{"title":"James Bond - Casino Royale (2006) DVDRip","uid":6187862,"size":848239786,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:004b2c732eb99d79507faa62ba1743ac196cca4e&amp;dn=James+Bond+-+Casino+Royale+%282006%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"TSV","files":-1,"time":1298177054,"description":"Casino Royale (2006) is the 21st film in the James Bond film series and the first to star Daniel Craig as MI6 agent James Bond. It was directed by Martin Campbell and written by Neal Purvis, Robert Wade, and Paul Haggis. Casino Royale is set at the beginning of Bond's career as Agent 007, just as he is earning his license to kill. After preventing a terrorist attack at Miami International Airport, Bond falls for Vesper Lynd, the treasury agent assigned to provide the money he needs to foil Le Chiffre's plans by beating him in a high-stakes poker game. The story arc continues in the following Bond film, Quantum of Solace (2008).\n\nThe film is a reboot, establishing a new timeline and narrative framework not meant to precede or succeed any previous Bond film. This allowed the film to show a less experienced and more vulnerable Bond and therefore for the first time in the series the character of Miss Moneypenny does not appear. Casting the film involved a widespread search for a new actor to portray James Bond, and significant controversy around Craig when he was selected to succeed Pierce Brosnan in October 2005. Location filming took place in the Montenegro, Czech Republic, Bahamas, Italy, and the United Kingdom with interior sets built at Pinewood Studios. Casino Royale was produced by EON Productions for Metro-Goldwyn-Mayer and Columbia Pictures, making it the first official Bond film to be co-produced by the latter studio. It is the third screen adaptation of Ian Fleming's 1953 novel of the same name, which was previously produced as a 1954 television episode and a 1967 satirical film.\n\nCasino Royale premiered at the Odeon Leicester Square on November 14, 2006. It received largely positive critical response, with reviewers highlighting Craig's performance and the reinvention of the character of Bond. It earned over $594 million worldwide, making it the highest-grossing James Bond film to date.\n","torrent":{"xt":"urn:btih:004b2c732eb99d79507faa62ba1743ac196cca4e","amp;dn":"James+Bond+-+Casino+Royale+%282006%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"004b2c732eb99d79507faa62ba1743ac196cca4e","infoHashBuffer":{"type":"Buffer","data":[0,75,44,115,46,185,157,121,80,127,170,98,186,23,67,172,25,108,202,78]},"announce":[],"urlList":[]}}