{"title":"Fundamentals of Polymer Engineering","uid":12424089,"size":15111716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0051749e8d39bb25734230b027685062e81459c2&amp;dn=Fundamentals+of+Polymer+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"clouderone","files":1,"time":1442348404,"description":"Fundamentals of Polymer Engineering - Arie Ram (Plenum, 1997).pdf\n\nISBN 0306457261\n\nWE ALL ARE SURROUNDED by plastic materials and cannot imagine modem life and utilities without the synthetic polymers. And yet, how many of us can distinguish between polyethylene and PVC? After all, most people name any polymer as ''Nylon. /I Is there any distinction between polymers and plastics? This introductory textbook tries to answer these questions and many others. It endeavors to provide the basic information required in modem life about the best utilization of new materials in the plastics era; the chemical sources of synthetic polymers, and the processes in which small&quot;simple&quot; molecules are converted to giant macromolecules, namely, high polymers; and the understanding of the role of these unique structures, their behavior and performance, their mechanical and thermal properties, flow and deforma tion. As we are mainly interested in the final product, the processing of plastics, through shaping and forming, presents a significant challenge to polymer engineering. All this is broadly discussed, ending with modem issues like composites, ecology and future prediction, followed by up-to-date informa tion and data about old as well as novel high performance polymers. The text is particularly targeted towards senior students of science and engineering (chemical, material, mechanical and others) who may use it as the first window to the world of polymers. At the same time many profession als who are involved in the resin or plastics industry may prefer this approach without elaborate math or overloading","torrent":{"xt":"urn:btih:0051749e8d39bb25734230b027685062e81459c2","amp;dn":"Fundamentals+of+Polymer+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0051749e8d39bb25734230b027685062e81459c2","infoHashBuffer":{"type":"Buffer","data":[0,81,116,158,141,57,187,37,115,66,48,176,39,104,80,98,232,20,89,194]},"announce":[],"urlList":[]}}