{"title":"Twilight Saga Audio Books FIXED","uid":4899588,"size":5603187350,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0093363d7931496c4b58fd8d8de6d613c9cfee3e&amp;dn=Twilight+Saga+Audio+Books+FIXED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"keikii","files":144,"time":1242545746,"description":"These are the Audio books of the Twilight Saga. FIXED.\n\nPossible Original Torrent: http://thepiratebay.se/torrent/4374374/Stephenie_Meyer_Twilight_Saga_Books_1-4_iTunes_iPod_Ready\n\n(I also downloaded the torrent that is the mp3s, but there were so many things wrong with those files I couldn't listen to them)\n\nI have split each book up into their chapters.  I've grown tired of audio books and them being broken up in random places.  In the original torrent, they were split up into two m4b files, and I converted those to mp3 files, and then broke those mp3 files into smaller ones, one for each chapter.\n\nNot only that, I have fixed the files themselves.  For example: in the first book, the first three minutes or so are repeated, and I've fixed it so it no longer does it.  Also, I believe in the thirteenth chapter of the first book it does another repeating bit, and I believe I fixed that.  I also took out the bits that said something to the effect of &quot;This is presented by audibles, and read by Ilyana Kadushin&quot; for all books.  I can't think of anything wrong with the second book files currently. In the third book, it did that thing where it would fade out, jump back ten seconds, and fade back in, and I fixed it so it no longer does that.  In the fourth book, originally there was about a three minute segment that was named wrong/put in the wrong place, and I put it back to where it was supposed to be.  And that's all I can think of that I fixed.\n\n\nI've also made each book into an .m4b (audio book format) file.  These are actually smaller in size, and they work perfectly on your iPod.\n\nEnjoy.\n\nIf you can think of anything else that needs to be fixed, or if there is a problem with any of the files, just comment, and I'll try and fix the problem.\n\nNext Up: The House of Night Series\n\n\n\n\nEDIT: It has been brought to my attention that chapter 26 and chapter 27 of Eclipse are the same chapter.  This was probably due to a mix up in files on my computers.  I'll reupload Eclipse into a new torrent just as fast as I can.  It won't be necessary to download the whole thing if you've already downloaded the book through this torrent, only the m4b files, and chapter 27, but I'll upload the whole book anyway.","torrent":{"xt":"urn:btih:0093363d7931496c4b58fd8d8de6d613c9cfee3e","amp;dn":"Twilight+Saga+Audio+Books+FIXED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0093363d7931496c4b58fd8d8de6d613c9cfee3e","infoHashBuffer":{"type":"Buffer","data":[0,147,54,61,121,49,73,108,75,88,253,141,141,230,214,19,201,207,238,62]},"announce":[],"urlList":[]}}