{"title":"Brilliant LED Projects - Nick Dossis","uid":12000043,"size":8774870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00df018a906d4c66c62445953271273d0ddecbca&amp;dn=Brilliant+LED+Projects+-+Nick+Dossis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":2,"uploader":"Mohammad_AT","files":3,"time":1433758614,"description":"Brilliant LED Projects presents 20 hands-on, step-by-step projects for you to make using inexpensive, commonly available components. Projects range from simple, functional devices, such as a &quot;green&quot; LED flashlight and a flashing rear bike light, to more complex designs, including color-changing disco lights and persistence-of-vision (POV) gadgets--all featuring easy-to-follow instructions, highlighted with detailed illustrations.\n\nBuild with confidence using this book's expert guidance and practical information, including overviews of various LED components, comprehensive listings of tool and supplies, sample clock and driver circuit building blocks, and more. A companion website gives you access to exclusive content, including downloadable assembly codes and programming codes (for the projects powered by the PIC 16F628 microcontroller). Plus, every chapter spotlights key concepts and techniques that make it easy and enjoyable for you to produce eye-catching LED displays.\n\nGreat for first-timers and expert hobbyists alike\nAll projects can be built with stripboard--no need to translate complicated schematics, or purchase special PCBs\nIncludes extensive guidelines for safe assembly\nLearn the basic principles of every project component--from LEDs to dot-matrix displays and various integrated circuits\nCreate your own designs using building blocks and assembly techniques from the book's projects","torrent":{"xt":"urn:btih:00df018a906d4c66c62445953271273d0ddecbca","amp;dn":"Brilliant+LED+Projects+-+Nick+Dossis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00df018a906d4c66c62445953271273d0ddecbca","infoHashBuffer":{"type":"Buffer","data":[0,223,1,138,144,109,76,102,198,36,69,149,50,113,39,61,13,222,203,202]},"announce":[],"urlList":[]}}