{"title":"How To Make Sewing Patterns - McCunn","uid":8063968,"size":40174737,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00ee3d8eb67e33835244db63d572e9adebde6200&amp;dn=How+To+Make+Sewing+Patterns+-+McCunn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"juliegoddess","files":-1,"time":1359134475,"description":"&quot;Other books that allegedly enable you to draft your own patterns all turn out to be either how to BUY a commercial pattern &amp; then alter it to make other designs, or else they only enable you to make clothing for the perfectly portioned body, which few of us have. A third alternative is that some books teach you to make shapeless &quot;sack&quot; clothing without much style. Almost all of these books require that you have a partner to help measure yourself and later to help fit the basic patterns to your body.\n\nTHAT IS NOT THE CASE WITH MR. McCUNN'S WONDERFUL BOOK! He starts out by showing you how to measure yourself accurately without any helpers.\n\nThen he takes you step-by-step through how to draft the basic patterns from your own measurements. He does NOT give tables of measurements for putting darts in, since the tables don't work for anyone without a &quot;perfect&quot; body. Instead, he explains how to custom fit the basic skirt, pants, bodice, &amp; sleeve patterns to your own body, even if you don't have a &quot;fitting buddy.&quot;\n\nAnd if that isn't enough, he includes instructions on how to design your own clothing styles (or copy those you see in the stores) and then change your basic patterns to make those styles.\n\nHe expands on this to show how to make waistbands &amp; cuffs, pockets &amp; plackets, jackets &amp; coats, and even how to make &amp; fit a man's suit. (Yes, this book even has info on making basic patterns for MEN, not just women.)\n\nThere is also discussion of how to choose the correct fabric for your style.\n\nAs a bonus, he explains how to take your perfectly-fitted basic patterns and turn them into a &quot;fitting dummy&quot; that mirrors your own body perfectly!\n\nThis is one of the most complete books on pattern drafting that I've seen, outside of college texts. (And those texts aren't of much use to the home seamstress, due to their emphasis on standard sizing.) If you can do it to a pattern or fabric, this book has it!\n\nThis is the ONLY book I've found that truly teaches you to make your own sewing patterns FROM SCRATCH, without having to buy a commercial pattern as a starting point. Each section builds on the last, so don't start in the middle.\n\nThis book is the ONLY book I've found that let me make patterns and clothing that actually fit me!\n\nThere are no color pics, but PLENTY of black and white line drawings and diagrams illustrate each step, so it is easy to read &amp; see each step of the process.\n\nIf you're serious about making your own patterns, you'll LOVE this book!&quot;","torrent":{"xt":"urn:btih:00ee3d8eb67e33835244db63d572e9adebde6200","amp;dn":"How+To+Make+Sewing+Patterns+-+McCunn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ee3d8eb67e33835244db63d572e9adebde6200","infoHashBuffer":{"type":"Buffer","data":[0,238,61,142,182,126,51,131,82,68,219,99,213,114,233,173,235,222,98,0]},"announce":[],"urlList":[]}}