{"title":"My Morning Jacket album","uid":5367812,"size":1404670605,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:011e4d0caaad35ca1a71ab3b56fce03aa4a380a0&amp;dn=My+Morning+Jacket+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"flitigalisa","files":203,"time":1266325611,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nMy Morning Jacket is an American rock band. The band comprises Jim James (singer-songwriter, guitarist), Tom &quot;Two-Tone Tommy&quot; Blankenship (bassist), Patrick Hallahan (drummer), Carl Broemel (guitarist, pedal steel guitarist, saxophonist, vocalist), and Bo Koster (keyboardist, percussionist, vocalist).\nMy Morning Jacket formed in 1998 in Louisville, Kentucky, consisting of Jim James on guitar, Tom Blankenship on bass, J. Glenn on drums, and Johnny Quaid on second guitar. James said the band's moniker comes from the letters &quot;MMJ&quot; embroidered on a discarded coat he once saw. \nThe band's debut, The Tennessee Fire, was released on Darla Records. In 2000, the band was augmented by the addition of Danny Cash (layout and keyboard instruments). Although the second album At Dawn was recorded with drummer J. Glenn, he had already left the band by the time the album was released by Darla in 2001. J. Glenn was replaced by Chris 'KC' Guetig. In May 2002 James' childhood friend Patrick Hallahan replaced Guetig.\nMy Morning Jacket were signed to ATO Records in 2002. In 2003 they released It Still Moves, their major-label debut. The release of the album was followed by the live EP Acoustic Citsuoca. This EP was notable for the absence of hall reverb on Jim James' vocals, a sound very different from their earlier works.\n\n","torrent":{"xt":"urn:btih:011e4d0caaad35ca1a71ab3b56fce03aa4a380a0","amp;dn":"My+Morning+Jacket+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011e4d0caaad35ca1a71ab3b56fce03aa4a380a0","infoHashBuffer":{"type":"Buffer","data":[1,30,77,12,170,173,53,202,26,113,171,59,86,252,224,58,164,163,128,160]},"announce":[],"urlList":[]}}