{"title":"Tarascon Pocket Pharmacopoeia, 2014 Deluxe Lab Coat Edition [PDF","uid":10043165,"size":3211113,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01c667ac258a106d167bfb4b6f06485b34bcc5ee&amp;dn=Tarascon+Pocket+Pharmacopoeia%2C+2014+Deluxe+Lab+Coat+Edition+%5BPDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"0xmovva","files":-1,"time":1398492781,"description":"Author: Richard J. Hamilton\nSeries: Tarascon Pocket Pharmacopoeia: Deluxe Lab-Coat Pocket\nPaperback: 440 pages\nPublisher: Tarascon; 15 edition (December 22, 2013)\nLanguage: English\nISBN-10: 1284026841\nISBN-13: 978-1284026849\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\n\n\nUsed by prescribers around the world, including: physicians, pharmacists, nurses, physician assistants, dentists and medical transcriptionist, the Tarascon PharmacopoeiaÂ® 2014 Deluxe Lab Coat Edition continues its tradition as the leading portable drug reference packed with vital drug information to help clinicians make better decisions at the point of care. The Tarascon PharmacopoeiaÂ® 2014 Deluxe Lab Coat Edition is an expanded version of the Classic Shirt-Pocket Edition, containing more drugs, black box warnings, evidence-based off-label indications for adults and pediatric patients, and additional tables. This reference also includes typical drug dosing (all FDA approved), available trade and generic formulations, metabolism, safety in pregnancy and lactation, relative drug pricing information, Canadian trade names, and an herbal &amp; alternative therapies section. Multiple tables supplement the drug content, including opioid equivalency, emergency drug infusions, cardiac dysrhythmia protocols, pediatric drug dosing, and much more.","torrent":{"xt":"urn:btih:01c667ac258a106d167bfb4b6f06485b34bcc5ee","amp;dn":"Tarascon+Pocket+Pharmacopoeia%2C+2014+Deluxe+Lab+Coat+Edition+%5BPDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01c667ac258a106d167bfb4b6f06485b34bcc5ee","infoHashBuffer":{"type":"Buffer","data":[1,198,103,172,37,138,16,109,22,123,251,75,111,6,72,91,52,188,197,238]},"announce":[],"urlList":[]}}