{"title":"Orange.is.the.New.Black.S01.720p.Bluray.x264.anoXmous","uid":10294165,"size":6103717679,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:01effc209693bdf4ea431719aaf637677a28bd4c&amp;dn=Orange.is.the.New.Black.S01.720p.Bluray.x264.anoXmous&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":8,"uploader":"anoXmous","files":-1,"time":1401899847,"description":"\n=========================================================================================\n\n      _*_*_ Orange.is.the.New.Black.S01.720p.Bluray.x264.anoXmous _*_*_\n\n=========================================================================================\n\n            Orange.is.the.New.Black.720p.Bluray.x264.anoXmous_.mp4\n\t   \nFormat            : MPEG-4 at 1 113 Kbps\n\nVideo #0          : AVC at 985 Kbps\nAspect            : 1280 x 720 (1.778) at 23.976 fps\n\nAudio #0          : AAC at 124 Kbps\nInfos             : 2 channels, 48.0 KHz\n-----------------------------------------------------------------------------------------\n\n          Sub in a .srt file it can turns off/on\n\t\t  \nOrange.is.the.New.Black.720p.Bluray.x264.anoXmous_eng.srt\n\n-----------------------------------------------------------------------------------------\n\nThe story of Piper Chapman, a woman in her thirties who is sentenced to fifteen months \nin prison after being convicted of a decade-old crime \nof transporting money for her drug-dealing girlfriend.\n             &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2372162/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2372162/&lt;/a&gt;\n   &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Orange_Is_the_New_Black&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Orange_Is_the_New_Black&lt;/a&gt;\n  &lt;a href=&quot;\nhttps://wikimediafoundation.org/wiki/Ways_to_Give/en&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://wikimediafoundation.org/wiki/Ways_to_Give/en&lt;/a&gt;\n\n-----------------------------------------------------------------------------------------\n\n          No. of episodes 13 List of episodes:\n\nS1, Ep1\n11 Jul. 2013\nI Wasn't Ready\nPiper Chapman is sent to jail as a result of her relationship with a drug smuggler.\n \n\nS1, Ep2\n11 Jul. 2013\nTit Punch\nPiper realizes the politics of prison life first-hand when the kitchen staff refuses \nto feed her after she accidentally insults prison chef Galina &quot;Red&quot; Reznikov. \nWhile Piper scrambles to find a way to apologize, \nthe reason for Red's incarceration is revealed.\n \n\nS1, Ep3\n11 Jul. 2013\nLesbian Request Denied\nAn inmate named Suzanne &quot;Crazy Eyes&quot; Warren has her sights set on Piper and makes her \nintentions apparent. Piper seeks advice on how to let Crazy Eyes down gently but finds \nthat blunt honesty might be the only way. Meanwhile, we get to know a \nlot more about transgender inmate Sophia Burset.\n \n\nS1, Ep4\n11 Jul. 2013\nImaginary Enemies\nPiper tries to remain on good terms with her no-nonsense roommate Miss Claudette Pelage. \nThe upcoming release of an inmate named Mercy causes conflict between Mercy's new \ngirlfriend Tricia Miller and her ex Carrie &quot;Big Boo&quot; Black. Piper's electrical \nengineering class faces serious punishment when a screwdriver goes missing.\n \n\nS1, Ep5\n11 Jul. 2013\nThe Chickening\nWhile on the lawn one morning, Piper sees a chicken roosting nearby on the grass. \nWhen she tells other inmates about the odd sighting, Piper discovers that the \nchicken is actually a prison legend that several inmates have tried to catch \nfor years. The complicated history between Aleida Diaz \nand her daughter Dayanara Diaz comes to light.\n \n\nS1, Ep6\n11 Jul. 2013\nWAC Pack\nThe inmates must campaign amongst their races for a coveted spot as a prisoners' \nrepresentative. Piper steers clear of the bizarre political process but might \nnot have a choice but to get involved. Larry's editor wants \nhim to write an article about Piper's incarceration.\n \n\nS1, Ep7\n11 Jul. 2013\nBlood Donut\nFormer high school track star Janae Watson returns from solitary confinement. \nPiper wants to reopen the outdoor track but Healy forces her to fulfill several \npotentially dangerous tasks before he will consider it. Alex's teasing of a \nreligious fanatic named Tiffany &quot;Pennsatucky&quot; Doggett sparks a rivalry.\n \n\nS1, Ep8\n11 Jul. 2013\nMoscow Mule\nOfficer Mendez begins harassing Red when she refuses to help him continue smuggling \ndrugs into the prison. Larry publishes his article about Piper in the New York Times, \nwhich turns her into a person of interest for inmates and corrections officers alike. \nPiper's best friend Polly has her baby at the same \ntime that a baby is born to an inmate in Piper's cell block.\n \n\nS1, Ep9\n11 Jul. 2013\nFucksgiving\nPiper is in high spirits when she makes peace with Alex and awaits a visit from Larry \non Thanksgiving. However, Healy's true colors come out when he throws Piper in \nsolitary confinement for dancing with Alex. The frightening experience of solitary \nforces Piper to take a serious look at her life and \ncome to several conclusions about the future.\n \n\nS1, Ep10\n11 Jul. 2013\nBora Bora Bora\nPennsatucky flaunts her new healing hands that Jesus has supposedly given her. \nThe prison brings in a group of teenage troublemakers so that the inmates can \nscare them straight. Tricia returns from detox to find she has lost her position \non the kitchen staff and must still deal with \nMendez breathing down her neck for her drug debts.\n \n\nS1, Ep11\n11 Jul. 2013\nTall Men with Feelings\nGrief looms over the prison as the inmates mourn a recent suicide. Dayanara, Nicky, \nand Red plot to end Mendez's career by tricking him into revealing his indiscretions. \nLarry gives a radio interview about Piper's experience in prison and his \ncomments cause conflict with some of Piper's closest allies.\n \n\nS1, Ep12\n11 Jul. 2013\nFool Me Once\nAfter discovering a series of sad truths, friendships change. Tiffany 'Pennsatucky' \nDoggett is offended by Piper Chapman, and that lead to the dangerous roads. \nLarry first meets Alex to cope with everything that is happening.\n \n\nS1, Ep13\n11 Jul. 2013\nCan't Fix Crazy\nAlex takes a final decision about Piper and Larry finally decides what will happen to \nPiper after meeting for the first time Alex. Red plan to retrieve her kitchen does \nnot come out very well. Piper faces for the first time with an inmate. \n\n-----------------------------------------------------------------------------------------\n\n         This BRRip plays very well with PSP and XBOX\n\t    \n-----------------------------------------------------------------------------------------\n\n                                 _/      _/                                             \n    _/_/_/  _/_/_/      _/_/      _/  _/    _/_/_/  _/_/      _/_/    _/    _/    _/_/_/\n _/    _/  _/    _/  _/    _/      _/      _/    _/    _/  _/    _/  _/    _/  _/_/     \n_/    _/  _/    _/  _/    _/    _/  _/    _/    _/    _/  _/    _/  _/    _/      _/_/  \n _/_/_/  _/    _/    _/_/    _/      _/  _/    _/    _/    _/_/      _/_/_/  _/_/_/\n\t\t\t\t\t\t\t\t","torrent":{"xt":"urn:btih:01effc209693bdf4ea431719aaf637677a28bd4c","amp;dn":"Orange.is.the.New.Black.S01.720p.Bluray.x264.anoXmous","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01effc209693bdf4ea431719aaf637677a28bd4c","infoHashBuffer":{"type":"Buffer","data":[1,239,252,32,150,147,189,244,234,67,23,25,170,246,55,103,122,40,189,76]},"announce":[],"urlList":[]}}