{"title":"Rob Zombie - Spookshow International Live (2015)ak","uid":11719510,"size":193453195,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0302373a387496ba9151ba4282a2edf60614a5e8&amp;dn=Rob+Zombie+-+Spookshow+International+Live+%282015%29ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"analogkid6103","files":20,"time":1424761853,"description":"Rob Zombie (born Robert Bartleh Cummings; 12 January 1965) is an American muisicker, film director, screenwriter and film producer. He rose to prominence as a founding member of the band White Zombie which formed in the mid-1980s an rose to fame in the early 1990s. As a solo artist, he has released five studio albums, five compilation albums, an a live album. He expanded his career an became a director, an has directed a total of six films, the majority of which he wrote or co-wrote an aw. He has released numerous comic books, an appeared as a actor on numerous occasions.\n\nWhite Zombie's debut album, Soul-Crusher, was released in 1987 and was followed by their second album Make Them Die Slowly in 1989. They rose to prominence after the success of their third album, La Sexorcisto: Devil Music, Vol. 1, and its lead single &quot;Thunder Kiss '65&quot; in 1993. The album went on to be certified multi-platinum by the RIAA, for sales exceeding two million copies in the US. Their fourth and final studio album, Astro-Creep: 2000, became their first top-10 entry on the Billboard 200, and their second album to reach multi-platinum status.\n\nZombie began his solo career with the release of his 1998 debut album Hellbilly Deluxe. The album was both a critical and commercial success, spawning three hit singles, reaching the Top 5 of the Billboard 200, and selling over three million copies worldwide. Hellbilly is Zombie's highest selling album to date. He followed the success of the album with The Sinister Urge in 2001, which had similar success to that of its predecessor. Zombie's first greatest hits album, Past, Present &amp; Future, was released in 2003, and reached Platinum status by the RIAA. His third studio album, Educated Horses, was released in 2006, and was his third Top 10 entry on the Billboard 200. In 2010, he released his fourth studio album Hellbilly Deluxe 2, which is a sequel to Hellbilly Deluxe. His fifth album, Venomous Rat Regeneration Vendor, was released on April 23, 2013.\n\n\nYear: 2015\nStyle: Industrial Metal\nCountry: USA\nFormat: 320 mp3\nSize: 184.49 MB\n\n01. Teenage Nosferatu Pussy\n02. Superbeast\n03. Living Dead Girl\n04. Dead City Radio\n05. Drum Solo\n06. More Human Than Human\n07. Sick Bubblegum\n08. House Of 1000 Corpses\n09. Meet The Creeper\n10. Never Gonna Stop\n11. Blitzkrieg Bop\n12. Thunder Kiss '65\n13. Jesus Frankenstein\n14. We're An American Band\n15. Dragula\n16. Demonoid Phenomenon\n17. Pussy Liquor\n18. Demon Speeding\n19. Ging Gang Gong De Do Gong De Laga Raga","torrent":{"xt":"urn:btih:0302373a387496ba9151ba4282a2edf60614a5e8","amp;dn":"Rob+Zombie+-+Spookshow+International+Live+%282015%29ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0302373a387496ba9151ba4282a2edf60614a5e8","infoHashBuffer":{"type":"Buffer","data":[3,2,55,58,56,116,150,186,145,81,186,66,130,162,237,246,6,20,165,232]},"announce":[],"urlList":[]}}