{"title":"The Cuckoo's Calling - Robert Galbraith (Pdf,Epub,Mobi) -Mantesh","uid":8693488,"size":2772979,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:034c925ee86dda7b2bbdfd995d6c425671fbc55a&amp;dn=The+Cuckoo%27s+Calling+-+Robert+Galbraith+%28Pdf%2CEpub%2CMobi%29+-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"MANTESH","files":3,"time":1373922621,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/511sTid4uHL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/511sTid4uHL.jpg&lt;/a&gt;\n\n\nThe Cuckoo's Calling\n\n\nPublisher: Little Brown Book Group \nRobert Galbraith\n2013\nLanguage: English\nASIN: B00AA20E5Y\nISBN-10: 1408703998\nISBN-13: 978-1408703991\nPDF,EPUB,MOBI\n464 Pages\n2.64 MB\n\nThe Cuckoo's Calling is a 2013 crime fiction novel by J. K. Rowling, published under the pseudonym Robert Galbraith.\n\nA brilliant mystery in a classic vein: Detective Cormoran Strike investigates a supermodel's suicide.\nAfter losing his leg to a land mine in Afghanistan, Cormoran Strike is barely scraping by as a private investigator. Strike is down to one client, and creditors are calling. He has also just broken up with his longtime girlfriend and is living in his office.\n\nThen John Bristow walks through his door with an amazing story: His sister, thelegendary supermodel Lula Landry, known to her friends as the Cuckoo, famously fell to her death a few months earlier. The police ruled it a suicide, but John refuses to believe that. The case plunges Strike into the world of multimillionaire beauties, rock-star boyfriends, and desperate designers, and it introduces him to every variety of pleasure, enticement, seduction, and delusion known to man.\n\nYou may think you know detectives, but you've never met one quite like Strike. You may think you know about the wealthy and famous, but you've never seen them under an investigation like this.\n\nWhen a troubled model falls to her death from a snow-covered Mayfair balcony, it is assumed that she has committed suicide. However, her brother has his doubts, and calls in private investigator Cormoran Strike to look into the case.\n\n\nStrike is a war veteran - wounded both physically and psychologically - and his life is in disarray. The case gives him a financial lifeline, but it comes at a personal cost: the more he delves into the young model's complex world, the darker things get - and the closer he gets to terrible danger . . .\n\n\nA gripping, elegant mystery steeped in the atmosphere of London - from the hushed streets of Mayfair to the backstreet pubs of the East End to the bustle of Soho - The Cuckoo's Calling is a remarkable book. Introducing Cormoran Strike, this is a classic crime novel in the tradition of P. D. James and Ruth Rendell, and marks the beginning of a unique series of mysteries.\n\n\n\n","torrent":{"xt":"urn:btih:034c925ee86dda7b2bbdfd995d6c425671fbc55a","amp;dn":"The+Cuckoo%27s+Calling+-+Robert+Galbraith+%28Pdf%2CEpub%2CMobi%29+-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"034c925ee86dda7b2bbdfd995d6c425671fbc55a","infoHashBuffer":{"type":"Buffer","data":[3,76,146,94,232,109,218,123,43,189,253,153,93,108,66,86,113,251,197,90]},"announce":[],"urlList":[]}}