{"title":"GLADIO: NATO’S Dagger at the Heart of Europe","uid":15848034,"size":1958003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03dbc19326b8596aa660b519467c740379eca8f8&amp;dn=GLADIO%3A+NATO%26rsquo%3BS+Dagger+at+the+Heart+of+Europe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"marty14","files":1,"time":1474129189,"description":"GLADIO: NATO’S Dagger at the Heart of Europe, The Pentagon-Nazi-Mafia Terror Axis - Richard Cottrell [epub]\r\n\r\nIn this groundbreaking work of investigative journalism, Richard Cottrell lays bare a web of evil in high places. The recent pedophile Savile scandal in London was foreshadowed by rampant abuses in Belgium, fiefdom of NATO. Their purpose: to subvert democracy through blackmail. GLADIO reveals the story of mayhem and murder, of corruption and subversion of democracy, behind NATO's secret &quot;alliance&quot; against decency and democracy.\r\n\r\nMasquerading as a rear guard against Soviet invaders, NATO's covert forces warped into psychological and physical terrorism. These were the 'years of lead,' in which hundreds perished in a synthetic war in the streets of Europe. NATO commander General Lyman Lemnitzer ordered attempts to kill French president Charles de Gaulle. Sacked from the Pentagon and exiled to Europe by JFK, did Lemnitzer reap revenge in Dallas?\r\n\r\nThe secret armies forged bonds with the Mafia. NATO-backed coups struck down governments in Greece and Turkey; Cyprus was sundered amid bitter genocide. Urban guerrillas like the Red Brigades and the Baader-Meinhof Gang were manipulated to torpedo democracy. Italy gained a deep-state government, the ultra-secret P2 pseudo-Masonic lodge, founded by former Blackshirts.\r\n\r\nSwedish premier Olof Palme and Italian ex-PM Aldo Moro were assassinated. Pope John Paul II was shot by Turkish gangsters who had regular work as Gladio guns for hire. In 2009, the Turkish Gladio unit named Ergenekon surfaced in Turkey. The shootings in Norway in July 2011, and in Belgium, France and Italy in 2012, all bore the classic stripe of Gladio false-flag operations","torrent":{"xt":"urn:btih:03dbc19326b8596aa660b519467c740379eca8f8","amp;dn":"GLADIO%3A+NATO%26rsquo%3BS+Dagger+at+the+Heart+of+Europe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03dbc19326b8596aa660b519467c740379eca8f8","infoHashBuffer":{"type":"Buffer","data":[3,219,193,147,38,184,89,106,166,96,181,25,70,124,116,3,121,236,168,248]},"announce":[],"urlList":[]}}