{"title":"Mandy Flores - I'll tell Mom Father's day taboo with Mandy Flore","uid":12345142,"size":1174362848,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:040ae161b9e3367b9703a970afd751217d1978c1&amp;dn=Mandy+Flores+-+I%27ll+tell+Mom+Father%27s+day+taboo+with+Mandy+Flore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":11,"uploader":"TKTh3K1ng","files":2,"time":1441342202,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/8an&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/8an&lt;/a&gt;\n\n\nts Father's day and Mandy was expecting to have some daddy daughter time. She is bugging her dad who is trying to watch porn in his office that he needs to take her somewhere and do something fun. He says that hell be done with work soon and for her to go get ready. Some time passes and Mandy comes barging back in. Dad, I'm ready lets go. Dad quickly shuts off monitor again. OK honey, just give me a few more minutes please. Just lock the door please i need some privacy. Mandy confused and now a little curious. Why do you need privacy? What were you looking at? He makes up an excuse and tells her just 5 more minutes please.\n\nMandy pretends to lock door....She comes back after only a couple minutes and this time her dad had his pants pulled down and panics to turn off the monitor as she is coming to see what hes really doing. What were you looking at, why cant I see? She turns on screen and starts giggling at the image on the computer. He turns it off and asks her to please leave. Dad I'm not stupid, I know what youre doing in here. He tells her even more reason for her to leave. Either you show me what youre looking at or Ill tell Mom how you're &quot;spending time' with me. She turns it back on knowing he has to show her or else. Her eyes widen and mouth drops at the video that is playing. Dad says this part is pretty good but I was actually watching this. The video changes to a blowjob scene and Mandy is glued. This is HOT! Dad says, OK, that's enough and goes to turn it off. No dad, I want to watch. She notices his pants are down and teases him about it.\n\nDad tries to explain that this is his private time and this what he likes to watch and yes he masturbates to it. He doesn't get a lot of this kind of private time when Mom is home. Well, can I watch it with you? I don't care if youre touching yourself. I wont look, I just don't want to be alone and bored and this is very interesting. She promises she wont tell if he lets her stay and watch. As they watch the erotic blowjob scene together dads state of mind takes a bad turn. He starts asking her inappropriate questions. Are you shaved down there? Have you ever done that before? She says no and he asks if she wants to try. Um.....I would love the learn how to do that. Can I practice on you? She begins to imitate on her daddy what she is seeing on the video.\n\nShe looks at the computer and its a different scene now. Daddy, I want to do what theyre doing. Hes licking her down there can you? He helps her pull her pants and panties off. He kisses and spreads her soft legs and eagerly tastes her. She lays back and enjoys her dads tongue and fingers all over her wet swollen pussy.\n\nI want it daddy, give me your cock. Points at the screen and demands he does the same.. Give it to me, give it. Or Ill tell Mommy. Make me cum Daddy. She smiles at him, she knows he has no choice but to give in to her demands. Hes rubbing his cock up and down between her pussy lips. I wont tell she promises him. He cant fight the temptation and he penetrates her virgin pussy. She gasps out loud, Oh God!! It feels so good. Make me cum daddy. He glides in and out of her pussy. Don't stop daddy, I'm gonna cum! She begins to scream out in her first orgasm and its to late to try to pull out now, he fills and sprays her pussy with cum. His jizz is oozing out of his daughters pussy and hes at a loss for words for what hes just done. Don't worry daddy, I wont tell anyone. This was really fun we should do this more often. I'm going to really enjoy having our secret daddy daughter time from now on","torrent":{"xt":"urn:btih:040ae161b9e3367b9703a970afd751217d1978c1","amp;dn":"Mandy+Flores+-+I%27ll+tell+Mom+Father%27s+day+taboo+with+Mandy+Flore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"040ae161b9e3367b9703a970afd751217d1978c1","infoHashBuffer":{"type":"Buffer","data":[4,10,225,97,185,227,54,123,151,3,169,112,175,215,81,33,125,25,120,193]},"announce":[],"urlList":[]}}