{"title":"Fine Art Tips with Lori McNee (gnv64)","uid":12428294,"size":19432638,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:047668089fadc86f5238c61232f96352b4fb132e&amp;dn=Fine+Art+Tips+with+Lori+McNee+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"gnv65","files":3,"time":1442417391,"description":"Fine Art Tips with Lori McNee: Painting Techniques and Professional Advice\nBy Lori McNee\nNorth Light Books | July 2015 | ISBN: 1440339228 | ePUB | 18.5 mb\n\nLessons of a lifetime. 24 modern-day masters share secrets to their success.\nSince 2009, thousands of artists have flocked to Lori McNee's FineArtTips.com for creative and professional advice. A social media guru as well as a professional artist, McNee has assembled a diverse and impressive group of today's most popular artists to create Fine Art Tips (the book!), an unprecedented master class in representational painting and art business advice.\nFine Art Tips goes &quot;behind the paintings&quot; to show how 24 of today's top artists transform dabs of paint into incredible still lifes, landscapes, portraits and wildlife art. Along the way, they generously share practical, real-world tips on everything from evoking the illusion of sparkling water to professional networking.\nPlein air afficianado Ken Auster offers an unforgettable lesson on focal point. John Seerey Lester, a rock star in the world of wildlife painting, talks about the power of storytelling in paint. Joe Anna Arnett reveals her secret to painting white peonies, and Daniel Sprick discusses the foundations behind his classical portraits.\nThe advice in these pages can be life-changing for artists, both aspiring and established. For art-lovers in general, Fine Art Tips is a brilliant showcase of today's top artists.\n\nAbout the Author\nLori McNee is a blogger, writer and professional artist who specializes in still life, and landscape oil paintings. As the owner of www.FineArtTips.com, Lori blogs about fine art tips, marketing and social media advice for the aspiring and professional artist.\nAs a social media #influencer, she ranks as one of the Most Powerful Women on Twitter, has been featured in the FINS of The Wall Street Journal and named a #TwitterPowerhouse by The Huffington Post. She is a popular keynote speaker, painting demonstrator, and a talk show host for Plum TV and ConciergeQ. Lori is a #SocialTV correspondent pioneer, tweeting red carpet events for Entertainment Tonight, The Insider, Access Hollywood, Vanity Fair.\nLori writes for F+W Media publications including Artist's Magazine, Artist's &amp; Graphic Designer's Market, Photographer's Market and contributed to Zero to 100,000: Social Media Tips &amp; Tricks for Small Businesses.\nShe is an exhibiting member of Oil Painters of America, Plein Air Painters of Idaho, serves on the Plein Air Mag Board of Advisors. Lori is a certified Master Artist in Cobra Watermixable Oil Paints, and is an Artist Ambassador for Arches / Canson / Royal Talens. Lori's art has been featured in SouthWest Art Magazine, American Art Collector, Plein Air Magazine, Fine Art Connoisseur, Western Art Collector, Wildlife Art, and Art Talk. Currently, Kneeland Gallery, Dana Gallery, Gardner Colby Galleries and Bella Muse Gallery represent Lori and her paintings.\n &lt;a href=&quot;\nhttp://s14.postimg.org/f7xfd8of5/Fine_Art_Tips_with_Lori_Mc_Nee.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s14.postimg.org/f7xfd8of5/Fine_Art_Tips_with_Lori_Mc_Nee.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:047668089fadc86f5238c61232f96352b4fb132e","amp;dn":"Fine+Art+Tips+with+Lori+McNee+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"047668089fadc86f5238c61232f96352b4fb132e","infoHashBuffer":{"type":"Buffer","data":[4,118,104,8,159,173,200,111,82,56,198,18,50,249,99,82,180,251,19,46]},"announce":[],"urlList":[]}}