{"title":"Jynx Maze - Anal Fanatic 2 (2011) DVDRip-AVC ","uid":12188526,"size":509833884,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:04a1b0d12def76c92472a8c77701230cbf31fa4a&amp;dn=+Jynx+Maze+-+Anal+Fanatic+2+%282011%29+DVDRip-AVC+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"Chinu685","files":1,"time":1438612240,"description":" Description: One last scene and it begins with Jynx standing in front of a grey wall and you can not miss that ass plus it's barely covered as she's wearing a thong so the great ass views are pretty much instantenous here. Jynx is working the eyes and her hair is also a great asset cascading down her head. The shots get pretty close to that ass which Jynx knows how to shake, rattle, and roll! As she turns around and sits facing towards us the water starts running down the wall behind her and her tits come out. Jynx then moves inside bending down to fellate a glass toy which you just know will soon be in her ass. A superb close shot then on her face and I mean close in and those eyes just grab you and they do not have any intention of letting you go! Jynx then makes it to a big mirror and gets to see what we're seeing which is one sexy woman. She loses the outfit and starts using a finger on her ass as well as making use of the glass toy. Jynx is then joined by not one but two guys, Erik Everhard and Steve Holmes so she's going to have quite the workout in this scene I think. The guys do some nice ass admiring getting in there nice and close on that tempting tush. You know Erik had to do some face diving, losing his head and face as he becomes immersed in that backside. Jynx gets busy too working on Steve-O's cock and Mr. Holmes sits back and enjoys this bit of oral delight. Erik gets the hate plow out so Jynx now has two cocks to play with, not to keen on the choking that took place before but Jynx ate it up and then she devoured their cocks. After some seriously good head the guys get right to work on her ass and she even adds in some nasty stuff doing ass licking. There is some pussy fucking but when it was in mish you had the other guy hovering over Jynx's face drilling her mouth with his cock. More good anal work in reverse plus the boys dp Jynx in both cowgirl and reverse. There is no denying from watching Jynx in multiple scenes now that this young lady takes great delight in fucking, losing herself in the moment and doing some excellent anal work in the process. It helps when she's got strong guys working with her and I'd say Erik and Steve qualify there. One last dp in reverse and then it's time to suck a little more cock followed by the pops, right on target to that pretty face.\n &lt;a href=&quot;\nhttp://teenimage.org/img-55bf5f68e41f2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55bf5f68e41f2.html&lt;/a&gt;","torrent":{"xt":"urn:btih:04a1b0d12def76c92472a8c77701230cbf31fa4a","amp;dn":"+Jynx+Maze+-+Anal+Fanatic+2+%282011%29+DVDRip-AVC+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04a1b0d12def76c92472a8c77701230cbf31fa4a","infoHashBuffer":{"type":"Buffer","data":[4,161,176,209,45,239,118,201,36,114,168,199,119,1,35,12,191,49,250,74]},"announce":[],"urlList":[]}}