{"title":"The Richest Man Who Ever Lived","uid":15749558,"size":28744208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0513639ada31c1d2809191113a9183f40d4e22b3&amp;dn=The+Richest+Man+Who+Ever+Lived&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"marty14","files":1,"time":1473016463,"description":"The Richest Man Who Ever Lived: The Life and Times of Jacob Fugger - Greg Steinmetz [epub]\r\n\r\nThe life and times of the wealthiest man who ever lived — Jacob Fugger — the Renaissance banker who revolutionized the art of making money and established the radical idea of pursuing wealth for its own sake. Jacob Fugger lived in Germany at the turn of the sixteenth century, the grandson of a peasant. By the time he died, his fortune amounted to nearly two percent of European GDP. Not even John D. Rockefeller had that kind of wealth. \r\n\r\nMost people become rich by spotting opportunities, pioneering new technologies, or besting opponents in negotiations. Fugger did all that, but he had an extra quality that allowed him to rise even higher: nerve. In an era when kings had unlimited power, Fugger had the nerve to stare down heads of state and ask them to pay back their loans—with interest. It was this coolness and self-assurance, along with his inexhaustible ambition, that made him not only the richest man ever, but a force of history as well. Before Fugger came along it was illegal under church law to charge interest on loans, but he got the Pope to change that. He also helped trigger the Reformation and likely funded Magellan’s circumnavigation of the globe. His creation of a news service, which gave him an information edge over his rivals and customers, earned Fugger a footnote in the history of journalism. And he took Austria’s Habsburg family from being second-tier sovereigns to rulers of the first empire where the sun never set.\r\n\r\nThe ultimate untold story, The Richest Man Who Ever Lived is more than a tale about the richest and most influential businessman of all time. It is a story about palace intrigue, knights in battle, family tragedy and triumph, and a violent clash between the 1 percent and everybody else. To understand our financial system and how we got it, it pays to understand Jacob Fugger","torrent":{"xt":"urn:btih:0513639ada31c1d2809191113a9183f40d4e22b3","amp;dn":"The+Richest+Man+Who+Ever+Lived","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0513639ada31c1d2809191113a9183f40d4e22b3","infoHashBuffer":{"type":"Buffer","data":[5,19,99,154,218,49,193,210,128,145,145,17,58,145,131,244,13,78,34,179]},"announce":[],"urlList":[]}}