{"title":"[SoM]The Bourne ultimatum[DvdRip-Xvid-Ita-AC3]","uid":5277548,"size":1465255936,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0569cf3fb2e3c09c849d47d70fad8c5cfed4fc84&amp;dn=%5BSoM%5DThe+Bourne+ultimatum%5BDvdRip-Xvid-Ita-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"misafor","files":2,"time":1263427091,"description":"\n\nRitroviamo in questo sequel l'agente Bourne, che in &quot;The Bourne Identity&quot; del 2002, cercava di scoprire chi fosse, in &quot;The Bourne Supremacy&quot; del 2004 esigeva vendetta per quello che aveva subito. Adesso, sta tornando a casa...e si ricorda tutto. Bourne non ha ne un paese ne un passato. Sottoposto ad un training brutale di cui non ha memoria da parte di persone che non puÃƒÂ² identificare, Bourne ÃƒÂ¨ stato trasformato in una sofisticata arma umana-per la CIA l'obbiettivo piÃƒÂ¹ impossibile da rintracciare. Da quando lo hanno ritrovato alla deriva nel Mar Mediterraneo a largo delle coste italiane diversi anni fa, si ÃƒÂ¨ imbarcato in un disperato viaggio alla ricerca della propria identitÃƒÂ  e di chi lo abbia addestrato ad uccidere. Tuttavia, dopo l'assassinio della sua amante Marie da parte di un killer, tutto ciÃƒÂ² che Bourne desiderava era vendicarsi. Una volta raggiunto il suo scopo, ciÃƒÂ² che voleva era scomparire per sempre e dimenticare la vita che qualcuno gli aveva sottratto. Ma la prima pagina di un quotidiano londinese che pone degli interrogativi in merito alla sua esistenza pone fine a tale speranza e Bourne si trova ad essere nuovamente un bersaglio. La Treadstone, l'operazione top-secret che ha creato questo super assassino, ÃƒÂ¨ ormai defunta. E' stata ricostituita come programma Blackbriar del Dipartimento della Difesa , con una nuova generazione di killer addestrati-nascosto alle ingerenze interne o estere-a disposizione del governo. Per loro Bourne ÃƒÂ¨ una minaccia difettosa da 30 milioni di dollari che deve essere eliminata una volta per tutte. Per lui, loro sono l'unico legame con una vita che ha tentato in vano di dimenticare. Bourne ÃƒÂ¨ alla fine della corsa. Questa volta a fermarlo non basteranno le vacue promesse dei suoi ex padroni ne l'uccisione di coloro che lo inseguono senza tregua. non avendo piÃƒÂ¹ nulla da perdere utilizzerÃƒÂ  ogni sottile tecnica acquisita durante il suo addestramento e ogni tipo di istinto che ha affinato nel frattempo per perseguire i suoi creatori e porre fine al tutto. La sua ricerca lo porterÃƒÂ  da Mosca a Parigi e da Madrid a Londra e a Tangeri-sfuggendo, superando in astuzia e contro manovrando gli agenti del Blackbriar, gli agenti federali e la polizia locale minuto dopo minuto-in una disperata ricerca di risposte alle domande che lo tormentano. E il viaggio di Bourne alla fine lo porterÃƒÂ  lÃƒÂ  dove tutto ha avuto inizio e dove tutto dovrÃƒÂ  finire: le strade di New York.\n","torrent":{"xt":"urn:btih:0569cf3fb2e3c09c849d47d70fad8c5cfed4fc84","amp;dn":"%5BSoM%5DThe+Bourne+ultimatum%5BDvdRip-Xvid-Ita-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0569cf3fb2e3c09c849d47d70fad8c5cfed4fc84","infoHashBuffer":{"type":"Buffer","data":[5,105,207,63,178,227,192,156,132,157,71,215,15,173,140,92,254,212,252,132]},"announce":[],"urlList":[]}}