{"title":"Olympic Portraits - Annie Leibovitz (Photography Art Ebook).pdf","uid":10314395,"size":16130255,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:058279f4e0df3ee80a72ce8d040f54ea65805006&amp;dn=Olympic+Portraits+-+Annie+Leibovitz+%28Photography+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"STBGD","files":-1,"time":1402227700,"description":"pdf / English / 1996 / 200 pages / 15 MB\n\nA celebrated, highly stylized photographer of rock stars shooting Olympic athletes? That apparent anomaly seems just right when the photographer in question is Leibovitz, whose portraiture has always managed to capture the inner turmoil lurking beneath outward calm. Wisely, she chose to shoot her athletes not in Atlanta, surrounded by hoopla, but in preparation for the games, isolated and intense. The results are stunning: a sculpted Carl Lewis in repose, achieving a Mapplethorpian elegance mixed with menace; a poised and incredibly focused Michael Johnson, suggesting all the unleashed energy it would take to run faster than anyone has ever run before; a sober U.S. women's softball team, exuding the determination that would eventually produce wild jubilation and the gold medal. What drives these stark, darkly lit black-and-white photos, though, isn't our knowledge of the eventual results in Atlanta, but a sense of the overwhelming solitary confinement of athletic training, the peculiar loneliness that comes with the obsession to excel. These haunting photos will endure beyond our memory of who won what. Ilene Cooper\n\nPS Not the best of scan","torrent":{"xt":"urn:btih:058279f4e0df3ee80a72ce8d040f54ea65805006","amp;dn":"Olympic+Portraits+-+Annie+Leibovitz+%28Photography+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"058279f4e0df3ee80a72ce8d040f54ea65805006","infoHashBuffer":{"type":"Buffer","data":[5,130,121,244,224,223,62,232,10,114,206,141,4,15,84,234,101,128,80,6]},"announce":[],"urlList":[]}}