{"title":"SIM CITY  3000 FULL GAME! (SEEDED BY KIERAN_268_UK)","uid":3468848,"size":174663740,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:05c2cf01e4ea2ecfd97b290ad3617b4249be7146&amp;dn=SIM+CITY++3000+FULL+GAME%21+%28SEEDED+BY+KIERAN_268_UK%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"kieran_268_uk","files":1,"time":1144628373,"description":"This is the full game enjoy :)\n\n\nTable of Contents\n\nGeneral\nPerformance Tips\nTroubleshooting\n\n\nGeneral\n\nFor the latest up to date information on SimCity 3000 visit &lt;a href=&quot;\nhttp://www.simcity.com.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.simcity.com.&lt;/a&gt;\n\n\nPerformance Tips\n\nSimCity 3000 has many options to scale performance for low end systems \nand to take full advantage of higher end systems.\n\nThe game runs best with full graphics hardware acceleration.  Open \nSettings, Control Panel, System. This brings up the System Properties \nwindow.  Click on the Performance tab at the far right. This brings up \nthe Advanced Graphics Settings. Full should be used.  \n\nOn lower end systems the game will default to 640x480 screen resolution,\ntraffic visible only in the closest 2 zoom levels, and sims visible only in \nthe closest zoom level. Ways to further optimize performance are:  turn off some \nor all animations, select smaller city sizes, and run with the simulation at \nlower speeds. Music and sound also tax the system.  \n\nOn higher end systems, the game will default to 800x600 screen resolution, \ntraffic visible at the closest 3 zoom levels, sims visible at the closest 2 zoom\nlevels. The screen resolution can be changed. You can run the game in screen \nresolutions 1024x768, 1152x864 on up. This allows you to see more of your city at \nany time.\n\nIn general, the system is stressed when running with the simulation at full speed, \nwith all animations enabled, and with sounds and music playing. To improve \nperformance, turn animations down, or off, and turn sounds and/or music off and \nuse lower screen resolution settings. Increasing RAM will improve performance as \nwell.\n\n\nTroubleshooting\n\n\nSee the enclosed Reference Card for details about contacting Electronic Arts \nTechnical Support.\n\nÂ· Problems with the mouse cursor flickering may be caused by old video \ndrivers. Update the video drivers with the latest from the manufacturer.\nÂ· If running with Windows NT 4.0 service pack 3, you can turn off all sound \nand music to prevent any sound related problems you may have. Windows NT has \nsome known problems with DirectSound that won&amp;#039;t be fixed until the next version \nof Windows NT.  SimCity 3000 will not run with any version of Window NT before\nWindow NT 4.0 service pack 3.\nÂ· The game runs in a video resolution that may be different from your \nnormal video resolution. If you have never run Windows in the resolution \nthe game plays in, it may not center the screen correctly. If you see \nthis happen, exit the game, change the resolution of Windows to that of \nthe game and apply it. You can then set the resolution back to what it was,\nthen play the game.\nÂ· Some video cards, most notably the Matrox Millenium, will occasionally show\na flash as the screen is drawn incorrectly for a split second. This problem \ncan be alleviated by getting the latest drivers for the video card. After \ndoing that, turning off Bus Mastering will also help. Visit the card \nmanufacturer&amp;#039;s website for latest drivers and instructions on Bus Mastering.\nÂ· The Sound Blaster Live sound card will squeak if using old drivers. Updating \nthe drivers will make the squeak go away.\nÂ· On systems with two video cards, some primary graphic cards do not provide \nmuch Windows acceleration or may not work at all with SimCity 3000 if they have \nless than 2 MB of memory. In such case, consider upgrading the primary card or \nchoosing the display drivers for your secondary 3D effects card to improve frame \nrate and increase performance. Usually a primary graphics card with \nstrong Windows acceleration will be more satisfactory than most \nsecondary 3D effects graphics cards. This is particularly true when \nattempting to run the game at resolutions higher than 640x480 with \nVoodoo I cards and higher than 800x600 with Voodoo II cards.  \nÂ· If you are using any 3D card in high resolution and find that you \ncannot access parts of the screen or menus once a city is loaded, you \nmust reload the city using a lower resolution. This is due to a bug in \nthe drivers for that card. Use Alt-F4 to exit the city, lower the resolution \nthrough the Preferences in the Opening Menu, and finally reload the city.\nÂ· If you are experiencing problems with the Hercules Terminator Beast Video Card \nranging from distorted graphics to missing text, update to the latest drivers \nfor this card from S3&amp;#039;s website.\nÂ· If you have a 3D sound effects card, you can take advantage of it by clicking\non the &quot;Enable 3D sounds&quot; in the Preferences window.  You will have to restart\nthe game for the setting to take effect.\n\n- Kieran\n","torrent":{"xt":"urn:btih:05c2cf01e4ea2ecfd97b290ad3617b4249be7146","amp;dn":"SIM+CITY++3000+FULL+GAME%21+%28SEEDED+BY+KIERAN_268_UK%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05c2cf01e4ea2ecfd97b290ad3617b4249be7146","infoHashBuffer":{"type":"Buffer","data":[5,194,207,1,228,234,46,207,217,123,41,10,211,97,123,66,73,190,113,70]},"announce":[],"urlList":[]}}