{"title":"Cocktail.1988.DvDrip.TeNNReeD","uid":4377746,"size":734401458,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05f962e62cb24a8a6f2b02e7efb1b30a5d9ab727&amp;dn=Cocktail.1988.DvDrip.TeNNReeD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"TeNNReeD","files":2,"time":1220495446,"description":"Cocktail (1988) A Release By:  TeNNReeD\n\nInfo Hash: 05f962e62cb24a8a6f2b02e7efb1b30a5d9ab727 \n\nTrackers:\nudp://vip.tracker.thepiratebay.se:80/announce &lt;a href=&quot;\nhttp://tracker.bittorrent.am/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.bittorrent.am/announce&lt;/a&gt;\n\nFile Info\n\nTitle: Cocktail\nYear: 1992\nGenre: Drama, Romance\nRun Time: 104 min\nIMDB Rating: 5.2/10 (19,023 votes)\nIMDB Url: http://www.imdb.com/title/tt0094889/\nLanguage: English\nFiles: 2\nSize: 700.26 MB\nSource: DVD\n\nMovie Info\n\nCountry: USA\nDirector: Roger Donaldson\nScreenwriter: Heywood Gould\nCast: Tom Cruise, Bryan Brown, Elisabeth Shue, Kelly Lynch, Gina Gershon, Lisa Banes\n\nTag Line: When he pours, he reigns.\n\nPlot Outline: After leaving the Army, Brian Flanagan (Tom Cruise) tries to get a marketing job in New York. But without a college degree, this was not possible. He then decides to start studying for a business degree at the local City College and gets a part time job as a bartender. He realizes that its not that easy, but when his new boss Douglas Coughlin (Brian Brown) teaches him the secrets of the bar trade and they become the most famous bartenders in town. Both Brian &amp; Doug Coughlin want their own top class cocktail bars someday and Brian&amp;#039;s Cocktail Bar is to be called &amp;#039;Cocktails &amp; Dreams&amp;#039;, and in order to get the necessary money to open it, Brian travels to Jamaica to work as a bartender at a resort Tiki Bar, and the pay is good. There he meets Jordan Mooney (Elisabeth Shue), a young and pretty, up and coming American artist on vacation with her girlfriend from New York, staying at the Island resort. Jordan and Brian spend some quality time together and fall in love. But when Brian takes a dare from his old buddy, Doug Coughlin to sleep with an older woman, who is also staying at the resort. Jordan, herself the daughter of wealthy parents back in New York, leaves the Island overnight, after seeing Brian and the older woman together after closing... Will Jordan ever forgive Brian and will they get back together??? \n\nI think I`m going to continue to search for movies and if I don`t find them I will up them.  Unfortunately I am deploying to Afghanistan next month and will be taking a break from releasing until early next year, but then I will be back and I will have a tonne more movies to up.  I will continue to up until I leave.  Thank you for supporting me.\n\nHere for you-TeNNReeD","torrent":{"xt":"urn:btih:05f962e62cb24a8a6f2b02e7efb1b30a5d9ab727","amp;dn":"Cocktail.1988.DvDrip.TeNNReeD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f962e62cb24a8a6f2b02e7efb1b30a5d9ab727","infoHashBuffer":{"type":"Buffer","data":[5,249,98,230,44,178,74,138,111,43,2,231,239,177,179,10,93,154,183,39]},"announce":[],"urlList":[]}}