{"title":"Jurassic Park The Lost World NL sub avi (MovieNight)","uid":6614070,"size":835141120,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:060482c30e184d2eac68cf34076cd472861664f0&amp;dn=Jurassic+Park+The+Lost+World+NL+sub+avi+%28MovieNight%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":2,"uploader":"MovieNight","files":1,"time":1313711402,"description":"Vier jaar na het mislukken van Jurassic Park op Isla Nublar blijkt er nog een eiland met dino's te zijn\n\nVier jaar na het mislukken van zijn dinosauruspretpark op Isla Nublar vertelt John Hammond aan Ian Malcolm dat er nog een eiland is ('Site B'), waar dinosaurussen gefokt werden voordat ze naar Isla Nublar werden overgebracht. Sinds de ramp zijn de dino's alleen achtergebleven en hebben zich flink voortgeplant. Met enige tegenzin reist Ian samen met een team wetenschappers, onder wie zijn vriendin Sarah, voor onderzoek naar het eiland. Al snel komen ze erachter dat ze niet de enige mensen daar zijn.\n\nDit vervolg op 'Jurassic Park' werd een gigantisch bioscoopsucces. Het verhaal is losjes gebaseerd op de bestseller van Michael Crichton. De effecten van zowel Stan Winston als ILM mogen er absoluut zijn, net zoals de sterke cast. Steven Spielberg regisseerde dit succesvolle vervolg op zijn wereldhit 'Jurassic Park'. Jeff Goldblum keerde terug als wiskundige Ian. Daarnaast is Julianne Moore te zien als Sarah en speelt Pete Postlethwaite een Brits jager die de dino's probeert te vangen. Hierna volgde 'Jurassic Park III'.\n\n\n\nMovieNight\n\nVerzoeken? Vraag maar raak","torrent":{"xt":"urn:btih:060482c30e184d2eac68cf34076cd472861664f0","amp;dn":"Jurassic+Park+The+Lost+World+NL+sub+avi+%28MovieNight%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"060482c30e184d2eac68cf34076cd472861664f0","infoHashBuffer":{"type":"Buffer","data":[6,4,130,195,14,24,77,46,172,104,207,52,7,108,212,114,134,22,100,240]},"announce":[],"urlList":[]}}