{"title":"flatout","uid":3617481,"size":990351275,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:06ea14bf907f606ed268eda15cc533ac81d656e9&amp;dn=flatout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"bercik82","files":69,"time":1171386094,"description":"FlatOut is a racing video game developed by Finnish Bugbear Entertainment and published by Empire Interactive and Vivendi Universal Games in 2004 and 2005. Gameplay in Flatout places emphasis on demolition derby-style races, and features a sophisticated physics engine. 16 different cars are included, each with 5 different skins for them.\n\nModes in FlatOut include standard lap races, in either open environments or stadium laps, and demolition derby deathmatches, in which the driver of the sole-surviving vehicle declared the winner; both modes pit players against 7 computer-controlled opponents. The game also includes special events which require the player to toss the driver of off his/her vehicle and meet certain requirements. In career mode, pick up your future top racer from the junkyard. Winnings come in the form of cash, which allows players to purchase vehicle upgrades and new vehicles.\n\nFlatOut is noted for its extensive use of physics in vehicle damage and collisions; dents on vehicles may vary based on the type of accident, object and angle of impact (falling objects, for example, will damage mostly the upper areas of a car), while many roadside items react better to collisions from other vehicles.\n\nRagdoll physics is also present in the game, with drivers capable of being tossed out of their car after high-impact crashes. This feature is extensively used in several special events, when the player is required to &quot;toss&quot; a driver to a specific distance, height, or target.","torrent":{"xt":"urn:btih:06ea14bf907f606ed268eda15cc533ac81d656e9","amp;dn":"flatout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06ea14bf907f606ed268eda15cc533ac81d656e9","infoHashBuffer":{"type":"Buffer","data":[6,234,20,191,144,127,96,110,210,104,237,161,92,197,51,172,129,214,86,233]},"announce":[],"urlList":[]}}