{"title":"Damien Jurado - Brothers and Sisters of the Eternal Son [FLAC]","uid":9522699,"size":351634354,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:07182e155c4033579be1795aa33974d7bd1dac4f&amp;dn=Damien+Jurado+-+Brothers+and+Sisters+of+the+Eternal+Son+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"politux","files":-1,"time":1390672035,"description":"  Damien Jurado - Brothers and Sisters of the Eternal Son [FLAC]\n\n  Released: 2014\n  Genre: Pop/Rock\n  Styles: Singer/Songwriter, Alternative, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n  \n  01 Magic Number \n  02 Silver Timothy\n  03 Return To Maraqopa \n  04 Metallic Cloud \n  05 Jericho Road \n  06 Silver Donna \n  07 Silver Malcolm\n  08 Silver Katherine \n  09 Silver Joy \n  10 Suns In Our Mind \n \n  Sisters (Disc 2)\n\n  01 Plains To Crash \n  02 Return To Maraqopa \n  03 Silver Timothy\n  04 Metallic Cloud \n  05 Silver Malcolm\n  06 All For You \n  07 Jericho Road \n  08 Silver Katherine \n\n  Long-running indie singer/songwriter Damien Jurado branched out into even deeper sonic territory with his Richard Swift-produced 2012 album, Maraqopa. That album's production managed to be in a constant state of tense flux without ever becoming busy or overblown, winding subtle touches of psychedelia and haunted echo around the acoustic core of Jurado's songs. A few years later, the duo of Swift and Jurado return with the sublime and even further out Brothers and Sisters of the Eternal Son, a twisting set of songs that hides intricate production techniques in Jurado's increasingly layered and complex compositions. The most remarkable element of the production is the heavy '70s dub influence that hides in the corners at first but eventually sprawls out over the course of the album. \n\n  The treated vocals of &quot;Jericho Road&quot; flutter with distorted echoes as the song builds into what sounds like an update of a lost track from Jesus Christ Superstar, with a far more demented mix. This song spills into the epic &quot;Silver Donna,&quot; also drenched in watery echo, groove-heavy hand percussion, and falsetto vocals from Jurado, reaching their crescendo with rippling call-and-response harmonies near the song's end. Somewhere between the most driven moments of early Crosby, Stills, Nash &amp; Young and the lovely confusion of the Lee Perry-produced Congos albums, the song finds its uniquely cracked voice. Elsewhere on the album, lofty autoharps, psyched-out organ tones, and Swift's bright, often orchestral arrangements leave no space too empty or too exposed. Like a far more experimental take on the perfect pacing of Bon Iver's best work, songs like &quot;Silver Katherine&quot; meld Jurado's always beautiful songwriting with gorgeous accompaniment and just enough studio magic to keep things moving forward for the duration of the album. What could have been a somewhat sleepy album is taken into a place of curious introspection, heightened emotional dynamics, and mysterious religious undercurrents. This album continues the colorful and reaching work of the albums that preceded it, and if this pairing of Swift's deft production and Jurado's risk-taking songwriting continues, even greater things are on the horizon than these already gorgeous songs.","torrent":{"xt":"urn:btih:07182e155c4033579be1795aa33974d7bd1dac4f","amp;dn":"Damien+Jurado+-+Brothers+and+Sisters+of+the+Eternal+Son+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07182e155c4033579be1795aa33974d7bd1dac4f","infoHashBuffer":{"type":"Buffer","data":[7,24,46,21,92,64,51,87,155,225,121,90,163,57,116,215,189,29,172,79]},"announce":[],"urlList":[]}}