{"title":"Ingrid Michaelson - Discography (2005-2014) [FLAC]","uid":9988727,"size":2302707133,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:075a612227bc6c28f290af3e66dd8abed4492545&amp;dn=Ingrid+Michaelson+-+Discography+%282005-2014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"politux","files":-1,"time":1397781680,"description":"\n  Ingrid Michaelson - Discography (2005-2014) [FLAC]\n\n  Genre: Pop/Rock \n  Styles: Indie, Singer/Songwriter\n  Source: CD, WEB\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  2005 Slow the Rain\n  2006 Girls and Boys\n  2008 Be OK\n  2009 Everybody \n  2010 Everybody Girls &amp; Boys\n  2012 Human Again\n  2014 Lights Out\n\n  With her piano-fueled songwriting, witty wordplay, and slight vocal vibrato, Ingrid Michaelson carries the tradition of the female singer/songwriter into the 21st century. Befitting a musician of the digital age, Michaelson first gained wide exposure through spots on TV soundtracks, including Grey's Anatomy and One Tree Hill. Born and raised on New York's Staten Island to an artist mother and classical composer father, she began exploring music through piano lessons at the age of four. After college, she toured with a national theater troupe and spent her free time writing songs, later compiling them into an online-distributed recording entitled Slow the Rain.\n\n  Michaelson blazed her own trail by independently issuing her proper debut, the engaging Girls and Boys, in 2006; following the inclusion of her music in several episodes of Grey's Anatomy, she then released a remastered version of the album on her own Cabin 24 Records in January 2007. Three months later, she won a national songwriting contest sponsored by Mountain Stage, a radio program produced by West Virginia Public Broadcasting and distributed worldwide. &quot;The Way I Am&quot; was then picked up by Old Navy, who used it to soundtrack one of their clothing commercials, and Michaelson began making headlines as one of the country's most promising independent artists. A benefit project comprised of live recordings, new songs, and rarities, Be OK was released in 2008. Michaelson joined the Hotel Cafe Tour that fall in support of the album, whose proceeds went toward cancer research, and later toured Europe alongside Jason Mraz.\n\n  For her &quot;proper&quot; follow-up to Girls and Boys, Ingrid Michaelson retreated to a Manhattan studio alongside producer Dan Romer. Forty newly composed songs were whittled down to a total of twelve, with more emphasis being paid to the songwriter's peppier material. Featuring a string section on several songs, 2009's Everybody proved to be Michaelson's most expansive, confident effort to date, and she followed its release with another cross-country fall tour. In 2012, Michaelson returned with her fifth studio album, Human Again with production from David Kahne (Paul McCartney, Regina Spektor, Stevie Nicks, The Bangles) and featuring the single, &quot;Ghost.&quot; It earned critical praise and performed better on the charts than any of her previous albums. The follow-up Lights Out appeared in April 2014, with 14 Michaelson originals and several guest appearances, including Greg Laswell, Mat Kearney, and A Great Big World.\n\n  *Thank you to the original uploaders and rippers.\n\n  **Note to downloaders, please don't complain if something isn't included in this discography.  I have assembled as much material as I could find.  If something is missing you can try to find it and upload it for the community.  Asking for it here wont help.","torrent":{"xt":"urn:btih:075a612227bc6c28f290af3e66dd8abed4492545","amp;dn":"Ingrid+Michaelson+-+Discography+%282005-2014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075a612227bc6c28f290af3e66dd8abed4492545","infoHashBuffer":{"type":"Buffer","data":[7,90,97,34,39,188,108,40,242,144,175,62,102,221,138,190,212,73,37,69]},"announce":[],"urlList":[]}}