{"title":"InfiniteSkills - Learning Cloud Computing With AWS","uid":11191966,"size":420475702,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:078061fd03a9fd304b5068c3da22c9db79480b6a&amp;dn=InfiniteSkills+-+Learning+Cloud+Computing+With+AWS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"NepsterJay","files":28,"time":1413009242,"description":"Infinite Skills - Learning Cloud Computing With Amazon Web Services\n\nIn this Amazon Web Services (AWS) training course, Rich Morrow walks you through utilizing the wide range of Cloud Computing and Cloud Web Hosting services that Amazon provides. Cloud Computing and Hosting is fast becoming the standard method of creating scalable, manageable Web Application Services, and Amazon is leading the way. This tutorial will teach you what is available in AWS, and how to use it effectively for your own Cloud Hosting needs.\n\nYou will start by learning exactly what Cloud Computing is, and why you should be using it. Rich shows you how to set up your AWS account, and gives you an overview of the services that are available to you. Throughout this video tutorial, you will cover topics such as; creating and managing EC2 instances, using the Elastic Load Balancers, CloudWatch, CloudFormation, Amazon Elastic Block Store (Amazon EBS) , S3, RDS and Dynamo. Rich also reviews CloudFront services, ElastiCache, VPC, SNS (Simple Notification Service), SES (Simple Email Service), SQS (Simple Queuing Service) and Route 53. You will finish off by walking through the creation of a 3 tier scalable Web Application using the AWS tools you have learned in this course.\n\nOnce you have completed this comprehensive AWS video training, you will be fully capable of creating and deploying your own Web Applications and setting up Cloud Hosted web servers AWS. You will be familiar with the most important services, and have hands on experience in deploying your own instances using the AWS interface. Working files are included, allowing you to follow along with the author throughout the lessons.","torrent":{"xt":"urn:btih:078061fd03a9fd304b5068c3da22c9db79480b6a","amp;dn":"InfiniteSkills+-+Learning+Cloud+Computing+With+AWS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"078061fd03a9fd304b5068c3da22c9db79480b6a","infoHashBuffer":{"type":"Buffer","data":[7,128,97,253,3,169,253,48,75,80,104,195,218,34,201,219,121,72,11,106]},"announce":[],"urlList":[]}}