{"title":"Quantum Break (Steam)","uid":15916479,"size":44852409914,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:08167a75853bb3c2a1b1a17bdd00645228ba1faa&amp;dn=Quantum+Break+%28Steam%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":181,"uploader":"dauphong","files":1,"time":1475201262,"description":"About This Game\r\nIn the aftermath of a split second of destruction that fractures time itself, two people find they have changed and gained extraordinary abilities. One of them travels through time and becomes hell-bent on controlling this power. The other uses these new abilities to attempt to defeat him – and fix time before it tears itself irreparably apart. Both face overwhelming odds and make dramatic choices that will determine the shape of the future. Quantum Break is a unique experience; one part hard-hitting video game, one part thrilling live action show, featuring a stellar cast, including Shawn Ashmore as the hero Jack Joyce, Aidan Gillen as his nemesis Paul Serene and Dominic Monaghan as Jack’s genius brother William. Quantum Break is full of the vivid storytelling, rich characters and dramatic twists Remedy Entertainment are renowned for. Your choices in-game will affect the outcome of this fast-paced fusion between game and show giving the player a completely unique entertainment experience.\r\n\r\nFEATURES:\r\n• In-depth, fast-paced narrative experience crafted by Remedy Entertainment\r\n• Top quality live action show that is directly impacted by choices made in-game\r\n• Stellar cast of actors\r\n• One story told many ways\r\n• Time-amplified action gameplay\r\n• Navigate epic scenes of destruction as they skip and rewind in broken time","torrent":{"xt":"urn:btih:08167a75853bb3c2a1b1a17bdd00645228ba1faa","amp;dn":"Quantum+Break+%28Steam%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08167a75853bb3c2a1b1a17bdd00645228ba1faa","infoHashBuffer":{"type":"Buffer","data":[8,22,122,117,133,59,179,194,161,177,161,123,221,0,100,82,40,186,31,170]},"announce":[],"urlList":[]}}