{"title":"Beneath the Sands of Egypt: Adventures of an Archaeologist","uid":15791801,"size":1473751,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0827f9d05dca64a050ee616c9f67aac732a94832&amp;dn=Beneath+the+Sands+of+Egypt%3A+Adventures+of+an+Archaeologist&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"marty14","files":1,"time":1473387760,"description":"Beneath the Sands of Egypt: Adventures of an Unconventional Archaeologist - Donald P. Ryan [epub]\r\n\r\nThis book should do for Egyptology what Donald Johanson and Maitland Eddy's Lucy (1981) did for paleontology. Ryan, the archaeologist who rediscovered tomb KV 60 in the Valley of the Kings (later identified as the final resting place of the pharoah Hatshepsut), takes us through his life, career, and numerous expeditions. It's a thrilling book, not because it's full of Indiana Jones heroics but because Ryan's enthusiasm for what he does (more dirt-sifting than bullwhip-wielding) is manifested on every page; and — again like Johanson and Eddy — he catches us up in his excitement, makes us wish we weren't just reading about this stuff but were actually doing it.\r\n\r\nRyan also dispels or challenges some long-held pieces of so-called common knowledge, such as the belief that slaves built the pyramids (there's no evidence to support that) and the much-ballyhooed but sadly nonexistent curse of the mummy's tomb. This wonderful adventure story should be must reading for anyone aspiring to become an archaeologist, but even those of us who harbor no such dreams will be aching to get a little dirt under our fingernails","torrent":{"xt":"urn:btih:0827f9d05dca64a050ee616c9f67aac732a94832","amp;dn":"Beneath+the+Sands+of+Egypt%3A+Adventures+of+an+Archaeologist","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0827f9d05dca64a050ee616c9f67aac732a94832","infoHashBuffer":{"type":"Buffer","data":[8,39,249,208,93,202,100,160,80,238,97,108,159,103,170,199,50,169,72,50]},"announce":[],"urlList":[]}}