{"title":"The Incredible Hulk (UPDATED)","uid":8902908,"size":10547705110,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:082f50fa218094b56cb5c867f0941d9e078c8b84&amp;dn=The+Incredible+Hulk+%28UPDATED%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":12,"uploader":"Zlenny","files":736,"time":1378845580,"description":"The Hulk is a fictional character, a comic book superhero appearing in publications by Marvel Comics. The character was created by Stan Lee and Jack Kirby, and first appeared in The Incredible Hulk #1 (May 1962). Throughout his comic book appearances, the Hulk is portrayed as a large green humanoid that possesses near limitless superhuman strength and great invulnerability, attributes that grow more potent the angrier he becomes. Hulk is the alter ego of Bruce Banner, a socially withdrawn and emotionally reserved physicist who physically transforms into the Hulk under emotional stress and other specific circumstances at will or against it; these involuntary transformations lead to many complications in Banner's life. When transformed, the Hulk often acts as a disassociated separate personality that hates Banner. Over the decades of Hulk stories, the Hulk has been represented with several different personalities based on Hulk and Banner's fractured psyche, ranging from mindless savage to brilliant warrior, and Banner has taken control of the Hulk's form on occasion. Banner first transforms into the Hulk after being caught in the blast of the gamma bomb he invented while saving Rick Jones, a youth who had wandered onto the testing range.\n\nLee said that the Hulk's creation was inspired by a combination of Frankenstein and Dr. Jekyll and Mr. Hyde.Although the Hulk's coloration has varied throughout the character's publication history, the most consistent shade is green. As a child, Banner's father Brian Banner often got mad and physically abused his mother, creating the psychological complex of fear, anger, and the fear of anger and the destruction it can cause that underlies the character. A common storyline is the pursuit of both Banner and the Hulk by the U.S. armed forces, because of all the destruction that he causes. He has two main catchphrases: &quot;Hulk is strongest one there is!&quot; and the better-known &quot;HULK SMASH!&quot;\n\n\nThis Torrent includes:\n\n. The Publication history The Incredible Hulk from 1962 - 2013. \n. Variant covers (if available)\n. In English and in CBR and/or CBZ format\n. World War Hulk, Fall of the Hulks and World War Hulks Tie-ins included \n\nIf you appreciate the torrent and work, leave a comment. \t","torrent":{"xt":"urn:btih:082f50fa218094b56cb5c867f0941d9e078c8b84","amp;dn":"The+Incredible+Hulk+%28UPDATED%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082f50fa218094b56cb5c867f0941d9e078c8b84","infoHashBuffer":{"type":"Buffer","data":[8,47,80,250,33,128,148,181,108,181,200,103,240,148,29,158,7,140,139,132]},"announce":[],"urlList":[]}}