{"title":"Jeff Buckley - You and I (2016)","uid":14109955,"size":94437424,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:089f59174b152c74679aaf346092669a732dbbcb&amp;dn=Jeff+Buckley+-+You+and+I+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"reedite","files":10,"time":1459380574,"description":"Long rumored to exist as the &quot;Addabbo sessions&quot;, but previously unheard outside the studio, these seminal recordings are a fan's Holy Grail, a rare opportunity to hear Jeff Buckley in peak form, developing his artistry through a series of spellbinding solo performances, each one captured in pristine sonic detail.\r\n\r\nRecently discovered in the Sony Music archives during the research for the 20th anniversary edition of Buckley's Grace album, the performances on You and I are a revelation, an intimate portrait of the artist performing a variety of cover songs and original music expressing a range of emotion channeled through his singular sensibility.\r\n\r\nThe songs on You and I reveal, in part, the eclectic scope of Jeff Buckley's extraordinary musical tastes and abilities. The covers on the album include Jeff's highly personal interpretations of songs written by Bob Dylan (&quot;Just Like a Woman&quot;); Sylvester Stewart (&quot;Everyday People,&quot; recorded by Sly &amp; the Family Stone); Joe Green (&quot;Don't Let the Sun Catch You Cryin',&quot; recorded by Louis Jordan, Ray Charles and others); Bob Telson (&quot;Calling You,&quot; recorded by Jevetta Steele for the 1987 film Bagdad Café); Morrissey and Johnny Marr (&quot;The Boy with the Thorn in His Side&quot; and &quot;I Know It's Over,&quot; recorded by the Smiths); Booker T. Washington &quot;Bukka&quot; White (&quot;Poor Boy Long Way from Home,&quot; from a 1939 &quot;field&quot; recording made by John Lomax) and John Paul Jones/Jimmy Page/Robert Plant (&quot;Night Flight,&quot; recorded by Led Zeppelin).\r\n\r\nRounding out You and I are two pieces of original music: the first-ever solo studio recording of his signature song, &quot;Grace&quot; and &quot;Dream of You and I,&quot; a mysterious and haunting piece which informs the deeply intimate and profoundly personal mood of the album.\r\n\r\nThese 10 tracks offer an incredible, rare glimpse of an artist, alone, in the sacred space that is the studio. There's an intimacy and an honesty to the performances that's literally breathtaking. You &amp; I is an important addition to Jeff's recorded legacy and will be a thrill for both his devoted longtime fans and newcomers alike","torrent":{"xt":"urn:btih:089f59174b152c74679aaf346092669a732dbbcb","amp;dn":"Jeff+Buckley+-+You+and+I+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"089f59174b152c74679aaf346092669a732dbbcb","infoHashBuffer":{"type":"Buffer","data":[8,159,89,23,75,21,44,116,103,154,175,52,96,146,102,154,115,45,187,203]},"announce":[],"urlList":[]}}