{"title":"Waterloo.1970.DVDrip.WS.DivX","uid":4020105,"size":939842881,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:08aa36ef54f64c9cde93d9f455c00fd79ff363c4&amp;dn=Waterloo.1970.DVDrip.WS.DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"avagriffon","files":2,"time":1202621017,"description":"528x224 pixels DivX\n25 fps\n320kbps Variable Bit Rate Mpeg layer-3\n128.11 Mins\n\nWaterloo was a Soviet-Italian film of 1970, directed by Sergei Bondarchuk and produced by Dino De Laurentiis. It was the story of the preliminary events and the Battle of Waterloo, and was famous for its lavish battle scenes.\n\nIt starred Rod Steiger (portraying Napoleon Bonaparte), Christopher Plummer (portraying the Duke of Wellington) with cameos by Orson Welles (Louis XVIII of France). Other stars included Jack Hawkins as General Picton, Virginia McKenna as the Duchess of Richmond and Dan O&amp;#039;Herlihy as Marshal Ney, whom he closely resembled.\n\nThe film includes some fifteen thousand Soviet foot soldiers as extras and two thousand cavalrymen, some of which were cossack horsemen (&quot;it was said that, during its making, director Sergei Bondarchuk was in command of the seventh largest army in the world&quot;). Fifty circus stunt riders were used to perform the dangerous horse falls. These numbers brought an epic quality to the battle scenes. This is particularly true of the panning aerial shots of Marshal Ney&amp;#039;s cavalry charging up and over the escarpment to break like a wave around the British squares. The slow motion section of the charge of the Scots Greys is a tribute to the painting &quot;Scotland Forever!&quot; by Lady Butler in Leeds City Art Gallery.","torrent":{"xt":"urn:btih:08aa36ef54f64c9cde93d9f455c00fd79ff363c4","amp;dn":"Waterloo.1970.DVDrip.WS.DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08aa36ef54f64c9cde93d9f455c00fd79ff363c4","infoHashBuffer":{"type":"Buffer","data":[8,170,54,239,84,246,76,156,222,147,217,244,85,192,15,215,159,243,99,196]},"announce":[],"urlList":[]}}