{"title":"Disney Pixars Ultimate Collection Boxset+Bonus Toy Story 3- dvds","uid":6677141,"size":20870314451,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:08c5773e053ad0bc052d7e3d1d3a57f9537175f3&amp;dn=Disney+Pixars+Ultimate+Collection+Boxset%2BBonus+Toy+Story+3-+dvds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":21,"uploader":"alanwatson","files":-1,"time":1316074541,"description":"Genre:  kids,animation,disney,pixar  \n\nRelease: June 30th, 2008\n\nCountry: usa/uk\n\nLanguage: English\n\nPlot:The Pixar Ultimate Collection has all your favourite movies from the legendary, groundbreaking Pixar studios. From CGI trailblazer Toy Story to the incredible Incredibles, eight of the greatest animated films of all time are put together in one place for the first time. There is also the chance to see some early Pixar short films in Pixar Shorts[full rip]--a fascinating insight into the development of CGI--and a look inside the studio in The Pixar Story.\n\nDescription\nThe complete collection of Disney Pixar titles, available in one box set. Titles include: TOY STORY (1995), A BUG'S LIFE (1998), TOY STORY 2 (1999), MONSTERS, INC. (2001), FINDING NEMO (2003), THE INCREDIBLES (2004), CARS (2006), RATATOUILLE (2007), PIXAR SHORTS COLLECTION VOL.1 and THE PIXAR STORY (2007).\nAdded Bonus DVD [Toy Story 3]\n\nno imdb for boxset\n\n[url=http://www.amazon.co.uk/Pixar-Ultimate-Collection-Tom-Hanks/dp/B001AP2BDS/ref=pd_cp_d_h__0]Amazon link [/url]\n\n\n\nVideo Format:All @ Xvid ac3 5.1 where available \n \nVideo Source: DVD COLLECTION BOXSET\n\n*****************************************\n\nToy Story:\n\nAs 6-year-old Andy's favourite toy, Woody (Tom Hanks), a take-charge, pull-string cowboy, is confident in his role as room leader. But after Andy's birthday party, newcomer Buzz Lightyear (Tim Allen), a flashy space ranger with laser action and pop-out wings, crash-lands into Woody's world.\n\n******************************************\n\nToy Story 2:\n\n While Andy is away at summer camp, Woody is toynapped by Al, a greedy toy collector. His best friends including Buzz, Mr Potato Head, Slinky Dog and Rex set out on a heroic rescue mission to save him. Along the way, they meet a whole host of new friends including Jessie the cow girl and Bullseye the horse. Together, the Toy Story 2 gang set out to make sure Woody is home safely before Andy returns.....\n\n*****************************************\n\nA Bug's Life:\n\n On behalf of oppressed bugs everywhere, an inventive ant named Flik hires warrior bugs to defend his colony from a horde of greedy grasshoppers, led by Hopper. But when Flik's cavalry turns out to be a motley group of flea circus performers, the stage is set for comic confusion...as well as unlikely heroes.\n\n******************************************\n\nMonsters, Inc:\n\n Monsters, Inc. is the largest scare factory in the monster world and the top Kid-Scarer is James P. Sullivan (John Goodman), a huge, intimidating monster with blue fur, large purple spots and horns, known as &quot;Sulley&quot; to his friends. His Scare Assistant&quot;, best friend and roommate is Mike Wazowski (Billy Crystal), a lime green, opinionated, feisty monster. And visiting from the human world is Boo, a tiny girl who turns the monster world upside down and teaches Sulley and Mike that laughter is more powerful than a scream.\n\n********************************************\n\nFinding Nemo:\n\n Nemo, an adventurous young clownfish, is unexpectedly taken to a dentist's office aquarium. It's up to Marlin (Albert Brooks), his worrisome father, and Dory (Ellen DeGeneres), a friendly but forgetful regal blue tang fish, to make the epic journey to bring Nemo home.\n\n*********************************************\n\nThe Incredibles:\n\n Bob Parr was once known as Mr Incredible, the world's greatest superhero. Fifteen years later, Bob and his wife, Helen (Formerly Elastigirl), have adopted civillian identities and retreated to the suburbs to lead &quot;normal lives&quot; with their three children. However, Bob is thrown back into the world of super-heroism when he receives a mysterious communication summoning him to a remote island for a top-secret mission.\n\n*********************************************\n\nCars:\n\n Speeding on his way to a big race, Lightning McQueen crashes into Radiator Springs, destroying lots of the inhabitants' belongings. In order to make up for what he did, the raucous roadster is sentenced to community service. Though he will do anything to get away from the work, McQueen must learn to respect and bond with the Radiator Springs inhabitants in order to get out of the town and back on the racetrack...\n\n*********************************************\n\nRatatouille:\n\n A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau.\n\n*********************************************\n\nPixar Shorts:\n\n With revolutionary animation, unforgettable music and characters you'll love, these dazzling short films have changed the face of animation and entertainment and are sure to delight people of all ages for years to come.\n\n*********************************************\n\nThe Pixar Story: \n\nThis film takes audiences behind the scenes of the groundbreaking company that pioneered a new generation of animation and forever changed the face of filmmaking. Featuring exclusive interviews with John Lasseter, Ed Catmull, Steve Jobs, George Lucas, Michael Eisner, Bob Igler, Tom Hanks, Billy Crystal, Tim Allen, Brad Bird and more.\n\n*********************************************\n\nBonus dvd\n\n\nToy Story 3:\n\nThe creative minds behind Disney/Pixar's groundbreaking animated blockbusters invite you back inside the toy box for a heartwarming and hilarious movie experience you'll never forget. In Toy Story 3, Woody (voiced by Tom Hanks), Buzz Lightyear (voiced by Tim Allen) and the rest of the Toy Story gang return for an all-new adventure, along with a few new faces - some plastic, some plush - including Barbie's counterpart Ken (voiced by Michael Keaton), a thespian hedgehog named Mr. Pricklepants (voiced by Timothy Dalton) and a strawberry-scented bear named Lots-O'-Huggin' Bear (voiced by Ned Beatty).\n\nAs Andy prepares to depart for college, Woody, Buzz, Jessie and the rest of Andy's faithful toys wonder what will become of them. But, when a mix-up lands them at Sunnyside Daycare, they meet a host of new toys and soon discover a wild new adventure is just beginning. Buzzing with hours of bonus features, including the Pixar short film Day &amp; Night, Toy Story 3 goes to infinity and beyond!\n\n**********************************************\n\nAll ripped to ac3 5.1 where available,the pixars shorts i have made as a[full rip]to include all extras.many of the incuded dvds were 2 disc collection....the 2nd discs i will up as a seperate torrent file....i have also included toy story 3 as a bonus....covers included!!!\n\nthis torrent due to the size has been added to a seedbox/server and will leave on for long period....happy downloading................\n","torrent":{"xt":"urn:btih:08c5773e053ad0bc052d7e3d1d3a57f9537175f3","amp;dn":"Disney+Pixars+Ultimate+Collection+Boxset%2BBonus+Toy+Story+3-+dvds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08c5773e053ad0bc052d7e3d1d3a57f9537175f3","infoHashBuffer":{"type":"Buffer","data":[8,197,119,62,5,58,208,188,5,45,126,61,29,58,87,249,83,113,117,243]},"announce":[],"urlList":[]}}