{"title":"Sergio Mendes Trio - Bossa Nova York (1964)","uid":5501484,"size":55910323,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:09166f858d3ea4d192edbb15df21892d93a9db37&amp;dn=Sergio+Mendes+Trio+-+Bossa+Nova+York+%281964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"artpepper","files":-1,"time":1271560792,"description":"Sergio Mendes Trio - Bossa Nova York (1964)\n\n@192 kbps\n\nAlso released as The Swinger from Rio (on Atlantic Records)\n\n\n\n\n\n\n\n\n\n\nFrom the original liner notes:\n\n\n\n&quot;...'During the recordings I was ecstatic, and kept pinching myself that here I am, playing with Jobim and Art and Phil. It was like a beautiful dream coming true...' - Sergio Mendes\n\nWe have become more familiar with the music of Latin America and especially that of Brazil in the past year. The new music from Brazil (better known as bossa nova) has been absorbed into the mainstream of our own music. This is completely natural. While we have been listening to their music, Latin American musicians have been listening to ours. Jazz music in particular has been fascinating to them for quite some time, and it would be accurate to describe bossa nova as a marriage of modern Brazilian music and American jazz.\n\nThe music contained in this album is the happy result of a meeting of Brazilian bossa nova stars and American jazz musicians. Sergio Mendes, the young man who graces the cover of this LP is one of the brightest talents to emerge from Brazilian music circles. He possesses a crisp piano style that clearly dominates all of the performances in this album. The clarity of Sergio's musical thought is always apparent whether he is soloing, playing ensemble or accompanying someone else's solo. In addition he inspires some of the finest work on records by the well known jazz performers, Art Farmer, Phil Woods and Hubert Laws.&quot; \n\n\n\n\n\n\n\nDigitally remastered reissue of Sergio's debut album with his trio. Initially, Sergio moved from Brazil to New York to work as pianist with Antonio Carlos Jobim and Art Farmer (amongst others). He recorded this album plus a second album entitled Girl From Ipanema before forming the band that would eventually become Brasil '66. Bossa Nova York is closer to authentic Brazilian music than his later, more commercial recordings and these early sides are adored by Jazz purists. Originally recorded in New York and released in 1966\n\n\n\n\n\n\n\n\nTracklist:\n\n\n\n1 Maria Moita (DeMoraes, Lyra) 3:28\n2 SÃƒÂ³ Tinha de Ser Com VocÃƒÂª (DeOliveira, Jobim) 3:11\n3 Batida Diferente (Einhorn, Ferreira) 3:46\n4 SÃƒÂ³ DanÃƒÂ§o Samba (DeMoraes, Jobim) 3:10\n5 Pau Brasil Moraes 3:12\n6 Garota de Ipanema DeMoraes, Jobim 2:51\n7 InÃƒÂºtil Paisagem DeOliveira, Jobim 3:25\n8 Vivo Sonhando Jobim 4:14\n9 Primavera DeMoraes, Lyra 2:45\n10 ConsolacÃƒÂ£o DeMoraes, Powell 3:20\n11 O Morro NÃƒÂ£o Tem Vez DeMoraes, Jobim 5:19 \n\n\n\nSergio Mendes (Piano)\nAntonio Carlos Jobim (Guitar) - 1,2,4,6-11\nArt Farmer (Trumpet and Flugelhorn) - 2,3,5-7,11\nPhil Woods (Alto Saxophone) - 1,4,8\nTiao Neto (Double Bass)\nChico DeSouza (Drums)\nHubert Laws (Flute) - 3,5,9,11","torrent":{"xt":"urn:btih:09166f858d3ea4d192edbb15df21892d93a9db37","amp;dn":"Sergio+Mendes+Trio+-+Bossa+Nova+York+%281964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09166f858d3ea4d192edbb15df21892d93a9db37","infoHashBuffer":{"type":"Buffer","data":[9,22,111,133,141,62,164,209,146,237,187,21,223,33,137,45,147,169,219,55]},"announce":[],"urlList":[]}}