{"title":"BPS Spyware Adware Remover 9.4.0.1","uid":4306249,"size":7897142,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:094262279c2447302dbd8aa83b3ca447a43743b1&amp;dn=BPS+Spyware+Adware+Remover+9.4.0.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"romelanda","files":4,"time":1216570529,"description":"BPS Spyware and Adware Remover - scan and remove spyware and adware components from your system safely\nBPS Spyware/Adware Remover Is a multi Adware, SpyWare, Trackware, Thiefware &amp; Big Brotherware removal utility with multi-language support.\n\nBPS Spyware and Adware Remover will scan your memory (for active memory ad components, which are not stored on your hard drive and last only as long as the system is powered up), registry and hard drives for known SpyWare parasites and scum-ware components and it will let you remove them safely, even ad component DLLs.\n\nThis tool is great if you value bandwidth, memory, &amp; privacy, it hunts down those SpyWare programs hogging resources and causing conflictions on your computer.\n\nAlso features SpyWatch -- A real-time SpyWare monitor watching your memory and registry\nfor SpyWare that tries to install or change your system.\nBPS Spyware/Adware Remover Is a multi Adware, SpyWare, Trackware, Thiefware &amp; Big Brotherware removal utility with multi-language support. BPS Spyware and Adware Remover will scan your memory (for active memory ad components, which are not stored on your hard drive and last only as long as the system is powered up), registry and hard drives for known SpyWare parasites and scum-ware components and it will let you remove them safely, even ad component DLLs. This tool is great if you value bandwidth, memory, &amp; privacy, it hunts down those SpyWare programs hogging resources and causing conflictions on your computer. Also features SpyWatch -- A real-time SpyWare monitor watching your memory and registry for SpyWare that tries to install or change your system","torrent":{"xt":"urn:btih:094262279c2447302dbd8aa83b3ca447a43743b1","amp;dn":"BPS+Spyware+Adware+Remover+9.4.0.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"094262279c2447302dbd8aa83b3ca447a43743b1","infoHashBuffer":{"type":"Buffer","data":[9,66,98,39,156,36,71,48,45,189,138,168,59,60,164,71,164,55,67,177]},"announce":[],"urlList":[]}}