{"title":"Fugazi - Studio Discography 1989-2001 [FLAC]","uid":10430721,"size":2457073139,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:09c17295ccc24af400a2a91495af440b27766b5e&amp;dn=Fugazi+-+Studio+Discography+1989-2001+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":3,"uploader":"rudown78","files":250,"time":1403798153,"description":"Fugazi - Studio Discography 1989-2001 [FLAC]\n\n\nIf history is kind to Fugazi, their records won't be overshadowed by their reputation and methods of operation. Instead of being known for their community activism, five-dollar shows, ten-dollar CDs, resistance to mainstream outlets, and the laughably fictitious folklore surrounding their lifestyle, they will instead be identified as setting a high bar for artistic excellence that is frequently aimed for but seldom achieved with great frequency. During their existence, the four-piece created some of the most intelligent, invigorating, and undeniably musical post-hardcore rock &amp; roll. Along with their stridently underground ethics -- which were more out of pragmatism and modesty than anything else -- they gained an extremely loyal and numerous global following. To many, Fugazi meant as much to them as Bob Dylan did to their parents. Somewhat better to look at, perhaps, and certainly more accessible, but just as commanding of attention and adoration. More than anything, Fugazi inspired; they showed that art can prevail over commerce.\n\nDrummer Brendan Canty, bassist Joe Lally, and guitarists/vocalists Ian MacKaye, and Guy Picciotto formed Fugazi in 1987. Initially a trio, Picciotto was added to the lineup after the band's first live shows. Prior to forming, the members already had deep pedigrees in the D.C. punk scene. Dischord labelhead MacKaye, who had previously been in the Teen Idles and Minor Threat, had just come from Embrace. For better or worse, Embrace, along with Picciotto and Canty's better Rites of Spring, kick-started the emocore sub-genre that would rise to prominence ten years later.\n\nAfter further honing their cathartic live act and expanding their material, their first EP (Fugazi, also known as Seven Songs) was released in late 1988. More of an extension of Rites of Spring's thick, dynamic, varied-tempo soul-bearing than anything else, the EP featured &quot;Suggestion,&quot; which would become the band's most well-known song. Though the course of rock history shows that loud music created by angry men tends to be of a predatory nature, &quot;Suggestion&quot; was an anomaly. MacKaye spoke from the female point of view, railing with frustration at how their sex is objectified. Not hampering the song's status as one of the most recognized chunks of late-'80s post-hardcore was its catchy, vaguely reggae-influenced rhythms and searing guitars.\n\nThe similarly veined Margin Walker EP followed the next year and was later coupled with Fugazi on CD as 13 Songs. Though suffering slightly from lyrical shortcomings (MacKaye and Picciotto grandstand too much), 1990's full-length debut Repeater is generally regarded as a classic. Toughening and refining the band's shockingly propulsive lockstep dynamics (see &quot;Repeater&quot; and &quot;Styrofoam&quot;), it still left several critics and a few fans wondering if the band was becoming a one-trick pony. A year later, the cynics were proven wrong with Steady Diet of Nothing, clearly the band's most challenging material to date. Branching out lyrically and limiting the finger pointing, Steady Diet also varied from its predecessors with more imaginative arrangements and less visceral qualities. Two years passed until In on the Killtaker, the band's most abrasively black-and-white record. With scabous guitars and extended stretches of discordance, some of the songs were among the band's most aggressive and angular.\n\nAt this point, the band's reputation for political correctness got a little out of hand. Word of mouth and touring was providing more new fans than ever, which was good and bad. Fugazi's energetic shows became the stuff of legend, known for the level of emotional release and Picciotto's wild stage antics as much as the band's anti-moshing stance. With the rise of the band's popularity, the venues got bigger and the ignorant crowd behavior became harder to control. There were loads of irony in clusters of bare-chested young men throwing themselves around and injuring others while the band played their often anti-violent material. MacKaye would often stop the band mid-song to calm the crowd down, occasionally offering troublemakers their money back to leave the venue.\n\nSince the band didn't do interviews with major publications, some journalists were left to improvise and opted to take creative license. The rumor mill amongst the fan base was equally imaginative. In fact, some concertgoers might have been surprised to see the band pull up to venues in a van, not arriving by a convoy of camels. Those who spoke with bandmembers were surprised to hear that they lived in houses -- not monasteries -- with running furnaces and that their diets weren't strictly rice-based. Worse yet, the band gained a reputation for not having a sense of humor. Their records never kicked out the yucks (they weren't Ween, after all), but this was probably the most unwarranted myth of all. Those who were resourceful enough to find interviews with the band in small fanzines might have been shocked to read that MacKaye was influence by Ted Nugent as much as Jimi Hendrix. Now that takes a sense of humor.\n\nAs the increasing responsibilities of adulthood and outside musical involvements increased, Fugazi's recordings and tours became more sporadic. Red Medicine was released another two years after In on the Killtaker, chipping away some of the latter's abrasion in favor of more jam-oriented experiments. It certainly wasn't a wholesale junking of the band's early sound, but more a matter of wanting to do things differently. They still sounded like Fugazi, but they weren't painting themselves into a corner, either. The even wilder End Hits came in 1998, amidst rumors of the band being put to rest. Eschewing the notion, more choppy touring in support of the record continued throughout the year. In 1999, the Instrument video and soundtrack hit the shelves. The result of several years spent working on a proper Fugazi documentary, friend Jem Cohen assembled a lengthy homage to the fab four, including live performances and interviews. The soundtrack featured demos, jams, and incidental cutting room scraps, still forming an enjoyable listen that focused on the band's instrumental talents. 2001 saw release of the band's sixth proper LP, The Argument, which was simultaneously issued with the three-song Furniture EP. Outside of Fugazi, both MacKaye and Picciotto helped other bands with production. MacKaye continued to operate Dischord, and Lally began his own label, Tolotta. Picciotto also ventured into filmmaking. \n\n\n1989 - 13 Songs [2003 Remaster]\n1990 - Repeater + 3 Songs [2005 Remaster]\n1991 - Steady Diet of Nothing [2004 Remaster]\n1993 - In on the Kill Taker [2004 Remaster]\n1995 - Red Medicine [2007 Remaster]\n1998 - End Hits\n1999 - Instrument Soundtrack\n2001 - Furniture [EP]\n2001 - The Argument\n\n\nAlbum artwork and rip logs are also included. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:09c17295ccc24af400a2a91495af440b27766b5e","amp;dn":"Fugazi+-+Studio+Discography+1989-2001+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09c17295ccc24af400a2a91495af440b27766b5e","infoHashBuffer":{"type":"Buffer","data":[9,193,114,149,204,194,74,244,0,162,169,20,149,175,68,11,39,118,107,94]},"announce":[],"urlList":[]}}