{"title":"Foundation Two","uid":10519514,"size":114300289,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09ce27c2974f4e93ee95e36099f532ae76c32c7a&amp;dn=Foundation+Two&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"wildturkey00","files":2,"time":1404955812,"description":"Format: PDF/webrip\nGenre: Workout/tutorial\nPublished: N/A\n\nBook Description: Foundation Two is the second part of the popular Foundation Series. During this course, you will continue building off the strength of the first course while preparing yourself for Foundation Three and our upcoming Rings 1 course.\n\nThe Most Cutting-Edge Courses on the Planet!\n\n\nBegin building your dream body through the Foundation Courses. It's working for thousands of students around the world, now it's your turn.\n\n\nThe GB Foundation Courses focus exclusively on the development of the seven GST fundamentals AND the necessary mobility requirements that go hand in hand with them; Front Lever, Straddle Planche, Side Lever, Manna, Single Leg Squat, Hollow Back Press and Rope Climb. Altogether there are four courses in the Foundation series; all of which are extremely rich in instructional information.\n\n\nFree Customized Workouts\n\n\nFoundation Two starts from the perspective of a Gymnastic Strength Training beginner. (Please note that previous weight training doesn't automatically transfer to GST.)\n\n\nMonths upon months of complete detailed programming is provided. If you can read, you can successfully follow and implement the GB Foundation courses.\n\n\nEmbedded Videos for Each and Every Exercise\n\n\nEach of the seven GST Fundamentals are developed through following an exact progression; rep by rep, set by set, exercise by exercise.\n\nIntegrated Mobility exercises are provided for each and every step along the way throughout all of the Foundation Courses. Never again will a lack of mobility be responsible for poor gains in GST.\n\nEmbedded videos are provided for each exercise and mobility element in Foundation Two. (82 in all!)","torrent":{"xt":"urn:btih:09ce27c2974f4e93ee95e36099f532ae76c32c7a","amp;dn":"Foundation+Two","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ce27c2974f4e93ee95e36099f532ae76c32c7a","infoHashBuffer":{"type":"Buffer","data":[9,206,39,194,151,79,78,147,238,149,227,96,153,245,50,174,118,195,44,122]},"announce":[],"urlList":[]}}