{"title":"Strike Back - Season 4","uid":9539338,"size":3307911114,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a498b0a00eea10be173aa472be2a4dc65d57f0f&amp;dn=Strike+Back+-+Season+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"POtHS11","files":-1,"time":1391008071,"description":"\n\nShadow Warfare (2013)\nMain article: Strike Back: Shadow Warfare\n\nA fourth series consists of ten episodes. Scott and Stonebridge are recalled from holiday in California to capture Leo Kamali (Zubin Varla), a high ranking member of a terrorist cell led by al-Zuhari, an elusive terrorist. After capturing him in Colombia it is revealed that Kamali is working deep cover with the CIA to stop al-Zuhari. As Kamali is pressured to work with Section 20, Dalton is suspended by Colonel Philip Locke (Robson Green), who takes charge. Dalton is later killed by the Real Irish Republican Army (IRA), who have joined forces with al-Zuhari's group. In the meantime, Scott and Stonebridge are wanted by the Russian mafia after killing the son of mob boss Arkady Ulyanov (Marcel Iures) in Colombia. Scott learns he fathered a child from one of his past relationships, while Stonebridge is infected with a neurotoxin during one of Section 20's missions in Beirut, which affects his combat abilities.\n\nAfter attacking the British Embassy in Budapest, the IRA and al-Zuhari's group steal a NATO harddrive and send it to a prison in Russia where a Swedish hacker and prisoner, Erik Andersson, is forced to decrypt it. While on mission in Russia, Section 20 also become aware of a secretive facility where al-Zuhari's scientists are weaponising smallpox to be used to attack NATO bases. After the mission, Stonebridge is given the antidote to the toxin, and Kamali is executed by al-Zuhari's men for being a double agent. Section 20 learn that al-Zuhari's group intends to attack a NATO base in Berlin, Germany, where it is revealed that Kamali faked his death, having been behind the operation the entire time (it is revealed that the Israelis killed al-Zuhari six months before). After the terrorists successfully infect a train and the NATO base's hospital, Section 20 thwart Kamali's plot to fly a plane over Berlin to infect the city. Both Kamali and Ulyanov are killed by 20 during an exchange arranged by Locke. In his last moments, Kamali reveals that his daughter Ester has a pendant that contains the cure to the smallpox, though only enough to save those infected at the hospital.","torrent":{"xt":"urn:btih:0a498b0a00eea10be173aa472be2a4dc65d57f0f","amp;dn":"Strike+Back+-+Season+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a498b0a00eea10be173aa472be2a4dc65d57f0f","infoHashBuffer":{"type":"Buffer","data":[10,73,139,10,0,238,161,11,225,115,170,71,43,226,164,220,101,213,127,15]},"announce":[],"urlList":[]}}