{"title":"Trick Photography &amp; Special Effects by Evan Sharboneau[54 vi","uid":7217982,"size":4191102398,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0a8381860dc8ddedb23c289f5351d16827e77177&amp;dn=Trick+Photography+%26amp%3B+Special+Effects+by+Evan+Sharboneau%5B54+vi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":4,"uploader":"rahuld3","files":54,"time":1335437854,"description":"Trick Photography &amp; Special Effects 2nd Edition - Your complete instructional guide on taking breathtaking special effects shots and cool images your friends won't believe...\n\n\nIt comes with 270 pages of instruction and contains over 300 creative photographs created by some of the most talented photographic artists worldwide.\n\n*How to create stunning special effects images that other people simply won't even understand - they'll think you've spent hours with Photoshop, but in reality they're just regular photos...\n\n*How to use laser pens, flashlights, and other household items to get spectacular visual effects using just your regular camera\n\n*How simple tweaks to your digital camera settings can let you take amazing shots that would usually need a hyper-expensive camera setup\n\n*How to use infra-red light to create some truly crazy images (and you won't believe how simple it is to get your camera to pick up infra red light - and it \nwill work with basically any camera)\n\n*How to capture beautiful High Dynamic Range nature or landscape shots...\n\n*How to create amazing 360 degree panoramic shots like these...\n\n*The secret behind stitching multiple light paintings together to create pseudo digital art.\n\n*How to put &quot;the invisible man&quot; into your pictures\n\n*How to tweak the color settings in your camera to make things &quot;pop&quot; in just the right way.\n\n*How to freeze motion and take crystal clear high-speed photographs...\n\n*How to take 3d images with your camera right now - no special tools or software needed, and you can grab great 3d images immediately...\n\n*How to capture amazing star shots like this\n\n*Why your computer scanner is the key to some of the coolest, wackiest pictures you've ever seen - and no, I'm not talking about scanning them\n\n*Advice on flashes and how how to use them to beautifully light up your subject\n\n*Advice and recommendations for filters and Photoshop plug-ins\n\n*How to market stock photographs and art photographs in order to sell them for profit\n\nThis amazing guide will show you exactly how to break through the ranks of &quot;ordinary&quot; photographers and become the person who takes shots that amaze everybody.\n\n\n\n\n\nfind 1st edition here: \n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6784028/Trick_Photography_and_Special_Effects_%282011%29-Mantesh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6784028/Trick_Photography_and_Special_Effects_%282011%29-Mantesh&lt;/a&gt;","torrent":{"xt":"urn:btih:0a8381860dc8ddedb23c289f5351d16827e77177","amp;dn":"Trick+Photography+%26amp%3B+Special+Effects+by+Evan+Sharboneau%5B54+vi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a8381860dc8ddedb23c289f5351d16827e77177","infoHashBuffer":{"type":"Buffer","data":[10,131,129,134,13,200,221,237,178,60,40,159,83,81,209,104,39,231,113,119]},"announce":[],"urlList":[]}}