{"title":"Zmodeler 2.2.2 build (964)","uid":5336866,"size":2717376,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0b2fb350daacd6225e5a8b44eb0d30dfaca8815a&amp;dn=Zmodeler+2.2.2+build+%28964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Torr3ntRid3r","files":-1,"time":1265347624,"description":"ZModeler (or Zanoza Modeler) is a 3D modeling application developed by Oleg Melashenko. It is aimed at modelers who model for computer games such as 18 Wheels of Steel, Grand Theft Auto, Need for Speed, Midtown Madness or similar video games.\n\nZModeler versions\n\nZModeler is capable of complex modeling, even though it does not support important modeling functions such as extruding, or beveling.\n\nVersion 1 does not support polygons other than triangles, or NURBs, or other forms of modeling other than polygonal and splines. It comes with filters to import and export meshes of other formats. However, there are more formats other than the included ones for download in various websites. ZModeler does not have a lighting system, although lighting can be made by using gradients for reflection maps.\n\nThe current ZModeler2 branch has a revised user interface, and adds new functions. Since version 2, ZModeler is no longer proposed as a feature-full freeware. Once activated, it becomes possible to use filters and plugins to import and export models of various other formats, including formats for computer games. ZModeler2 has a new rendering engine, and adds several more functions. It sports a vastly different user interface than ZModeler1. Additionally, ZModeler2 supports quadrilateral polygons, a major step-up from ZModeler1.\n\nRendering\n\nNo version of ZModeler comes with support for making final scene renderings. Currently, scene renderings can only be made by taking a screen capture. This method, however, does affect the output quality because no post-processing, such as anti-aliasing, is performed on the final image. Any necessary manual post-processing can, for example, be done by rescaling a high-output rendering of the scene with any graphics software.\n\nPrimitive objects\n\nBoth ZModeler versions come with a standard list of primitive objects that can be easily created. After determining the size and location of the object, a dialog box will pop up, allowing the user to specify the object name, and the &quot;horizontal steps&quot; and &quot;vertical steps&quot;. The list of primitive objects include spheres, cones, cubes, cylinders, tubes, and toruses.\n\nFormat\n\nThe ZModeler file format has an extension of &quot;*.Z3D&quot;. The ZModeler2 file format is different from the ZModeler 1x series' file format. Although ZModeler2 can open ZModeler 1 files, ZModeler 1 cannot open ZModeler2 files. Both formats have the same file extension. They are also both capable of storing unsupported data. Z3D files do not store the textures; instead, textures are separately stored as bitmaps, PNG, or other supported files types.\n\nMinimum system requirements\n\nZModeler is a relatively light program needing only around 20MB of empty hard disk space. The CPU and RAM requirements depend on the complexity of the scene, with the graphics card being the most important factor. Besides support for any graphics card with Direct3D hardware transform and lighting support, software rendering is also supported although render errors may occur. Certain graphics cards may cause artifacts to occur.\n\nFilters\n\n3ds\nBattlefield 2\nConvoy PMG\nEmergency 3\nFlatout\nGTA San Andreas\nGTA IV\nJuiced 2\nLive for Speed\nLock On\nMoto Gran Prix 2\nNFS Carbon\nNFS Shift\nPSM\nRace Driver P3D\nrFactor GMT\nRichard Burns Rally\nTest Drive Unlimited\nXpand Rally","torrent":{"xt":"urn:btih:0b2fb350daacd6225e5a8b44eb0d30dfaca8815a","amp;dn":"Zmodeler+2.2.2+build+%28964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b2fb350daacd6225e5a8b44eb0d30dfaca8815a","infoHashBuffer":{"type":"Buffer","data":[11,47,179,80,218,172,214,34,94,90,139,68,235,13,48,223,172,168,129,90]},"announce":[],"urlList":[]}}