{"title":"Beginning 3D Game Development with Unity 4, 2nd Ed.","uid":10130026,"size":33186562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b32e50460beaa2bc3a01bc9a480a2fbf1b49de9&amp;dn=Beginning+3D+Game+Development+with+Unity+4%2C+2nd+Ed.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":null,"files":-1,"time":1399823982,"description":"I recommend buying this book for 3 reasons. First because how it is written. Second because the content and scope of the book. Third because of Unity 3D.\n\n----------------------------------------\n\n1) The book is really well written, it invites you to explore Unity and get familiar with the Interface and concepts, which is the only way you will really learn. The book does not read as programming book, it reads more like a book for learning an application, like reading a content creation software book. \n\nAs other reviewer said, the author assumes nothing about previous knowledge or experience of the reader, so there is a lot of information and explanations to help you get the tasks done. At times this detail may seem too much for a seasoned developer, but for a beginner its perfect.\n\n----------------------------------------\n\n2) The book is targeted to beginners audience, and does a great job on that regard. You will learn by creating a Point and Click 3D Adventure, which may be not be your favorite genre, but it does not matter, this will serve very well the purpose of teaching.\n\n----------------------------------------\n\n3) Unity 3D is simply great, I kind of regret not learning it sooner. I have followed Unity from its creation, but back then I choose to learn XNA and develop for the PC and XBOX 360 Indie Games. But then the iOS games and Facebook games took over the game world. Suddenly it made no sense to learn platform specific languages or technologies. \n\nI tried to learn Unreal with the UDK, but found it kind of complex. My advice to anyone learning how to create video games is to learn Unity, because at the present moment the ability to deploy to iOS, Android, Mac OS, Linux, Wii U, and all the Microsoft's OS including Windows Phone; is simply mandatory if you really want any chance of success. \n\nReview by Cecilia Marcano from Amazon.","torrent":{"xt":"urn:btih:0b32e50460beaa2bc3a01bc9a480a2fbf1b49de9","amp;dn":"Beginning+3D+Game+Development+with+Unity+4%2C+2nd+Ed.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b32e50460beaa2bc3a01bc9a480a2fbf1b49de9","infoHashBuffer":{"type":"Buffer","data":[11,50,229,4,96,190,170,43,195,160,27,201,164,128,162,251,241,180,157,233]},"announce":[],"urlList":[]}}