{"title":"Harry Smith's (1952) Anthology of American Folk Music","uid":3508609,"size":309099772,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0b6789bc76d65a3317040a5b706880a7bed3e86d&amp;dn=Harry+Smith%5C%27s+%281952%29+Anthology+of+American+Folk+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"shakewell","files":84,"time":1154275509,"description":"Harry Smith&amp;#039;s (1952) Anthology of American Folk Music\n\nBig influence on modern rock music.\n\nHard to find online, expensive to buy.\n\nBasic info &amp; track list: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Anthology_of_American_Folk_Music&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Anthology_of_American_Folk_Music&lt;/a&gt;\n\nMore info: &lt;a href=&quot;\nhttp://www.expectingrain.com/dok/cd/97/anthology.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.expectingrain.com/dok/cd/97/anthology.html&lt;/a&gt;\n\nOccasionally a single artifact, document or exhibition manages both to\nrecast the way in which artists see their tradition and to reanimate their\nsense of what is possible within that tradition. Such cultural moments act\nas prisms, gathering together work from different ends of a genre&amp;#039;s\nspectrum and allowing them to blend in a new way.\n\nIn 1997, Smithsonian Folkways records re-released another such document,\nthe &quot;Anthology of American Folk Music,&quot; originally issued by Folkways\nRecords in 1952. The brainchild of the avant-garde filmmaker, folklorist\nand anthropologist Harry Smith, the anthology comprised three boxed two-LP\nsets that contained 84 performances recorded between 1926 and 1933.\nIncluded were early black blues and white country music, Cajun recordings,\nhymns and sacred music, and more, thrown together under a loose framework\nthat almost single-handedly redefined folk music. \n\nIn doing so, the anthology became the single most important source of\nmaterial and inspiration for many young singers in the 1950&amp;#039;s and 60&amp;#039;s and\nthe touchstone of the early-60&amp;#039;s &quot;folk revival.&quot; Such performers as Bob\nDylan, Joan Baez, Phil Ochs and the New Lost City Ramblers, as well as\nlater offshoots like the Byrds, Bruce Springsteen and Jerry Garcia, owe not\njust repertory and techniques but, in a real sense, a large portion of\ntheir world view to the anthology&amp;#039;s conflation of such seemingly different\ntraditions. \n\nThe package appeared on the small but important Folkways label, run by\nMoses Asch, who had recorded performers like Woody Guthrie, Leadbelly and\nPete Seeger, and thought of his label as a great aural museum. Before\nissuing Harry Smith&amp;#039;s Anthology, Folkways had released a series of\ncompilations of various ethnic musics as well as early jazz music. But\nSmith&amp;#039;s project was different. \n\nThe anthology itself seemed to have a personality, much like that of its\ncompiler: erudite, hermetic, witty in a deadpan way. The cover of each\nboxed volume was plain black cardboard, with the selections and performers\nlisted plainly on a label affixed to the front. Volume 1 contained ballads\n(songs with a narrative content), Volume 2 was titled Social Music (dance\nmusic and religious music) and Volume 3 was a catchall called Songs,\noffering vocal selections with no real narrative aspect. \n\n(The six-disk reissue wisely follows the exact format and sequence of the\noriginal.) \n\nEach box contained a copy of a booklet written, designed and laid out by\nSmith himself, an idiosyncratic compendium of discographical information,\nbibliographical references and summaries of the songs, all set in various\ntype fonts and illustrated with photographs, advertisements from old record\ncatalogues and other ephemera. \n\nThe music itself on the anthology opens a door to a world that will be just\nas strange to most listeners of today as it was in 1952, and perhaps more\nso. The lyrics offer a panorama of murders, religious visions, hangings,\nagrarian complaints, heroic exploits, swindles, assassinations and endless\ntraveling. The extraordinary range of vocal sounds in which these marvels\nare expressed is no less wondrous. The nasal timbre of the coal miner and\nbanjoist Dock Boggs on his two 1927 recordings included here, or the\nrasping throat tones of the religious street singer Blind Willie Johnson,\nso different from each other, both still carry the power to shock 70 years\nafter they were recorded. \n\nThe vitality and variety of the music are staggering, from the country\nsinger Uncle Dave Macon&amp;#039;s hollering, headlong vocal and banjo on &quot;Down the\nOld Plank Road&quot; to the inwardness of the New Orleans songster Rabbit Brown\non his &quot;James Alley Blues&quot; to the pinched, wry, tall-tale quality of Kelly\nHarrell&amp;#039;s small 1927 masterpiece &quot;My Name Is John Johanna,&quot; a song about a\nlaborer&amp;#039;s disastrous trip to Arkansas in search of work. Several pieces,\nlike Buell Kazee&amp;#039;s &quot;East Virginia,&quot; have the odd-sounding modal harmonic\nquality of English ballads; elsewhere one finds Anglo-Irish fiddle tunes,\nCajun dance music from Louisiana and collective ensemble gospel singing by\nblack and white groups that rivet you to your spot by their intensity and\ncommitment. Many of the performers remain obscure even to this day. ?? ?? \n\nhe performances were originally recorded commercially by\ncompanies that were trying to compete with radio in the 1920&amp;#039;s by finding\nnew markets among the people of the rural South. The 78 rpm records were\noften designated as &quot;hillbilly&quot; or &quot;old time&quot; (euphemisms for rural white)\nand &quot;race&quot; (euphemism for black). What Harry Smith did that was new was to\nthrow these recordings together, with no regard for the commercial\ncategories for which they had initially been recorded. \n\nThe booklet resolutely avoided mentioning the race or ethnicity of\nperformers, and many of the songs that were included cropped up in both\nblack and white traditions. The rationale for listening to a performance on\nthe anthology&amp;#039;s terms was not that it represented the voice of a specific\nethnic group; rather, strangeness, passion and mystery, the anthology\nseemed to proclaim, are universal human traits. \n\nIt was a revolutionary message and is still so today, when so many claims\nof identity are staked along ethnic lines. \n\nSmith&amp;#039;s cultural Trojan horse rolled into public view at the beginning of\nthe Eisenhower 1950&amp;#039;s, in the wake of World War II, as America was asking\nitself in many ways, not all of them healthy, what it meant to be American.\nPowerful currents of standardization were all around; anxiety about fitting\nin, assimilating, returning to normalcy after the war and a residual sense\nof threat from outside quickened the impulse to locate a common denominator\nin behaviors and values. It was the period in which Levittown was born. \n\nInto these currents strode the anthology, implicitly asserting the\nmultifarious, the odd, the local as being somehow definitively American.\nThat apparent paradox appealed to those who wanted to see behind the\nconformist scrim of the Eisenhower era. To them, the anthology was a sort\nof palimpsest wherein they read a secret cultural history of the nation. \n\nAmong these were the young men and women who made up the folk revival. Many\nof them, like the members of the New Lost City Ramblers, a traditionalist\ngroup, strove to recreate the original performances in as faithful a manner\nas possible; others used the anthology as a trove of material to mine, and\ntransmute. Bob Dylan is certainly the best example of this; his earliest\nperformances were full of material taken from the anthology. Echoes of\nlyrics from anthology songs continued to appear in Mr. Dylan&amp;#039;s later works.\nOn his most recent disk, &quot;World Gone Wrong&quot; (1993), he performs several\ntunes that appear on the anthology. \n\nIf the anthology energized a new generation of performers it did the same\nfor a new generation of folklorists, mostly white and mostly male -- among\nthem Mike Seeger, Ralph Rinzler and Paul Clayton -- who traveled south in\nhopes of finding the original performers. An amazing number of them turned\nout to still be alive; the Newport Folk Festivals of the early 1960&amp;#039;s\noffered a procession of them -- Clarence Ashley, Dock Boggs, Mississippi\nJohn Hurt, Furry Lewis, Buell Kazee and others -- in one of the great\nreclamation projects in American cultural history. \n\nThe re-issue of the anthology is the most significant event yet in\nSmithsonian Folkways&amp;#039; superb reactivation of the original Folkways\ncatalogue, which the Smithsonian Institution acquired in 1987, after Mr.\nAsch&amp;#039;s death. Smithsonian Folkways has taken care to allude repeatedly to\nthe original anthology in its repackaging. \n\nIncluded is a reproduction of the original booklet as well as invaluable\nsupplemental notes, an expanded bibliography and references to other\nrecordings of the same material by other artists. \n\nThere are essays on the anthology&amp;#039;s effect at the time, including a\nwonderfully pointed one by the folklorist Jon Pankake, as well as\nreminiscences of Harry Smith, who died in 1991, by those who knew him. \n\nThe re-issue also features a long essay by the writer Greil Marcus\nexcerpted from his recent book &quot;Invisible Republic,&quot; which offers insights\ninto the anthology&amp;#039;s place in American culture. Not included in the\npackage, but worth reading, is a chapter in Robert Cantwell&amp;#039;s recent book\non the folk revival entitled &quot;When We Were Good,&quot; which puts Smith&amp;#039;s\nachievement in lucid historical and cultural context. The current set&amp;#039;s\nsixth disk is an enhanced CD offering photographs, biographical material\nabout Smith, video footage and linkage to an Anthology Web site. \n\nSomehow, in the process of gathering all its voices together, the anthology\nbecame not just a loose confederation but an integral unit, a whole made up\nof the most disparate parts, like some ideal America of its own. It was a\ngauntlet thrown down, in a sense, a challenge to ponder: what kind of unity\ncould possibly underlie this diversity? It is a question we still ask, and\nthe re-issue of this milestone set helps us ask it in appreciative wonder.\n\n","torrent":{"xt":"urn:btih:0b6789bc76d65a3317040a5b706880a7bed3e86d","amp;dn":"Harry+Smith%5C%27s+%281952%29+Anthology+of+American+Folk+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b6789bc76d65a3317040a5b706880a7bed3e86d","infoHashBuffer":{"type":"Buffer","data":[11,103,137,188,118,214,90,51,23,4,10,91,112,104,128,167,190,211,232,109]},"announce":[],"urlList":[]}}