{"title":"Jewish People - An Illustrated History (2003).pdf Gooner","uid":12061098,"size":46168401,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b8541ff201809f6186f3a279460d462449640ea&amp;dn=Jewish+People+-+An+Illustrated+History+%282003%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1435266110,"description":"Publisher: Continuum (July 29, 2003)\nLanguage: English\nISBN-10: 0826414702\nISBN-13: 978-0826414700\n\nContributors to this book include Anson F. Rainey, Shmuel Safrai, Haim Beinart, and Evyatar Friesel.This is the first atlas of its kind to document in such great detail the turbulent history of the Jewish people. A work of prodigious and meticulous scholarship by some of Israel's most brilliant scholars, this atlas portrays every aspect of Jewish history that lends itself to cartographic interpretation, from biblical times to the present day. This is the fascinating story of how an ancient people, separated from their roots and dispersed throughout the world, survived in exile for two thousand years and eventually returned and recreated itself within the framework of a modern state.Now, in one profusely illustrated volume, the reader is presented with in-depth coverage of major themes in biblical, mishnaic, talmudic, medieval, and modern Jewish history by the foremost authorities in their field.Anson F. Rainey is Professor of Ancient Near Eastern Cultures and Semitic Linguistics at Tel Aviv University. Shmuel Safrai is Professor of the History of the Mishnaic and Talmudic periods at the Hebrew University of Jerusalem. Haim Beinart is Professor of Jewish History in the Middle Ages at the Hebrew University of Jerusalem. Evyatar Friesel is Professor of Modern Jewish History at the Hebrew University of Jerusalem.\n\nAbout the Author\n\nShmuel Ahituv is Emeritus Professor of Bible and Ancient Near Eastern Studies at Ben-Gurion University of the Negev in Be'er Sheva. He has written and edited several books. He was co-editor of the Hebrew Biblical Encyclopedia and director of the Ben-Gurion University Press. He is currently editor of the Be'er Sheva Series of the Department of Bible and Ancient Near East at Ben-Gurion University, editor of Mikra Leyisrael (Bible for Israel) commentary, and co-editor of the Israel Exploration Journal","torrent":{"xt":"urn:btih:0b8541ff201809f6186f3a279460d462449640ea","amp;dn":"Jewish+People+-+An+Illustrated+History+%282003%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b8541ff201809f6186f3a279460d462449640ea","infoHashBuffer":{"type":"Buffer","data":[11,133,65,255,32,24,9,246,24,111,58,39,148,96,212,98,68,150,64,234]},"announce":[],"urlList":[]}}