{"title":"Jenny Lewis - The Voyager (2014) [FLAC]","uid":10630395,"size":292606420,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0b923c221042deb1da14e8de983198010e225d57&amp;dn=Jenny+Lewis+-+The+Voyager+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"politux","files":-1,"time":1406307598,"description":"\n  Jenny Lewis - The Voyager (2014) [FLAC]\n\n  Genre: Rock\n  Styles: Singer/Songwriter, Alternative Country \n  Source: Scene CD (outerspace)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16 \n  Sample Rate: 44.1 kHz\n\n  01 Head Underwater \n  02 She's Not Me \n  03 Just One of the Guys \n  04 Slippery Slopes \n  05 Late Bloomer \n  06 You Can't Outrun 'Em\n  07 The New You \n  08 Aloha &amp; the Three Johns \n  09 Love U Forever \n  10 The Voyager \n\n  Lurking beneath the seductive, supple gloss of The Voyager lies a serious undercurrent of sorrow -- an undercurrent Jenny Lewis doesn't disguise but doesn't bring to the surface, either. Someone, somewhere broke her heart, and perhaps the culprit is Lewis herself. Regret and self-recrimination abound on The Voyager: it's a tattered storybook full of relationships gone to rot, missed marriages, infidelities forgiven but not forgotten, wistful teenage memories fading in the face of adult disappointment. Whether the songs are autobiographical or not -- and they're filled with seemingly personal signifiers, ranging from red hair and scars left from the San Fernando Valley to a philandering, layabout beau named John -- doesn't matter much, as The Voyager aims to strike a universal chord for ladies in their thirties watching the years slide by as they wait for boyfriends to commit or life to start happening. It's heavy midlife crisis material but The Voyager plays lightly, offering a warm balm of Southern California sounds. Much more than Under the Blacklight, Rilo Kiley's 2007 stab at Fleetwood Mac-styled pop, this feels like vintage L.A. studio rock. Working primarily with producer Ryan Adams -- Beck comes aboard to give &quot;Just One of the Guys&quot; a narcotic sway, while Jenny collaborates with longtime partner Johnathan Rice on &quot;Head Underwater&quot; and &quot;You Can't Outrun 'Em&quot; -- Lewis indulges in the sunnier aspects of vintage yacht rock, occasionally dipping into the Laurel Canyon folk-rock she's specialized in on her own. Guitars roam wide-open spaces, couched in luxurious reverb and draped in strings; the rhythms often follow cool, steady eighth-note pulses; the surfaces always shimmer. It's such a sultry, soothing sound that it's easy to ignore the pain that lies beneath but that's a feature, not a bug: on The Voyager, Lewis' characters live for today without ever thinking that the world might pass them by, and having her music flow so smooth and easy, she illustrates how easy it is to get sucked into that alluring stasis.","torrent":{"xt":"urn:btih:0b923c221042deb1da14e8de983198010e225d57","amp;dn":"Jenny+Lewis+-+The+Voyager+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b923c221042deb1da14e8de983198010e225d57","infoHashBuffer":{"type":"Buffer","data":[11,146,60,34,16,66,222,177,218,20,232,222,152,49,152,1,14,34,93,87]},"announce":[],"urlList":[]}}