{"title":"Haynes Anthony - Writing Successful Academic Books [2010] [A]","uid":9927776,"size":1527964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b99022b17310a88c697a88d7f7309d34ffe38e9&amp;dn=Haynes+Anthony+-+Writing+Successful+Academic+Books+%5B2010%5D+%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Anette14","files":-1,"time":1397081651,"description":"Description\nProduct Details\nBook Title: Writing Successful Academic Books\t\nBook Author: Anthony Haynes (Author)\nPaperback: 192 pages\nPublisher: Cambridge University Press; 1 edition (April 30, 2010)\nLanguage: English\nISBN-10: 1107003873\nISBN-13: 978-0521730747\nASIN: 0521730740\n\nBook Description\nPublication Date: April 30, 2010 | ISBN-10: 1107003873 | ISBN-13: 978-0521730747 | Edition: 1\n'Publish or perish' is a well-established adage in academia. Never has the pressure on academics to publish been greater. Yet the prospect of writing a book can seem daunting, while the business of getting it published may be mystifying. Written by an expert in academic publishing, Writing Successful Academic Books provides a practical guide to both writing and getting published. It covers all stages of academic authorship from developing the initial idea for a book through to post-publication issues, showing how to avoid the common pitfalls and achieve academic and professional success through publication. Full of real life examples, including a sample book proposal, the book covers everything you need to know to build up an authorial career. This is an invaluable guide for academic authors - prospective or established - in all disciplines.\n\nReviews\n'Every academic serious about getting published will benefit from reading this succinct yet highly accomplished guide. Brimming with invaluable insights from publishing, as well as containing plenty of practical writing tips and strategies, this book will be indispensable whether you're a first-time author or seasoned pro.' Alexandra Webster, Associate Director, Palgrave\n\n'A very useful and thorough book that will certainly help me and fellow PhD students: the book demystifies publishing of academic books, especially those based on dissertations.' Lisa Mueller, University of Zurich\n\n'Readable, clear and useful, Writing Successful Academic Books is an interesting, accessible and enlightening book for anyone wanting to publish, particularly for academics. In a wonderful position to write such a book, Haynes does it comprehensively, including information and advice that is not common knowledge and often not divulged. A must read for anyone considering publishing an academic book!' Rachel L. Hardy-Holbrook, University of Warwick\n\n'Anthony Haynes, editor and (successful) author, has a refreshing approach to academic writing that includes new ideas and new points of view. The dissertation-to-monograph transition has already been covered in so many similar guides, but Haynes presents ideas on key processes - reducing or omitting, adding, changing and deliberating - that make excellent reading.' Learned Publishing\n\nBook Description II\nThis practical guide covers all stages of academic authorship from developing the initial idea for a book through to post-publication, showing how to avoid common pitfalls. Full of real examples, including a sample book proposal, the book covers everything you need to know to build up a successful publication record.\n","torrent":{"xt":"urn:btih:0b99022b17310a88c697a88d7f7309d34ffe38e9","amp;dn":"Haynes+Anthony+-+Writing+Successful+Academic+Books+%5B2010%5D+%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b99022b17310a88c697a88d7f7309d34ffe38e9","infoHashBuffer":{"type":"Buffer","data":[11,153,2,43,23,49,10,136,198,151,168,141,127,115,9,211,79,254,56,233]},"announce":[],"urlList":[]}}