{"title":"Before the Flood: The Biblical Flood as a Real Event and ...","uid":15791781,"size":3622690,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b9b2d3f98789276e207efab5aa74d3c6bb3cb10&amp;dn=Before+the+Flood%3A+The+Biblical+Flood+as+a+Real+Event+and+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"marty14","files":1,"time":1473387627,"description":"Before the Flood: The Biblical Flood as a Real Event and How It Changed the Course of Civilization - Ian Wilson [epub]\r\n\r\nThe great Biblical flood so described in Genesis has long been a subject of fascination and speculation. In the 19th century the English archbishop James Ussher established it as having happened in the year 2348 B.C., calculating what was then taken as the age of the earth and working backward through the entire series of Biblical &quot;begats.&quot; Proof of the flood, which is an element of so many creation myths, began in earnest when archaeology started connecting physical evidence with Biblical story. The dream of proving the Bible as literal truth has proven irresistible, producing both spurious claims and serious scholarship.\r\n\r\nAs best-selling historian Ian Wilson reveals in this fascinating new book, evidence of a catastrophic event has been building steadily, culminating in the work of William Ryan and Walter Pitman. Several years ago Ryan and Pitman had posited that around 5600 BC there had an inundation in the Black Sea of such proportions that it turned the freshwater lake into a saltwater lake by connecting it to the Mediterranean. Were that true, they estimated that there would be signs of civilization 300 feet below the surface of the Black Sea. In September 2000, using his famous underwater equipment, Robert Ballard (of SS Titanic fame) explored parts of the Black Sea near the Turkish shore and found the remains of wood houses. There had been a flood, and whether God's wrath or not it had destroyed everything around it for hundreds of miles, killing tens of thousands of people.\r\n\r\nExploring all the archeological evidence, Wilson explains how the Black Sea flood and the Biblical flood have to be connected. In particular, Wilson argues, learnedly and persuasively, that the center of the civilized world was further to the West than previously thought-not in Egypt or Mesopotamia but in what is today Northern Turkey","torrent":{"xt":"urn:btih:0b9b2d3f98789276e207efab5aa74d3c6bb3cb10","amp;dn":"Before+the+Flood%3A+The+Biblical+Flood+as+a+Real+Event+and+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b9b2d3f98789276e207efab5aa74d3c6bb3cb10","infoHashBuffer":{"type":"Buffer","data":[11,155,45,63,152,120,146,118,226,7,239,171,90,167,77,60,107,179,203,16]},"announce":[],"urlList":[]}}