{"title":"Peter Bevelin - Seeking Wisdom. From Darwin to Munger [2007][A]","uid":10442765,"size":13367838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0bb226a27762bf786a1440192315fc527d3060bd&amp;dn=Peter+Bevelin+-+Seeking+Wisdom.+From+Darwin+to+Munger+%5B2007%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"Anette14","files":-1,"time":1403916368,"description":"Description\nProduct Details\nBook Title: Seeking Wisdom: From Darwin to Munger, 3rd Edition\t\nBook Author: Peter Bevelin (Author)\nHardcover: 328 pages\nPublisher: PCA Publications L.L.C.; 3rd edition (2007)\nLanguage: English\nISBN-10: 1578644283\nISBN-13: 978-1578644285\n\n===================================================================================\nBook Description\nPublication Date: 2007 | ISBN-10: 1578644283 | ISBN-13: 978-1578644285 | Edition: 3rd\nPeter Bevelin begins his fascinating book with Confucius' great wisdom: &quot;A man who has committed a mistake and doesn't correct it, is committing another mistake.&quot; Seeking Wisdom is the result of Bevelin's learning about attaining wisdom. His quest for wisdom originated partly from making mistakes himself and observing those of others but also from the philosophy of super-investor and Berkshire Hathaway Vice Chairman Charles Munger. A man whose simplicity and clarity of thought was unequal to anything Bevelin had seen. In addition to naturalist Charles Darwin and Munger, Bevelin cites an encyclopedic range of thinkers: from first-century BCE Roman poet Publius Terentius to Mark Twain-from Albert Einstein to Richard Feynman-from 16th Century French essayist Michel de Montaigne to Berkshire Hathaway Chairman Warren Buffett. In the book, he describes ideas and research findings from many different fields. This book is for those who love the constant search for knowledge. It is in the spirit of Charles Munger, who says, &quot;All I want to know is where I'm going to die so I'll never go there.&quot; There are roads that lead to unhappiness. An understanding of how and why we can &quot;die&quot; should help us avoid them. We can't eliminate mistakes, but we can prevent those that can really hurt us. Using exemplars of clear thinking and attained wisdom, Bevelin focuses on how our thoughts are influenced, why we make misjudgments and tools to improve our thinking. Bevelin tackles such eternal questions as: Why do we behave like we do? What do we want out of life? What interferes with our goals? Read and study this wonderful multidisciplinary exploration of wisdom. It may change the way you think and act in business and in life.\n\n===================================================================================\nMost Helpful Customer Review\nA wonderful, very very rich book! July 30, 2007\nBy Nassim Nicholas Taleb\nFormat:Hardcover\nA wonderful book on wisdom and decision-making written by a wise decision-maker. This is the kind of book you read first, then leave by your bedside and re-read a bit every day, so you can slowly soak up the wisdom. It is sort of Montaigne but applied to business, with a great investigation of the psychological dimension of decision-making.\n===================================================================================","torrent":{"xt":"urn:btih:0bb226a27762bf786a1440192315fc527d3060bd","amp;dn":"Peter+Bevelin+-+Seeking+Wisdom.+From+Darwin+to+Munger+%5B2007%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bb226a27762bf786a1440192315fc527d3060bd","infoHashBuffer":{"type":"Buffer","data":[11,178,38,162,119,98,191,120,106,20,64,25,35,21,252,82,125,48,96,189]},"announce":[],"urlList":[]}}