{"title":"Complete Marvel CIVIL WAR Comics DVD","uid":4313211,"size":1626698478,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0c59aa1bff136c440525c1778c47c4fd8eb3ad97&amp;dn=Complete+Marvel+CIVIL+WAR+Comics+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"citaltras","files":207,"time":1216926643,"description":"\nTHE  COMPLETE   MARVEL\nCIVIL WAR\nCOMICS DVD\n\n\n\n\n\n\nHere is the Complete Civil War DVD nicely converted to the\npopular .cbz format.  Now you can read these high quality commercial\nscans with your favorite comic book viewer software.\n\nThese are all complete scans, cover-to-cover, including letters pages,\nbullpen bulletins, and all advertisements.  All files have been expertly\nconverted from .pdf  to .cbz format with single-page images!  No more\ndouble-page images to navigate!  And all are crisp, sharp scans!   If\nyou have used the commercial DVD, you are sure to appreciate this\nimproved, user-friendly collection.\n\n\n\n\n\n\n---------------------------------------------------------------------------------------\nUntil this torrent is fully seeded, the original seeder may be\noff-line for a few hours each day.  This is a large torrent, so\nplease be patient.  Seeding will resume.  Please help by\nseeding as long as possible, after you reach 100%.\n---------------------------------------------------------------------------------------\n\n\n\n\n\n\n\n\n\n\nHow are these .cbz files better than .pdf?\n\nUnlike the commercial Marvel comic book collections,  these files\nemploy no use-restriction schemes.  There are  no passwords,\nno encryption, no water-marked images.  You are free to view,\ncopy, extract, print, and manipulate the images.   Also,  all  images\nhave been split into single pages for easier reading.  A convenient\ngraphical &quot;covers index&quot; is included to help you find the issues you\nwant and an informative character bios file is also included.  All\nare .cbz files.\n\nThese files will work well on any major computing platform,  e.g.\nWindows, Linux/Unix, Mac OS-X, and many others.  You can copy\nthe comics files to your hard drive, laptop, or optical disk.  Because\nthese comics are in the popular .cbz format, they can now be read\nwith your favorite comics viewing software.  Unlike the .pdf file\nformat, the .cbz file format is supported by a wide choice of snappy\nviewers offering a multitude of reading enhancement features.  See\nthe readme file, included in the collection, to learn where to down-\nload free .cbz/.cbr comic viewer software.\n\n\n\n\n\n\n\n\n\n\n\n--------------------------------------------------------------------------------------\nIf you like this converted comics DVD, be sure to download other titles in our series:\n\nThe Complete Marvel  Captain America Comics DVD (in 4 parts w/ approx. 500 issues)\nThe Complete Marvel  Incredible Hulk Comics DVD (in 4 parts)\nThe Complete Marvel  Avengers Comics DVD (in 5 parts)\nThe Complete Marvel  X-Men Comics DVD (in 4 parts)\nThe Complete Marvel  Ultimate X-Men CD\nThe Complete Marvel  Fantastic Four Comics DVD (in 5 parts)\nThe Complete Marvel  Iron Man Comics DVD (in 4 parts)\nThe Complete Marvel  Amazing Spider-Man Comics DVD (in 5 parts)\nThe Complete Marvel  Ghost Rider Comics DVD ( in 2 parts )\nThe Complete Marvel  Silver Surfer Comics on DVD\nThe Complete Marvel  House of M Comics CD\n\n\n---------------------------------------------------------------------------------------\n\n\n","torrent":{"xt":"urn:btih:0c59aa1bff136c440525c1778c47c4fd8eb3ad97","amp;dn":"Complete+Marvel+CIVIL+WAR+Comics+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c59aa1bff136c440525c1778c47c4fd8eb3ad97","infoHashBuffer":{"type":"Buffer","data":[12,89,170,27,255,19,108,68,5,37,193,119,140,71,196,253,142,179,173,151]},"announce":[],"urlList":[]}}