{"title":"Bernard Williams - Philosophy as a Humanistic Discipline [2006][","uid":10455472,"size":838246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e02d2a859d99c6acffea6253c4574891eb24aa4&amp;dn=Bernard+Williams+-+Philosophy+as+a+Humanistic+Discipline+%5B2006%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Anette14","files":-1,"time":1404071669,"description":"Description\nProduct Details\nBook Title: Philosophy as a Humanistic Discipline\t\nBook Author: Bernard Williams (Author), A. W. Moore (Editor)\nHardcover: 256 pages\nPublisher: Princeton University Press; First Edition edition (January 22, 2006)\nLanguage: English\nISBN-10: 0691124264\nISBN-13: 978-0691124261\n\n===================================================================================\nBook Description\nPublication Date: January 22, 2006\nWhat can--and what can't--philosophy do? What are its ethical risks--and its possible rewards? How does it differ from science? In Philosophy as a Humanistic Discipline, Bernard Williams addresses these questions and presents a striking vision of philosophy as fundamentally different from science in its aims and methods even though there is still in philosophy &quot;something that counts as getting it right.&quot; Written with his distinctive combination of rigor, imagination, depth, and humanism, the book amply demonstrates why Williams was one of the greatest philosophers of the twentieth century.\nSpanning his career from his first publication to one of his last lectures, the book's previously unpublished or uncollected essays address metaphysics, epistemology, and ethics, as well as the scope and limits of philosophy itself. The essays are unified by Williams's constant concern that philosophy maintain contact with the human problems that animate it in the first place. As the book's editor, A. W. Moore, writes in his introduction, the title essay is &quot;a kind of manifesto for Williams's conception of his own life's work.&quot; It is where he most directly asks &quot;what philosophy can and cannot contribute to the project of making sense of things&quot;--answering that what philosophy can best help make sense of is &quot;being human.&quot;\nPhilosophy as a Humanistic Discipline is one of three posthumous books by Williams to be published by Princeton University Press. In the Beginning Was the Deed: Realism and Moralism in Political Argument was published in the fall of 2005. The Sense of the Past: Essays in the History of Philosophy is being published shortly after the present volume.\n\n===================================================================================\nEditorial Review\nFrom Publishers Weekly\nPart of a trilogy of posthumous anthologies of Williams's writing, this miscellany assembles 17 otherwise unrelated, uncollected and, in two cases, unpublished essays by one of Britain's most prominent modern philosophers. Drawing on the entirety of Williams's 50-year career, the volume charts a rough progression from early exercises of Williams's nimble intelligence on specific metaphysics, epistemology and ethics questions (how religious language embodies an argument about the comprehensibility of articles of faith; the structure and merit of R.M. Hare's Moral Thinking) to a veteran's expansive and provocative musings on the proper scope and future of philosophy as a discipline. Many essays address issues Williams did not treat at book length but fit into the prism of his lifelong concerns-rejecting scientific objectivity as a legitimate goal for philosophy, focusing on the historical development of modern ethical values and arguing individual action can only be motivated by internal desires, preferences and evaluations. If Williams occasionally belabors the obvious or follows a tangent of questionable interest, his insight and erudition ultimately enliven nearly every question he takes up, even when he is writing outside his areas of greatest expertise. Students of philosophy will find this cross-section of the breadth of his achievement inspiring, although the lack of an overarching argument or single unifying theme means general readers or those seeking an introduction to Williams's philosophy will be better served by Ethics and the Limits of Philosophy or Shame and Necessity.\n\n===================================================================================\nReviews\n[Williams emphasized] the role of the local and the historical, the need for philosophy to 'sound right.' One ends Philosophy as a Humanistic Discipline wishing that he had another decade both to do the sort of philosophy that 'sounds right' and to tell us more about what made it sound so. (Alan Ryan New York Review of Books )\n\n[Williams's books] reveal just how challenging, and how enjoyable, really imaginative philosophy can be. (Simon Blackburn New Republic )\n\nEditor A.W. Moore . . . has certainly done the scholarly world a service. . . . Williams is a virtuoso practitioner and questioner of philosophy. His task is both positive and negative: positive in that he seeks to carve out a place for distinctively philosophical contributions to human knowledge and well-being (where these contributions are indeed peculiarly philosophical and not scientific), and negative in that he is concerned with the limited nature of these contributions. (Choice )\n\n[T]his superb collection of essays further demonstrates Williams's greatness as not only a multitalented philosopher but also a human one. More important, it appropriately honours his philosophical legacy by offering essays that span his entire career. (The Philosopher's Magazine )\n\nHis departure from our scene is our loss; we can only be thankful that collections such as this allow discussion with him to continue. (Alan Montefiore Philosophy )\n\n===================================================================================\nFrom the Back Cover\n&quot;The book should immediately become a staple in the library of anyone with an interest in contemporary English-language philosophy. The collection contains many excellent essays that have been hard to locate for a while, or which have not been previously published. The title essay,'Philosophy as a Humanistic Discipline,' is a rich and remarkable essay, and this is a splendid collection.&quot;--Richard Moran, Professor of Philosophy, Harvard University, author of Authority and Estrangement (Princeton)\n\n&quot;Bernard Williams brought human life into philosophy, and so into the philosophy of all of us. No one outdid him in his mastery of those abstract complexities without which no real philosophy is possible. But through all the intricate reasonings his eye was always on what counts most: making the best sense of the lives of human beings.&quot;--Barry Stroud, University of California at Berkeley\n\n&quot;Williams was one of the most important philosophers of the late twentieth century, who managed to combine an extraordinary philosophical command with an equally impressive gift for keeping in touch with the deepest issues of human life. These essays take up questions about practical reason, the will to believe, and the relation between belief and other mental states, whose modern discussion was transformed by the power and originality of his contributions. Central to all his work is a resistance to what might be called the scientism of much analytical philosophy, something that Williams always stood against in the spheres of ethics and politics.&quot;--Kwame Anthony Appiah, Laurance S. Rockefeller University Professor of Philosophy, Princeton University, and author of The Ethics of Identity (Princeton)\n\n===================================================================================\nAbout the Author\nBernard Williams was Knightbridge Professor of Philosophy, Cambridge University (1967-1979), Monroe Deutsch Professor of Philosophy, University of California, Berkeley (1988-2003), and White's Professor of Moral Philosophy, Oxford University (1990-1996), and was a Fellow of All Souls College, Oxford until his death in 2003. A. W. Moore is Professor of Philosophy at Oxford and the author of &quot;The Infinite, Points of View,&quot; and &quot;Noble in Reason, Infinite in Faculty&quot;.\n===================================================================================","torrent":{"xt":"urn:btih:0e02d2a859d99c6acffea6253c4574891eb24aa4","amp;dn":"Bernard+Williams+-+Philosophy+as+a+Humanistic+Discipline+%5B2006%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e02d2a859d99c6acffea6253c4574891eb24aa4","infoHashBuffer":{"type":"Buffer","data":[14,2,210,168,89,217,156,106,207,254,166,37,60,69,116,137,30,178,74,164]},"announce":[],"urlList":[]}}