{"title":"Ella Fitzgerald &amp; Louis Amstrong - Ella &amp; Louis Sing Gershwin + ","uid":3891885,"size":300667949,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0e0ea1f6ca2ea8b2892156a9d64ab2547e1f36d6&amp;dn=Ella+Fitzgerald+%26+Louis+Amstrong+-+Ella+%26+Louis+Sing+Gershwin+%2B+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"alekow1","files":40,"time":1195069774,"description":"1. Ella &amp; Louis Sing Gershwin\n\nReview:\nWhen Ella and Louis recorded a series of albums together for Verve in 1956 and 1957, George Gershwin&amp;#039;s songs were a constant theme, including a double LP of Porgy and Bess that delighted Ira Gershwin. This 1998 compilation pulls together material from those recordings to celebrate a union of jazz&amp;#039;s greatest singers with a songwriter who had been an essential resource for jazz since the 1920s. The chemistry is consistently inspired, with Armstrong&amp;#039;s gravelly voice, perfect rhythmic sense, and still-eloquent trumpet providing a fine complement to Fitzgerald&amp;#039;s consummately smooth delivery and extraordinary range. Also included are Ella and Louis&amp;#039;s own takes on Gershwin from contemporary sessions, including Fitzgerald&amp;#039;s Jazz at the Philharmonic version of &quot;Oh, Lady, Be Good!&quot; (from At the Opera House) that includes Lester Young, Coleman Hawkins, and Stan Getz among the tenor saxophonists. Collectors will want the CD reissues of the original albums to get a complete picture of the Fitzgerald and Armstrong partnership, or Fitzgerald&amp;#039;s own extended encounter with Gershwin in the Songbook series; nevertheless, this is a delightful introduction to an inspired collaboration.\n\n\n01. I Got Plenty O&amp;#039; Nuttin                                                                                              \n02. He Loves And She Loves                                                                                              \n03. A Woman Is A Sometime Thing                                                                                        \n04. They Can&amp;#039;t Take That Away From Me\n05. Let&amp;#039;s Call The Whole Thing Off\n06. Strike Up The Band                                                                                                  \n07. Things Are Looking Up                                                                                              \n08. They All Laughed                                                                                                    \n09. A Foggy Day                                                                                                        \n10. How Long Has This Been Going On  \n11. Summertime  \n12. Love Is Here To Stay    \n13. There&amp;#039;s A Boat Dat&amp;#039;s Leavin&amp;#039;Soon                                                                            \n14. &amp;#039;s Wonderful                                                                                                        \n15. I Was Doing All Right                                                                                              \n16. Oh, Lady, Be Good!          \n\nPersonnel: Ella Fitzgerald (vocals); Louis Armstrong (vocals, trumpet); Russell Garcia, Nelson Riddle (conductor); Sonny Stitt (alto saxophone); Stan Getz, Coleman Hawkins, Flip Phillips, Lester Young, Illinois Jacquet (tenor saxophone); Roy Eldridge (trumpet); J.J. Johnson (trombone); Oscar Peterson (piano); Herb Ellis (guitar); Ray Brown (bass); Louie Bellson, Jo Jones, Buddy Rich (drums); The Russell Garcia Orchestra; The Nelson Riddle Orchestra.\n\nRecorded at Capitol Studios, Hollywood, California on August 16, 1956, between August 18 and October 14, 1957 and between January 5 and July 17, 1959; Radio Recorders, Hollywood, California on July 23, 1957; The Shrine Auditorium, Los Angeles, California on October 7, 1957. Includes liner notes by Jim Macnie.\n\n\nLabel: Verve\nDate: January 27, 1998\n\n\nNot My rip (thanks to original uploader)\nCovers Included\n\nThe missing tracks are common with these in the other album\n\n\n\n2.  The Best Of\n\nFrom August 1956 to August 1957, legendary jazz producer Norman Granz oversaw several recording sessions and a handful of concerts at the Hollywood Bowl starring two of the finest singers in jazz history, Ella Fitzgerald and Louis Armstrong. Fitzgerald was at the peak of her powers at the time, having clearly defined herself as the best female singer in jazz. Armstrong was comfortably settling into his Grand Old Man of Jazz role by this point, trading hot swing and fiery trumpet solos for genial, good-humored vocalizing.\n\nStill, Armstrong was never one to back off from a challenge, and he holds his own divinely against the younger singer. Fitzgerald was Armstrong&amp;#039;s only rival as a scat singer, and so nearly every track here dissolves into impressive competing scat solos. Fans of scat singing will rejoice.\n\n\n01. Let&amp;#039;s Call The Whole Thing Off                                                                                      \n02. Love Is Here To Stay                                                                                                \n03. The Nearness Of You                                                                                                \n04. Stars Fell On Alabama                                                                                              \n05. Gee, Baby, Ain&amp;#039;t I Good To You                                                                                      \n06. They Can&amp;#039;t Take That Away From Me                                                                                  \n07. Autumn In New York                                                                                                  \n08. Summertime                                                                                                          \n09. Tenderly                                                                                                            \n10. Stompin&amp;#039; At The Savoy                                                                                              \n11. Under A Blanket Of Blue                                                                                            \n12. I Wants To Stay Here                                                                                                \n13. I&amp;#039;ve Got My Love To Keep Me Warm                                                                                    \n14. There&amp;#039;s A Boat Dat&amp;#039;s Leavin&amp;#039; Soon For New York                                                                      \n15. You Won&amp;#039;t Be Satisfied (Until You Break My Heart)        \n\nPersonnel: Ella Fitzgerald (vocals); Louis Armstrong (vocals, trumpet); Russell Garcia (conductor, arranger); Trummy Young (trombone); Edmond Hall (clarinet); Billy Kyle, Oscar Peterson (piano); Herb Ellis (guitar); Ray Brown, Dale Jones (bass); Louie Bellson, Buddy Rich, Barrett Deems (drums).\n\nPrincipally recorded at Capitol Studios, The Hollywood Bowl, Hollywood, California from August 15, 1956 - August 28, 1957.\nIncludes liner notes by William Ruhlmann.\n\n\nLabel: Verve\nOrig Year: 1997\n\n\n\n\nBITRATE: 320\n\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:0e0ea1f6ca2ea8b2892156a9d64ab2547e1f36d6","amp;dn":"Ella+Fitzgerald+%26+Louis+Amstrong+-+Ella+%26+Louis+Sing+Gershwin+%2B+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e0ea1f6ca2ea8b2892156a9d64ab2547e1f36d6","infoHashBuffer":{"type":"Buffer","data":[14,14,161,246,202,46,168,178,137,33,86,169,214,74,178,84,126,31,54,214]},"announce":[],"urlList":[]}}