{"title":"My.Kitchen.Rules.s06e03.WS.PDTV.x264.BF1.mkv","uid":11680332,"size":631083155,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0e8e6beda42d80fdc84187e15bf68b06aed9b02a&amp;dn=My.Kitchen.Rules.s06e03.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"bigfish5","files":1,"time":1423056898,"description":"My Kitchen Rules Australia Series 6 Episode 3\n\nIt's cowboy Robert and his daughter Lynzey's turn to give their Instant Restaurant some Texan flavour as we head to NSW.\n\n Robert and Lynzey New South Wales\nWe're both real determined. We're both real hard headed. \nRobert and Lynzey are about to inject some Texan flavour into the My Kitchen Rules instant restaurants.\nNative Texan Robert, who has called Australia home for 23 years, would much prefer to catch or hunt his own dinner himself.\n&quot;I spent most of my life as a cowboy in Texas. It's a great life and my dad used to say, 'Anything you can't do off the back of a horse is not worth doing,'&quot; he says.\nWhile horses are not part of his everyday life in the Blue Mountains nowadays, he has been sure to pass down his love of traditional Texan foods to his four children, including his cooking buddy, daughter Lynzey, 23.\n&quot;I think the first thing dad taught me to cook was white gravy,&quot; recalls occupational therapy student Lynzey.\nAdds Robert: &quot;I was always, 'Hey come in here and let me show you how to do this.' Because I cook stuff that nobody here knows how to cook. I was thinking you know they need to learn how to do this because they like to eat this kind of stuff.&quot;\nIn fact the whole family is quite happy in the kitchen, except perhaps for Lynzey's twin brother Matthew. But having recently moved out of home, Robert has ensured he is capable of cooking a good steak on his own.\n&quot;We cook a lot of steak and seafood,&quot; says Lynzey. &quot;I like to make some different sauces and I always try to make something nice for dessert. But I typically try to keep things on the healthy side. Most of the time. And every now and then I'll make something decadent. I have made healthy desserts in the past but they haven't been as popular as the unhealthy ones.&quot;\nA fitness buff, she can be found in the gym five days a week. Dad is generally there too.\n&quot;I also like working out outdoors,&quot; she says. &quot;I like setting goals like trying to beat how many pull ups I can do, learning how to do handstands and stuff that just keeps me interested in it.&quot;\nA recently retired visual arts teacher, Robert is a wildlife artist who creates in painting and drawing.\n&quot;It takes a lot of concentration and focus to do artwork. I think my creativity extends out into my food because I know a lot about colour and composition,&quot; he adds.\nBut Robert says Lynzey is their head chef. &quot;As far as general cooking knowledge, she already knows a whole lot more than me. I've got certain areas that I can do really well and there's a lot of things I can do really fast. If she just tells me what to do I can help her quite a bit.&quot;\nRobert says they'll be the diligent team, working hard to get results in the kitchen","torrent":{"xt":"urn:btih:0e8e6beda42d80fdc84187e15bf68b06aed9b02a","amp;dn":"My.Kitchen.Rules.s06e03.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e8e6beda42d80fdc84187e15bf68b06aed9b02a","infoHashBuffer":{"type":"Buffer","data":[14,142,107,237,164,45,128,253,200,65,135,225,91,246,139,6,174,217,176,42]},"announce":[],"urlList":[]}}