{"title":"Falling.In.Reverse - The.Drug.In.Me.Is.You.320k-KB","uid":6545605,"size":110036416,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0eefdcc869c6cabab3d9b4bfb88520bdb8a009b1&amp;dn=Falling.In.Reverse+-+The.Drug.In.Me.Is.You.320k-KB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"KingBooob","files":14,"time":1310842697,"description":"Artist: Falling In Reverse\nAlbum: The Drug In Me Is You\nYear: 2011\nRipped from: Spotify\nRipped by: KingBoob\n\n\n1. \tRaised By Wolves\n2. \tTragic Magic\n3. \tThe Drug in Me is You\n4. \tI'm Not a Vampire\n5. \tGood Girls Bad Guys\n6. \tPick Up the Phone\n7. \tDon't Mess With Ouija Boards\n8. \tSink Or Swim.mp3\n9. \tCaught Like A Fly\n10. \tGoodbye Graceful\n11. \tThe Westerner\n\n\nBitrate: \t320kbps\nLenght:\t\t45min\nCdcover: Yes, 600x600, JPG\n\n\n\niNFO:\nFalling in Reverse (formerly From Behind These Walls) is a Hardcore/Screamo band from Las Vegas, Nevada formed by ex-Escape the Fate vocalist, \nRonnie Radke after being released from prison. \nThe band consists of vocalist, Ronnie Radke, Nason &quot;Nasty&quot; Schoeffler on the bass, guitarists, Jacky Vincent and Derek Jones and Scott Gee on drums. \nThey are set to release their first album in early 2011, \nalthough they posted a song on their Myspace, &quot;Listen Up&quot;, which was recorded by Ronnie Radke and Michael &quot;Elvis&quot; Baskette.\n\n\n\nBand History\nRonnie Radke formed Falling in Reverse after he was sentenced to prison for two years. \nDuring his incarceration, Escape the Fate, his former band, replaced him with former Blessthefall singer, Craig Mabbitt. \nHe was thinking of just getting a real job, but his friend, Nason Schoeffler, convinced him to continue his dream.\n\nOnce Ronnie got over his bitterness toward everyone and everything, he called his friend, Nasty, and asked him to be in his band. \nNasty had always been a good friend to him, he visited him and put money on his card in there when Max (His best friend for ten years) didn't even send a letter or attempt to make any contact with him. \nThey started to get a band together, and named it From Behind These Walls, but due to legal reasons, they were forced to change the name that is now Falling In Reverse. Ronnie says that he likes the name more because it has more of a meaning to him, being in a band named this in previous years. \nHe also stated that they were going to name Escape The Fate this, but came up with the other name instead. Many people already have come and gone in the band so far, (Anthony, Nick, Gilbert, Oskar.. Check the band member tab to see why)","torrent":{"xt":"urn:btih:0eefdcc869c6cabab3d9b4bfb88520bdb8a009b1","amp;dn":"Falling.In.Reverse+-+The.Drug.In.Me.Is.You.320k-KB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eefdcc869c6cabab3d9b4bfb88520bdb8a009b1","infoHashBuffer":{"type":"Buffer","data":[14,239,220,200,105,198,202,186,179,217,180,191,184,133,32,189,184,160,9,177]},"announce":[],"urlList":[]}}