{"title":"Digital Underground [1990] Sex Packets","uid":3904820,"size":114292736,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0f715d0dc03dbe91944114a7dd0b515091e44cf5&amp;dn=Digital+Underground+%5B1990%5D+Sex+Packets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"JaffaDaHutt","files":14,"time":1195773519,"description":"Review\tby Stephen Thomas Erlewine\n\nSex Packets is a vibrant, wildly funny record that transcends any attempt to dismiss it as mere novelty. Novelty records are throwaways -- cheap gags that are funny once, but never pay off with repeat plays, something that Sex Packets certainly does. Sex Packets is layered like any good story. Corny jokes, gross-out tales, flights of fancy, and sheer absurdist humor co-exist comfortably, usually within the course of one song. Take &quot;The Humpty Dance,&quot; their breakthrough single and timeless party anthem. Within that one song, Humpty Hump spills out countless jokes, spinning between inspired allusions and thuddingly obvious cut-ups, which are equally funny because of the irrepressible, infectious nature of his rap. And he&amp;#039;s so confident in his skills, he&amp;#039;s sexy, which is kind of what the album is about -- it knows that sex is funny, and sexier because of it. But the very name of the album should be a clear indication that Digital Underground doesn&amp;#039;t take any of this stuff all that seriously while creating elaborate, fantastical settings that reveal boundless imagination. The showiest number, of course, is the &quot;Sex Packets&quot; suite that concludes the album, built around their idea for a drug that creates full-blown sexual fantasies (virtual reality before it was in vogue), but their skill at creating distinctive worlds is just as apparent on the endless party of &quot;Doowutchyalike.&quot; These are the things that are buried beneath the band&amp;#039;s jokes and an enormous amount of George Clinton samples. Much of the music on Sex Packets uses the P-Funk canon as their foundation (a notable exception being a swinging interpolation of a Jimi Hendrix Band of Gypsys cut on &quot;The New Jazz (One),&quot; a cracking showcase for their team vocal skills). It&amp;#039;s so strong an influence, it may seem easy to reduce Digital Underground to the status of mere Clinton imitators, but they take his blueprint, expand it, and personalize it, creating a record that is as loose and funny as anything in the P-Funk empire, and in some ways, easier to access, since the party feels wide open. Few hip-hop albums sound as much like a constant party as this, and years later, it&amp;#039;s still impossible to resist. \n\n1 The Humpty Dance \t\n2 The Way We Swing \t\n3 Rhymin&amp;#039; on the Funk \t\n4 The New Jazz [One] \t\n5 Underwater Rimes [Remix] \t\n6 Gutfest &amp;#039;89 [Edit] \t\n7 The Danger Zone \t\n8 Freaks of the Industry \t\n9 Doowutchyalike \t\n10 Packet Prelude \t\n11 Sex Packets \t\n12 Street Scene \t\n13 Packet Man \t\n14 Packet Reprise \t","torrent":{"xt":"urn:btih:0f715d0dc03dbe91944114a7dd0b515091e44cf5","amp;dn":"Digital+Underground+%5B1990%5D+Sex+Packets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f715d0dc03dbe91944114a7dd0b515091e44cf5","infoHashBuffer":{"type":"Buffer","data":[15,113,93,13,192,61,190,145,148,65,20,167,221,11,81,80,145,228,76,245]},"announce":[],"urlList":[]}}