{"title":"Zen Gardens - The Complete Works of Shunmyo Masuno, Japan's Lead","uid":10098064,"size":68541382,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f8858581293b323353672b11f6413667d9dab34&amp;dn=Zen+Gardens+-+The+Complete+Works+of+Shunmyo+Masuno%2C+Japan%27s+Lead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"STBGD","files":-1,"time":1399338377,"description":"Zen Gardens: The Complete Works of Shunmyo Masuno, Japan's Leading Garden Designer By Mira Locher\n2012 | 224 Pages | ISBN: 4805311940 | EPUB | 65 MB\n\n&quot;Shunmyo Masuno, Japan's leading garden designer, is at once Japan's most highly acclaimed landscape architect and an 18th-generation Zen Buddhist priest, presiding over daily ceremonies at the Kenkoji Temple in Yokohama. He is celebrated for his unique ability to blend strikingly contemporary elements with the traditional design vernacular. He has worked in ultramodern urban hotels and in some of Japan's most famous classic gardens. In each project, his work as a designer is inseparable from his Buddhist practice. Each becomes a Zen garden, &quot;&quot;a special spiritual place where the mind dwells.&quot;&quot; This beautiful book, illustrated with more than 400 drawings and color photographs, is the first complete retrospective of Masuno's work to be published in English. It presents 37 major gardens around the world in a wide variety of types and settings: traditional and contemporary, urban and rural, public spaces and private residences, and including temple, office, hotel and campus venues. Masuno achieved fame for his work in Japan, but he is becoming increasingly known internationally, and in 2011 completed his first commission in the United States which is shown here. The book, divided into three chapters, covers: &quot;&quot;Traditional Zen Gardens,&quot;&quot; &quot;&quot;Contemporary Zen Gardens&quot;&quot; and &quot;&quot;Zen Gardens outside Japan.&quot;&quot; Illustrated with photographs and architectural plans or sketches, each garden is described and analyzed by author Mira Locher, herself an architect and a scholar well versed in Japanese culture. Celebrating the accomplishments of a major, world-class designer, Zen Gardens also serves as something of a master class in Japanese garden design and appreciation: how to perceive a Japanese garden, how to understand one, even how to make one yourself. Like one of Masuno's gardens, the book can be a place for contemplation and mindful repose.","torrent":{"xt":"urn:btih:0f8858581293b323353672b11f6413667d9dab34","amp;dn":"Zen+Gardens+-+The+Complete+Works+of+Shunmyo+Masuno%2C+Japan%27s+Lead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f8858581293b323353672b11f6413667d9dab34","infoHashBuffer":{"type":"Buffer","data":[15,136,88,88,18,147,179,35,53,54,114,177,31,100,19,102,125,157,171,52]},"announce":[],"urlList":[]}}