{"title":"The Nag Hammadi Gnostic Scriptures (2 complete translations)","uid":11154964,"size":26707768,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f94d705ad7058230830fca0105883b1347831a9&amp;dn=The+Nag+Hammadi+Gnostic+Scriptures+%282+complete+translations%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"workerbee","files":-1,"time":1412390657,"description":"\n* THE NAG HAMMADI LIBRARY: The Definitive Translation of the Gnostic Scriptures Complete in One Volume (HarperCollins, 1988).  Third, Completely Revised Edition.  James M. Robinson, General Editor.  564 pp. -- PDF\n\n* THE NAG HAMMADI SCRIPTURES: The Revised and Updated Translation of Sacred Gnostic Texts (HarperCollins, 2007).  Edited by Marvin W. Meyer, with an Introduction by Elaine H. Pagels.  864 pp. -- ePUB + MOBI\n\n\nThe Nag Hammadi library is a collection of ancient Gnostic gospels and sacred texts unearthed in Egypt in 1945.  The writings, buried in a sealed jar and dating from the third and fourth centuries, comprised 52 mostly Gnostic treatises, but they also include three works belonging to the Corpus Hermeticum and a partial translation/alteration of Plato's &quot;Republic&quot;.  The best-known of these works is probably the Gospel of Thomas, of which the Nag Hammadi codices contain the only complete text, as well as the Gospel of Mary and the controversial Gospel of Judas.\n\nTHE NAG HAMMADI LIBRARY was hailed as &quot;a tremendous achievement&quot; when it first appeared in 1978 and in a completely revised and updated form in 1988.  The publication, according to general editor James M. Robinson, &quot;marked the end of one stage of Nag Hammadi scholarship and the beginning of another.&quot;  It launched modern Gnostic studies and exposed a movement within Christianity whose teachings are in many ways as relevant today as they were centuries ago.  The translators include such prominent scholars as Elaine Pagels, Marvin Meyer, Helmut Koester, and Bentley Layton.\n\nTHE NAG HAMMADI SCRIPTURES, edited by Marvin Meyer, is the most recent, up-to-date, one-volume, English-language edition of the Gnostic manuscripts.  The translations are accompanied by introductory essays, notes, tables, glossary, index, etc., to help readers understand the context and contemporary significance of these texts which have shed new light on the early Christian church, ancient Judaism, and Greco-Roman religions.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:0f94d705ad7058230830fca0105883b1347831a9","amp;dn":"The+Nag+Hammadi+Gnostic+Scriptures+%282+complete+translations%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f94d705ad7058230830fca0105883b1347831a9","infoHashBuffer":{"type":"Buffer","data":[15,148,215,5,173,112,88,35,8,48,252,160,16,88,131,177,52,120,49,169]},"announce":[],"urlList":[]}}