{"title":"Sexually Broken--Little Asian slut Marica Hase fucked by 10 inch","uid":10398444,"size":595039457,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0ffc0145aeaaf83a40407c54155aacb0fec6b102&amp;dn=Sexually+Broken--Little+Asian+slut+Marica+Hase+fucked+by+10+inch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":3,"uploader":"merzedes","files":-1,"time":1403308500,"description":"\nLittle Asian slut Marica Hase roughly fucked by 10 inch BBC in strict bondage, cums hard and fast! | Marica Hase | Jack Hammer \n\nJune 20, 2014\n\n\nHigh bitrate MP4 only.\n\n\nThey do not come any cuter or more adorable then Marica Hase. She is like a tiny little kitten. A sex kitten that craves the cock, and likes it even better if there is bondage involved. Lucky for this Asian sex kitten cock and bondage is exactly what Sexuallybroken specializes in. Today we have one of the biggest cocks around to put this fucktoy through her paces. East meets West with a tiny pussy in the balance.\n\nBound in a classic &quot;fuck me&quot; with a twist, Marica is splayed open as wide as you can get. Her lean legs are tied to poles that prevent her from bending or twisting in any way. It makes her pussy a perfect target. 10 inches of massive black cock step up and fill her to the brim. Marica is so tight it does not go in easy, but the bondage keeps her in place as it sinks home. The gurgles and mews that burble out of her mouth hole are precious music indeed. This is what real dick feels like. Every inch of that tight Asian pussy is throughly plowed.\n\nMarica cums hard and fast as the cock reshapes her tight hole. She literally can not help herself. The cock owns her down to her slutty soul. Marica did not think she could handle that much dick, but she is finding out that the cock always fits in the end. As the multiple orgasms wash over her, Marica' s eyes haze over and her pussy creams. And we are only just getting started. We will not be satisfied until we have pulled out every last orgasm hiding in that tiny cunt. We pull out the vibrator and proceed to blast her deeply into sexual subspace.\n\nThe vibrator is so intense she tries to escape it, but the bondage holds her in place. All she can do is submit to the pleasure. She cums hard, squeaking and gasping. We are still not satisfied and finger blast some more orgasms out of that tight hole. Marica is squirming frantically but too firmly bound to get away. Once we are sure we have wrenched every bit of cum out of her that we can, we leave her a spent and heaving mess of flesh, twitching in her ropes. THIS is how you treat a rope slut. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_20mhase6/SexuallyBroken-Marica-Hase-Jack-Hammer-Little-Asian-slut-Marica-Hase-roughly-fucked-by-10-inch-BBC-in-strict-bondage-cums-hard-and-fast.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_20mhase6/SexuallyBroken-Marica-Hase-Jack-Hammer-Little-Asian-slut-Marica-Hase-roughly-fucked-by-10-inch-BBC-in-strict-bondage-cums-hard-and-fast.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:0ffc0145aeaaf83a40407c54155aacb0fec6b102","amp;dn":"Sexually+Broken--Little+Asian+slut+Marica+Hase+fucked+by+10+inch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ffc0145aeaaf83a40407c54155aacb0fec6b102","infoHashBuffer":{"type":"Buffer","data":[15,252,1,69,174,170,248,58,64,64,124,84,21,90,172,176,254,198,177,2]},"announce":[],"urlList":[]}}