{"title":"the clan of a cave bear 1986","uid":3247525,"size":744979079,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:10ff663c6e1ba015d69b652ea259667a611fb347&amp;dn=the+clan+of+a+cave+bear+1986&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"itoh1","files":12,"time":1097673770,"description":"The clan of a cave bear\nthe movie:\nAt a time in prehistory when Neanderthals shared the Earth with early Homo sapiens, a band of cave-dwellers adopt blond and blue-eyed Ayla, a child of the &amp;quot;Others&amp;quot;. As Ayla matures into a young woman of spirit and courage (unlike other women of the clan), she must fight for survival against the jealous bigotry of Broud, who will one day be clan leader. Based on Jean M. Auel's popular book, there is minimal narration; subtitles translate the Neanderthal gestures and primitive spoken language.\n\nNatural changes have the clans moving. Iza, medicine woman of the &amp;quot;Clan of the Cave Bear&amp;quot; finds little Ayla from the &amp;quot;other&amp;quot;'s clan - tradition would have the clan kill Ayla immediately, but Iza insists on keeping her. When the little one finds a most needed new cave, she may stay - for now. As it turns out later, she's a bright child, but has a hard time to keep her place in a clan with different customs. She has to hide her intelligence because she's a woman.\n\nMy opinion: This movie is based on mis Joan Auel's books, witch I like a lot.\nAs so often happens with screen adaptations of books this one is a real loser. From start to finish the writers/producers seem to have taken the general plot outline and characters and dropped most of the actual story.\nIt will do all right as a way to spend an afternoon if you haven't read the book (at this writing the paperback is $2 cheaper)but too much is so unlike what Ms. Auel wrote. I know that lot's of detail had to be removed for times sake but at what cost to the story? Little Ayla's orphaning resembles the book as does her discovery by the Clan but the way the Neanderthals behave isn't like the book. I don't even remember all of the scenes but when Ayla gives birth to her son Durc, that's conpletely different, although good. Later in the story when Ayla's adoptive mother Iza (Pamela Reed unrocognizable in makeup)is too old and frail to go to the CLan Gathering Ayla is sent in her place, they made a real mess of that one.\nDaryl Hannah is very well cast as the adult Ayla, she's the best reason to watch ths movie.\nSo becouse of that  I also share you all five books. Have fun","torrent":{"xt":"urn:btih:10ff663c6e1ba015d69b652ea259667a611fb347","amp;dn":"the+clan+of+a+cave+bear+1986","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10ff663c6e1ba015d69b652ea259667a611fb347","infoHashBuffer":{"type":"Buffer","data":[16,255,102,60,110,27,160,21,214,155,101,46,162,89,102,122,97,31,179,71]},"announce":[],"urlList":[]}}