{"title":"Gold Rush.Alaska.Season 4.720p.x264","uid":11405465,"size":28697622447,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:111e7ad1c1235597311f810112d9362c4297141b&amp;dn=Gold+Rush.Alaska.Season+4.720p.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":20,"uploader":"markjohnston1","files":20,"time":1415472531,"description":"Gold Rush Season 4, 720p, x264\n\nS00E58 Ready to Roll\n  Special: Filming in the jungles of South America and in the frozen North.\n\nS04E01 Queen of Diamonds\n  The season premiere breaks ground in 3 countries. The Hoffman crew moves\n  their operation to the hostile Guyana jungle. The Dakota boys need to find\n  a safe route over thin ice. Parker is out of cash and must find gold, but\n  Tony Beets has bad news for him.\n\nS04E02 Learning Curve\n  Todd faces disaster when he discovers his claim has been mined out. The\n  Dakota Boys fight over rival mining plans with one plan high in the mountains\n  and the other deep in the hole. Parker ignores Tony Beets, but still manages\n  to hit his first pay dirt.\n\nS04E03 In Too Deep\n  The Hoffman Crew battles the hostile jungle to get vital mining equipment\n  to the claim. The Dakota Boys drill to find out if the glory hole contains\n  millions in gold. Parker is on the warpath when a new crew member throws out\n  his gold.\n\nS04E04 Road From Hell\n  The Hoffman crew attempts to set up their washplant, but the jungle fights\n  them every step of the way. The Dakota Boys find their first bedrock gold in\n  the glory hole. In the Klondike, Parker gets more gold out of Little Blue\n  than the Hoffmans ever did.\n\nS04E05 Garnets or Gold\n  Todd makes a shocking departure. Parker is forced to rebuild his wash plant\n  after losing gold. The Dakota Boys finally hit the bottom of the Glory Hole.\n\nS04E06 Mutiny\n  Todd returns to Guyana expecting 20 ounces of gold but gets a nasty shock.\n  Parker faces a mutiny and seeks advice from his Grandpa. The Dakota Boys\n  expect a huge pay out from the glory hole but get a crushing blow.\n\nS04E07 Paid in Full\n  Todd makes an incredible discovery while searching for new gold rich ground.\n  Parker needs his best clean up ever in order to stop Todd from repossessing\n  his dozer. Just as Fred gives up on the Glory Hole, it suddenly pays out big.\n\nS04E08 Jungle Boogie\n  Todd abandons gold and switches to diamond mining. In Alaska, Dustin gets\n  stranded in the mountains during the worst electrical storm in twenty years.\n  ParkerÂ¿s need for speed destroys his wash plant.\n\nS04E09 Hope Creek\n  Dave returns to the Hoffman Crew and butts heads with Todd over their mining\n  plan. The Dakota boys stake their future on a new cut and Parker gets a\n  second chance at mining with one of the largest wash plants in the Klondike.\n\nS04E10 Blowout\n  A tropical storm floods the HoffmanÂ¿s operation and Dave is forced to dive\n  deep into the pit. Parker is running one of the biggest washplants in the\n  Klondike and needs to prove it will deliver. The Dakota boys get the biggest\n  clean-up of their season.\n\nS04E11 Death of a Dream\n  In the first of a two part episode, Parker hires yet another ex-Hoffman crew\n  member while Todd grows more and more desperate. In the end, two crews get\n  their biggest gold clean ups to date while the third faces an abrupt end to\n  their season.\n\nS04E12 The Resurrection\n  In the second part of a two part episode, Todd's 150 days is up and with no\n  gold and just a few diamonds he faces eviction. Despite a big clean out,\n  Parker modifies his plant to hit a million dollar season. Dustin finally\n  gets real mining equipment up to Cahoon Creek to see if it holds big gold.\n\nS04E13 Fantasy Land\n  ToddÂ¿s claim owner forces a change to the mining plan. Grandpa visits Parker\n  and makes a radical suggestion that the crew believes to be pure fantasy.\n  Dustin fights to reach his first mountain gold.\n\nS04E14 Medevac\n  An emergency in the jungle forces Todd to airlift one of his men to safety.\n  Tony Beets becomes furious when he finds that Parker has moved his whole\n  operation over the creek. The Dakota boys may be forced to abandon their hole.\n\nS04E15 Man on Wire\n  Jack destroys the washplant forcing Dave to find a new way to run their dirt.\n  Frozen pay dirt disrupts ParkerÂ¿s operation and threatens to end his season\n  early. Dustin participates in a dangerous operation.\n\nS04E16 Day of Reckoning\n  Todd's claim owner arrives unannounced to take stock of the Hoffman's\n  operation. Dustin returns from the mountains just in time for the final\n  clean up. Unwilling to admit defeat, Parker uses a new piece of equipment\n  to thaw his frozen paydirt.\n\nS04E17 Go Big or Go Home\n  Parker Schnabel refuses to give up. He's not satisfied with his gold total\n  and is dead set on bringing home big gold to his beloved grandfather. Nothing\n  is going to stop him, not even the Klondike winter.\n\nS04E18 Grandpa's Last Wish\n  Parker and his brother Payson team up to chase one of their grandfather's\n  lifelong dreams. They must battle tough terrain, harsh weather, and each\n  other to find out if there's gold at Smith Creek after all.\n\nS04E19 Unearthed\n  This no holds barred show reveals how Fred coped with a dying wife, why a\n  fateful choice cost Todd a huge amount of gold and how he coped with a murder\n  in the jungle. A look forward reveals where the miners will be next season\n  and who will return","torrent":{"xt":"urn:btih:111e7ad1c1235597311f810112d9362c4297141b","amp;dn":"Gold+Rush.Alaska.Season+4.720p.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"111e7ad1c1235597311f810112d9362c4297141b","infoHashBuffer":{"type":"Buffer","data":[17,30,122,209,193,35,85,151,49,31,129,1,18,217,54,44,66,151,20,27]},"announce":[],"urlList":[]}}