{"title":"Hands Off! 3.0 (Mac OSX)","uid":12467484,"size":11774722,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:11e8d0a406175f9b3c49f4b7e3703ee92a9afa8b&amp;dn=Hands+Off%21+3.0+%28Mac+OSX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":null,"files":2,"time":1442873636,"description":"From MacTake.com\n\nHands Off! is an application to monitor and control the access of applications to your network and disks. Being able to monitor the normally unnoticeable activities enables you to make informed decisions regarding the transfer of your private information, hence avoiding confidential information leakage.\n\nWhen connected to the Internet, applications can send any information stored on your computer to whoever they want without you ever knowing. Using Hands Off!, you can monitor and control Internet connections from all applications as to expose hidden connections and prevent them from sending data or phoning home without your consent.\n\nApplications present on your computer can freely read, store or erase information on your computer without your knowledge. Using Hands Off!, you can monitor and control disk access from all applications as to prevent them from obtaining confidential information, erasing your data or storing cookies.\n\nThe best way to find out if Hands Off! suits your needs is to download the latest version and try the demonstration mode.\n\nWHAT'S NEW\nVersion 3.0:\n\nNote: Now requires OS X 10.9.5 or later running on a 64-bit Intel processor.\n\n- Forward Looking - Ready for the new OS X 10.11 El Capitan and in harmony with the beautiful OS X user interface design. Hands Off! is looking fresh and refined.\n- Retina-Display Support - Graphics and user interface are now optimized for Retina displays so they look sharper and take full advantage of those stunning high-resolution Mac displays.\n- Improved Performance - Under-the-hood improvements make Hands Off! more efficient so it keeps your Mac secure while allowing you to focus on accomplishing amazing things","torrent":{"xt":"urn:btih:11e8d0a406175f9b3c49f4b7e3703ee92a9afa8b","amp;dn":"Hands+Off%21+3.0+%28Mac+OSX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11e8d0a406175f9b3c49f4b7e3703ee92a9afa8b","infoHashBuffer":{"type":"Buffer","data":[17,232,208,164,6,23,95,155,60,73,244,183,227,112,62,233,42,154,250,139]},"announce":[],"urlList":[]}}