{"title":"Polymer Reaction Engineering - Jose M. Asua","uid":12430174,"size":23194189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12389343dc08126dd78a87e0cfa3434071996816&amp;dn=Polymer+Reaction+Engineering+-+Jose+M.+Asua&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"clouderone","files":1,"time":1442443572,"description":"Polymer Reaction Engineering - Jose M. Asua (Blackwell, 2007).pdf\n\nISBN: 978-1-4051-4442-1\n\nPolymers are an example of &quot;products-by-process,&quot; where the final product properties are mostly determined during manufacture, in the reactor. An understanding of processes occurring in the polymerization reactor is therefore crucial to achieving efficient, consistent, safe and environmentally friendly production of polymeric materials. \nPolymer Reaction Engineering provides the link between the fundamentals of polymerization kinetics and polymer microstructure achieved in the reactor. Organized according to the type of polymerization, each chapter starts with a description of the main polymers produced by the particular method, their key microstructural features and their applications Polymerization kinetics and its effect on reactor configuration, mass and energy balances and scale-up are covered in detail. The text is illustrated with examples emphasizing general concepts, principles and methodology. \nWritten as an authoritative guide for chemists and chemical engineers in industry and academe, Polymer Reaction Engineering will also be a key reference source for advanced courses in polymer chemistry and technology","torrent":{"xt":"urn:btih:12389343dc08126dd78a87e0cfa3434071996816","amp;dn":"Polymer+Reaction+Engineering+-+Jose+M.+Asua","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12389343dc08126dd78a87e0cfa3434071996816","infoHashBuffer":{"type":"Buffer","data":[18,56,147,67,220,8,18,109,215,138,135,224,207,163,67,64,113,153,104,22]},"announce":[],"urlList":[]}}