{"title":"Terror in the City of Champions (2016) (Pdf) Gooner","uid":16009749,"size":7265537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12a924d0e31fb193f26f65f2f21591fb9ed0a362&amp;dn=Terror+in+the+City+of+Champions+%282016%29+%28Pdf%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1476221112,"description":"Terror in the City of Champions - Murder, Baseball and the Secret Society That Shocked Depression-Era Detroit (2016) (Pdf) Gooner\r\n\r\nPublisher: The Lyons Press (1 Aug. 2016)\r\nLanguage: English\r\nISBN-10: 1493015702\r\nISBN-13: 978-1493015702\r\n\r\nA New York Times Bestseller Detroit, mid-1930s: In a city abuzz over its unrivaled sports success, gun-loving baseball fan Dayton Dean became ensnared in the nefarious and deadly Black Legion. The secretive, Klan-like group was executing a wicked plan of terror, murdering enemies, flogging associates, and contemplating armed rebellion. The Legion boasted tens of thousands of members across the Midwest, among them politicians and prominent citizens-even, possibly, a beloved athlete. Terror in the City of Champions opens with the arrival of Mickey Cochrane, a fiery baseball star who roused the Great Depression's hardest-hit city by leading the Tigers to the 1934 pennant. A year later he guided the team to its first championship. Within seven months the Lions and Red Wings follow in football and hockey-all while Joe Louis chased boxing's heavyweight crown. Amidst such glory, the Legion's dreadful toll grew unchecked: staged &quot;suicides,&quot; bodies dumped along roadsides, high-profile assassination plots. Talkative Dayton Dean's involvement would deepen as heroic Mickey's Cochrane's reputation would rise. But the ballplayer had his own demons, including a close friendship with Harry Bennett, Henry Ford's brutal union buster. Award-winning author Tom Stanton weaves a stunning tale of history, crime, and sports. Richly portraying 1930s America, Terror in the City of Champions features a pageant of colorful figures: iconic athletes, sanctimonious criminals, scheming industrial titans, a bigoted radio priest, a love-smitten celebrity couple, J. Edgar Hoover, and two future presidents, Gerald Ford and Ronald Reagan. It is a rollicking true story set at the confluence of hard luck, hope, victory, and violence","torrent":{"xt":"urn:btih:12a924d0e31fb193f26f65f2f21591fb9ed0a362","amp;dn":"Terror+in+the+City+of+Champions+%282016%29+%28Pdf%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12a924d0e31fb193f26f65f2f21591fb9ed0a362","infoHashBuffer":{"type":"Buffer","data":[18,169,36,208,227,31,177,147,242,111,101,242,242,21,145,251,158,208,163,98]},"announce":[],"urlList":[]}}