{"title":"Brazzers Double Feature (Brazzers) XXX 2016 WEB-DL Split Scenes","uid":13477171,"size":1812554413,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:12d5f901328697f324e67f7c544e33d614e7dc6c&amp;dn=Brazzers+Double+Feature+%28Brazzers%29+XXX+2016+WEB-DL+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"Ctrlme","files":6,"time":1455023231,"description":"------------------------------------------------------------\r\n        ....... : Screenshots/ Info : .......    \r\n------------------------------------------------------------     \nhttp://youpornbook.com/forums/topic/6666-brazzers-double-feature-brazzers-xxx-2016-web-dl-split-scenes/\r\n\r\nIt's Peta Jensen's first day working as a maid for Monique Alexander and her family, and she has no idea what they have in store for her. First Monique's stepson Xander spies on her while she changes into her sexy uniform, then he convinces her to suck his cock! The next day at breakfast Monique tells Peta to hand over her panties then dismisses her so she can have fun teasing her husband Danny. Monique jerks off his thick cock while letting him smell the maid’s wet panties, making him so horny he bends her over the breakfast table and spanks her perfect ass. They move to the bedroom for a good hard fucking - but do they know they’re being watched? Feeling horny and confused, sexy french maid Peta can’t help but spy on Monique and her husband as they fuck in the master bedroom. When Xander sees her spying and rubbing her sweet, wet pussy, he helps her out with some sneaky doggystyle action before taking her to another room for some one-on-one hardcore fucking. Peta has never had a job like this before!  Freshly fucked by Monique's stepson, Peta is worried she’s in big trouble when she’s summoned to her boss’s room. But Monique just wants Peta to clean up the mess she and her husband Danny made... including the one in her pussy. Peta eagerly licks the hot, sticky creampie out of Monique’s pussy and then is rewarded for being such a good maid by getting fingered, licked and scissored. Having fucked her way through most of medical school, Tiffany Star is worried about dealing with the real world pressure and stress of being an actual doctor, especially since she’s just quit the porn business for a career in medicine. Tiffany manages to get a job working at ZZ Hospital as an urologist, which is easy for her since she’s very familiar in working with dicks. Her biggest fear isn’t failing as a doctor, but if her pornographic past will cum back to haunt her! Tiffany Star is called into her supervisor’s office for a performance review. Dr. Anna Bell Peaks is a lesbian nympho and has been eyeing the young cutie for quite some time. Dr. Peaks, while masturbating in her office, discovers that Tiffany used to be in porn and considers whether or not to let her continue to practice at ZZ Hospital. Tiffany pleads her case, but must first prove to Dr. Peaks that she has the necessary skills for the job. Hoping to see her lover Dr. Peaks, Rachel Starr is a bit disappointed when male doctor Johnny Sins arrives to examine her. When the male doctor realizes that nothing’s wrong with Mrs. Starr, he deduces that she’s a lesbian. But Dr. Sins is well known for giving his female patients a good dicking. Hoping to jog her memory of how fun it is to get fucked by a well hung stud, the male doctor works his charm and soon Ms. Starr is cured of her ri-dick-ulous behavior.   \r\n------------------------------------------------------------ \r\n_________________________$$$$$$$____________________________\r\n________________________$$$$$$$$$$__________________________\r\n________________________$$$$$$$$$$$_________________________\r\n_________________________$$$$$$$$$$$$$$_____________________\r\n__________________________$$$$$$$$$$$_______________________\r\n_____________________________$$$$$$$$$$$$$__________________\r\n___________________________$$$$$$$$$$_______________________\r\n_________________________$$$$$$$$$$$$$$$____________________\r\n________________$$$______$$$$$$$$$$$$$$_____________________\r\n______________$$$$$$$$_____$$$$$$__$$$$$____________________\r\n_____________$$$$$$$$$$_____$$$$____$$$$$___________________\r\n___________$$$$$$_$$$$$$$$__$$$$______$$$$__________________\r\n__________$$$$$_____$$$$$$$$_$$$$_______$$$_________________\r\n________$$$$$_________$$$$$$$$$$$$_______$$$________________\r\n_______$$$_____________$$$$$$$$$$$________$$$_______________\r\n_____$$$________________$$$$$$$$$$________$$$$$$____________\r\n__$$$$$$__________________$$$$$$$\r\n------------------------------------------------------------\r\n... : If you like this torrent, please post a comment!  :...\r\n... :    Greets to our Friends at TPB, PL, ET &amp; 1337x   :...\r\n... :                Don't forget to seed               :...\r\n... :                   We ♥ Torrents!                  :...\r\n------------------------------------------------------------\r\nList of Ctrlme Torrents  https://thepiratebay.se/user/Ctrlme","torrent":{"xt":"urn:btih:12d5f901328697f324e67f7c544e33d614e7dc6c","amp;dn":"Brazzers+Double+Feature+%28Brazzers%29+XXX+2016+WEB-DL+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12d5f901328697f324e67f7c544e33d614e7dc6c","infoHashBuffer":{"type":"Buffer","data":[18,213,249,1,50,134,151,243,36,230,127,124,84,78,51,214,20,231,220,108]},"announce":[],"urlList":[]}}