{"title":"State-Sponsored Terrorism, Crimes, and Lies - Collection 19 (Inj","uid":11119846,"size":174569359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13446b01c4372ddfe86ba9af4a381416d9abb32c&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+19+%28Inj&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"moman73","files":35,"time":1411901004,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 19 (Injustice):\n\nWe have 35 titles in this upload. They all discuss injustice and failures of the justice system. Some of the injustice is unintentional, but most of it is a manifestation of state-sponsored terrorism and crimes.\n\n-  Aladjem - The Culture of Vengeance and the Fate of American Justice (2008)\n\n-  Amnesty Int. - Russian Federation; Rule Without Law; Human Rights Violations in the North Caucasus (2009)\n\n-  Amnesty Int. - The Circle of Injustice; Security Operations and Human Rights Violations in Ingushetia (2012)\n\n-  Bravin - The Terror Courts; Rough Justice at Guantanamo Bay (2013)\n\n-  Compton-Wallace - Eating the Ashes; Seeking Rehabilitation within the US Penal System (2003)\n\n-  Corlett - Race, Rights, and Justice (2009)\n\n-  Cucullu - Inside Gitmo; the True Story behind the Myths of Guantanamo Bay (2009)\n\n-  de Londras - Detention in the 'War on Terror'; Can Human Rights Fight Back (2011)\n\n-  Dorling - Injustice; Why Social Inequality Persists (2010)\n\n-  Ebisike - Offender Profiling in the Courtroom; the Use and Abuse of Expert Witness Testimony (2008)\n\n-  Eddleston - Miscarriages of Justice; Famous London Cases (2009)\n\n-  Edlin - Judges and Unjust Laws; Common Law Constitutionalism and the Foundations of Judicial Review (2010)\n\n-  Fabre - Justice in a Changing World (2007)\n\n-  Felman - The Juridical Unconscious; Trials and Traumas in the Twentieth Century (2002)\n\n-  Haas - The Assassination of Fred Hampton; How the FBI and the Chicago Police Murdered a Black Panther (2010)\n\n-  HRW - An Offer You Can't Refuse; How US Federal Prosecutors Force Drug Defendants to Plead Guilty (2013)\n\n-  HRW - In the Name of Security; Counterterrorism Laws Worldwide since September 11 (2012)\n\n-  HRW - No One Left to Witness; Torture, the Failure of Habeas Corpus, and the Silencing of Lawyers in Uzbekistan (2011)\n\n-  HRW - Where Is the Justice; Interethnic Violence in Southern Kyrgyzstan and Its Aftermath (2010)\n\n-  Lanier &amp; Page - A Mighty Long Way; My Journey to Justice at Little Rock Central High School (2009)\n\n-  Lesley - Los Angeles Police Department Meltdown; the Fall of the Professional-Reform Model of Policing (2012)\n\n-  Levy &amp; Sidel (Eds.) - Social Injustice and Public Health (2006)\n\n-  MacIntyre - Whose Justice; Which Rationality (1988)\n\n-  Maxeiner - Failures of American Civil Justice in International Perspective (2011)\n\n-  May - Global Justice and Due Process (2011)\n\n-  Miller - Search and Destroy; African-American Males in the Criminal Justice System (1996)\n\n-  Mullins - The Rape of Justice; America's Tribunals Exposed (1989)\n\n-  Natapoff - Snitching; Criminal Informants and the Erosion of American Justice (2009)\n\n-  Provine - Unequal Under Law; Race in the War on Drugs (2007)\n\n-  Richman &amp; Reynolds - Injustice on Appeal; the United States Courts of Appeals in Crisis (2013)\n\n-  Roberts &amp; Stratton - The Tyranny of Good Intentions; How Prosecutors and Law Enforcement Are Trampling the Constitution (2008)\n\n-  Taibbi - The Divide; American Injustice in the Age of the Wealth Gap (2014)\n\n-  Tribe &amp; Matz - Uncertain Justice; the Roberts Court and the Constitution (2014)\n\n-  Wang - Becoming American; the Art and Identity Crisis of Yasuo Kuniyoshi (2011)\n\n","torrent":{"xt":"urn:btih:13446b01c4372ddfe86ba9af4a381416d9abb32c","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+19+%28Inj","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13446b01c4372ddfe86ba9af4a381416d9abb32c","infoHashBuffer":{"type":"Buffer","data":[19,68,107,1,196,55,45,223,232,107,169,175,74,56,20,22,217,171,179,44]},"announce":[],"urlList":[]}}