{"title":"The Traveling Wilburys Collection - 2007","uid":3717444,"size":142981267,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:144175b715cda023f209945627f5778c2db8f2ca&amp;dn=The+Traveling+Wilburys+Collection+-+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"Ekolb","files":27,"time":1182190424,"description":"The Traveling Wilburys were a supergroup created by George Harrison, Jeff Lynne, Roy Orbison, Tom Petty, and Bob Dylan. Initially an informal grouping with Roy Orbison and Tom Petty, they got together at Bob Dylan&amp;#039;s studio (Santa Monica, California) to record an additional track as a B-side for the single release of Harrison&amp;#039;s &quot;This is Love&quot;. The song they came up with was &quot;Handle with Care&quot;. However, the record company immediately realized it was too good to be released as a single &quot;filler&quot;.\n\nThey enjoyed working together so much that they decided to create an album together. Written by all its members, the album was recorded over a ten-day period because Dylan was due to go on tour. Released in October 1988 (under various pseudonyms as half-brothers, supposed sons of Charles Truscott Wilbury, Sr.), the album Traveling Wilburys Vol. 1 was in 1989 ranked #70 on Rolling Stone magazine&amp;#039;s list of the 100 greatest albums of the 1980s. The death of band member Roy Orbison (on December 6, 1988) prevented further full collaborations; however, the band continued without him.\n\n&quot;Wilburys&quot; was a slang term coined by Harrison and Lynne during the recording of Cloud Nine as a reference to recorded &quot;flubs&quot; that could be eliminated during the mixing stage (i.e., &quot;&amp;#039;We&amp;#039;ll bury&amp;#039; them in the mix&quot;). The term was used again when the entire group was together. Harrison suggested &quot;The Trembling Wilburys&quot; as the group&amp;#039;s name, but they decided to use &quot;Traveling&quot; instead.\n\nAfter Orbison&amp;#039;s death, there was undocumented speculation in the news media that Del Shannon might join the band, but his 1990 suicide precluded any possible involvement.\n\nA charity single entitled &quot;Nobody&amp;#039;s Child&quot;, aimed at drawing attention to the orphaned children of Romania, followed in early 1990, also with an album with others. A second album titled Traveling Wilburys Vol. 3 was released in October 1990. However, the album met with less success. Some possible reasons for the skip from Vol. 1 to Vol. 3 include the fact that some consider Tom Petty&amp;#039;s Full Moon Fever as Vol. 2 (Jeff Lynne, George Harrison, and Roy Orbison perform on the album), a nod to the many bootlegs titled &quot;Volume 2&quot; containing early studio mixes/alternative takes, to honor the death of Roy Orbison by not releasing the project started with Orbison, or as a simple joke. Harrison once claimed in an MTV interview that the band had written material for a Vol. 2, but the material was stolen before completion.\n\nThe two Traveling Wilburys albums have extremely limited availability and have been left out of print in most territories. Harrison, as primary holder of the rights, did not get around to reissuing them prior to his death. However, Tom Petty announced on his XM radio show that Volume 1 and 3, along with DVD footage and bonus tracks, will be released on June 11th 2007 (http://www.wilburys.info/), a claim further substantiated in the February 2007 edition of Q Magazine in an interview with Jeff Lynne.\n\nAs of June 17, 2007, the group held the number one position on the UK Album Charts with the release of The Traveling Wilburys Collection. The group also hit number one on the Australian album charts, Amazon&amp;#039;s pre-order and sales list, and Apple&amp;#039;s iTunes.\n\nThe Traveling Wilburys Collection is a 2007 box set compilation album comprised of both albums by the Traveling Wilburys and a DVD with their videos and a documentary about the group. The set was released June 12, 2007 by Rhino, in association with Wilbury Records. The set recently debuted at #1 on the UK Albums Chart and Australian ARIA Albums Chart.\n\nReleased  June 11, 2007\n June 12, 2007 \nRecorded 1987 - 1990 \nGenre Rock music \nLength 1:26:46 (CDs) \nLabel Wilbury Record Co.\nRhino Entertainment \nProducer(s) Otis Wilbury, Nelson Wilbury, Clayton Wilbury, Spike Wilbury \n\nDisc one:\n&quot;Handle with Care&quot; ? 3:20 \n&quot;Dirty World&quot; ? 3:30 \n&quot;Rattled&quot; ? 3:00 \n&quot;Last Night&quot; ? 3:48 \n&quot;Not Alone Any More&quot; ? 3:24 \n&quot;Congratulations&quot; ? 3:30 \n&quot;Heading for the Light&quot; ? 3:37 \n&quot;Margarita&quot; ? 3:15 \n&quot;Tweeter and the Monkey Man&quot; ? 5:30 \n&quot;End of the Line&quot; ? 3:30 \n&quot;Maxine&quot; - 2:49 \nPreviously unreleased bonus track, with additional backing vocals by Jeff Lynne and Dhani Harrison and a guitar solo by Jeff Lynne added in 2007. \n&quot;Like A Ship&quot; - 3:30 \nPreviously unreleased bonus track, with additional backing vocals by Jeff Lynne and Dhani Harrison and a guitar solo by Dhani Harrison added in 2007. \n\nDisc two:\n\n&quot;She&amp;#039;s My Baby&quot; ? 3:14 \n&quot;Inside Out&quot; ? 3:36 \n&quot;If You Belonged To Me&quot; ? 3:13 \n&quot;Devil&amp;#039;s Been Busy&quot; ? 3:18 \n&quot;7 Deadly Sins&quot; ? 3:18 \n&quot;Poor House&quot; ? 3:17 \n&quot;Where Were You Last Night?&quot; ? 3:03 \n&quot;Cool Dry Place&quot; ? 3:37 \n&quot;New Blue Moon&quot; ? 3:21 \n&quot;You Took My Breath Away&quot; ? 3:18 \n&quot;Wilbury Twist&quot; ? 2:56 \n&quot;Nobody&amp;#039;s Child&quot; (Cy Coben, Mel Foree) - 3:28 \nBonus track, previously released on Nobody&amp;#039;s Child: Romanian Angel Appeal. \n&quot;Runaway&quot; (Del Shannon, Max D. Crook) - 2:30 \nBonus track, originally released as the B-side to &quot;She&amp;#039;s My Baby&quot; in the UK. Remixed, with a new clavioline solo replacing the original guitar/harmonica tracks recorded in 1990. \n\nEnjoy! and please seed..\nEkolb","torrent":{"xt":"urn:btih:144175b715cda023f209945627f5778c2db8f2ca","amp;dn":"The+Traveling+Wilburys+Collection+-+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"144175b715cda023f209945627f5778c2db8f2ca","infoHashBuffer":{"type":"Buffer","data":[20,65,117,183,21,205,160,35,242,9,148,86,39,245,119,140,45,184,242,202]},"announce":[],"urlList":[]}}