{"title":"Gold Warriors: America's Secret Recovery of Yamashita's Gold","uid":15811210,"size":1845600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1456c543bbf0d896c3d51b632832534bc7471bfc&amp;dn=Gold+Warriors%3A+America%27s+Secret+Recovery+of+Yamashita%27s+Gold&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"marty14","files":1,"time":1473636709,"description":"Gold Warriors: America's Secret Recovery of Yamashita's Gold - Sterling Seagrave [epub]\r\n\r\nIn 1945, US intelligence officers in Manila discovered that the Japanese had hidden large quantities of gold bullion and other looted treasure in the Philippines. President Truman decided to recover the gold but to keep its riches secret. These, combined with Japanese treasure recovered during the US occupation, and with recovered Nazi loot, would create a worldwide American political action fund to fight communism. This ‘Black Gold’ gave Washington virtually limitless, unaccountable funds, providing an asset base to reinforce the treasuries of America’s allies, to bribe political and military leaders, and to manipulate elections in foreign countries for more than fifty years.\r\n\r\nJapan systematically looted the entire continent of Asia during WWII, seizing billions in precious metals, gems and artworks. From war's end to the present, the looted treasure, used by President Truman to create a secret slush fund to fight communism, has had a malignant effect on American and Asian politics. The Seagraves assert that the Japanese imperial family, along with Ferdinand Marcos, every American president from Harry Truman to George W. Bush, and numerous sinister figures on the American hard right have been tainted and in many cases utterly corrupted by the loot. Postwar efforts to recover and exploit the treasure, involved murders, dishonest deals and cover-ups","torrent":{"xt":"urn:btih:1456c543bbf0d896c3d51b632832534bc7471bfc","amp;dn":"Gold+Warriors%3A+America%27s+Secret+Recovery+of+Yamashita%27s+Gold","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1456c543bbf0d896c3d51b632832534bc7471bfc","infoHashBuffer":{"type":"Buffer","data":[20,86,197,67,187,240,216,150,195,213,27,99,40,50,83,75,199,71,27,252]},"announce":[],"urlList":[]}}