{"title":"Structural Analysis: Civil Engineering Course Material","uid":4724572,"size":14322952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14817ad08a7ed466fba16e9ad64cfdefd362efe8&amp;dn=Structural+Analysis%3A+Civil+Engineering+Course+Material&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":16,"uploader":"VasiaZozulia","files":1,"time":1234688617,"description":"Description : Structural analysis and design is a very old art and is known to human beings since early civilizations. The Pyramids constructed by Egyptians around 2000 B.C. stands today as the testimony to the skills of master builders of that civilization. Many early civilizations produced great builders, skilled craftsmen who constructed magnificent buildings such as the Parthenon at Athens (2500 years old), the great Stupa at Sanchi (2000 years old), Taj Mahal (350 years old), Eiffel Tower (120 years old) and many more buildings around the world. These monuments tell us about the great feats accomplished by these craftsmen in analysis, design and construction of large structures. Today we see around us countless houses, bridges, fly-overs, high-rise buildings and spacious shopping malls. Planning, analysis and construction of these buildings is a science by itself. The main purpose of any structure is to support the loads coming on it by properly transferring them to the foundation. Even animals and trees could be treated as structures. Indeed biomechanics is a branch of mechanics, which concerns with the working of skeleton and muscular structures. In the early periods houses were constructed along the riverbanks using the locally available material. They were designed to withstand rain and moderate wind. Today structures are designed to withstand earthquakes, tsunamis, cyclones and blast loadings. Aircraft structures are designed for more complex aerodynamic loadings. These have been made possible with the advances in structural engineering and a revolution in electronic computation in the past 50 years. The construction material industry has also undergone a revolution in the last four decades resulting in new materials having more strength and stiffness than the traditional construction material. In this book we are mainly concerned with the analysis of framed structures (beam, plane truss, space truss, plane frame, space frame and grid), arches, cables and suspension bridges subjected to static loads only.","torrent":{"xt":"urn:btih:14817ad08a7ed466fba16e9ad64cfdefd362efe8","amp;dn":"Structural+Analysis%3A+Civil+Engineering+Course+Material","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14817ad08a7ed466fba16e9ad64cfdefd362efe8","infoHashBuffer":{"type":"Buffer","data":[20,129,122,208,138,126,212,102,251,161,110,154,214,76,253,239,211,98,239,232]},"announce":[],"urlList":[]}}