{"title":"The L Word - Season 1 (gremster)","uid":4225729,"size":5147154479,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:149537bf7255c642215d1372c9cd596345b59d41&amp;dn=The+L+Word+-+Season+1+%28gremster%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"gremster","files":14,"time":1212813847,"description":"Season 1, Episode 1: Pilot\nOriginal Air Date: 18 January 2004\nArt gallery manager Bette Porter and social worker Tina Kennard have been a couple for seven years and want to start a family. Their next-door neighbor, Tim Haspel, who works as the assistant coach of a girls swim team at UCLA, is about to form a couple when his girlfriend, a talented young writer named Jenny Schecter, moves in after graduating from college in Iowa with the desire to start writing her first novel. Soon, after mixing with Bette and Tina\\&amp;#039;s circle of lesbian friends at a party where Jenny has a brief sexual encounter with Marina Ferrer, an attractive European woman who runs The Planet, their local coffeehouse hangout, Jenny learns that her mid-west university education may not have prepared her for what she will learn about life, lust and love in Los Angeles among the lesbian community. Bette and Tina\\&amp;#039;s other friends include; Dana Fairbanks, a prim and proper, conservative tennis player who dreams of making it big, but who is closeted; Alice Pieszecki, a liberal and \\&amp;#039;out-of-the-closet\\&amp;#039; magazine writer who has not had any luck in the dating service for some time and sets in motion a \\&amp;#039;conquest chart\\&amp;#039; to see who has been with who; Shane McCutcheon is an unkempt, sexually aggressive, hairstylist who\\&amp;#039;s unapologetic lifestyle of one-night stands begins to catch up with her when one conquest, Lacey, refuses to take no for an answer to get lost. Rounding out the group is Bette\\&amp;#039;s older, straight, half-sister Kit Porter, whom has problems dealing with her sagging singing career and alcoholism.\n\n\nSeason 1, Episode 2: Let\\&amp;#039;s Do It\nOriginal Air Date: 25 January 2004\nBette and Tina wait eagerly to see if Tina will get pregnant via artificial insemination. Dana becomes interested in a woman, named Lara Perkins, who works as the chief at the tennis club she is practicing at. Unable to know if Lara is gay or straight, all of Dana\\&amp;#039;s friend go to the club\\&amp;#039;s restaurant to try out a series of amusing \\&amp;#039;tests\\&amp;#039; to see if Lara \\&amp;#039;is or isn\\&amp;#039;t\\&amp;#039;. Meanwhile, Tim, unaware of her encounter with Jenny, invites Marina to a dinner party at his house which stirs up tension between both women. Bette notices the air of tension and in an angry tone, tells Marina to stay away from Jenny. Kit tries to make amends meet to Bette. While doing research at a women\\&amp;#039;s clinic for a news story, Alice meets a former flame, named Gabby, and considers rekindling the flame despite protests from her friends about the way Gabby treated her in the past. Also, Shane continues to be harassed by Lacey who tries to destroy Shane\\&amp;#039;s reputation.\n\n\nSeason 1, Episode 3: Longing\nOriginal Air Date: 1 February 2004\nBette engages in a battle of wills with the board of directors whom oppose a new set of artwork called \\&amp;#039;Provocations\\&amp;#039; at the California Art Center, and she takes a desperate step by traveling to Santa Barbara to see Peggy Peabody, an eccentric and notorious art collector, to ask for help in funding for setting up the event. Meanwhile, Jenny struggles with her feelings for Marina and finds herself unable to resist the temptation. Alice tries to regain her self-respect by going out with Gabby, but learns that Gabby has not changed her selfish ways. Dana finally asks Lara out on a date. Also, Shane finally makes amends to her stalker Lacey.\n\n\nSeason 1, Episode 4: Lies, Lies, Lies\nOriginal Air Date: 8 February 2004\nBette greets Tina\\&amp;#039;s pregnancy with apparent delight despite her work problems with the gallery in trying to keep her job. Jenny\\&amp;#039;s continuing lustful relationship with Marina endangers her life with Tim when she visits her old college professor, Nick Barashkov, whom she confides about her involvement with Marina, while Tim thinks Jenny\\&amp;#039;s cheating on him with Nick. Dana\\&amp;#039;s insecurity about her romantic involvement with Lara continues. Also, Alice has mother problems when her irresponsible and pompous actress mother, Lenora, is evicted from her hotel suite and asks to stay with her while she fibs a little about her sagging acting career.\n\n\nSeason 1, Episode 5: Lawfully\nOriginal Air Date: 15 February 2004\nAlice becomes more neurotic after her mother tells her about a \\&amp;#039;tender moment\\&amp;#039; with Shane at a party the night before. Tim finally finds out about Jenny and Marina when he catches both of them \\&amp;#039;in the act.\\&amp;#039; In a desperate attempt to hold onto him, Jenny tries making up with Tim where he tells her to put their love to the ultimate test by traveling to Lake Tahoe and marring in haste. Meanwhile, Dana is invited to a Subaru dinner party that wants to sponsor her tennis career. But she ends up hurting Lara when Dana takes Harrison, her (male) doubles tennis partner instead. Bette and Tina have dinner with Bette\\&amp;#039;s conservative father where they announce Tina\\&amp;#039;s pregnancy. But Melvin Porter\\&amp;#039;s negative reaction dismays both of them. Hurt that he avoided her, Kit offers Bette a little comfort and then confronts Mr. Porter to accept Bette\\&amp;#039;s lifestyle even if he will always disapproves. Also, Shane runs into Clive, an old friend whom is the personal assistant to Harry Sandchuk, a Hollywood bigwig who has come to see Shane\\&amp;#039;s hairstyling work.\n\n\nSeason 1, Episode 6: Losing It\nOriginal Air Date: 22 February 2004\nA rising artist in New York tests Bette\\&amp;#039;s commitment while Tina has an unpleasant run-in with Lei Ling, the sperm donor\\&amp;#039;s girlfriend, who begins to harass her. Alice meets a man named Lisa, who claims to be a \\&amp;#039;lesbian in a man\\&amp;#039;s body\\&amp;#039; whom she asks on a date. Meanwhile, Tim, still distrustful of Jenny after their quickie wedding, returns home alone leaving Jenny on her own. While hitchhiking back to Los Angeles, Jenny gets a ride from two disaffected teenagers, named Malcolm and Marnie, where she confides in them about her troubled life and spends the time writing a long, heartfelt letter to Tim describing her emotional pain. Also, Shane gets a big emotional boost when Harry wants to refer her hairstyling techniques to public celebrities.\n\n\nSeason 1, Episode 7: L\\&amp;#039;Ennui\nOriginal Air Date: 29 February 2004\nAfter returning home, Jenny is hurt when Tim rejects her and tells her to move out. Jenny then goes to Marina who willingly offers her place and they have a great time together. But it all comes to a sudden head when Marina reveals that she has another lover, named Francesca, living in Italy. Meanwhile, Bette and Tina struggle with their fears of parenthood, especially Tina with her pregnancy. Dana\\&amp;#039;s fears about being outed by her endorsement contract with Subaru wrecks her relationship with Lara. Shane throws a party aboard Harry\\&amp;#039;s boat with all her friends in attendance. Alice, fed up with women, tries a relationship with Lisa, who does not turn out to be as expected. Also, Kit is stung when her estranged son, David Waters, doesn\\&amp;#039;t show up for their meeting after thinking that she\\&amp;#039;s fallen off the wagon again.\n\n\nSeason 1, Episode 8: Listen Up\nOriginal Air Date: 7 March 2004\nJenny tries to explain her situation and her confused sexuality to her one-time college roommate, Annette, who suggests they stalk Marina\\&amp;#039;s girlfriend, Francesca, after she arrives in town. Meanwhile, Bette and Tina attend group therapy in preparation of becoming parents while Bette faces off against a militant writer, named Yolanda, who questions Bette\\&amp;#039;s self-image as a mixed race. With her Subaru endorsement contract in full swing, Dana, with Alice in tow, decides to come out to her right-wing parents during a formal ball for Mrs. Fairbanks despite knowing they will not approve. Kit is offered by an agent to help writing a song for rapper Slim Daddy. Also, Shane throws Clive out of her place after seeing him reverting back to his old criminal self when she catches him pilfering items out of her own apartment to support his drug habit.\n\n\nSeason 1, Episode 9: Luck, Next Time\nOriginal Air Date: 14 March 2004\nBette faces serious personal and professional problems when the art gallery comes under attack for it\\&amp;#039;s radical art and Tina buys some expensive baby accessories without consulting her. As Dana starts to find herself as she really is, fame (with complications) finds Shane when she does a hairstyle to a has-been actress, named Cherie Jaffe, who makes a pass a her. Alice finds complications with Lisa and turns to another man, named Andrew. Meanwhile, Jenny is in turmoil when she\\&amp;#039;s more confused then ever about being with Tim or Marina after having an unpleasant dinner with Marina and Francesca who defend their open romance. But Tim refuses to take Jenny back when he tells her that he will never forget, nor forgive, her cheating on him. Also, Kit begins to rehearse for Slim Daddy\\&amp;#039;s music video.\n\n\nSeason 1, Episode 10: Liberally\nOriginal Air Date: 21 March 2004\nTina\\&amp;#039;s grief from her sudden miscarriage is eased when an unexpected opportunity arrives in the form of Oscar, a member of her and Bette\\&amp;#039;s therapy group, who asks her to volunteer at his social insurance office and they find some dirt on Fay Buckley, the fanatically conservative leader of a religious right group who\\&amp;#039;s bent on shutting down Bette\\&amp;#039;s art gallery which leads to a live television debate. Shane\\&amp;#039;s relationship with Cherie becomes complicated when Cherie\\&amp;#039;s unsuspecting husband, Steve, wants to invest in Shane opening up her own hair salon while he asks her to spend time with his emotionally distant teenage daughter, Clea, who also makes a pass at Shane. Marina and Francesca have an argument over Francesca wanting to leave town again for a job. Jenny tries to help Tim whom begins to date Trish, one of his swim team students. Dana also gets a new liberal hairstyle and tries a fling with Jenny, but it doesn\\&amp;#039;t work. Alice worries that she might be pregnant after her flings with Lisa and Andrew. Also, Kit makes her return to the stage during a club party with Slim Daddy.\n\n\nSeason 1, Episode 11: Looking Back\nOriginal Air Date: 28 March 2004\nBette prepares for the gallery\\&amp;#039;s \\&amp;#039;Provocations\\&amp;#039; show and hires Candace, an attractive female contractor and the ex-lover of Yolanda, to handle the set-up. Meanwhile, Tina, Jenny, Shane, Alice and Dana share an eventful road trip to Palm Springs to the Diana Shore Golf Classic for women. While there, they tell their \\&amp;#039;coming out\\&amp;#039; stories, and Alice\\&amp;#039;s mother, Lenora, tags along to her home after an acting job. At the hotel, Dana meets her new manager, Tonya, and both hit it off, while Alice suspects that Tonya is just a grifter. Jenny unloads about her tragic life to some of the attendees, and meets a new lady, named Robin, and both hit it off.\n\n\nSeason 1, Episode 12: Locked Up\nOriginal Air Date: 4 April 2004\nA near-riot at the art gallery lands Bette, Dana, Shane, and Alice in the L.A. county jail, which puts Bette in dangerous proximity to Candace when they share a cell together. Meanwhile, Kit meets Ivan, an auto mechanic and ultra-butch drag king that she finds herself strangely attracted to. Marina contemplates life without Francesca, and beings to flirt with Robin, knowing that she has a dinner date with Jenny. While attending the local aquarium for working on her new book, Jenny meets an attractive marine biologist named Gene, whom she too asks out. As Tim and Jenny discuss divorce, Shane\\&amp;#039;s relationships spin out of control when Clea refuses to take no for an answer to back away. Also, Dana remains oblivious to Tonya\\&amp;#039;s hidden agenda for her.\n\n\nSeason 1, Episode 13: Limb from Limb\nOriginal Air Date: 11 April 2004\nThe \\&amp;#039;Provocations\\&amp;#039; art show finally premieres at the CAC with mixed reviews, while Bette can no longer resist the temptation and begins a sordid fling with Candace. Meanwhile, Marina continues to flirt with Robin despite knowing she\\&amp;#039;s dating Jenny, who begins to have a lustful fling of her own with Gene. Shane\\&amp;#039;s life turns from bad to worse when her attempts to let down Clea easy turns disastrous, and Cherie abandons Shane when their affair is finally discovered which leads to Steve terminating his business arrangement with Shane. Tina finds out about Bette\\&amp;#039;s fling with Candace. Dana loses a friend when her pet cat dies and gains a fiancÃƒ?Ã‚Â©e when Tonya proposes marriage. Also, Kit tries to make sense of Ivan\\&amp;#039;s attention and her reaction to it.","torrent":{"xt":"urn:btih:149537bf7255c642215d1372c9cd596345b59d41","amp;dn":"The+L+Word+-+Season+1+%28gremster%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"149537bf7255c642215d1372c9cd596345b59d41","infoHashBuffer":{"type":"Buffer","data":[20,149,55,191,114,85,198,66,33,93,19,114,201,205,89,99,69,181,157,65]},"announce":[],"urlList":[]}}