{"title":"The Jim Rohn 2004 Weekend Leadership Event","uid":4074623,"size":1964011384,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:151c2a643f4b0f8e9d31cefbf58dde8292bc000a&amp;dn=The+Jim+Rohn+2004+Weekend+Leadership+Event&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":9,"uploader":"prince213","files":250,"time":1205241321,"description":"Product Details\n\n* Format: MP3 @ 192kbps\n* Source: Audio CD\n* Author: Jim Rohn, Denis Waitley, Brian Tracy\n* Narrator: Jim Rohn, Denis Waitley, Brian Tracy\n* Publisher: Jim Rohn International\n* Running Time: ~ 24 Hrs.\n\nProduct Description\n\nDay One Jim Rohn - Success Equations and Personal Development Denis Waitley - Leadership in Action - How to Outthink, Outperform, Outserve and Outlast the Competition VIP Lunch (Platinums) - Q and A with Jim Rohn and Denis Waitley Jim Rohn - Communication and The Art of Persuasion Special Teenager Session - The Winning Generation: Why Now is the Best Time in History To Be a Teenager in This or Any Country, hosted by Denis Waitley, Jim Rohn and Chris Widener Day Two VIP Breakfast ? Vic Johnson shares on &quot;No Dream Too Big&quot; including Lessons learned from John Goddard, the &quot;real-life Indiana Jones&quot;. (TC, Donna and Chris): TC Cummings - Overcoming Self-Imposed Limitations, Donna Krech - The Victory Principle and Chris Widener - Secrets of Influence Brian Tracy - Getting Rich Your Way: Learn How Millions of Americans Go From Rags to Riches in One Generation, Starting with Nothing VIP Lunch (Platinums) - Q and A with Jim Rohn and Brian Tracy Jim Rohn - Goals Workshop, Designing the Next Ten Years Jim Rohn - Financial Independence Jim Rohn - Leadership, Touching Others Lives Day Three Bonus Day - Open to All Attendees Robert Helms - Real Equity Jerry Clark - Magic of Colors, Gain Instant Rapport with Those You Meet and Get New Skills that Will Help You Effectively Lead Thousands Charlie ?Tremendous? Jones - Life is Tremendous! Speakers Roundtable ? Q &amp; A featuring Jim Rohn, Denis Waitley, Brian Tracy, Charlie ?Tremendous? Jones, Donna Krech, Jerry Clark and Vic Johnson - Plus Audience Participation Plus 9 bonus, behind the scenes, 30 minute one-on-one interviews with Brian Tracy, Denis Waitley, Chris Widener, Jerry Clark, Vic Johnson, Donna Krech, Charlie &quot;Tremendous&quot; Jones and TC Cummings.\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:151c2a643f4b0f8e9d31cefbf58dde8292bc000a","amp;dn":"The+Jim+Rohn+2004+Weekend+Leadership+Event","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"151c2a643f4b0f8e9d31cefbf58dde8292bc000a","infoHashBuffer":{"type":"Buffer","data":[21,28,42,100,63,75,15,142,157,49,206,251,245,141,222,130,146,188,0,10]},"announce":[],"urlList":[]}}