{"title":"AB de Villiers:The Autobiography (Exclusive) (2016) (EPUB)[WWRG]","uid":15951501,"size":3795644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:152778e8724c497605ca113b38f7575d22a41198&amp;dn=AB+de+Villiers%3AThe+Autobiography+%28Exclusive%29+%282016%29+%28EPUB%29%5BWWRG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":6,"uploader":"Lion.King","files":3,"time":1475571663,"description":"[center][b]\r\n\r\n\r\nThe Autobiography of One of the World's Finest Ever Batsman.\r\n\r\n'AB has become the most valuable cricketer on the planet' Adam Gilchrist\r\n\r\nAB de Villiers is one of the finest batsmen ever to play cricket, and yet his achievement extends beyond his outrageous armoury of drives, pulls, paddles, scoops and flicks.\r\n\r\nWhether he is delighting home crowds at the Wanderers or Newlands or setting new records in Bengaluru or Sydney, he plays the game in a whole-hearted manner that projects a positive image of his country around the world, and also makes millions of South Africans feel good about themselves.\r\n\r\nThis is AB's story, in his own words. The story of the youngest of three talented, sports-mad brothers growing up in Warmbaths, of a boy who excelled at tennis, rugby and cricket, of a youngster who made his international debut at the age of twenty and was then selected in every single test played by South Africa for the next eleven seasons, of a batsman who has started to redefine the art, being ranked among the world's very best in test, ODI and T20.\r\n\r\nThrough all the pyrotechnics and consistency, AB de Villiers has remained a true sportsman - quick to deflect praise, swift to praise opponents, eager to work hard, to embrace the team's next challenge and to relish what he still regards as the huge privilege of representing his country.\r\n\r\nThis is the story of a modern sporting phenomenon.\r\n\r\n\r\n\r\n[img]http://extraimago.com/images/2016/07/31/WWRG-Globe-4.png[/img][/center]","torrent":{"xt":"urn:btih:152778e8724c497605ca113b38f7575d22a41198","amp;dn":"AB+de+Villiers%3AThe+Autobiography+%28Exclusive%29+%282016%29+%28EPUB%29%5BWWRG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"152778e8724c497605ca113b38f7575d22a41198","infoHashBuffer":{"type":"Buffer","data":[21,39,120,232,114,76,73,118,5,202,17,59,56,247,87,93,34,164,17,152]},"announce":[],"urlList":[]}}