{"title":"Hero Generations v1.17","uid":11856287,"size":58837648,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:156b17bdc00c8a524f30e8b046066ad527d9a839&amp;dn=Hero+Generations+v1.17&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"dauphong","files":1,"time":1430162415,"description":"Version 1.17 Change List\nWhen in a space with items on the ground, and your hands are full, a new UI will appear on the sidebar below your character that will show all items in the space. You can click on any of the &quot;Items on Ground&quot; buttons to swap the specific item with the last item in your hand. There is a maximum of 4 items allowed on the ground in a single space\n    Traits Full UI improved: The message that appears when you get a new trait when you trait slots are full is more user friendly. The message displays the function of the new trait you learned, the existing trait buttons now have roll-over tool-tips, and the &quot;continue&quot; button has had its text changed to &quot;Pass&quot; to clarify its function.\n    The Volcano Boss (Demon) will now appear appropriately, as well as its associated quest.\n    The Monolith offering bowls now function properly. Also fixed a memory leak associated with this bug.\n    The Monolith clock timer text now updates immediately upon entering the area, not after 1 move.\n    Other nodes also fixed to update their visuals immediately on loading an area.\n    Minor bug with ESC menu fixed.\n    Minor bug where some buttons could be hit during transition to menu fixed","torrent":{"xt":"urn:btih:156b17bdc00c8a524f30e8b046066ad527d9a839","amp;dn":"Hero+Generations+v1.17","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"156b17bdc00c8a524f30e8b046066ad527d9a839","infoHashBuffer":{"type":"Buffer","data":[21,107,23,189,192,12,138,82,79,48,232,176,70,6,106,213,39,217,168,57]},"announce":[],"urlList":[]}}