{"title":"How to Grow a Novel - Sol Stein.pdf","uid":11311876,"size":3149467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1592d63b129af09e7b3ed1a14f913e808e9e7506&amp;dn=How+to+Grow+a+Novel+-+Sol+Stein.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1414517761,"description":"Each year thousands of fiction writers, from beginners to bestselling author, benefit from Sol Stein's sold-out workshops, featured appearances at writers' conferences, software for writers, on-line columns, and his popular first book for writers, Stein on Writing. Stein practices what he teaches: He is the author of nine novels, including the million-copy bestseller The Magician, as well as editor of such major writers as James Baldwin, Jack Higgins, Elia Kazan, Budd Schulberg, W. H. Auden, and Jacques Barzun, and the teacher and editor of several current bestselling authors. What sets Stein apart is his practical approach. He provides specific techniques that speed writers to successful publication.\n\nHow to Grow a Novel is not just a book, but an invaluable workshop in print. It includes details and examples from Stein's editorial work with a #1 bestselling novelist as well as talented newcomers. Stein takes the reader backstage in the development of memorable characters and fascinating plots. The chapter on dialogue overflows with solutions for short-story writers, novelists, screenwriters, and playwrights. Stein shows what readers are looking for-- and what they avoid-- in the experience of reading fiction. The book offers guidelines-- and warnings-- of special value for nonfiction writers who want to move into fiction. Stein points to the little, often overlooked things that damage the writer's authority without the writer knowing it. And this book, like no other writing book, takes the reader behind the scenes of the publishing business as it affects writers of every level of experience, revealing the hard truths that are kept behind shut doors","torrent":{"xt":"urn:btih:1592d63b129af09e7b3ed1a14f913e808e9e7506","amp;dn":"How+to+Grow+a+Novel+-+Sol+Stein.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1592d63b129af09e7b3ed1a14f913e808e9e7506","infoHashBuffer":{"type":"Buffer","data":[21,146,214,59,18,154,240,158,123,62,209,161,79,145,62,128,142,158,117,6]},"announce":[],"urlList":[]}}