{"title":"Effective Java 2nd Edition (May 2008)","uid":4244204,"size":2129188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15ce9970cb0bccb78de4f4eeaa10ab3fe3108ea4&amp;dn=Effective+Java+2nd+Edition+%28May+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"fransfl","files":1,"time":1213710884,"description":"The new book from Joshua Bloch!\n\n\nFrom amazon.com:\n\n&quot;Are you looking for a deeper understanding of the Java? programming language so that you can write code that is clearer, more correct, more robust, and more reusable? Look no further! Effective Java?, Second Edition, brings together seventy-eight indispensable programmer?s rules of thumb: working, best-practice solutions for the programming challenges you encounter every day.\n\n \n\nThis highly anticipated new edition of the classic, Jolt Award-winning work has been thoroughly updated to cover Java SE 5 and Java SE 6 features introduced since the first edition. Bloch explores new design patterns and language idioms, showing you how to make the most of features ranging from generics to enums, annotations to autoboxing.\n\n \n\nEach chapter in the book consists of several ?items? presented in the form of a short, standalone essay that provides specific advice, insight into Java platform subtleties, and outstanding code examples. The comprehensive descriptions and explanations for each item illuminate what to do, what not to do, and why.\n\n \n\nHighlights include:\n\n    *\n      New coverage of generics, enums, annotations, autoboxing, the for-each loop, varargs, concurrency utilities, and much more\n    *\n      Updated techniques and best practices on classic topics, including objects, classes, libraries, methods, and serialization\n    *\n      How to avoid the traps and pitfalls of commonly misunderstood subtleties of the language\n    *\n      Focus on the language and its most fundamental libraries: java.lang, java.util, and, to a lesser extent, java.util.concurrent and java.io\n\nSimply put, Effective Java?, Second Edition, presents the most practical, authoritative guidelines available for writing efficient, well-designed programs.&quot;","torrent":{"xt":"urn:btih:15ce9970cb0bccb78de4f4eeaa10ab3fe3108ea4","amp;dn":"Effective+Java+2nd+Edition+%28May+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15ce9970cb0bccb78de4f4eeaa10ab3fe3108ea4","infoHashBuffer":{"type":"Buffer","data":[21,206,153,112,203,11,204,183,141,228,244,238,170,16,171,63,227,16,142,164]},"announce":[],"urlList":[]}}