{"title":"Zaxwerks ProAnimator 7.0.0 (plugin After Effects) [ChingLiu]","uid":9251720,"size":51058446,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:163f8ce0ab6afeea062c5c87df6048a1f076375f&amp;dn=Zaxwerks+ProAnimator+7.0.0+%28plugin+After+Effects%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"Ching_Liu","files":-1,"time":1385476031,"description":"ProAnimator comes in two forms: as a standalone application and as an After Effects plug-in. Both products act exactly the same, but the plug-in is integrated into Adobe After Effects, so you can do all of your authoring with After Effects. The standalone application doesn't require a host product, so you may generate your animated movies independent of any particular target. You may even import a standalone ProAnimator scene into the ProAnimator plug-in (or vice versa) for added flexibility.\n\nProAnimator includes all of the powerful 3D content creation tools as the 3D Invigorator PRO product. It also contains a next generation animation system that can be used to quickly generate complex animations that would take hours to create in other 3D applications.\n\nLighting Set-Up\nRay Trace Reflectivity and Shadows\nObject Fragmentation\nAutomatic Object Creation\nRefraction (Glass, Ice, Water Materials)\nGrid Shader\nCustomizable Workspaces\nRealtime Drawing Tools\nObject List\n3D Text Creation\n3D Text Substitution\nLathe Objects\nImport/Export Objects\nMotion Blur\nParenting &amp; Tracking AE's 3D Objects\nGradient &amp; Noise Editor\nObject Deformation &amp; Warping\nMapping Techniques\nHighlight Mapping\nWireframe and Hidden Line Rendering\nFresnel Coloring\nCartoon Coloring\nAbsolute Coloring\nMatte Coloring\nShadow Catcher Rendering\n\nNew in Version 7.0.0 - Major Release:\n\n* Compatible with After Effects CS5, CS5.5, CS6 and After Effects CC\n\n* Compatible with Windows Vista, Windows 7, Windows 8 / OSX 10.6.8 or above and Intel Mac Only\n\n* Lighting\n- Light Tracks &amp; Light Actions - Create your own lighting animations using the familiar Pose and Transition system.\n- Use Light Brightness Actions to set up light animations where lights fade, blink, pulse, or flicker on and off.\n- Light Rotation Actions can be used where lights rotate randomly such as in a concert, bar or club.\n- Light Color Actions create light color animations without use of keyframes.\n- Advanced lighting controls tracks lights objects, camera and more.\n- Use Fan controls for lights to fan out, or converge at a point.\n- Work with Parallel, Point or Spot lights to create a realistic 3D environment.\n- Lighting Fixtures - Dozens of lighting fixture presets.\n- Variety of Trusses and Pipes - Create complex trusses such as box, triangular, rectangle trusses, or laced and ring pipes with a click of a button.\n- Lens Flares - Dozens of Lighting Flares can be used for any lighting effect. Contains a wide variety of flares to use for professional stage effects.\n- Flare Editor. This lets you create extremely realistic glows and spikes to produce the perfect flare for your scene.\n- Light Cones - Customize your light with dozens of different beams such as hard, soft, smooth, wash, and many other moody lights.\n- Lighting Rigs - Use lighting rigs to instantly add stage elements to your project.\n\n* Gorgeous Photo-Realistic Materials - Over a hundred highly detailed, seamless materials.\n\n* Newly Designed Interface - Re-designed buttons and easier to read text.\n- Auto-Save - The Auto-Save feature automatically saves your project so you have a backup of your file as you're working.\n- Increment and Save - Automatically increments your save file so you have multiple versions of your project file as a back-up.\n\nSystem Requirements\n\n- Host: Adobe After Effects CS5 - CS6 and After Effects CC.\n- Pentium 4 or better\n- Windows Vista, Windows 7 or Windows 8\n- A video card that supports floating point calculations.\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://zaxwerks.com/proanimatorae/index.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://zaxwerks.com/proanimatorae/index.shtml&lt;/a&gt;","torrent":{"xt":"urn:btih:163f8ce0ab6afeea062c5c87df6048a1f076375f","amp;dn":"Zaxwerks+ProAnimator+7.0.0+%28plugin+After+Effects%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"163f8ce0ab6afeea062c5c87df6048a1f076375f","infoHashBuffer":{"type":"Buffer","data":[22,63,140,224,171,106,254,234,6,44,92,135,223,96,72,161,240,118,55,95]},"announce":[],"urlList":[]}}