{"title":"No Man's Sky (Patch 2.3.0.5) (GOG)","uid":15621024,"size":24291843,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:16a94a97e947adaeac1fb474cece60914ec23eb2&amp;dn=No+Man%27s+Sky+%28Patch+2.3.0.5%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"mercs215","files":2,"time":1471879623,"description":"Install instructions:\r\n- Run &quot;patch_no_mans_sky_2.3.0.5.exe&quot;\r\n- Play\r\nCredits: This release was made possible by Swapware Games Network!\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nChange log:\r\nPatch 3 \r\n- Patch 3 is targeted at our next most common support requests, fixing the next most common crashes, as well as trying to help players who have become stranded or have corrupted their save files. \r\n\r\nStranded in Space Station \r\n- If you died in your ship while in atmosphere of a planet with a damaged ship, you could respawn in a space station with your launch thrusters and pulse engine damaged. If you did not have the resources to fix them then you could no longer take off and be stuck there. This will no longer happen. \r\n\r\nLoading Corrupted Save Files \r\n- Some players have corrupted save files, we’ve been working with them to still load saves even if they are corrupted (this can happen for many reasons outside of the games control). This fix has allowed many players to still load their save even if they have become corrupt on PC. \r\n- Crash fixes for next three most commonly reported issues: \r\n- As the player gathers a huge amount of discoveries, there was a threading issue that becomes more prevalent the more discoveries you have, and could cause the game to crash. \r\n- If you had collected a large number of blueprints, in a specific order it was possible to crash the game when you - received a new blueprint. This has been fixed. \r\n- Players who set a large number of waypoints could find themselves in a situation where they could crash the game in the Galactic Map, this is remedied now (PS. A better waypoint system is coming)","torrent":{"xt":"urn:btih:16a94a97e947adaeac1fb474cece60914ec23eb2","amp;dn":"No+Man%27s+Sky+%28Patch+2.3.0.5%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16a94a97e947adaeac1fb474cece60914ec23eb2","infoHashBuffer":{"type":"Buffer","data":[22,169,74,151,233,71,173,174,172,31,180,116,206,206,96,145,78,194,62,178]},"announce":[],"urlList":[]}}