{"title":"NewBlueFX Video Essentials VI for Sony Vegas Pro 13 [ChingLiu]","uid":10084264,"size":36071626,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:16b27ce6a6656276b6877f084ce18c34ef941837&amp;dn=NewBlueFX+Video+Essentials+VI+for+Sony+Vegas+Pro+13+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1399069171,"description":"Chroma Key Pro\n\nGives you a fast and powerful color key in seconds with options for garbage mattes, outlines and shadows. This individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nColor Replace\n\nAllows shadows, textures, and gradients to be visible when changing from one specific color to another. This individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nCut Away\n\nMagnifies a segment of your picture for emphasis with options for various shapes and outlines. This individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nGarbage Matte\n\nAdds a fast and convenient matte in your effects chain to expand your creative flexibility. This individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nPicture Grid\n\nCreates a grid system to snap your images into place so you're able to align multi-track picture-in-picture in no time. This individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nPicture-in-Shape\n\nFits your overlay image within a flexible four-point mask complete with drop shadow and outline. The individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nSaturation EQ\n\nSeparates the color spectrum into eight distinct saturations so pushing or pulling any color is effortless. This individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nSaturation Modifier\n\nSeparates your image into over and under saturated regions so you have distinct control over each. This individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nSelective Touch Up\n\nSmooth's specific regions in your image to remove subtle imperfections while retaining strong detail. This individual plugin is part of the Video Essentials VI collection in the eFX series.\n\nTile\n\nReplicates your picture into a video wall with variations of color, brightness, blur, saturation, and more. This individual plugin is part of the Video Essentials VI collection \n\nRecommended System Requirements\n\n-MicrosoftÂ® WindowsÂ® XP (SP 3 or later)\n-Windows VistaÂ® (SP 2 or later), or Windows 7\n-Mac OS X v 10.6.8, v10.7.2 or later\n-1 GHz processor (multicore or multiprocessor CPU recommended for HD)\n-OpenGL 2.1-capable graphics card and minimum 256MB graphics memory.\n-512MB or higher recommended for HD.*\n-200 MB hard-disk space for installation\n-1 GB RAM (2 GB RAM recommended for HD)\n\n*nVidia GeForce or Quadro card that supports CUDA with driver 285.62 or newer, AMD/ATI Radeon HD 2400 or better with Catalyst 11.11 or newer, Intel HD is not supported.\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.newbluefx.com/products/essential-tools/video-essentials-6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.newbluefx.com/products/essential-tools/video-essentials-6&lt;/a&gt;","torrent":{"xt":"urn:btih:16b27ce6a6656276b6877f084ce18c34ef941837","amp;dn":"NewBlueFX+Video+Essentials+VI+for+Sony+Vegas+Pro+13+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b27ce6a6656276b6877f084ce18c34ef941837","infoHashBuffer":{"type":"Buffer","data":[22,178,124,230,166,101,98,118,182,135,127,8,76,225,140,52,239,148,24,55]},"announce":[],"urlList":[]}}