{"title":"The Grammar Book Teacher's Course, Second Edition[A4]","uid":8747000,"size":26923849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16ba10b08eb2cf8d80cd5f75b0424db3b90eb2d1&amp;dn=The+Grammar+Book+Teacher%27s+Course%2C+Second+Edition%5BA4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"AUDI-A4","files":1,"time":1374945420,"description":"Book Description\n\nPublication Date: July 24, 1998 | ISBN-10: 0838447252 | ISBN-13: 978-0838447253 | Edition: 2\nIn this highly acclaimed revision, grammatical descriptions and teaching suggestions are organized into sections dealing with Form, Meaning, and Use. The Grammar Book, 2/e helps teachers and future teachers grasp the linguistic system and details of English grammar, providing more information on how structures are used at the discourse level.\n\nEditorial Reviews\nAbout the Author\nMarianne Celce-Murcia is professor emerita of applied linguistics at the University of California, Los Angeles.\n\nDiane Larsen-Freeman is Professor of Education, Professor of Linguistics, and Director of the English Language Institute at the University of Michigan, Ann Arbor. She is also a Distinguished Senior Faculty Fellow at the School for International Training in Brattleboro, Vermont. Dr. Larsen-Freeman has been a conference speaker in over 50 countries of the world and has published over 100 articles in her areas of interest. Her Thomson/Heinle books include The Grammar Book: An ESL/EFL Teacher's Course (1999; co-authored with Marianne Celce-Murcia), From Grammar to Grammaring (2003) and the fourth edition of Grammar Dimensions: Form, Meaning, and Use (forthcoming, Series Director). From 1980-1985, Dr. Larsen-Freeman was Editor of the journal Language Learning. In 1997, Dr. Larsen-Freeman was inducted into the Vermont Academy of Arts and Sciences. In 1999, she was selected by ESL Magazine as one of &quot;the ESL pioneers&quot;. In 2000, she received the lifetime achievement award from Heinle &amp; Heinle Publishers.\n\nProduct Details\nHardcover: 854 pages\nPublisher: Heinle ELT; 2 edition (July 24, 1998)\nLanguage: English\nISBN-10: 0838447252\nISBN-13: 978-0838447253\nProduct Dimensions: 1.4 x 7.2 x 10.1 inches\nShipping Weight: 3.2 pounds (View shipping rates and policies)\nAverage Customer Review: 4.6 out of 5 stars See all reviews","torrent":{"xt":"urn:btih:16ba10b08eb2cf8d80cd5f75b0424db3b90eb2d1","amp;dn":"The+Grammar+Book+Teacher%27s+Course%2C+Second+Edition%5BA4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16ba10b08eb2cf8d80cd5f75b0424db3b90eb2d1","infoHashBuffer":{"type":"Buffer","data":[22,186,16,176,142,178,207,141,128,205,95,117,176,66,77,179,185,14,178,209]},"announce":[],"urlList":[]}}