{"title":"Can't Hardly Wait(1998)DVDRip.AC3(ENG)-DROCK","uid":6172248,"size":734466285,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:16c4ea2155c3abea614233cbac2ff90e2762afde&amp;dn=Can%5C%27t+Hardly+Wait%281998%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"drock232","files":-1,"time":1297627452,"description":"After the Huntington Hills High graduation ceremony, the fun gets underway at the graduation party where an assortment of jocks, geeks, prom queens, bimbos, headbangers, and nerdy misfits unload four years' worth of emotional baggage at a house where the hostess (Michelle Brookhurst) loses control of her guests. Writer wannabe Preston Meyers (Ethan Embry) has been in love with Amanda (Jennifer Love Hewitt of Party of Five) since the first time he saw her during their freshman year. His tormented infatuation with Amanda has intensified throughout high school and culminates at the party, where Preston must now seize this final opportunity to proclaim his love for her before he leaves the next day for Boston. Preston decides to make his move at some point during the party, a particularly auspicious occasion since Amanda has just been dumped by her super-jock boyfriend, Mike Dexter (Peter Facinelli), who wanted freedom to pursue his testosterone-charged fantasies with college women. Cringing at this ludicrous love triangle is Preston's introverted pal and confidante, Denise Fleming (Lauren Ambrose). When Denise runs into her ex-childhood friend Kenny (Seth Green), the two begin sexual experimentation behind the closed bathroom door. Geeky science-fiction fan William Lichter (Charlie Korsmo) devises a plan to ruin Mike's stud reputation and publicly humiliate him and his meathead buddies -- sweet revenge for four years of agony. Former Huntington Hills graduate Trip McNieley (Jerry O'Connell) tells Mike about the terror awaiting in college where &quot;Guys like us are a dime a dozen.&quot; Yearbook Girl (Melissa Joan Hart of Sabrina, the Teenage Witch) wants everyone to sign her cherished volume of memories as the partying teens attempt to move into the uncertain future. Party house exteriors were shot on Rubio Street in Altadena, California, and other California locations included Johnnie's Broiler in downtown Downey, Dutton's Book Store in Reseda, Marshall High School in Los Feliz, and Union Station in LA. With more than 70 speaking parts, this film is the directorial debut of the scriptwriting team of Deborah Kaplan and Harry Elfont.\n\nRipped with Handbrake.","torrent":{"xt":"urn:btih:16c4ea2155c3abea614233cbac2ff90e2762afde","amp;dn":"Can%5C%27t+Hardly+Wait%281998%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16c4ea2155c3abea614233cbac2ff90e2762afde","infoHashBuffer":{"type":"Buffer","data":[22,196,234,33,85,195,171,234,97,66,51,203,172,47,249,14,39,98,175,222]},"announce":[],"urlList":[]}}