{"title":"Mikhail Bulgakov - The Master and Margarita (1997)","uid":8567954,"size":618541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16ee9cc2ed9e34f5e78e171eba4a8795545ea955&amp;dn=Mikhail+Bulgakov+-+The+Master+and+Margarita+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"workerbee","files":-1,"time":1371067245,"description":"Mikhail Bulgakov - The Master and Margarita, translated from the Russian by Richard Pevear and Larissa Volokhonsky (Penguin, 1997).\n\nISBN: 9780140455465 | 432 pages | EPUB\n\n\nThe Master and Margarita, Mikhail Bulgakov's masterpiece, is a fiercely satirical fantasy that remained unpublished in its author's home country for over thirty years. This new edition is translated with an introduction by Richard Pevear and Larissa Volokhonsky, the acclaimed translators of Tolstoy's Anna Karenina.\n\nIn Soviet Moscow, God is dead, but the devil -- to say nothing of his retinue of demons, from a loudmouthed, gun-toting tomcat, to the fanged fallen angel Koroviev -- is very much alive. As death and destruction spread through the city like wildfire, condemning Moscow's cultural elite to prison cells and body bags, only a madman, the Master, and Margarita, his beautiful, courageous lover, can hope to end the chaos. Written in secret during the darkest days of Stalin's reign and circulated in samizdat form for decades, when The Master and the Margarita was finally published it became an overnight literary phenomenon, signalling artistic freedom for Russians everywhere.\n\nThis luminous translation from the complete and unabridged Russian text is accompanied by an introduction by Richard Pevear exploring the extraordinary circumstances of the novel's composition and publication, and how Bulgakov drew on carnivalesque folk traditions to create his ironic subversion of Soviet propaganda. This edition also contains a list of further reading and a note on the text.\n\n\nReview\n\n&quot;One of the great novels of the 20th century, a scary, darkly comic allegory.&quot; -- Daily Telegraph\n","torrent":{"xt":"urn:btih:16ee9cc2ed9e34f5e78e171eba4a8795545ea955","amp;dn":"Mikhail+Bulgakov+-+The+Master+and+Margarita+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16ee9cc2ed9e34f5e78e171eba4a8795545ea955","infoHashBuffer":{"type":"Buffer","data":[22,238,156,194,237,158,52,245,231,142,23,30,186,74,135,149,84,94,169,85]},"announce":[],"urlList":[]}}