{"title":"My Turn - Hillary Clinton Targets the Presidency EPUB MOBI AZW3","uid":15878355,"size":1049816,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17017a05f03bd70f003cae0dd069021d7293e670&amp;dn=My+Turn+-+Hillary+Clinton+Targets+the+Presidency+EPUB+MOBI+AZW3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"nosnavis","files":3,"time":1474557414,"description":"By Doug Henwood\r\nEPUB MOBI AZW3 \r\n\r\nHillary Clinton is running for the presidency with a message of hope and change. But, as Doug Henwood makes clear in this concise, devastating indictment, little trust can be placed in her campaign promises. Rigorously reviewing her record, Henwood shows how Clinton's positions on key issues have always blown with the breeze of expediency, though generally around an axis of moralism and hawkishness. Without a meaningful program other than a broad fealty to the status quo, Henwood suggests, &quot;the case for Hillary boils down to this: she has experience, she's a woman, and it's her turn.&quot; &quot;My Turn is compulsively good reading-not only for its glimpse into Hillary Clinton's mind but for its insights into the entire Clinton political-philanthropic machine. Doug Henwood is both smart and-almost uniquely for this campaign season-sane.&quot; -Barbara Ehrenreich, author of Nickel and Dimed &quot;Doug Henwood sums up the argument against Ms. Clinton well.&quot; -New York Observer &quot;Doug Henwood... twisted the facts to argue that Hillary was a corporatist wolf in sheep's clothing.&quot; -David Brock &quot;I represented Wall Street, as a senator from New York.&quot; -Hillary Clinton, October 2015, during the first Democratic TV debate","torrent":{"xt":"urn:btih:17017a05f03bd70f003cae0dd069021d7293e670","amp;dn":"My+Turn+-+Hillary+Clinton+Targets+the+Presidency+EPUB+MOBI+AZW3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17017a05f03bd70f003cae0dd069021d7293e670","infoHashBuffer":{"type":"Buffer","data":[23,1,122,5,240,59,215,15,0,60,174,13,208,105,2,29,114,147,230,112]},"announce":[],"urlList":[]}}