{"title":"Standup Comedy - Daniel Tosh - True Stories I Made Up (2005)","uid":4319893,"size":47570186,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:172a7e0229960c30c5f093e782e97c400a2df8a4&amp;dn=Standup+Comedy+-+Daniel+Tosh+-+True+Stories+I+Made+Up+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"rambam1776","files":17,"time":1217371834,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nDANIEL TOSH ? TRUE STORIES I MADE UP\n\nBiography\tby David Jeffries\nSharp, snide, and just about as wicked as they come, standup comedian Daniel Tosh&amp;#039;s sardonic material and the casual way it&amp;#039;s delivered has made him a college favorite and a frequent guest of the Comedy Central television network. Born in Germany but raised in Florida, Tosh is the son of a preacher, a fact that shocks nearly everyone who has encountered his edgy and flippant act. In Miami, Tosh created and hosted the late-night television show Tens, where he would interview and mock the numerous models who inhabit the city&amp;#039;s South Beach area. After touring the comedy club circuit, a successful performance at the prestigious Just for Laughs International Comedy Festival in Montreal introduced him to the big time. He was soon appearing at comedy festivals as far away as New Zealand and Kilkenny, Ireland, and averaging 100 college campus performances a year. He made his first appearance on The Late Show with David Letterman in 2001 and a year later was hosting his first standup special, Comedy Central Presents Daniel Tosh. In 2005 the cable network&amp;#039;s record label released his debut, the CD/DVD combo True Stories I Made Up. \n\n\nReview\tby David Jeffries\nTake the rapid wit of Dane Cook and trade his hyper-cockiness for dry wickedness and you&amp;#039;ve got Daniel Tosh, which is by all means a compliment. Tosh matches Cook&amp;#039;s ability to spit wry crassness, but he&amp;#039;s more absurd and complex. Much of his material hits two to three seconds after the fact, partly because it takes awhile to unravel and partly because of the &quot;I can&amp;#039;t believe he just said that&quot; factor. The title True Stories I Made Up is the least witty thing about this package, but it references a core routine, &quot;Fictitious Disorder,&quot; that will one day be thought of as trademark Tosh. The comedian explains how living in denial is easier than reality on the track, and goes off on a long series of made-up stories that connect. It&amp;#039;s the brilliant, standup equivalent of a Rube Goldberg machine, but Tosh&amp;#039;s less obtuse, blunter, edgier, and crueler side is just as funny. Suggesting athletes should be pumped with steroids because he has a high-def TV and wants his sports like his video games (&quot;Who cares if you die at 40, you hate life after sports anyway. I&amp;#039;m doing you a favor&quot;) or drawing comparisons between the Abu Ghraib prison and the world of baby photographer Anne Geddes is sick and downright startling when delivered so casually by the comedian. In a lot of ways he juggles and alienates the audience in an Andy Kaufman style but without breaking the rules of standup. It&amp;#039;s exciting and subversive and you only need to gauge the audience reaction captured on the disc to see how effective it is. At first they are quiet, probably creeped out, but by the end of the disc they&amp;#039;re guffawing. The bonus DVD from his 2002 Comedy Central special is less interesting, either because Tosh hasn&amp;#039;t matured his act to the sharpness of the audio portion or because the network&amp;#039;s censors shaved off the more risky and rewarding material. It&amp;#039;s a letdown, but the audio portion of the set is one sick, twisted, and hilarious stunner of a debut. \nTracks\n \t\t \n\t \t\t \n&quot;Fictitious Disorder&quot; ? 3:55 \n&quot;Mind of a Sleeping Man&quot; ? 2:52 \n&quot;Dream Small, the Disappointment Hurts Less&quot; ? 3:38 \n&quot;America the Augmented&quot; ? 8:21 \n&quot;Gaunt and Sexy&quot; ? 5:44 \n&quot;Hollywood Made Me Queer&quot; ? 4:23 \n&quot;Enlightened Garbage&quot; ? 5:10 \n&quot;I Heart Dave&quot; ? 2:44 \n&quot;The Coprophagia Diet&quot; ? 7:41 \n&quot;Please Light Me&quot; ? 5:02 \n\t\n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:aiftxqedldae&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:aiftxqedldae&lt;/a&gt;\n","torrent":{"xt":"urn:btih:172a7e0229960c30c5f093e782e97c400a2df8a4","amp;dn":"Standup+Comedy+-+Daniel+Tosh+-+True+Stories+I+Made+Up+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"172a7e0229960c30c5f093e782e97c400a2df8a4","infoHashBuffer":{"type":"Buffer","data":[23,42,126,2,41,150,12,48,197,240,147,231,130,233,124,64,10,45,248,164]},"announce":[],"urlList":[]}}