{"title":"Marvels 00-04 (1994|Digital|AnPymGold)","uid":9849192,"size":465658099,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:17dd052d2c3ceaa7aab2ac1aa3ccf85cbb6b7a81&amp;dn=Marvels+00-04+%281994%7CDigital%7CAnPymGold%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1396126998,"description":"This enormously successful and multiple Eisner Award-winning limited series cemented Kurt Busiek's reputation as a talented writer and put the astonishing artistic talents of Alex Ross on the map. With stunning detail, the stories contained in these issues harken back to a simpler time in the Marvel universe, when the superheroes first began appearing - and reshaped the fortune of so many forever. Promotional info from Amazon - &quot;Welcome to New York. Here, burning figures roam the streets, men in brightly colored costumes scale the glass and concrete walls, and creatures from space threaten to devour our world. This is the Marvel Universe, where the ordinary and fantastic interact daily. This is the world of MARVELS.&quot;\n\nWikipedia summary - &quot;Set from 1939 to 1974, the series examines the Marvel Universe, the collective setting of most of Marvel's superhero series, from the perspective of an Everyman character: news photographer Phil Sheldon. The street-level series portrayed ordinary life in a world full of costumed supermen, with each issue featuring events well known to readers of Marvel comics as well as a variety of minute details and retelling the most famous events in the Marvel universe.&quot;\n\nThese awesome new digital copies are courtesy of AnPymGold, thanks to them for their hard work and as always, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:17dd052d2c3ceaa7aab2ac1aa3ccf85cbb6b7a81","amp;dn":"Marvels+00-04+%281994%7CDigital%7CAnPymGold%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17dd052d2c3ceaa7aab2ac1aa3ccf85cbb6b7a81","infoHashBuffer":{"type":"Buffer","data":[23,221,5,45,44,60,234,167,170,178,172,26,163,204,248,92,187,107,122,129]},"announce":[],"urlList":[]}}