{"title":"True Romance DVDRip DivX","uid":4127648,"size":735233459,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:181297af582eeb9b161667ee32bf7024e00ec231&amp;dn=True+Romance+DVDRip+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"circlensess","files":3,"time":1207868587,"description":"Plot Outline: Clarence marries hooker Alabama, steals cocaine from her pimp, and tries to sell it in Hollywood, while the owners of the coke try to reclaim it.\nChristian Slater&amp;#039;s wardrobe however, steals the show.\nStealing, Cheating, Killing. Who said romance is dead? \n\n\n701 MB (or 717,924 KB or 735,154,176 bytes)\n02:00:22 (173,149 fr)\nDivX 4 (OpenDivX)\nVideo Bitrate: 680 kb/s\nFPS: 23.976 fps\n576x240 (2.40:1) [=12:5]\nAudio..: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 128 kb/s (64/ch, stereo) CBR 48000 Hz\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0108399/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0108399/&lt;/a&gt;\n\n\n\nCast (Cast overview, first billed only)\t\n         Christian Slater\t... \tClarence Worley\n\tPatricia Arquette\t... \tAlabama Whitman\n\tMichael Rapaport\t... \tDick Ritchie\n\tVal Kilmer\t... \tElvis, Mentor\n\tBronson Pinchot\t... \tElliot Blitzer\n\tDennis Hopper\t... \tClifford Worley\n\tGary Oldman\t... \tDrexl Spivey\n\tBrad Pitt\t... \tFloyd\n\tTom Sizemore\t... \tCody Nicholson\n\tChristopher Walken\t... \tVincenzo Coccotti\n\tSamuel L. Jackson\t... \tBig Don\n\tSaul Rubinek\t... \tLee Donowitz\n\tJames Gandolfini\t... \tVirgil\n\tVictor Argo\t... \tLenny\n\tFrank Adonis\t... \tFrankie\n\n\nTop Notch Pulp...., 5 March 2003\n\nAuthor: underfire35 from Chicago, USA\n\nTrue Romance is a celebration of film. It wallows in every possible seedy contrivance of American crime/action cinema. It is absolutely shameless in its exploitation of excessive violence, over-acting, melodrama, lurid sex, and rampant drug use...I love it. Quentin Tarantino, as I&amp;#039;m sure everyone knows, wrote the story, but it is the in execution that this film pays off. The cast, oh the cast: The lynchpins are Christian Slater and Patricia Arquette. They both give solid performances, which prevents the film from flying off the tracks; they serve as the pilot light. The supporting roles are the gas. The Walken/Hopper show down has been oft sighted as the film&amp;#039;s best aspect, and this is, arguably, true. Just watch this scene and then watch it again. Sparks actually shoot out of the screen and burn people about the head and shoulders. OK, you&amp;#039;ve got Val Kilmer as the ghost of Elvis, Brad Pitt as a disgruntled pot-smoking loser, Tom Sizemore &amp; Chris Penn as cops, James Gandolfini (pre-Sopranos) as a reflective hitman, and you&amp;#039;ve even got Bronson Pinchot (from TV&amp;#039;s PERFECT STRANGERS) for God&amp;#039;s sake. Did I forget Gary Oldman? Do yourself a favor and rent every single Gary Oldman related project (they&amp;#039;re not all good films, but...). Why is Gary Oldman not in every film ever made? Why? I ask you why? He has got to be the best actor working today, hands down. As Drexel Spivey, Oldman chews the scenery, digests it, and then expels it from every orifice. Keep in mind that he is an English actor with a normal speaking voice at home in the Royal Shakespeare Company. His performance here is second only to his turn in LEON in blatant over-the-top insanity. Tony Scott, who along with his brother Ridley, has been known to over-direct a film or two, here chooses wisely to basically set up the camera and run. The score by Hans Zimmer adds a bouncy xylophone driven theme to the film and finds the right balance. This a well made, balls-to-the-wall, popcorn throwing, cult classic. In a market dominated with stereotypical characters, this movie avoids that trap by letting the stereotypes flourish with all the grotesque absurdity it can muster. \n\nWith enough memorable scenes and talented stars to fuel a half a dozen blockbusters, True Romance gives us the `best bang for our buck&amp;#039; in years. The Walken/Hopper scene alone is worth the `price of admission&amp;#039; not to mention the Gandolfini/Arquette and Slater/Oldman match ups. This can only be described as a `wonderfully wicked movie&amp;#039; for its tantalizing content, smart dialog and toothsome violence.\n\nPut the kiddies to bed, be prepared for rough language, adult themes and graphic violence and enjoy a `not for the faint of heart&amp;#039; masterpiece.\n\n\n","torrent":{"xt":"urn:btih:181297af582eeb9b161667ee32bf7024e00ec231","amp;dn":"True+Romance+DVDRip+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"181297af582eeb9b161667ee32bf7024e00ec231","infoHashBuffer":{"type":"Buffer","data":[24,18,151,175,88,46,235,155,22,22,103,238,50,191,112,36,224,14,194,49]},"announce":[],"urlList":[]}}