{"title":"TTC - Games People Play: Game Theory in Life, Business, and Beyo","uid":4547250,"size":362815887,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1859a950138003d1f47809d46062e1b3aa7e5e10&amp;dn=TTC+-+Games+People+Play%3A+Game+Theory+in+Life%2C+Business%2C+and+Beyo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"BhangWalla","files":26,"time":1228174395,"description":"TTC - Games People Play: Game Theory in Life, Business, and Beyond\n\nThe Teaching Company\n(24 lectures, 30 minutes/lecture)\nCourse No. 1426 &lt;a href=&quot;\nhttp://www.teach12.com/ttcx/coursedesclong2.aspx?cid=1426&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.teach12.com/ttcx/coursedesclong2.aspx?cid=1426&lt;/a&gt;\n\nEver since modern game theory - the scientific study of interactive, rational decision making - achieved prominence in the mid-20th century, it has proven instrumental in helping us understand how and why we make decisions.\n\nGame theory plays a crucial role in our lives and provides startling insights into all endeavors in which humans cooperate or compete, including biology, computer science, politics, agriculture, and, most importantly, economics.\n\nFor example, game theory\n\n* has become an invaluable tool for economists, underpinning the theories of five Nobel Prize winners in economics;\n* helps corporate decision makers through the alternatives of complex negotiations where thousands of jobs and billions of dollars may be at stake;\n* plays a crucial role in international diplomacy and military strategy, influencing the fates of nations even when that influence may well be invisible to the uninitiated; and\n* provides insights into the origins of human behaviors, not only for psychologists seeking to understand why we act as we do, but also for evolutionary biologists asking how those patterns of actions - as human strategies - were handed down.\n\nYou can even see game theory at work in the interactions you engage in every day, such as an obvious &quot;game,&quot; like buying a car, or a less obvious one, like trying to decide where to go on a Saturday night or how you ought to dress.\n\nA basic working knowledge of this profoundly important tool can help us cut through an often confusing clutter of information - allowing us to make better decisions in our own lives or better understand the decisions facing other players in games. In Games People Play: Game Theory in Life, Business, and Beyond, award-winning Professor Scott P. Stevens of James Madison University has designed a course meant for anyone looking to gain that knowledge. In 24 insightful lectures, he presents you with the fundamentals of game theory in a manner that is both engaging and easy to understand.\n\nLearn the Basic Games on which More Complex Interactions Are Built\n\nAny game can be described as an interaction involving two or more players who share a common knowledge about the game's structure and make rational decisions about the strategies that will best achieve the maximum possible payoff.\n\nBut along the pathways that lead from that basic description to the far more complex games that can be built from it - from billion-dollar negotiations to nuclear confrontations - you find a fascinating collection of questions. Are decisions being made simultaneously, with players not knowing what others are doing? Or are they made sequentially, with each player's decision following another's? Are binding agreements between players possible? Is the element of chance involved? Do all players have the same information? As these questions are answered, games can take different forms, and planning a strategy requires basic analytical tools.\n\nProfessor Stevens introduces you to those tools by exploring several classic games, each involving two players who can make one of two choices. Translating them into everyday examples, Professor Stevens shows how these games occur everywhere, from casual life to business to international diplomacy:\n\n* Chicken, derived from the game in which two drivers race toward each other to see who will swerve first. This game is one in which neither player wants to yield to the other - even when a &quot;collision&quot; is the worst possible outcome. In science fields such as biology, this game is known as the Hawk-Dove game.\n* Stag Hunt, also know as the assurance game. This game involves making a choice between individual safety and risky cooperation. The idea behind this game - involving two hunters who must decide whether to hunt a hare alone or a stag together - was developed by the philosopher Jean-Jacques Rousseau.\n* Prisoner's Dilemma, a famous situation and perhaps the most important in all of game theory. This game involves two prisoners being separately interrogated for their common crime. Each must decide whether to confess or remain silent, knowing his partner has the same choice.\n\nIf neither confesses, they each get a one-year sentence. If both confess, each gets three years. And if only one confesses, he goes free, but sends his partner away for five years.\n\nThis perplexing game, in which logic points to a strategy for each prisoner that is clearly best, yet nevertheless provides a worse outcome, surfaces repeatedly in the course, as it does in real life.\n\nBut as these lectures make clear, that isn't unusual. For the ideas that underlie game theory are everywhere, their practical applications appearing repeatedly:\n\n* You see game theory at work in business, explaining the moves in the billion-dollar chess game between Boeing and Airbus over control of the market for medium-sized, medium-range jets.\n* And you see it used in war, exploring the choices that faced U.S. and Japanese commanders as each side decided how best to deploy its weapons: the waiting force of U.S. bombers and the Japanese convoy that knew it was the bombers' target.\n\nMeet Game Theory's Most Important Minds\n\nJust as these lectures introduce you to game theory's most important ideas, they also introduce you to many of its most important minds:\n\n* John von Neumann, whose 1944 book Theory of Games and Economic Behavior, written with Oscar Morgenstern, made him arguably the founding father of modern game theory\n* John Nash, whose story was told in the film A Beautiful Mind and whose achievements have helped make him one of the best-known game theorists\n* Kenneth Arrow, whose famous &quot;impossibility theory&quot; proved that designing a fundamentally unflawed voting system is essentially impossible\n* Barry Nalebuff and Adam Brandenberger, whose 1996 book on Co-Opetition offered modern business an innovative rethinking of the competitiveess.\n\nFocus on Game Theory's Basic Ideas\n\nWhile game theory is rooted in mathematics, this course requires nothing more than a basic understanding of how numbers operate and interact. Each lecture in Games People Play features visually rich graphics that help you grasp the simple mathematical ideas underlying this fascinating field of study. Despite the apparent complexity of game theory, Professor Stevens always makes the subject matter accessible and easy to understand.\n\nTaught with relish and wit by a teacher as amiable and easy to understand as he is knowledgeable, Games People Play instills a new awareness of the games hidden at the core of the most complex arenas of corporate negotiations and foreign policy, as well as the most basic encounters of our daily lives.\n\n1. The World of Game Theory\n2. The Nature of the Game\n3. The Real Life Chessboard - Sequential Games\n4. Life's Little Games - The 2 x 2 Classic Games\n5. Guessing Right - Simultaneous Move Games\n6. Practical Applications of Game Theory\n7. A Random Walk - Dealing with Chance Events\n8. Pure Competition - Constant-Sum Games\n9. Mixed Strategies and Nonzero-Sum Games\n10. Threats, Promises, and Commitments\n11. Credibility, Deterrence, and Compellence\n12. Incomplete and Imperfect Information\n13. Whom Can You Trust? - Signaling and Screening\n14. Encouraging Productivity - Incentive Schemes\n15. The Persistence of Memory - Repeated Games\n16. Does This Stuff Really Work?\n17. The Tragedy of the Commons\n18. Games in Motion - Evolutionary Game Theory\n19. Game Theory and Economics - Oligopolies\n20. Voting - Determining the Will of the People\n21. Auctions and the Winner's Curse\n22. Bargaining and Cooperative Games\n23. Game Theory and Business - Co-opetition\n24. All the World's a Game\n\nGuidebook Included\n\nMore related material: \n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/BhangWalla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/BhangWalla&lt;/a&gt;\n","torrent":{"xt":"urn:btih:1859a950138003d1f47809d46062e1b3aa7e5e10","amp;dn":"TTC+-+Games+People+Play%3A+Game+Theory+in+Life%2C+Business%2C+and+Beyo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1859a950138003d1f47809d46062e1b3aa7e5e10","infoHashBuffer":{"type":"Buffer","data":[24,89,169,80,19,128,3,209,244,120,9,212,96,98,225,179,170,126,94,16]},"announce":[],"urlList":[]}}