{"title":"Chris Ware - Building Stories","uid":8639320,"size":608826413,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:188efdff425a7dbaea792b25766e2259a835b8a8&amp;dn=Chris+Ware+-+Building+Stories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1372846366,"description":"'Building Stories'\n\nPantheon Books, 2012, 260 pages\n\nWritten and Illustrated by Chris Ware\n\nNew York Times Book Review, Top 10 Books of the Year\nTime Magazine, Top Ten Fiction Books of the Year\nPublishers Weekly, Best Book of the Year\nKirkus Reviews, Top 10 Fiction of 2012\nNewsday, Top 10 Books of 2012\nEntertainment Weekly, Gift Guide, A+\nWashington Post, Top 10 Graphic Novels of 2012\nMinneapolis Star Tribune, Best Books of the Year\nCleveland Plain Dealer, Top 10 Fiction Books of the Year\nAmazon, Best Books of the Year/Comics\nBoing Boing, Best Graphic Novel of the Year\nTime Out New York, Best of 2012\nEntertainment Weekly, Best Fiction of 2012\n\nEverything you need to read the new graphic novel Building Stories: 14 distinctively discrete Books, Booklets, Magazines, Newspapers, and Pamphlets.\n\nWith the increasing electronic incorporeality of existence, sometimes it's reassuring - perhaps even necessary - to have something to hold on to. Thus within this colorful keepsake box the purchaser will find a fully-apportioned variety of reading material ready to address virtually any imaginable artistic or poetic taste, from the corrosive sarcasm of youth to the sickening earnestness of maturity - while discovering a protagonist wondering if she'll ever move from the rented close quarters of lonely young adulthood to the mortgaged expanse of love and marriage. Whether you're feeling alone by yourself or alone with someone else, this book is sure to sympathize with the crushing sense of life wasted, opportunities missed and creative dreams dashed which afflict the middle - and upper-class literary public (and which can return to them in somewhat damaged form during REM sleep).\n\nCHRIS WARE is the author of Jimmy Corrigan: The Smartest Kid on Earth and the annual progenitor of the amateur periodical the ACME Novelty Library. An irregular contributor to The New Yorker and The Virginia Quarterly Review,Ware was the first cartoonist chosen to regularly serialize an ongoing story in The New York Times Magazine, in 2005-2006. He edited the thirteenth issue of McSweeney's Quarterly Concern in 2004 as well as Houghton Mifflin's Best American Comics for 2007, and his work was the focus of an exhibit at the Museum of Contemporary Art in Chicago in 2006. Ware lives in Oak Park, Illinois, with his wife, Marnie, a high-school science teacher, and their daughter, Clara.","torrent":{"xt":"urn:btih:188efdff425a7dbaea792b25766e2259a835b8a8","amp;dn":"Chris+Ware+-+Building+Stories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"188efdff425a7dbaea792b25766e2259a835b8a8","infoHashBuffer":{"type":"Buffer","data":[24,142,253,255,66,90,125,186,234,121,43,37,118,110,34,89,168,53,184,168]},"announce":[],"urlList":[]}}