{"title":"The Idan Raichel Project (320 Kbps) - Sarpanch Release","uid":4466695,"size":142154266,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:18bd6c64d18ba23f05937d114906c7197894243b&amp;dn=The+Idan+Raichel+Project+%28320+Kbps%29+-+Sarpanch+Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Sarpanch","files":37,"time":1224947697,"description":"~ A Sarpanch release ~ \n----------------------------\n(All tracks are 320kbps CBR)\n----------------------------\n\nWhile recent headlines are dominated by news of conflict and war in the Middle East, an Israeli musical collaborative has achieved success by looking beyond intercultural differences and celebrating the value of diversity. With its blend of traditional Ethiopian folk music, Arabic poetry, Yemenite chants, Biblical psalms and Caribbean rhythms, The Idan Raichel Project has already taken Israel by storm with multiple number one hits and triple platinum sales. On November 7, 2006, the recently formed record label Cumbancha will present the powerful music of The Idan Raichel Project to the world with an international CD release of The Idan Raichel Project. \n \nThe Idan Raichel Project is the brainchild of Israeli keyboardist, composer, producer, and arranger Idan Raichel, who invited over 70 different musicians from a wide variety of backgrounds to participate in the recordings. In particular, Raichel has long been fascinated by the music of Israel&amp;#039;s growing population of Ethiopian Jews, and many songs feature members of Israel&amp;#039;s Ethiopian community. The recordings also include Arab musicians, traditional Yemenite vocalists, a toaster and percussionist from Suriname and a South African singer, among others. \n \nThe Project released its first album in Israel in 2002 and quickly became one of the biggest success stories in the history of Israeli popular music. The haunting Ethiopian chorus of the first single, &quot;Bo&amp;#039;ee&quot; (Come With Me), sounded completely unlike anything most Israeli&amp;#039;s had heard before. The groundswell of interest propelled the album to heights rarely seen in the local music scene and firmly established Idan Raichel as a new type of Israeli pop star. Now a musical icon in the Israeli community worldwide, The Idan Raichel Project has performed to sell-out crowds in prestigious venues in Paris, Brussels, New York, Los Angeles, Singapore and beyond. \n \nThe international release of The Idan Raichel Project&amp;#039;s recordings promises to introduce a wide new audience to the electrifying work of this unique musical collective. The Project offers a new vision for how Israelis, their neighbors in this volatile region, and people all over the world, can cherish their individual cultural traditions, celebrate their differences and through respectful collaboration create new and inspiring expressions. &quot;Our ability to live in peace with one other depends on our learning to appreciate and respect each other&amp;#039;s differences,&quot; notes Idan. &quot;The way forward is not by trying to change your neighbor, but by accepting him and recognizing that we are all looking for the same things in life: bread, water, spirit, respect and love. \n\n\nTracklist\n---------\n\n1 Boee (Come to Me) (4:26)     \n2 Mi&amp;#039;ma&amp;#039;amakim (Out of the Depths) (5:51)     \n3 Ayal-Ayale (The Handsome Hero) (3:35)     \n4 Hinach Yafah (You Are Beautiful) (4:53)     \n5 Im Tachpetza (If Thou Wisheth) (3:58)     \n6 Shuvi el Beyti (Come Back to My Home) (3:54)     \n7 Im Telech (If You Go) (2:47)     \n8 Be&amp;#039;yom Shabbat (On Sabbath) (3:34)     \n9 Brong Faya (Burn Fire) (4:05)     \n10 Ulai Ha&amp;#039;pa&amp;#039;am (Maybe This Time) (2:39)     \n11 Azini (Comfort Me) (4:26)     \n12 Siyaishaya Ingoma (Sing out for Love) (3:30) ","torrent":{"xt":"urn:btih:18bd6c64d18ba23f05937d114906c7197894243b","amp;dn":"The+Idan+Raichel+Project+%28320+Kbps%29+-+Sarpanch+Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18bd6c64d18ba23f05937d114906c7197894243b","infoHashBuffer":{"type":"Buffer","data":[24,189,108,100,209,139,162,63,5,147,125,17,73,6,199,25,120,148,36,59]},"announce":[],"urlList":[]}}