{"title":"Ben Harper &amp; Charlie Musselwhite - Get Up! (2013) [FLAC]","uid":8034992,"size":219321312,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:19018b9ac8cb8aeccdb6d8122ceb5c25832cd85c&amp;dn=Ben+Harper+%26amp%3B+Charlie+Musselwhite+-+Get+Up%21+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"dickspic","files":13,"time":1358503268,"description":"01 Don't Look Twice3:13\n02 I'm In I'm Out And I'm Gone4:37\n03 We Can't End This Way3:34\n04 I Don't Believe A Word You Say3:17\n05 You Found Another Lover (I Lost Another Friend)4:13\n06 I Ride At Dawn4:42\n07 Blood Side Out2:52\n08 Get Up!6:17\n09 She Got Kick2:56\n10 All That Matters Now4:53\n\n\n\n&quot;I Don't Believe A Word You Say&quot; from Get Up!\nBen Harper with Charlie Musselwhite\t\nThe fearsome &quot;Blood Side Out&quot; finds Harper portraying a man pushed past his breaking point. Both the blunt guitar solo and the emotive harmonica capture the frustration and manic energy of someone who's been on the short end of the stick too many times.\n\nThere's plenty of defiance on Get Up! and also tender heartache. Case in point the poignant acoustic guitar and harmonica duet of &quot;You Found Another Lover (I Lost Another Friend.)&quot; Featuring poetic lyrics, the song's three short verses detail a painful break-up, vividly embodied in Musselwhite's brilliant accompaniment. &quot;I've played with John Lee, Solomon Burke and Taj Mahal, and one of my greatest musical moments is playing that song with Charlie,&quot; Harper says.\n\n\n\n&quot;I Don't Believe a Word You Say,&quot; is an angry blast of electric blues that could be directed at anyone who hasn't lived up to their promises, be it lover or politician. &quot;I could fit those words to political imagery and it would almost work better than matters of the heart,&quot; Harper points out.\n\nA rollicking New Orleans piano highlights &quot;She Got Kick&quot;, an unambiguous testimonial to the ultimate control of the opposite sex. Things go further out on &quot;We Can't End This Way,&quot; a heavenly synthesis of acoustic blues and gospel written in three-quarter time. In lesser hands it would have been a mess of good intentions but here the music is simply a celebration teeming with life.\n\nAnchored by a pulsating groove, the band goes just as far in a different direction on &quot;Get Up!&quot; the title track. &quot;That song was written around a killer baseline that Jessie had,&quot; Harper explains. &quot;It's tempting to throw everything but the kitchen sink on top of it, but we left it sparse. Powerful. &quot;\n\nThe haunting battle hymn, &quot;I Ride at Dawn&quot;, dedicated to departed Navy SEAL Nicholas P. Spehar, the brother of a friend, is a harrowing look at a modern day warrior preparing for duty. &quot;Real blues has depth and substance,&quot; Musselwhite points out. &quot;It's not just tunes that are tossed off. These songs are all from the heart, more so than from the head. More than just music, they are reflections of life.&quot;\n\nThe album ends with the uplifting &quot;All That Matters Now.&quot; The song is a reconciliation of sorts after the album's emotional journey. &quot;I was in the production booth, in total producer mode trying to figure out where to go next,&quot; recalls Harper. &quot;And I hear Charlie and Jason messing around in the studio with this deep groove. I heard it and told my engineer to roll tape. Don't go fix the mic, just roll tape. There's people talking and walking through the room, but it doesn't matter.&quot;\n\nRecorded down and dirty, fast and live, Get Up! is an old school creation. This kind of musical chemistry demanded the approach. But its attitude, brash, assertive, disarming and vulnerable, is defiantly modern. This is a record Harper has always aspired to make but knew required the essential life experience. Get Up! proves it's been time well spent.","torrent":{"xt":"urn:btih:19018b9ac8cb8aeccdb6d8122ceb5c25832cd85c","amp;dn":"Ben+Harper+%26amp%3B+Charlie+Musselwhite+-+Get+Up%21+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19018b9ac8cb8aeccdb6d8122ceb5c25832cd85c","infoHashBuffer":{"type":"Buffer","data":[25,1,139,154,200,203,138,236,205,182,216,18,44,235,92,37,131,44,216,92]},"announce":[],"urlList":[]}}