{"title":"Reds (1981) Warren Beatty Diane Keaton (DivX)","uid":5159212,"size":1379758819,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1923cac004086a2cb331a6fe0f0e549ece4ff198&amp;dn=Reds+%281981%29+Warren+Beatty+Diane+Keaton+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"mrizzo2","files":-1,"time":1258043542,"description":"We are still seeding Yes Minister with extra bandwidth, and can offer you this\nmovie too:\n\nNote: This is a re-launch of our previously successful torrent, which surpassed 2000\ncompletions soon after it was first launched, so there are many seeders out\nthere who could join this torrent after downloding the tiny jpg file we've added\nto this torrent, as that is th only difference you'll see. We have however added\nmulti-tracker facility as well and so its worth swirching to this torrent\ninstead.\n\nExcellent picture and sound. 720 X 400 Divx\n\nReds is a monumental brainchild and genius of the great actor Mr. Warren\nBeatty, turned Director for this wonderful achievement for mankind. Lovely\nMs. Diane Keaton is special in her performance here too.\n\nShould the desire to better allocate resources than happens in a &quot;state of\nnature&quot; or where unfettered capitalism might have existed - is this desire a\nsufficient enough impetus to altogether abandon freedoms we do need to survive,\nin favour instead of the communist model?\n\nAlebit, a noteworthy part of the movie substantially deal with the romantic\nrelations between the two main actors (along with Jack Nicholson, who is\nbrought into the conflicting situation as a potential &quot;spoiler&quot; with less\nsuperficial regard for the needs of the Character played by Diane Keaton), yet\nthe movie mainly deals with the misguided &quot;romantic idealism&quot; of &quot;left wing\nliberals&quot; from the United states, who had then felt it appropriate to involve\nthemselves in the red movement that swept Russia, leading eventually to a\nregime that existed &quot;behind the iron curtain&quot; as though the needs of humanity\nwould be better served by such efforts of involvement here.\n\n\nThere is an element of social responsibility and conscionable awareness\nthat is heightened in the environment you see depicted in the movie,\nhowever at the end of the day, we are left with nothing worthwhile from\nthis experiment except for the great pickings of human stocks in Russia\nthat have not only weathered the storm as it were, but have strengthened\ncharacter from a period of communal caring that did flourish and thrive\ndespite the odds, and that did result in a gentle character that is\nconcerned with the lot of their fellow human beings. As such Mr. Beatty\nmainly brings us to take a look at what came of the experiment we see at\nits inception in what is the object of the movie, in such a way as to bring\nthe people involved closer to us, in a way as to benefit all of mankind, as\nRussia is no less a part of who we are than is even much of the world that\nnow surrounds us wherever we happen to be in this misguided spirit of newfound\nChristianly egalitarian &quot;wisdom&quot; that pervades the earth in fulfillment of\nan agenda driven by madness gone amok.\n\nBy the way, its interesting that Mr. Warren Beatty's character in the movie\nseems dead set against &quot;excessive profits&quot; by capitalists who are misguided\non fairer models on which to share a movie work such as this, so I guess we\nhave to intervene in that spirit, so Mr. Beatty can be a happier man in fact\nas we are complying with that sentiment, which is in fat laudable I submit.\n\nMichael Rizzo Chessman\nmovie reviews at: moviesbyrizzo.info\n","torrent":{"xt":"urn:btih:1923cac004086a2cb331a6fe0f0e549ece4ff198","amp;dn":"Reds+%281981%29+Warren+Beatty+Diane+Keaton+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1923cac004086a2cb331a6fe0f0e549ece4ff198","infoHashBuffer":{"type":"Buffer","data":[25,35,202,192,4,8,106,44,179,49,166,254,15,14,84,158,206,79,241,152]},"announce":[],"urlList":[]}}