{"title":"A History of Britain, Volume 1 - Simon Schama","uid":11153008,"size":3295558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1956b2a990437604c735ba22e2be378c9ddf2f30&amp;dn=A+History+of+Britain%2C+Volume+1+-+Simon+Schama&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1412371313,"description":"History clings tight but it also kicks loose,' writes Simon Schama at the outset of this, the first book in his three-volume journey into Britain's past. 'Disruption as much as persistence is its proper subject. So although the great theme of British history seen from the twentieth century is endurance, its counter-point, seen from the twenty-first, must be alteration.'\n\nChange - sometimes gentle and subtle, sometimes shocking and violent - is the dynamic of Schama's unapologetically personal and grippingly written history, especially the changes that wash over custom and habit, transforming our loyalties. At the heart of this history lie questions of compelling importance for Britain's future as well as its past: what makes or breaks a nation? To whom do we give our allegiance and why? And where do the boundaries of our community lie - in our hearth and home, our village or city, tribe or faith? What is Britain - one country or many? Has British history unfolded 'at the edge of the world' or right at the heart of it?\n\nSchama delivers these themes in a form that is at once traditional and excitingly fresh. The great and the wicked are here - Becket and Thomas Cromwell, Robert the Bruce and Anne Boleyn - but so are countless more ordinary lives: an Irish monk waiting for the plague to kill him in his cell at Kilkenny; a small boy running through the streets of London to catch a glimpse of Elizabeth I. They are all caught on the rich and teeming canvas on which Schama paints his brilliant portrait of the life of the British people: 'for in the end, history, especially British history with its succession of thrilling illuminations, should be, as all her most accomplished narrators have promised, not just instruction but pleasure.\n\nReview\n\n&quot;An exciting, intensely seductive presentation of history.&quot; Independent &quot;Remarkably vivid pictures... A decade on, Schama's study remains a terrific read.&quot; -- Paul Lay History Today &quot;A bravura performance by the Lord Macaulay of our day.&quot; -- David Cannadine The Observer &quot;Schama has a masterly ability to conjure up character and vivify conflict.&quot; -- Ben Rogers Financial Times &quot;Popular history at its finest.&quot; Express on Sunday","torrent":{"xt":"urn:btih:1956b2a990437604c735ba22e2be378c9ddf2f30","amp;dn":"A+History+of+Britain%2C+Volume+1+-+Simon+Schama","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1956b2a990437604c735ba22e2be378c9ddf2f30","infoHashBuffer":{"type":"Buffer","data":[25,86,178,169,144,67,118,4,199,53,186,34,226,190,55,140,157,223,47,48]},"announce":[],"urlList":[]}}