{"title":"Who's Pulling Your Strings - 1st Edition (2003).pdf Gooner","uid":14158234,"size":2513321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a37a723eb07bfbc28d32a42b122c5512601c7c7&amp;dn=Who%27s+Pulling+Your+Strings+-+1st+Edition+%282003%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1459688746,"description":"Who's Pulling Your Strings - How to Break the Cycle of Manipulation and Regain Control of Your Life - 1st Edition (2003).pdf Gooner\r\n\r\nPublisher: McGraw-Hill; 1 edition (August 12, 2003)\r\nLanguage: English\r\nISBN-10: 0071402780\r\nISBN-13: 978-0071402781\r\n\r\nA self-empowering plan for anyone who wants to stop being manipulated by others\r\n\r\nIn Who's Pulling Your Strings?, Dr. Harriet B. Braiker,New York Times bestselling author of The Disease to Please, explains how depression, low self-esteem, chronic anger, and feelings of helplessness are often the result of being caught in relationships with manipulative people--including family members, friends, coworkers, and associates. More importantly, she arms readers with the knowledge and tools they need to understand and identify manipulative personalities and to free themselves from the bondage of relationships with them.\r\n\r\nWorking from sound psychological theory and research, yet writing in a warm, accessible style, Braiker exposes the most common methods manipulative people use to control others--and makes clear that it takes at least two people to enable such a relationship to function. With the help of valuable self-assessment quizzes, action plans, and how-to exercises she empowers readers to:\r\n\r\n* Recognize the signs of a manipulative relationship\r\n* Spot manipulators and their typical modus operandi\r\n* Assess their own vulnerability to manipulation\r\n* Identify the 7 main &quot;Head Games&quot; manipulators play\r\n\r\n...and much more, including informative case studies and highly effective Resistance Tactics to help those who identify themselves as victim-participants end the damaging cycle of control and manipulation--and clear the way for success and happiness","torrent":{"xt":"urn:btih:1a37a723eb07bfbc28d32a42b122c5512601c7c7","amp;dn":"Who%27s+Pulling+Your+Strings+-+1st+Edition+%282003%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a37a723eb07bfbc28d32a42b122c5512601c7c7","infoHashBuffer":{"type":"Buffer","data":[26,55,167,35,235,7,191,188,40,211,42,66,177,34,197,81,38,1,199,199]},"announce":[],"urlList":[]}}