{"title":"Felidae - German Audio, English Hard Subs - DVD Quality","uid":7328480,"size":792524543,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1a90c79b285c188586bb9757be77ed208979fdca&amp;dn=Felidae+-+German+Audio%2C+English+Hard+Subs+-+DVD+Quality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"apparentlynothing0843","files":-1,"time":1338835146,"description":"A German animated classic (not for kids), with hard-coded English subs (not easy to find) and the original German audio.\n\nSummary from Fandango: &quot;This animated feature film, based on a successful German novel, was made for adult audiences and feature graphic depictions of feline sex and violence. &quot; Felidae&quot; is the Latin word for cats. Francis is a suave cat who investigates murders. A series of female cat murders leads him to uncover a plot. The plot centers around the forced breeding of superior cats... Francis encounters explicit brutality reminiscent of a not too distant German past.&quot;\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0109791/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0109791/&lt;/a&gt;\n\n\nSome comments from IMDB:\n\n&quot;Felidae is a feast for the eyes. What initially appears to be a typical animation with lavish colours, top art and high production values becomes much more. For one, there is animated violence that would shock an adult Japanese animation studio. We're talking gritty, horrid violence that makes this tale all the more real. Secondly, there are some brilliant dream sequences with incredibly surreal effects that just have to be seen. The most alluring aspect of this film is most definitely its noir feel. There's a murder mystery, thugs, grit and guts, femme fatales and a story that'll make your eyes pop. The story is arguably the most intriguing yet seen in animation. It covers cults, murder, ancient Egypt, animal experimentation, genetics and much more. It's definitely a film you need to see multiple times to soak it all up. &quot;\n\n&quot;Overall, an excellent movie. The pacing is fantastic, the characters fun, and the plot engaging, twisty and compelling. The mature elements are handled smoothly and fit naturally within the plot, and the film does a great job of believably transferring a murder mystery into the realm of animated cats. While I do understand why the movie didn't get a theatrical release(I think the reason is pretty obvious) in America, it is a movie that deserves more attention.&quot;\n","torrent":{"xt":"urn:btih:1a90c79b285c188586bb9757be77ed208979fdca","amp;dn":"Felidae+-+German+Audio%2C+English+Hard+Subs+-+DVD+Quality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a90c79b285c188586bb9757be77ed208979fdca","infoHashBuffer":{"type":"Buffer","data":[26,144,199,155,40,92,24,133,134,187,151,87,190,119,237,32,137,121,253,202]},"announce":[],"urlList":[]}}