{"title":"Tales From The Crypt complete 1950 series comics","uid":8841946,"size":527372712,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1aa44bc3fd381d2a7c1680b462c11ea5c003a420&amp;dn=Tales+From+The+Crypt+complete+1950+series+comics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"AN0NYMOUS142857","files":-1,"time":1377271225,"description":"Tales from the Crypt (1950 E.C. Comics) comic books\n\ncbr format.\n\nOriginal and reprints complete this collection.\n\n\nFirst issue of the series (continues from The Crypt of Terror). &quot;The Thing From the Sea&quot; (art by Al Feldstein), &quot;A Fatal Caper&quot; (art by Jack Kamen), &quot;Rx...Death&quot; (art by Graham Ingels), and &quot;Impending Doom&quot; (art by Johnny Craig). Craig cover. \nIssue #21\nTales from the Crypt (1950 E.C. Comics) 21\nTales from the Crypt (1950 E.C. Comics) #21\nPublished December 1950 by EC.\n\n&quot;A Shocking Way to Die&quot; (art by Al Feldstein), &quot;Terror Ride&quot; (art by Wally Wood), &quot;House of Horror&quot; (art by Harvey Kurtzman), and &quot;Death Suited Him&quot; (art by Graham Ingels). Feldstein cover. \nIssue #22\nTales from the Crypt (1950 E.C. Comics) 22\nTales from the Crypt (1950 E.C. Comics) #22\nPublished February 1951 by EC.\n\n&quot;The Thing From the Grave&quot; (art by Al Feldstein), &quot;Blood Type V&quot; (art by Graham Ingels), &quot;Death's Turn&quot; (art by Jack Kamen), and a Vault of Horror story, &quot;The Curse of the Arnold Clan&quot; (art by Johnny Craig). Feldstein cover. \nIssue #23\nTales from the Crypt (1950 E.C. Comics) 23\nTales from the Crypt (1950 E.C. Comics) #23\nPublished April 1951 by EC.\n\n&quot;Reflection of Death&quot; (art by Al Feldstein), &quot;Last Respects&quot; (art by Graham Ingels), &quot;Seance&quot; (art by Jack Davis), and a Vault of Horror story, &quot;Voodoo Death&quot; (art by Johnny Craig). Feldstein cover. \nIssue #24\nTales from the Crypt (1950 E.C. Comics) 24\nTales from the Crypt (1950 E.C. Comics) #24\nPublished June 1951 by EC.\n\n&quot;Bats in My Belfry&quot; (art by Jack Davis), &quot;The Living Death&quot; (art by Graham Ingels), a Vault of Horror story, &quot;Midnight Snack&quot; (art by Johnny Craig), and &quot;Scared to Death&quot; (art by Wally Wood). Feldstein cover. \nIssue #25\nTales from the Crypt (1950 E.C. Comics) 25\nTales from the Crypt (1950 E.C. Comics) #25\nPublished August 1951 by EC.\n\n&quot;The Trophy&quot; (art by Jack Davis), &quot;Judy, You're Not Yourself Today!&quot; (art by Wally Wood--his final story for the title), &quot;Loved to Death!&quot; (art by Jack Kamen), and &quot;The Works...in Wax!&quot; (art by Graham Ingels). Al Feldstein cover. \nIssue #26\nTales from the Crypt (1950 E.C. Comics) 26\nTales from the Crypt (1950 E.C. Comics) #26\nPublished October 1951 by EC.\n\n&quot;Drawn and Quartered&quot; (art by Jack Davis), a Vault of Horror story, &quot;The Borrowed Body&quot; (art by Howard Larsen), &quot;Indian Burial Mound&quot; (art by George Roussos), and &quot;Political Pull&quot; (art by Graham Ingels). Wally Wood cover. \nIssue #27\nTales from the Crypt (1950 E.C. Comics) 27\nTales from the Crypt (1950 E.C. Comics) #27\nPublished December 1951 by EC.\n\n&quot;Well-Cooked Hams&quot; (art by Jack Davis), a Vault of Horror story, &quot;Madam Bluebeard&quot; (art by Joe Orlando--his first horror story for EC), &quot;Return&quot; (art by Jack Kamen), and &quot;Horror! Head It Off&quot; (art by Graham Ingels, who begins signing his name &quot;Ghastly&quot;). Wood cover. \nIssue #28\nTales from the Crypt (1950 E.C. Comics) 28\nTales from the Crypt (1950 E.C. Comics) #28\nPublished February 1952 by EC.\n\n&quot;Bargain in Death&quot; (art by Jack Davis), a Vault of Horror story, &quot;Ants in Her Trance&quot; (art by Joe Orlando), &quot;A Corny Story&quot; (art by Jack Kamen), and &quot;The Ventriloquist's Dummy&quot; (art by Graham Ingels). One-page bio (with photo) of Orlando. Al Feldstein cover. \nIssue #29\nTales from the Crypt (1950 E.C. Comics) 29\nTales from the Crypt (1950 E.C. Comics) #29\nPublished April 1952 by EC.\n\n&quot;Grounds for Horror&quot; (art by Jack Davis), a Vault of Horror story, &quot;A Rottin' Trick&quot; (art by Joe Orlando), &quot;Board To Death&quot; (art by Jack Kamen), and &quot;A Sucker For a Spider&quot; (art by Graham Ingels). One-page bio (with photo) of Davis, who also drew the cover. \nIssue #30\nTales from the Crypt (1950 E.C. Comics) 30\nTales from the Crypt (1950 E.C. Comics) #30\nPublished June 1952 by EC.\n\n&quot;Gas-tly Prospects&quot; (art by Jack Davis), a Vault of Horror story, &quot;A Hollywood Ending&quot; (art by Joe Orlando), &quot;Auntie, it's Coal Inside&quot; (art by Jack Kamen), and &quot;Mournin', Ambrose&quot; (art by Graham Ingels). Davis cover. \nIssue #31\nTales from the Crypt (1950 E.C. Comics) 31\nTales from the Crypt (1950 E.C. Comics) #31\nPublished August 1952 by EC.\n\n&quot;Survival or Death&quot; (art by Jack Davis), a Vault of Horror story, &quot;The Thing in the 'Glades&quot; (art by Al Williamson--his only story for Crypt), &quot;Kamen's Kalamity&quot; (art by Jack Kamen, who draws himself, Gailes, and Feldstein in the story; Graham Ingels, Johnny Craig, and Davis each draw themselves), and &quot;Buried Treasure&quot; (art by Ingels). Davis cover. \nIssue #32\nTales from the Crypt (1950 E.C. Comics) 32\nTales from the Crypt (1950 E.C. Comics) #32\nPublished October 1952 by EC.\n\n&quot;'Taint the Meat, It's the Humanity&quot; (art by Jack Davis), a Vault of Horror story, &quot;Roped In&quot; (art by George Evans), &quot;Cutting Cards&quot; (art by Fred Peters), and &quot;Squash, Anyone?&quot; (art by Graham Ingels). Davis cover. \nIssue #33\nTales from the Crypt (1950 E.C. Comics) 33\nTales from the Crypt (1950 E.C. Comics) #33\nPublished December 1952 by EC.\n\n&quot;Lower Berth&quot; (art by Jack Davis), a Vault of Horror story, &quot;This Trick'll Kill You&quot; (art by George Evans and Jack Kamen), &quot;The Funeral&quot; (art by Kamen), and &quot;None But the Lonely Heart&quot; (art by Graham Ingels). Origin of the Crypt Keeper. Davis cover. \nIssue #34\nTales from the Crypt (1950 E.C. Comics) 34\nTales from the Crypt (1950 E.C. Comics) #34\nPublished February 1953 by EC.\n\n&quot;Mirror, Mirror, On the Wall&quot; (art by Jack Davis), a Vault of Horror story, &quot;Oil's Well That Ends Well&quot; (art by George Evans), &quot;Attacks of Horror&quot; (art by Jack Kamen), and &quot;There Was an Old Women&quot; (art by Graham Ingles; adapted from a Ray Bradbury story). Davis cover. \nIssue #35\nTales from the Crypt (1950 E.C. Comics) 35\nTales from the Crypt (1950 E.C. Comics) #35\nPublished April 1953 by EC.\n\n&quot;By the Fright of the Silvery Moon!&quot; (art by Jack Davis); a Vault of Horror story, &quot;Midnight Mess!&quot; (art by Joe Orlando); &quot;Busted Marriage!&quot; (art by Jack Kamen); and &quot;This Wraps It Up!&quot; (art by Graham Ingels). Davis cover. \nIssue #36\nTales from the Crypt (1950 E.C. Comics) 36\nTales from the Crypt (1950 E.C. Comics) #36\nPublished June 1953 by EC.\n\n&quot;Fare Tonight, Followed by Increasing Clottyness&quot; (art by Jack Davis), a Vault of Horror story, &quot;Curiosity Killed&quot; (art by George Evans), &quot;How Green Was My Alley&quot; (art by Jack Kamen), and &quot;The Handler&quot; (art by Graham Ingels; adapted from a story by Ray Bradbury). One-page bio (with photo) of George Evans. Davis cover. \nIssue #37\nTales from the Crypt (1950 E.C. Comics) 37\nTales from the Crypt (1950 E.C. Comics) #37\nPublished August 1953 by EC.\n\n&quot;Dead Right&quot; (art by Jack Davis), a Vault of Horror story, &quot;Pleasant Screams&quot; (art by Joe Orlando), &quot;Strop! You're Killing Me&quot; (art by Bill Elder), and &quot;The Rover Boys&quot; (art by Graham Ingels). Davis cover. \nIssue #38\nTales from the Crypt (1950 E.C. Comics) 38\nTales from the Crypt (1950 E.C. Comics) #38\nPublished October 1953 by EC.\n\n&quot;Undertaking Palor&quot; (art by Jack Davis), a Vault of Horror story, &quot;The Craving Grave&quot; (art by Joe Orlando), &quot;The Sleeping Beauty&quot; (art by Jack Kamen), and &quot;Shadow of Death&quot; (art by Graham Ingels). Davis cover. \nIssue #40\nTales from the Crypt (1950 E.C. Comics) 40\nTales from the Crypt (1950 E.C. Comics) #40\nPublished February 1954 by EC.\n\n&quot;Food For Thought&quot; (art by Jack Davis), a Vault of Horror story, &quot;Pearly To Dead&quot; (art by George Evans), &quot;Prairie Schooner&quot; (art by Bernard Krigstein), and &quot;Half-Baked&quot; (art by Graham Ingels). Davis cover. \nIssue #41\nTales from the Crypt (1950 E.C. Comics) 41\nTales from the Crypt (1950 E.C. Comics) #41\nPublished April 1954 by EC.\n\n&quot;Operation Friendship&quot; (art by Jack Davis), a Vault of Horror story, &quot;Come Back, Little Linda&quot; (art by George Evans), &quot;Current Attraction&quot; (art by Jack Kamen), and &quot;Mess Call&quot; (art by Graham Ingels). Davis cover. \nIssue #42\nTales from the Crypt (1950 E.C. Comics) 42\nTales from the Crypt (1950 E.C. Comics) #42\nPublished June 1954 by EC.\n\n&quot;Concerto for Violin and Werewolf&quot; (art by Jack Davis), a Vault of Horror story, &quot;By the Dawn's Early Light&quot; (art by Jack Kamen), &quot;The Bath&quot; (art by Bernard Krigstein), and &quot;Hoodwinked&quot; (art by Graham Ingels). Letter to the editor from E. Nelson Bridwell. Davis cover. \nIssue #43\nTales from the Crypt (1950 E.C. Comics) 43\nTales from the Crypt (1950 E.C. Comics) #43\nPublished August 1954 by EC.\n\n&quot;Four-Way Split&quot; (art by Jack Davis), a Vault of Horror story, &quot;Cold War&quot; (art by Jack Kamen), &quot;Clots My Line&quot; (art by George Evans), and &quot;Accidents and Old Lace&quot; (art by Graham Ingels). Davis cover. \nIssue #44\nTales from the Crypt (1950 E.C. Comics) 44\nTales from the Crypt (1950 E.C. Comics) #44\nPublished October 1954 by EC.\n\n&quot;Forever Ambergris&quot; (art by Jack Davis), a Vault of Horror story, &quot;Burial at Sea&quot; (art by Reed Crandall), &quot;Proposal&quot; (art by Jack Kamen), and &quot;The Sliceman Cometh&quot; (art by Graham Ingels). Davis cover. \nIssue #45\nTales from the Crypt (1950 E.C. Comics) 45\nTales from the Crypt (1950 E.C. Comics) #45\nPublished December 1954 by EC.\n\n&quot;Telescope&quot; (art by Jack Davis), &quot;The Substitute&quot; (art by Jack Kamen), &quot;Murder Dream&quot; (art by Bernard Krigstein), and &quot;The Switch&quot; (art by Graham &quot;Ghastly&quot; Ingels). One-page editorial on the Senate Subcommittee on Juvenile Delinquency investigation into the comic industry. Two-page montage of the EC office with caricatures of the artists by Marie Severin. Davis cover. \nIssue #46\nTales from the Crypt (1950 E.C. Comics) 46\nTales from the Crypt (1950 E.C. Comics) #46\nPublished February 1955 by EC.\n\nFinal issue of the series. &quot;Upon Reflection&quot; (art by Jack Davis), &quot;Blind Alleys&quot; (art by George Evans), &quot;Success Story&quot; (art by Joe Orlando), and &quot;Tatter Up!&quot; (art by Graham Ingels). Davis cover. ","torrent":{"xt":"urn:btih:1aa44bc3fd381d2a7c1680b462c11ea5c003a420","amp;dn":"Tales+From+The+Crypt+complete+1950+series+comics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa44bc3fd381d2a7c1680b462c11ea5c003a420","infoHashBuffer":{"type":"Buffer","data":[26,164,75,195,253,56,29,42,124,22,128,180,98,193,30,165,192,3,164,32]},"announce":[],"urlList":[]}}