{"title":"An Introduction to Metamaterials and Waves in Composites","uid":15869017,"size":5589573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b2ff64de9e7146634a53cfc7af7efca8d21ae19&amp;dn=An+Introduction+to+Metamaterials+and+Waves+in+Composites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"clouderone","files":1,"time":1474409551,"description":"An Introduction to Metamaterials and Waves in Composites - Biswajit Banerjee (CRC, 2011).pdf\r\n\r\nRequiring no advanced knowledge of wave propagation, An Introduction to Metamaterials and Waves in Composites focuses on theoretical aspects of metamaterials, periodic composites, and layered composites. The book gives novices a platform from which they can start exploring the subject in more detail.\r\n\r\nAfter introducing concepts related to elasticity, acoustics, and electrodynamics in media, the text presents plane wave solutions to the equations that describe elastic, acoustic, and electromagnetic waves. It examines the plane wave expansion of sources as well as scattering from curved interfaces, specifically spheres and cylinders. The author then covers electrodynamic, acoustic, and elastodynamic metamaterials. He also describes examples of transformations, aspects of acoustic cloaking, and applications of pentamode materials to acoustic cloaking. With a focus on periodic composites, the text uses the Bloch-Floquet theorem to find the effective behavior of composites in the quasistatic limit, presents the quasistatic equations of elastodynamic and electromagnetic waves, and investigates Brillouin zones and band gaps in periodic structures. The final chapter discusses wave propagation in smoothly varying layered media, anisotropic density of a periodic layered medium, and quasistatic homogenization of laminates.\r\n\r\nThis book provides a launch pad for research into elastic and acoustic metamaterials. Many of the ideas presented have yet to be realized experimentally—the book encourages readers to explore these ideas and bring them to technological maturity","torrent":{"xt":"urn:btih:1b2ff64de9e7146634a53cfc7af7efca8d21ae19","amp;dn":"An+Introduction+to+Metamaterials+and+Waves+in+Composites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b2ff64de9e7146634a53cfc7af7efca8d21ae19","infoHashBuffer":{"type":"Buffer","data":[27,47,246,77,233,231,20,102,52,165,60,252,122,247,239,202,141,33,174,25]},"announce":[],"urlList":[]}}