{"title":"Illuminating the Renaissance - The Triumph of Flemish Manuscript","uid":15854566,"size":88006244,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bf76d03d105e4799790dd54a9f053f23911a266&amp;dn=Illuminating+the+Renaissance+-+The+Triumph+of+Flemish+Manuscript&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"STBGD","files":1,"time":1474226148,"description":"Illuminating the Renaissance: The Triumph of Flemish Manuscript Painting in Europe\r\nGetty | 2003 | 0892367040 | English | PDF | 593 pages | 83.9 Mb\r\n\r\nThis comprehensive and richly illustrated catalogue focuses on the finest illustrated manuscripts produced in Europe during the great epoch in Flemish illumination. During this aesthetically fertile period - beginning in 1467 with the reign of the Burgundian duke Charles the Bold and ending in 1561 with the death of the artist Simon Bening - the art of book painting was raised to a new level of sophistication. Sharing inspiration with the celebrated panel painters of the time, illuminators achieved astonishing innovations in the handling of colour, light, texture, and space, creating a naturalistic style that would dominate tastes throughout Europe for nearly a century. Focusing on the notable artists of the period - Simon Marmion, the Vienna Master of Mary of Burgundy, Gerard David, Gerard Horenbout, Bening, and others - the catalogue examines both devotional and secular manuscript illumination within a broad context: the place of illuminators within the visual arts, including artistic exchange between book painters and panel painters; the role of court patronage and the emergence of personal libraries; and the international appeal of the new Flemish illumination style","torrent":{"xt":"urn:btih:1bf76d03d105e4799790dd54a9f053f23911a266","amp;dn":"Illuminating+the+Renaissance+-+The+Triumph+of+Flemish+Manuscript","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bf76d03d105e4799790dd54a9f053f23911a266","infoHashBuffer":{"type":"Buffer","data":[27,247,109,3,209,5,228,121,151,144,221,84,169,240,83,242,57,17,162,102]},"announce":[],"urlList":[]}}