{"title":"Advances in Natural Polymers - Composites and Nanocomposites","uid":12426301,"size":8488502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c352f4522a8e4079a39b12cc3cb995c2cd99262&amp;dn=Advances+in+Natural+Polymers+-+Composites+and+Nanocomposites&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"clouderone","files":1,"time":1442382426,"description":"Advances in Natural Polymers - Composites and Nanocomposites (Advanced Structured Materials Vol. 18)(Springer, 2013).pdf\n\nISBN 978-3-642-20939-0\n\nThe book summarizes in a comprehensive manner many of the recent technical research accomplishments in the area of natural polymers. It discusses the various attempts reporting on solving this problem from the point of view of the chemistry and the structure of natural polymers, highlighting the drawbacks and advanteges of each method and proposal. Based on considerations of structure - property relations, it is possible to obtain fibers with improved strength by making use of their nanostructures and/or mesophase properties of natural polymers. The book is a unique book with contributions from the experts of the biomaterial area research. it covers all topics related to natural biomaterials such as natural rubber, cellulose, chitin, starch, hemicellulose, lignin, alginates, soy protein, casein and their bioanacomposites and applications. This book is a useful reference for scientists, academicians, research scholars and biotechnologists","torrent":{"xt":"urn:btih:1c352f4522a8e4079a39b12cc3cb995c2cd99262","amp;dn":"Advances+in+Natural+Polymers+-+Composites+and+Nanocomposites","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c352f4522a8e4079a39b12cc3cb995c2cd99262","infoHashBuffer":{"type":"Buffer","data":[28,53,47,69,34,168,228,7,154,57,177,44,195,203,153,92,44,217,146,98]},"announce":[],"urlList":[]}}