{"title":"Brain Damage (1988)............FFF","uid":3811844,"size":737024000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c4ef90073299b3651e5939e6d0f1485c0517153&amp;dn=Brain+Damage+%281988%29............FFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"FatFuckFrank","files":1,"time":1190160182,"description":"IMDB review.........\n\nI suggest going back 20 years to the 70&amp;#039;s and 80&amp;#039;s if you want to find some great horror. horror then was low budget but imaginative. the movies had interesting story lines and were not shy about blood and gore. a good stepping stone for this sub-genre is one of my current favorites, Brain Damage. It starts off on a very surreal note, but mixes its strangeness with an accurate portrayal of a young man hopelessly addicted to the mother of all drugs. his dealer is perhaps the most unique little monster in all of horror, Aylmer (pronounced &quot;elmer&quot;).\n\nAylmer is a purple cucumber shaped alien with a tiny smiling face and a soft warm voice. he finds a host, and injects his host with a blue liquid that comes out of one of Aylmer&amp;#039;s fangs. this &quot;brain juice&quot; jacks up its host into a hullucionary state. while the host is in la-la land, Aylmer makes a victim of whoever the host comes in contact with, eating the victims brains.\n\nas vile as all that sounds, it is hard to see Aylmer as evil. he is just such a nice little guy. plus he is unique in his appearance, personality, and attacks, which all go a long way with me in a modern world of horror villains pushed off an assembly line.\n\nthis movie is not winning an Oscar. it is strange and campy and violent. but if that is what you desire in a film, this hidden gem may become one of your favorites! ","torrent":{"xt":"urn:btih:1c4ef90073299b3651e5939e6d0f1485c0517153","amp;dn":"Brain+Damage+%281988%29............FFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c4ef90073299b3651e5939e6d0f1485c0517153","infoHashBuffer":{"type":"Buffer","data":[28,78,249,0,115,41,155,54,81,229,147,158,109,15,20,133,192,81,113,83]},"announce":[],"urlList":[]}}