{"title":"The Battle of Bellicourt Tunnel: Tommies, Diggers and Doughboys","uid":15744608,"size":10501507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c70e9bb7056f9ed3990881082cd40ff8063ddfb&amp;dn=The+Battle+of+Bellicourt+Tunnel%3A+Tommies%2C+Diggers+and+Doughboys&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"marty14","files":1,"time":1472953206,"description":"The Battle of Bellicourt Tunnel: Tommies, Diggers and Doughboys on the Hindenburg Line, 1918 by Dale Blair [epub]\r\n\r\nIn November 1918 the BEF under Field Marshal Haig fought a series of victorious battles on the Western Front that contributed mightily to the German army’s defeat. They did so as part of a coalition and the role of Australian ‘diggers’ and US ‘doughboys’ is often forgotten. The Bellicourt Tunnel attack, fought in the fading autumn light, was very much an inter-Allied affair and marked a unique moment in the Allied armies’ endeavors. It was the first time that such a large cohort of Americans had fought in a British army. Additionally, untried American II Corps and experienced Australian Corps were to spearhead the attack under the command of Lieutenant General Sir John Monash with British divisions adopting supporting roles on the flanks.\r\n\r\nBlair forensically details the fighting and the largely forgotten desperate German defense. Although celebrated as a marvelous feat of breaking the Hindenburg Line, the American attack failed generally to achieve its set objectives and it took the Australians three days of bitter fighting to reach theirs. Blair rejects the conventional explanation of the US ‘mop up’ failure and points the finger of blame at Rawlinson, Haig and Monash for expecting too much of the raw US troops, singling out the Australian Corps commander for particular criticism. \r\n\r\nOverall, Blair judges the fighting a draw. At the end, like two boxers, the Australian-American force was gasping for breath and the Germans, badly battered, backpedalling to remain on balance. Overall the day was calamitous for the German army, even if the clean break-through that Haig had hoped for did not occur. Forced out of the Hindenburg Line, the prognosis for the German army on the Western Front – and hence Imperial Germany itself – was bleak indeed","torrent":{"xt":"urn:btih:1c70e9bb7056f9ed3990881082cd40ff8063ddfb","amp;dn":"The+Battle+of+Bellicourt+Tunnel%3A+Tommies%2C+Diggers+and+Doughboys","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c70e9bb7056f9ed3990881082cd40ff8063ddfb","infoHashBuffer":{"type":"Buffer","data":[28,112,233,187,112,86,249,237,57,144,136,16,130,205,64,255,128,99,221,251]},"announce":[],"urlList":[]}}