{"title":"The Young Hitler I Knew: Memoirs of Hitler's Childhood Friend","uid":16033566,"size":1468132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c8adf844f8718b964bbacb83dc8ec76db40b1ba&amp;dn=The+Young+Hitler+I+Knew%3A+Memoirs+of+Hitler%27s+Childhood+Friend&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":8,"uploader":"marty14","files":1,"time":1476454284,"description":"The Young Hitler I Knew: The Memoirs of Hitler's Childhood Friend - August Kubizek [epub]\r\n\r\nThis is the first edition to be published in English since 1955 and it corrects many changes made for reasons of political correctness. It also includes important sections which were excised from the original English translation.\r\n\r\nAugust Kubizek met Adolf Hitler in 1904 while they were both competing for standing room at the opera. Their mutual passion for music created a strong bond, and over the next four years they became close friends. Kubizek describes a reticent young man, painfully shy, yet capable of bursting into hysterical fits of anger if anyone disagreed with him. The two boys would often talk for hours on end; Hitler found Kubizek to be a very good listener, a worthy confidant to his hopes and dreams.\r\n\r\nIn 1908 Kubizek moved to Vienna and shared a room with Hitler at 29 Stumpergasse. During this time, Hitler tried to get into art school, but he was unsuccessful. With his money fast running out, he found himself sinking to the lower depths of the city: an unkind world of isolation and 'constant unappeasable hunger'. Hitler moved out of the flat in November, without leaving a forwarding address; Kubizek did not meet his friend again until 1938.\r\n\r\nThe Young Hitler I Knew tells the story of an extraordinary friendship, and gives fascinating insight into Hitler's character during these formative years. A must for Hitler scholars","torrent":{"xt":"urn:btih:1c8adf844f8718b964bbacb83dc8ec76db40b1ba","amp;dn":"The+Young+Hitler+I+Knew%3A+Memoirs+of+Hitler%27s+Childhood+Friend","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c8adf844f8718b964bbacb83dc8ec76db40b1ba","infoHashBuffer":{"type":"Buffer","data":[28,138,223,132,79,135,24,185,100,187,172,184,61,200,236,118,219,64,177,186]},"announce":[],"urlList":[]}}