{"title":"mIRC v7.22 + Crack-Serials [ChattChitto RG]","uid":6790525,"size":7202604,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1c95a3f180ef25a63d1787fe78022d5d53b17de9&amp;dn=mIRC+v7.22+%2B+Crack-Serials+%5BChattChitto+RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"ChattChitto","files":-1,"time":1320246412,"description":"mIRC v7.22 + Crack-Serials\n\n.exe File Format (Setup File - Crack - Serials - Instructions)\n\n***********************************************************************************\n\nmIRC v7.22\n\nHomepage: http://www.mirc.com/index.html\n\n\nmIRC is a popular Internet Relay Chat client used by millions of people, and thousands of organizations, to communicate, share, play and work with each other on IRC networks around the world. Serving the Internet community  for over a decade, mIRC has evolved into a powerful, reliable and fun piece of technology. You can download mIRC here.\n\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\n\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\n\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\n\nmIRC has been in development for over a decade and is constantly being improved and updated with new technologies. The most recent changes can be found on the latest news page. \n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n[Please Leave A Comment Confirming This Pack]","torrent":{"xt":"urn:btih:1c95a3f180ef25a63d1787fe78022d5d53b17de9","amp;dn":"mIRC+v7.22+%2B+Crack-Serials+%5BChattChitto+RG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c95a3f180ef25a63d1787fe78022d5d53b17de9","infoHashBuffer":{"type":"Buffer","data":[28,149,163,241,128,239,37,166,61,23,135,254,120,2,45,93,83,177,125,233]},"announce":[],"urlList":[]}}