{"title":"Concise Encyclopedia Of Plastics","uid":12404816,"size":73570159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ca6b94cc223c1154e7cd9723534d077e766bb3c&amp;dn=Concise+Encyclopedia+Of+Plastics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"clouderone","files":1,"time":1442077311,"description":"Concise Encyclopedia Of Plastics (Kluwer, 2000).pdf\n\nISBN 0-7923-8496-2\n\nAfter over a century of worldwide production of all kinds trol persons, cost estimators, buyers, vendors, consultants, of products, the plastics industry is now the fourth largest and others. industry in the United States. This brief, concise, and prac The bulk of the book is the alphabetical listing of en tical book is a cutting edge compendium of the plastics tries. Preceding those entries is A Plastics Overview: Fig industry's information and terminology-ranging from ures and Tables (which presents eight summary guides on design, materials, and processes, to testing, quality control, the subjects examined in the text) and then the World of regulations, legal matters, and profitability. New and use Plastics Reviews (which presents 14 articles that provide ful developments in plastic materials and processing con general introductory information, comprehensive updates, tinually are on the horizon, and the examples of these de and important networking avenues within the world of velopments that are discussed in the book provide guides plastics). Following the alphabetical listing of entries, at the to past and future trends. end of the encyclopedia, seven appendices provide back This practical and comprehensive book reviews the ground and source guide information keyed to the text of the book. The extensive and useful Appendix A, List of plastics industry virtually from A to Z through its more than 25,000 entries. Its concise entries cover the basic is Abbreviations, lists all abbreviations used in the text","torrent":{"xt":"urn:btih:1ca6b94cc223c1154e7cd9723534d077e766bb3c","amp;dn":"Concise+Encyclopedia+Of+Plastics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ca6b94cc223c1154e7cd9723534d077e766bb3c","infoHashBuffer":{"type":"Buffer","data":[28,166,185,76,194,35,193,21,78,124,217,114,53,52,208,119,231,102,187,60]},"announce":[],"urlList":[]}}