{"title":"Divinity.Original.Sin.Repack-R.G.Mechanics","uid":10676196,"size":5760830880,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1cf3cdceb4f84ab2f21f365fb2c917fb4e7568c6&amp;dn=Divinity.Original.Sin.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"Taker009","files":-1,"time":1406948293,"description":"Divinity.Original.Sin.Repack-R.G.Mechanics\n\n\n\n\n\nYear: 2014\nGenre: RPG / 3D / Isometric\nDeveloper: Larian Studios\nPublisher: Larian Studios\nPublication Type: RePack\nGame Language: Eng |Rus\nVoiceLanguage: Eng |Rus\nCrack: 3DMGAME\n\n\n\n\n\nSystem Requirements:\n\nOperating system: Windows Vista, Windows 7, Windows 8\nProcessor: Intel Core2 Duo E6600 or equivalent\nMemory: 2 GB\nVideo Card: NVIDIA Geforce 8800GTS / ATI Radeon HD 3870 or better DirectX 9.0c compatible\nSound Card: Sound device compatible with DirectXÂ® 9.0\nFree space on hard disk: 10.5 GB\n\nGame information:\n\nIn the story of Divinity: Original Sin us falls the role\nof some &quot;Hunters source&quot; - a little-known warriors guild,\nwhich had already been dubbed &quot;magic police.&quot;\nIn this largely storyline Divinity: Original Sin event precedes\nthe very first part of the Divinity, which marked the beginning\nof the world-famous fantasy series. We are waiting for the\nfamiliar characters, but radically different approach to the\nstory campaign.\n\nFrom the outset, the passage of Divinity: Original Sin tell us\nthat the world faces an invasion of orcs rivellona Tanarota who\nmanaged to master the powerful magic that distort reality. Now\nfree peoples in Divinity simply impossible to resist the fury\nof the orcs, and only two people are able to prevent future wars.\nSo, the main characters Divinity: Original Sin became at once\ntwo characters: damn warrior, who was released from custody,\nand a mysterious girl, who managed to conquer death. However,\nthroughout the game in Divinity saved pleasant affair: Heroes\ncombines some terrible secret which will only be able to find you.\n\nAnother key feature of Divinity: Original Sin was that the game\nimplements a classless system, which will be the basis of a number\nof diverse abilities to develop skills of the protagonists. However,\nin order to resist the stronger enemies in Divinity: Original Sin\nimplemented to collect detachments of troops, which can be assigned\nto commanders, as well as steps to improve the combat system of the army.\n\nThe game world in the new part of Divinity surprise you its realism\nand openness: you will travel through the vast Rivellon, facing face\nto face with a variety of unknown creatures, showing extreme caution.\nEach offense in the world Divinity can cost you your life!\n\n\nGame Features:\n\nThe two main characters\nThe lack of classes in the system of character development\nSet of capabilities and a wide arsenal of weapons\n\nAbility to recruit mercenaries in the squad and develop\ngeneral skills and spells to deal effectively with the enemy\nAdvanced system of dialogues, which gives an\nopportunity to express their point of view\n\nInteraction with any objects and combining them to create new objects\nTurn-based battle system with the ability to implement an elaborate\ntactics, using and combining skills, spells, terrain and terrain\nfeatures, work together\nMultiplayer mode.\nLevel editor. Two in one: the game and the\nopportunity to create your own campaign!\nMusic for the game was written by Kirill Pokrovsky,\nthe ex-keyboardist of &quot;Aria&quot; and &quot;Masters&quot;\n\n\nRepack Features:\n\nDivinity: Original Sin\nVersion of the game - v1.0.81.0\nDo not cut / recoded\nAbility to install VMware text from Notabenoid v.1.4\n\nAdditions:\n\nThe Golden Grail\nZandalor's Trunks","torrent":{"xt":"urn:btih:1cf3cdceb4f84ab2f21f365fb2c917fb4e7568c6","amp;dn":"Divinity.Original.Sin.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf3cdceb4f84ab2f21f365fb2c917fb4e7568c6","infoHashBuffer":{"type":"Buffer","data":[28,243,205,206,180,248,74,178,242,31,54,95,178,201,23,251,78,117,104,198]},"announce":[],"urlList":[]}}