{"title":"Fallen Son - Death of Captain America 01-05 (2007|Digital|TH-E)","uid":9913487,"size":60968872,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1d8f46bd8c05f269f757c32f8b839aeec5d3a6f2&amp;dn=Fallen+Son+-+Death+of+Captain+America+01-05+%282007%7CDigital%7CTH-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"VikTSlick","files":5,"time":1396918550,"description":"During Ed Brubaker's amazing run on Captain America, Steve Rogers was fatally shot and killed. Writer Jeph Loeb took a look at life without the good Captain in these five brief but poignant side stories, and how the mythical man affected all the various Marvel characters that are highlighted here. There's Spider-Man's tale of how inspiring Rogers could be; Wolverine's disbelief and rage over the death of his good friend and longtime ally; Hawkeye's mourning (after his own brush with death) and judgmental glimpse at the Young Avengers - with an interesting outcome; the grief of the Avengers being taken out in its own (violent) way, and even the empty chair at a regular card game, and how it represents a deep wound that won't close. Most importantly, Iron Man's guilt and regret over the outcome of &quot;Civil War&quot; and what it did to his relationship with Rogers as a whole. If you've ever been a fan of the Captain in any form, this is not a set of stories that you should miss. John Cassaday and others beautifully capture all the emotions in the faces of these great heroes. \n\nPromotional info for the collected edition - &quot;Where were you when Captain America died? Perhaps you were listening to the radio or reading the morning paper. Maybe you were surfing the web or on the phone with a friend. You were probably shocked, most likely thinking, &quot;How could they? How could this happen to Cap?&quot; And for a moment, you perhaps thought about all the ways the super soldier meant something to you. Something very real, very abiding. Fallen Son: Death of Captain America follows the reaction of the legendary heroes' best friends and closest comrades as they struggle to work through the emotions stirred by the loss of their ally, and the stages of grief that make them confront the part they may have played in that loss. This is their story. This is Cap's story. This is our story. The story of a Fallen Son and the world he helped make a better place.&quot;\n\nThis is all 5 of the short issues individually presented in shiny new digital copies, thanks to TheHand-Empire. Please seed and enjoy! :-)","torrent":{"xt":"urn:btih:1d8f46bd8c05f269f757c32f8b839aeec5d3a6f2","amp;dn":"Fallen+Son+-+Death+of+Captain+America+01-05+%282007%7CDigital%7CTH-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d8f46bd8c05f269f757c32f8b839aeec5d3a6f2","infoHashBuffer":{"type":"Buffer","data":[29,143,70,189,140,5,242,105,247,87,195,47,139,131,154,238,197,211,166,242]},"announce":[],"urlList":[]}}