{"title":"James Patterson - BookShots - 6 Short Books (New 2016)","uid":15000139,"size":7573773,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e280e92929d8cd0eb0efd5b8c0d924e1b289e7c&amp;dn=James+Patterson+-+BookShots+-+6+Short+Books+%28New+2016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":4,"uploader":"Skyeater","files":13,"time":1466370737,"description":"BookShots \r\nNovels you can devour in a few hours\r\nImpossible to stop reading\r\nAll original content from James Patterson\r\n\r\n-----------------------------------\r\n\r\nBlack &amp; Blue \r\nA beautiful young woman is found murdered on a river bank, and Detective Harriet Blue is convinced she's the next victim of the worst serial killer Sydney has seen in decades.\r\nBut the more Harriet learns, the more she realises this murder is not what she first thought. And her own life might be tangled up in the case.\r\n\r\nBreak Point \r\nOne point away from winning the French Open, tennis star Kirsten Keller breaks down and flees the court in tears.\r\nKeller has been receiving death threats. Terrified and desperate, she hires former Metropolitan police officer Chris Foster to protect her at Wimbledon.As the championship progresses, Kellerâ™s tormentor gets ever closer. And the threats become horrifyingly real.\r\n\r\nCross Kill \r\nAlex Cross, I'm coming for you--even from the grave if I have to.\r\nAlong Came a Spider killer Gary Soneji has been dead for over ten years. Alex Cross watched him die. But today, Cross saw him gun down his partner. Is Soneji alive? A ghost? Or something even more sinister?\r\nNothing will prepare you for the wicked truth.\r\n\r\nPrivate Royals \r\nJack Morgan is visiting Peter Knight and the team in the London branch of his investigation agency, Private.\r\nAt a cocktail party the night before the Trooping the Colour parade for the Queenâ™s 90th birthday, Jack receives a phone call from the Duke of Aldershot saying that his daughter, Abbie, has been kidnapped. He needs Private on the case – one word to the police and Abbie will be killed.Jack will have to find Abbie before 11:00 a.m. the next morning, or the kidnapping will turn to murder.\r\n\r\nThe Hostage \r\nThe grand opening of the world's most exclusive hotel: forty floors of breathtaking luxury.\r\nVIPs gather in London for the ultimate preview. But one uninvited guest plans to make this a day the city will never forget.\r\nGlobal Head of Security, Jon Roscoe, confronts a killer with a deadly timetable.\r\n\r\nZoo II \r\nWill the last humans on Earth please turn out the lights?\r\nJames Patterson's ZOO was just the beginning. The planet is still under violent siege by ferocious animals. Humans are their desperate prey. Except some humans are evolving, mutating into a savage species that could save civilization-or end it","torrent":{"xt":"urn:btih:1e280e92929d8cd0eb0efd5b8c0d924e1b289e7c","amp;dn":"James+Patterson+-+BookShots+-+6+Short+Books+%28New+2016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e280e92929d8cd0eb0efd5b8c0d924e1b289e7c","infoHashBuffer":{"type":"Buffer","data":[30,40,14,146,146,157,140,208,235,14,253,91,140,13,146,78,27,40,158,124]},"announce":[],"urlList":[]}}