{"title":"Liver Pathology (Demos Surgical Pathology Guides) [StormRG]","uid":11174410,"size":14714078,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1edf701f7b1784288e0bb5aef7ab3b3379e10eb8&amp;dn=Liver+Pathology+%28Demos+Surgical+Pathology+Guides%29+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"0xmovva","files":-1,"time":1412757987,"description":"TITLE/EDITIONLiver Pathology (Demos Surgical Pathology Guides)\nAuthor: Liver Pathology (Demos Surgical Pathology Guides)\nSeries: Demos Surgical Pathology Guides\nPaperback: 200 pages\nPublisher: Demos Medical; 1 edition (September 12, 2014)\nLanguage: English\nISBN-10: 1620700077\nISBN-13: 978-1620700075\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n________________________________________________________________________________\n\n\nLiver Pathology covers the key entities and diagnoses that pathologists see in daily practice, focusing on the salient H&amp;E histopathology of each entity with concise descriptions of clinical features, differential diagnosis, and references for further study. It provides the opportunity for correlation with clinical data and radiologic and laboratory findings that are essential to correct diagnosis of non-neoplastic disease and correlation with morphologic and immunohistochemical features in the case of neoplastic liver disease.\n\nThe book presents information in a bulleted format with H&amp;E illustrations to match histopathologic criteria, and summarizes helpful ancillary tests such as appropriate immunohistochemical panels. It provides a synopsis of all common liver entities and covers non-neoplastic conditions, including description of infectious processes, autoimmune and metabolic disorders, neonatal and pediatric conditions, drug-induced liver injury and liver allograft pathology. Coverage of neoplastic disease includes a selection of the most commonly seen malignancies including metastatic carcinoma. The book serves as a handy summary and quick reference guide for pathology residents and a &quot;portable refresher course&quot; or MOC review tool for the more experienced pathologist.\n\nThe Demos Surgical Pathology Guides series presents in summary and visual form the basic knowledge base that every practicing pathologist needs each working day. Series volumes cover the major specialty areas of surgical pathology, and coverage emphasizes the key entities and diagnoses that pathologists will see in practice, and that they must know whether in training or practice. The emphasis is on the basic morphology with newer techniques represented where they are frequently used. The series provides a handy summary and quick reference that any pathology resident or fellow will find useful. Experienced practitioners will find the series valuable as a portable refresher course or review tool.\n\nKey Features of Liver Pathology:\n\nCovers the key entities and diagnoses of liver pathology seen in daily practice\nProvides concise, bullet-point format for quick reference and easy review\nContains over 200 high-quality color images to match histopathologic criteria\nIncludes key references directing reader to recent literature and greater depth of information\nSummarizes helpful ancillary tests","torrent":{"xt":"urn:btih:1edf701f7b1784288e0bb5aef7ab3b3379e10eb8","amp;dn":"Liver+Pathology+%28Demos+Surgical+Pathology+Guides%29+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1edf701f7b1784288e0bb5aef7ab3b3379e10eb8","infoHashBuffer":{"type":"Buffer","data":[30,223,112,31,123,23,132,40,142,11,181,174,247,171,59,51,121,225,14,184]},"announce":[],"urlList":[]}}