{"title":"Joe Abercrombie - Sharp Ends (First Law World #7)","uid":14580335,"size":340043069,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1f0017b8e5c4cc3aded4aeb33d22d7ffa8367c83&amp;dn=Joe+Abercrombie+-+Sharp+Ends+%28First+Law+World+%237%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Cybotage","files":15,"time":1462867540,"description":"From New York Times bestselling author, Joe Abercrombie, comes a collection of award-winning short fiction set in the world of the First Law.\r\n\r\n1. A Beautiful Bastard: The Union army may be full of bastards, but there’s only one big enough to think he can save the day single-handed when the Gurkish come calling: the incomparable Colonel Sand dan Glokta.\r\n\r\n2. Made a Monster: After years of bloodshed, the idealistic chieftain Bethod is desperate to bring peace to the North. There’s only one obstacle left – his own lunatic champion.\r\n\r\n3. Small Kindnesses: The hopes of Shevedieh, the best thief in Westport, to turn her back on crime, come crashing down when she finds a huge drunkard sleeping in her doorway. Doing the right thing always comes at a price…\r\n\r\n4. The Fool Jobs: Curnden Craw has been sent with his dozen to recover a thing from beyond the Crinna. One small problem. No one seems to know what the thing is.\r\n\r\n5. Skipping Town: Shevedieh and Javre, ill-matched adventurers, find themselves forced to flee yet another self-made disaster.\r\n\r\n6. Hell: ‘I have seen hell, and it is a great city under siege.’ The fall of Dagoska through the eyes of a young acolyte.\r\n\r\n7. Two’s Company: Javre, Lioness of Hoskopp, runs into Cracknut Whirrun on a bridge over a remote canyon. Can Shevedieh persuade either of these proud heroes to step aside?\r\n\r\n8. Wrong Place, Wrong Time: Three not entirely innocent bystanders are sucked into the chaos of Monzcarro Murcatto’s vengeance.\r\n\r\n9. Some Desperado: There is no honour among thieves when the outlaw Smoke finds herself being hunted down by her own comrades.\r\n\r\n10. Yesterday, Near a Village Called Barden: Royal Observer Bremer dan Gorst reports to the king on another ugly little skirmish as summer dies in the North.\r\n\r\n11. Three’s a Crowd: It’s a foolish man who steals from the best thief in Styria, and when Horald the Finger steals her lover, it’s time for Shevedieh to stop running and start fighting. For those who work in the shadows, though, few things are ever quite as they seem…\r\n\r\n12. Freedom: Being an absolutely true account of the liberation of the town of Averstock from the grip of the incorrigible rebel menace by the famous Nicomo Cosca.\r\n\r\n13. Tough Times all Over: All Carcolf wants is to take her package from here to there, but in the city of fogs and whispers, there are always a dozen other rogues with their own ideas.\r\n\r\nSharp Ends combines previously published, award-winning tales with exclusive new short stories. Violence explodes, treachery abounds, and the words are as deadly as the weapons in this rogue's gallery of side-shows, back-stories, and sharp endings from the world of the First Law.\r\n\r\n\r\n\r\nRead by Steven Pacey\r\nFormat: MP3","torrent":{"xt":"urn:btih:1f0017b8e5c4cc3aded4aeb33d22d7ffa8367c83","amp;dn":"Joe+Abercrombie+-+Sharp+Ends+%28First+Law+World+%237%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f0017b8e5c4cc3aded4aeb33d22d7ffa8367c83","infoHashBuffer":{"type":"Buffer","data":[31,0,23,184,229,196,204,58,222,212,174,179,61,34,215,255,168,54,124,131]},"announce":[],"urlList":[]}}