{"title":"Introduction to Political Theory, 3E Hoffman [PDF][StormRG]","uid":11746596,"size":3489169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1fc0a5eb23379af276bc4ddb15bcf0d6fee3709c&amp;dn=Introduction+to+Political+Theory%2C+3E+Hoffman+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"0xmovva","files":2,"time":1426053218,"description":"TITLE/EDITION Introduction to Political Theory \nBy: John Hoffman (Author), Paul Graham (Author)\nPaperback: 528 pages\nPublisher: Routledge; 3 edition (April 12, 2015)\nLanguage: English\nISBN-10: 1408285924\nISBN-13: 978-1408285923\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n__________________________________________________________________________________\n\n\nIntroduction to Political Theory is a text for the 21st century. It shows students why an understanding of theory is crucial to an understanding of issues and events in a rapidly shifting global political landscape. Bringing together classic and contemporary political concepts and ideologies into one book, this new text introduces the major approaches to political issues that have shaped the modern world, and the ideas that form the currency of political debate.\n\nIntroduction to Political Theory relates political ideas to political realities through effective use of examples and case studies making theory lively, contentious and relevant.\n\nThis updated third edition comes with significant revisions which reflect the latest questions facing political theory, such as the French burqa controversy, ethnic nationalism and the value of research from sociobiology. Accompanying these debates is a wealth of new and thought-provoking case studies for discussion, including (consensual) sadomasochism, affirmative action and same-sex marriage. A new chapter on difference has also been added to complement those on feminism and multiculturalism.\n\nThe revised glossary, revamped website for further reading and new streamlined layout make Introduction to Political Theory third edition the perfect accompaniment to undergraduate study","torrent":{"xt":"urn:btih:1fc0a5eb23379af276bc4ddb15bcf0d6fee3709c","amp;dn":"Introduction+to+Political+Theory%2C+3E+Hoffman+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc0a5eb23379af276bc4ddb15bcf0d6fee3709c","infoHashBuffer":{"type":"Buffer","data":[31,192,165,235,35,55,154,242,118,188,77,219,21,188,240,214,254,227,112,156]},"announce":[],"urlList":[]}}