{"title":"Handstand Two","uid":10519543,"size":107346687,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:201775b3a7237849e9afbc7185ed52d10e79d7b0&amp;dn=Handstand+Two&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"wildturkey00","files":2,"time":1404956522,"description":"Format: PDF/webrip\nGenre: Workout/tutorial\nPublished: N/A\n\nBook Description: Master the pike press to handstand while developing pancake flexibility in this web-delivered course by Coach Christopher Sommer.\nCourse Prerequisite:\n\n-Foundation Two\n\n\nPress handstands are the most perfect of all GST exercises; strength, mobility, balance and agility all rolled into a single movement. For beginning to advanced beginning level athletes, press handstands should be THE staple exercise of their conditioning program.This multimedia course takes you from the level of an absolute beginner to a pike press handstand. Each step along the way has detailed workout plans, exercises specifically for the pancake, and mobility drills to make you stronger and more flexible.\n\n\nWith over 175 pictures and 60 videos, our goal is to help you succeed in training. We show only athletes who have trained using these methods (no fitness models) and the training comes from Coach Sommer himself, a National-level USAG coach of nearly 40 years. We have a long line of champion athletes to show this training works, and back our product with a 100% money-back promise if you are not satisfied.\n\n\nHandstand Two also integrates directly into your Foundation Three and Four workouts and can (and should) be trained with Handstand One.","torrent":{"xt":"urn:btih:201775b3a7237849e9afbc7185ed52d10e79d7b0","amp;dn":"Handstand+Two","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"201775b3a7237849e9afbc7185ed52d10e79d7b0","infoHashBuffer":{"type":"Buffer","data":[32,23,117,179,167,35,120,73,233,175,188,113,133,237,82,209,14,121,215,176]},"announce":[],"urlList":[]}}