{"title":"Marilyn Manson - The Pale Emperor [24bit FLAC] vinyl","uid":11679141,"size":1669743343,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2050c894d3ee3c689b68fc0db6112255267fdde2&amp;dn=Marilyn+Manson+-+The+Pale+Emperor+%5B24bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"politux","files":14,"time":1423003653,"description":"\n  Marilyn Manson - The Pale Emperor [24bit FLAC] vinyl\n\n  Released: 2015\n  Genre: Electronic\n  Style: Industrial\n  Source: Loma Vista Recordings LVR-36856-02 Deluxe Edition vinyl\n  Codec: FLAC\n  Bit rate: ~ 2,700 kbps\n  Bit depth: 24\n  Sample rate: 96 kHz\n\n  01 Killing Strangers \n  02 Deep Six \n  03 Third Day of a Seven Day Binge \n  04 The Mephistopheles of Los Angeles \n  05 Warship My Wreck \n  06 Slave Only Dreams To Be King \n  07 The Devil Beneath My Feet \n  08 Birds of Hell Awaiting \n  09 Cupid Carries a Gun\n  10 Odds of Even\n  11 Day 3 \n  12 Fated, Faithful, Fatal \n  13 Fall of the House of Death \n\n  Ripping Info: (not my rip)\n\n  Technics SL-1600MK2 - Pangea AC-14SE Power Cable\n  Ortofon Quintet Black\n  TEAC AI-2000 Integrated Amp - Pangea AC-9 Power Cable\n  Jolida JD9-MKII Preamp - Pangea AC-14 Power Cable\n  Arcam irDAC\n  Blue Jeans Cable LC-1 Low Capacitance Audio Cable used with all interconnections\n  Vinyl Studio\n\n  Review by Fred Thomas\n\n  In 2012, icons of evil Marilyn Manson issued their eighth album, Born Villain, a surprisingly strong record that redeemed some of the weaker work that they'd been churning out since they reached their zenith of popularity and artistry in the late '90s. The album got closer to the intensity and showmanship of their most over the top days without simply sounding like a band trying to relive faded glories. With follow-up The Pale Emperor, Manson and his band continue to ride that comeback hot streak, this time working in a decidedly more blues-influenced vein, combining a trademark penchant for lyrical darkness with the most unholy type of biker rock for ten songs that swagger and simmer in unexpected ways. The album kicks off with &quot;Killing Strangers,&quot; a slow-burning trudge of stomping percussion and sleazy guitar licks, coming off like a far more sedated if somewhat grizzled counterpart to the band's 1996 hit &quot;The Beautiful People.&quot; There's still some of the industrial metal backbone that the band developed throughout its career, but even heavier rockers like &quot;Deep Six&quot; and &quot;Warship My Wreck&quot; roll around in dusty tumbleweeds of blues licks, intense percussion, and depraved synthesizers. Many songs for the album were captured in a single take, giving even more cinematic blues ramblers like &quot;Third Day of a Seven Day Binge&quot; and &quot;Cupid Carries a Gun&quot; a heightened sense of abandon and danger. Production is loose and humid throughout, and above all Manson and company sound like they're stepping away completely from the caricature of themselves that started looming on the band's weakest mid-2000s material. Taking their sound in a new, unforeseen bluesy direction accomplishes the near impossible by making Marilyn Manson sound even more sinister than before","torrent":{"xt":"urn:btih:2050c894d3ee3c689b68fc0db6112255267fdde2","amp;dn":"Marilyn+Manson+-+The+Pale+Emperor+%5B24bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2050c894d3ee3c689b68fc0db6112255267fdde2","infoHashBuffer":{"type":"Buffer","data":[32,80,200,148,211,238,60,104,155,104,252,13,182,17,34,85,38,127,221,226]},"announce":[],"urlList":[]}}