{"title":"Ingested - The Architect of Extinction (2015)ak","uid":11683826,"size":101908561,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20f940c3cf6713a72a577f4489ae037f7710db2d&amp;dn=Ingested+-+The+Architect+of+Extinction+%282015%29ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"analogkid6103","files":11,"time":1423183172,"description":"\nimage\nRelease Date : Jan 12, 2015\n\nIngested are a brutal death metal band from Manchester. Their main influences lie in slam death metal and the deathcore scene, so you can expect to hear elements of both on this album.\n\nThe vocalist, Jason Evans, has a wide range. He has a mid-range growl, a lower guttural, a higher pitched shriek and occasionally uses a pig squeal. His gutturals are the most commonly used, with the others coming in less often. Because each technique isn't too overused, they never get boring and it gives this album a very refreshing feel. All his techniques sound decent, and while he's nothing special, he certainly has a better range than most death metal vocalists these days. Unfortunately, as the vocals and the drums are both pretty high in the mix, hearing anything else over either is a problem\n\nThe guitars are fast and heavy, but hearing them is a problem. They're almost drowned out by the vocals and drums, meaning I can't really say much more beyond that. However, there is one thing that sticks out: a solo in Stillborn. It's nothing special, but solos in this genre are rare and hearing it makes a nice change from slams and chugging riffs.\n\nThe drums are really, really, really fucking fast and so blatantly triggered! They sound like a machine gun going off! The only problem with that is that they NEVER slow down, and like I said before they're so loud they tend to drown everything else out but the vocals (which may explain why the bass is so inaudible apart from very briefly in closer Anal Evisceration).\n\nLyrically, this is typical brutal death metal e.g. rape, gore, mutilation etc. However, the lyrics are slightly more humorous (I challenge you to read the lyrics to Intercranial Semen Injection and not smile just a tiny bit).\n\nOverall a solid effort, but a better production could've done it a ton of favors. Also, listening to this album several times within a short amount of time leads to it getting quite boring. Definitely an album you bring out every once in a while when you wanna hear some brutal, heavy shit.\n\n80/100, nothing more.\n\nTracklist:\n\n01. The Divine Right Of Kings\n02. Narcissistic Apathy\n03. Endless Despondency\n04. The Heirs To Mankind's Atrocities\n05. I, Despoiler (04:22)\n06. Penance\n07. A Nightmare Incarnate\n08. Extinction Event\n09. Amongst Vermin\n10. Rotted Eden\n\n\ncGyo0L5kuR.jpg\ntrusted, verified ,guarenteed,\n\nenjoy &amp; seed\nGenre: Death\nSubgenre: Brutal Deathcore\nBitrate: 320 k\nSize: 97.19 MB\nShow/Hide Files:\n11 files","torrent":{"xt":"urn:btih:20f940c3cf6713a72a577f4489ae037f7710db2d","amp;dn":"Ingested+-+The+Architect+of+Extinction+%282015%29ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20f940c3cf6713a72a577f4489ae037f7710db2d","infoHashBuffer":{"type":"Buffer","data":[32,249,64,195,207,103,19,167,42,87,127,68,137,174,3,127,119,16,219,45]},"announce":[],"urlList":[]}}