{"title":"The Afghan Whigs - Do to the Beast (2014) [FLAC]","uid":9979686,"size":263086527,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:211b1fa98a449047e8e3129ad1318cec42a0fd4f&amp;dn=The+Afghan+Whigs+-+Do+to+the+Beast+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"politux","files":-1,"time":1397723394,"description":"\n  The Afghan Whigs - Do to the Beast (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Parked Outside\n  02 Matamoros\n  03 It Kills\n  04 Algiers\n  05 Lost in the Woods\n  06 The Lottery\n  07 Can Rova\n  08 Royal Cream\n  09 I Am Fire\n  10 These Sticks\n\n  Of the bands that came from the &quot;heavy alternative&quot; scene typified by the Sub Pop roster in the late '80s to early '90s, the Afghan Whigs were one of the very best, and also one of the least likely to connect with a mass audience -- their music was strong and powerful, the songs were outstanding soul-inflected hard rock, and Greg Dulli's nicotine-bathed voice was the perfect fit for their musical approach, but they were willing to dig deeper into the dark spaces of self-loathing and needy emotional manipulation than anyone else in rock, and as a consequence their finest and most compelling album, 1993's Gentlemen, was often hard to hear for all its grim fascination with the ugly side of the male psyche. It seemed the band couldn't go any deeper, and they didn't on their final two albums, 1996's Black Love and 1998's 1965, but after a heroically received reunion tour in 2012, the Afghan Whigs returned to the recording studio and have offered up a work nearly as dark and unsettling as Gentlemen, 2014's Do to the Beast. \n\n  It sounds a good bit different than their previous work: vocalist and songwriter Dulli and bassist/multi-instrumentalist John Curley are the only original members of the band on board, and the sheets of electric guitar generated by Rick McCollum are particularly missed, replaced with a larger ensemble (including lots of keys, occasional strings, and busy percussion) that boasts a broader dramatic scope than the classic Whigs sound but fails to connect with the same ferocity. Dulli's phrasing and sense of drama are as solid as ever, but his instrument is significantly grainier than it has been in the past, and he has a bit of trouble making this material signify (the fact that his vocals are frequently deep in the mix doesn't help much). And Do to the Beast chronicles a relationship just as damaged as you'd expect from Dulli, but the songs don't quite cohere into a larger statement with the grace of his best work, even if the performances and arrangements manage to be something more than the sum of their parts. Do to the Beast is an ambitious attempt to re-create the feeling of the Afghan Whigs while retooling their sonic fingerprint; the final product is intelligent and often fascinating, but it doesn't deliver like the Afghan Whigs do at their best, and ultimately comes off as a brave but somewhat unsatisfying experiment.","torrent":{"xt":"urn:btih:211b1fa98a449047e8e3129ad1318cec42a0fd4f","amp;dn":"The+Afghan+Whigs+-+Do+to+the+Beast+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"211b1fa98a449047e8e3129ad1318cec42a0fd4f","infoHashBuffer":{"type":"Buffer","data":[33,27,31,169,138,68,144,71,232,227,18,154,209,49,140,236,66,160,253,79]},"announce":[],"urlList":[]}}