{"title":"Portrait Professional Studio 9.0.14","uid":5454167,"size":35796442,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:211f6151a4d657333211137a43044966c9738403&amp;dn=Portrait+Professional+Studio+9.0.14&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"ramachandra","files":2,"time":1269274199,"description":"An application that allows anyone to look great in a photo\nPortrait Professional is a sophisticated computer program that has been trained in male and female beauty. The software has been shown hundreds of examples of beautiful photographs of human faces, and using sophisticated statistical techniques, it has learnt how to subtly enhance photographs to make them more beautiful.\n\nWhat does this mean for you? It means that you can give your photographs an automatic &quot;celebrity makeover&quot; correcting the lighting and makeup, removing blemishes and generally making your subject look as good as possible.\nPortrait Professional is a painting program that will not require any artistic skill. All you have to do is identify some points on the photo - such as the corners of the eyes, and the edges of the lips - and the software then calculates how to make your subject look their absolute best.\nThe software has been trained in all aspects of beauty. It allows you to choose how much to enhance the lighting, the skin texture and even how many wrinkles to remove. It even allows you subtly re-sculpt the face to make your subject look as good as possible.\nPortrait Professional enhances people in the same way that good lighting and perfect makeup is used to make someone look more attractive. The software lets anyone look as good as a celebrity in a magazine.\n\nHere are some key features of &quot;Portrait Professional&quot;:\nFace Sculpting\nAirbrush\nSkin toner\nLighting regulation\nShadow control\nHighlight control\nWhite balance\nEye whitening\nTeeth whitening\nSpot removal\nRed-eye removal\nFree upgrades for 6 months\nSupport for 8 bits per color channel images\n(JPEG and TIFF formats)\nSupport for 16 bits per color channel images\nReads RAW image files\nWhat's New in This Release:\nSmooth, recolor and thicken the hair\nControl the eyes and mouth in much greater detail\nChange the eye color of the subject\nSave and use multiple changes at once with Saved Slider configurations\nImproved User Interface: Help, Tutorial and Undo functions making Portrait Professional the easiest to use photo-editing software available\n\nOS: Windows 2000, XP, 7 or Vista?\n\nHomepage-http://www.anthropics.com/portraitprofessional/index.html\n\nInstall notes: After you installed Portrait Professional Studio,\nplease put(replace) the PortraitProfessionalStudio.exe\nin [Portrait Professional Studio-Installed-Dir].\n\nOnly true working version since 6,3.5","torrent":{"xt":"urn:btih:211f6151a4d657333211137a43044966c9738403","amp;dn":"Portrait+Professional+Studio+9.0.14","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"211f6151a4d657333211137a43044966c9738403","infoHashBuffer":{"type":"Buffer","data":[33,31,97,81,164,214,87,51,50,17,19,122,67,4,73,102,201,115,132,3]},"announce":[],"urlList":[]}}