{"title":"Anthony Kenny - A New History of Western Philosophy (4 vols.)","uid":10704983,"size":24851814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:214a4ecf7202ab2c2775371e60c990a0d41d6a3c&amp;dn=Anthony+Kenny+-+A+New+History+of+Western+Philosophy+%284+vols.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"workerbee","files":-1,"time":1407270889,"description":"\nAnthony Kenny - A New History of Western Philosophy (Oxford UP, 2004-2007).  4 vols.\n\n  * Volume 1: Ancient Philosophy (368 pp.)\n  * Volume 2: Medieval Philosophy (352 pp.)\n  * Volume 3: The Rise of Modern Philosophy (376 pp.)\n  * Volume 4: Philosophy in the Modern World (368 pp.)\n\n\nThese four volumes are no less than a guide to the whole of Western philosophy -- the ideas that have undergirded our civilization for two-and-a-half thousand years.  Anthony Kenny tells the story of philosophy from ancient Greece through the Middle Ages and the Enlightenment into the modern world.  He introduces us to the great thinkers and their ideas, starting with Plato, Aristotle, and the other founders of Western thought.  In the second volume, he takes us through a thousand years of medieval philosophy, and shows us the rich intellectual legacy of Christian thinkers like Augustine, Aquinas, and Ockham.  Moving into the early modern period, we explore the great works of Descartes, Hobbes, Locke, Leibniz, Spinoza, Hume, and Kant, which remain essential reading today.  In the nineteenth and twentieth centuries, Hegel, Mill, Nietzsche, Freud, and Wittgenstein again transformed the way we see the world.\n\nRunning though the volumes are certain themes which have been constant concerns of philosophy since its early beginnings: the fundamental questions of what exists and how we can know about it; the nature of humanity, the mind, truth, and meaning; the place of God in the universe; how we should live and how society should be ordered.  Kenny traces the development of these themes through the centuries: we see how the questions asked and answers offered by the great philosophers of the past remain vividly alive today.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                           &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:214a4ecf7202ab2c2775371e60c990a0d41d6a3c","amp;dn":"Anthony+Kenny+-+A+New+History+of+Western+Philosophy+%284+vols.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214a4ecf7202ab2c2775371e60c990a0d41d6a3c","infoHashBuffer":{"type":"Buffer","data":[33,74,78,207,114,2,171,44,39,117,55,30,96,201,144,160,212,29,106,60]},"announce":[],"urlList":[]}}