{"title":"Baraka (1992) [DVDrip (XviD)]","uid":4113336,"size":727155727,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21764b8beb2c37bfe8b3ae430076584ee65dfefc&amp;dn=Baraka+%281992%29+%5BDVDrip+%28XviD%29%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"Ekolb","files":3,"time":1207174901,"description":"Baraka (1992) is a Todd-AO (70 mm) purely cinematic visual film directed by Ron Fricke, cinematographer for Koyaanisqatsi, the first of the Qatsi films by Godfrey Reggio.\n\nOften compared to Koyaanisqatsi, Baraka&amp;#039;s subject matter has some similarities?including footage of various landscapes, churches, ruins, religious ceremonies, and cities thrumming with life, filmed using time-lapse photography in order to capture the great pulse of humanity as it flocks and swarms in daily activity. The film also features a number of long tracking shots through various settings, including one through former concentration camps at Auschwitz (in Nazi-occupied Poland) and Tuol Sleng (in Cambodia) turned into museums honoring their victims: over photos of the people involved, past skulls stacked in a room, to a spread of bones. In addition to making comparisons between natural and technological phenomena, such as in Koyaanisqatsi, Baraka searches for a universal cultural perspective: for instance, following a shot of an elaborate tattoo on a bathing Japanese yakuza mobster with one of Native Australian tribal paint.\n\nThe movie was filmed at 152 locations of 24 countries: Argentina, Australia, Brazil, Cambodia, China, Ecuador, Egypt, France, Hong Kong, India, Indonesia, Iran, Israel, Italy, Japan, Kenya, Kuwait, Nepal, Poland, Saudi Arabia, Tanzania, Thailand, Turkey, and the United States. It contains no dialogue. Instead of a story or plot, the film uses themes to present new perspectives and evoke emotion purely through cinema. The film was the first in over twenty years to be photographed in the 70mm Todd-AO format.\n\nThe title Baraka is a word that means blessing in many different languages. The score provided by Brendan Perry and Lisa Gerrard (from Dead Can Dance) and Michael Stearns is noticeably different from the minimalist one provided by Philip Glass for Koyaanisqatsi. Notable music was also contributed by the band Brother. The film was produced by Mark Magidson, who also produced and directed the film Toward the Within, a live concert performance by Dead Can Dance. A sequel to Baraka, Samsara, is currently in production and expected to be released in 2008.\n\nDirected by Ron Fricke \nProduced by Mark Magidson \nWritten by Constantine Nicholas\nGenevieve Nicholas \nMusic by Michael Stearns, Dead Can Dance \nRelease date(s) 1992 \nRunning time 96 min \nLanguage None\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0103767/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0103767/&lt;/a&gt;\n\nLength.......................: 01h 36m 37s\nResolution...................: 624 x 352\nCodec........................: XviD, 2 Pass mode\nBitrate......................: Avg. 895 kBit/s\nFormat.......................: MP3\nChannels.....................: 2 Channels (Surround Stereo)\nSampleRate...................: 48000 Hz\nBitrate......................: 96 kBit/s\n\nEkolb.","torrent":{"xt":"urn:btih:21764b8beb2c37bfe8b3ae430076584ee65dfefc","amp;dn":"Baraka+%281992%29+%5BDVDrip+%28XviD%29%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21764b8beb2c37bfe8b3ae430076584ee65dfefc","infoHashBuffer":{"type":"Buffer","data":[33,118,75,139,235,44,55,191,232,179,174,67,0,118,88,78,230,93,254,252]},"announce":[],"urlList":[]}}