{"title":"[Richard_Williams]The Animators Survival Kit(Expanded Edition)(p","uid":11003204,"size":36740430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2202c1665b4bd74711ae1c09c6fbcc26aae1526c&amp;dn=%5BRichard_Williams%5DThe+Animators+Survival+Kit%28Expanded+Edition%29%28p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410181400,"description":"The definitive book on animation, from the Academy Award-winning animator behind &quot;Who Framed Roger Rabbit?&quot; Animation is one of the hottest areas of filmmaking today--and the master animator who bridges the old generation and the new is Richard Williams. During his fifty years in the business, Williams has been one of the true innovators, winning three Academy Awards and serving as the link between Disney's golden age of animation by hand and the new computer animation exemplified by &quot;Toy Story.&quot; Perhaps even more important, though, has been his dedication in passing along his knowledge to a new generation of animators so that they in turn could push the medium in new directions. In this book, based on his sold-out master classes in the United States and across Europe, Williams provides the underlying principles of animation that every animator--from beginner to expert, classic animator to computer animation whiz --needs. Urging his readers to &quot;invent but be believable,&quot; he illustrates his points with hundreds of drawings, distilling the secrets of the masters into a working system in order to create a book that will become the standard work on all forms of animation for professionals, students, and fans.\n\nPublisher: Faber &amp; Faber (December 8, 2009)\nASIN: B008GAT3S6\n\n","torrent":{"xt":"urn:btih:2202c1665b4bd74711ae1c09c6fbcc26aae1526c","amp;dn":"%5BRichard_Williams%5DThe+Animators+Survival+Kit%28Expanded+Edition%29%28p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2202c1665b4bd74711ae1c09c6fbcc26aae1526c","infoHashBuffer":{"type":"Buffer","data":[34,2,193,102,91,75,215,71,17,174,28,9,198,251,204,38,170,225,82,108]},"announce":[],"urlList":[]}}