{"title":"InfiniteSkills - Learning Ruby On Rails 4","uid":11276186,"size":1463607736,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:224c87b254888dcb9c1e1db881e180740e4390ad&amp;dn=InfiniteSkills+-+Learning+Ruby+On+Rails+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"NepsterJay","files":103,"time":1414110604,"description":" In this Ruby on Rails training course, expert author Brian Hoke will take you through the key features of this open-source web development framework while leading you through the development of a time-tracking web application. This course is designed for users that already have a working knowledge of the Ruby programming language.\n\nYou will start with a tour of Ruby Syntax and how to run Ruby code, learning about objects and classes, strings and numerics, and control structures in Ruby. You will then begin to create a Rails app, covering topics such as domain modeling, controllers, views, creating forms, and authentication. This video tutorial will also teach you how to use Ajax with Rails, handle file uploads, send emails from the server, and export content to CSV, JSON, and XML. Finally, you will learn how to test Rail apps and write model and controller tests.\n\nBy the completion of this computer based training course, you will be fully capable of creating a web app from start to finish with Ruby on Rails. Working files are included, allowing you to follow along with the author throughout the lessons","torrent":{"xt":"urn:btih:224c87b254888dcb9c1e1db881e180740e4390ad","amp;dn":"InfiniteSkills+-+Learning+Ruby+On+Rails+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"224c87b254888dcb9c1e1db881e180740e4390ad","infoHashBuffer":{"type":"Buffer","data":[34,76,135,178,84,136,141,203,156,30,29,184,129,225,128,116,14,67,144,173]},"announce":[],"urlList":[]}}