{"title":"ISO to USB tool       burn ISO to USB drive","uid":7322927,"size":1503342,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2326953b0ce98ecad367fa112b32a35a4755d601&amp;dn=ISO+to+USB+tool+++++++burn+ISO+to+USB+drive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"mietje64","files":-1,"time":1338670667,"description":" &lt;a href=&quot;http://www.isotousb.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.isotousb.com/&lt;/a&gt;\n\n\nISO to USB is a free and small software that can burn the ISO image file directly to the USB drives, these USB drives include USB flash drives, memory sticks and other USB storage devices, it also supports to create a bootable USB disk with Windows operating systems. Freeware.\n\n\nThe ISO image file is a popular image of the CD/DVD discs, an ISO file can include all the content on the disc, this software can easily burn these ISO files to a USB flash disk, makes it easy to carry and use. The program's interface is very simple, you only need select the ISO file you want to burn and the target USB drive, then click &quot;Burn&quot; button, an USB disk that includes all ISO image data will be created. There do not have any complicated settings, it is easy to use very much.\n\nBootable USB flash disks\n\nThis software currently only support Windows bootable disk, can work with both BOOTMGR and NTLDR boot mode, can create USB disk with FAT, FAT32, exFAT or NTFS file system. (When you are making a bootable USB disk, suggest you choose the FAT32 file system.)\n\nThis program have be tested with WinXP, Win7 PE and WinXP PE bootable ISO image files, it can work fine, the generated USB disk can normally boot the computers. Only a small part of the machines can boot Win7, but can not boot WinXP, these machines will display &quot;NTLDR is missing&quot;, for this problem there is no good solution currently.","torrent":{"xt":"urn:btih:2326953b0ce98ecad367fa112b32a35a4755d601","amp;dn":"ISO+to+USB+tool+++++++burn+ISO+to+USB+drive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2326953b0ce98ecad367fa112b32a35a4755d601","infoHashBuffer":{"type":"Buffer","data":[35,38,149,59,12,233,142,202,211,103,250,17,43,50,163,90,71,85,214,1]},"announce":[],"urlList":[]}}