{"title":"Teach Yourself VISUALLY Excel 2013 [PDF] [StormRG]","uid":11023938,"size":64557293,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23b0657bccf7da2bd180daa0a5ddd73bc96a0b39&amp;dn=Teach+Yourself+VISUALLY+Excel+2013+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"steelballz","files":-1,"time":1410642846,"description":"Description\nTeach Yourself VISUALLY Excel 2013\nAuthor:McFedries, Paul\nPublisher and Published Date:Visual (Feb. 25 2013)\nISBN-10:1118505395\nISBN-13:9781118505397\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nThe step-by-step, visual way to learn Excel 2013\n\nExcel can be complicated, but this Visual guide shows you exactly how to tackle every essential task with full-color screen shots and step-by-step instructions. You'll see exactly what each step should look like as you learn to use all the new tools in this latest release of the world's most popular spreadsheet program. In easy two-page lessons, author Paul McFedries shows you how to organize, present, analyze, and chart data, over the web or on a network.\n\nThe Visual learning system is perfect for teaching Excel; previous editions of this book have sold more than 230,000 copies\nCovers common Excel 2013 tasks such as creating spreadsheets and charts, filtering and sorting data, and working with PivotTables\nProvides step-by-step instructions for each task\nEach step is illustrated with full-color screenshots\n\nTeach Yourself VISUALLY Excel 2013 offers visual learners the ideal way to master this popular but complex spreadsheet program.\n\n\n\n\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:23b0657bccf7da2bd180daa0a5ddd73bc96a0b39","amp;dn":"Teach+Yourself+VISUALLY+Excel+2013+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23b0657bccf7da2bd180daa0a5ddd73bc96a0b39","infoHashBuffer":{"type":"Buffer","data":[35,176,101,123,204,247,218,43,209,128,218,160,165,221,215,59,201,106,11,57]},"announce":[],"urlList":[]}}