{"title":"Warhammer Fantasy Army book The Empire 8E - 2011","uid":10573375,"size":69466268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23d07663c9c48f17a2b20ceea03659c81f0e5537&amp;dn=Warhammer+Fantasy+Army+book+The+Empire+8E+-+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"nezhit88","files":1,"time":1405613790,"description":"Warhammer FB - Army book - Warhammer Armies The Empire (8E) - 2011,98 pages\n\nThe Empire is the largest and most powerful realm in the Old World. Founded by the warrior-god Sigmar, it is built up of city-states and provinces that are now bound together under the rule of the Emperor Karl Franz. Only through the actions of its tireless citizens, valiant heroes and mighty war machines, has it repelled the numerous invasions brought against it. Though the pride of the nation is undoubtedly the cosmopolitan cities where the pinnacle of human achievements can be found, the discipline and martial skill of its professional armies are also rightfully famous throughout the Old World.\n\nAs an Empire collector, you have access to a huge variety of troop types, from colourful regiments of State Troops and Knightly Orders, to arcane War Machines and formidable Battle Wizards. March your Empire warriors heroically into the teeth of the enemy; blast your foes from afar with powerful artillery and volleys of handgun fire; obliterate them with an array of magical weapons and spells. The Empire player has endless choices before them...\n\nThis 96-page full-colour hardback Warhammer Army Book contains all the rules you need to field your Empire army, as well as detailed background information, bestiary, accompanying artwork and miniatures showcase.\n\nP.S. As said earlier a full Warhammer FB's torrent you can find on the Demonoid.ph (I can't upload whole ~17GB on thepiratebay because of the upload rules right now). Ignore no seeders in torrent description, online mostly 24/7.\n\nFAPZILLA continues to download from thepiratebay.","torrent":{"xt":"urn:btih:23d07663c9c48f17a2b20ceea03659c81f0e5537","amp;dn":"Warhammer+Fantasy+Army+book+The+Empire+8E+-+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23d07663c9c48f17a2b20ceea03659c81f0e5537","infoHashBuffer":{"type":"Buffer","data":[35,208,118,99,201,196,143,23,162,178,12,238,160,54,89,200,31,14,85,55]},"announce":[],"urlList":[]}}