{"title":"Rocket Theme-Joomla Complete","uid":9170855,"size":458472741,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:23fd6f2ab3ebc67c5b920712c90c9869b060af83&amp;dn=Rocket+Theme-Joomla+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"Solaris17","files":1,"time":1384065290,"description":"Complete Rocket theme collection brought to you by Solaris17. This pack is separated into folders and includes all themes and their extensions as well as standalone joomla extensions such as roksprocket. This is up-to-date as of Nov-10-2013.\n\nThis pack contains the following themes as of Nov-10-2013 Joomla 3.2 release from the years.\n\n2013\n2012\n2011\n2010\n2009\n2008\nLegacy\nFree\n\nSome themes 2010 and older have joomla 2.5 and joomla 1.5 editions because of the complexity of some of the changes. I included both for some few users that may use old versions of joomla. ~2009 and older templates come with separate extension packs these are also included. \n\nEvery theme is the &quot;bundle&quot; and NOT the template only. This is because I wanted to avoid downloaders from needing to install the gantry framework separately as the &quot;bundles&quot; have gantry pre-integrated.\n\nEven older templates ~2008 and older do not have a &quot;bundle&quot; since they do not require gantry and are usually more simple themes. In these cases I have simply included the template and their required extensions if any. \n\nAs a bonus I have added the club only extensions as well as the free ones in a separate folder (Theme specific extensions are inside the folder the theme in question is in).\n\nThis is the most complete collection to date these are raw unmodified .zip and .tar files from rocket theme directly. If you like them please consider supporting THEM!\n\nHappy hosting\n","torrent":{"xt":"urn:btih:23fd6f2ab3ebc67c5b920712c90c9869b060af83","amp;dn":"Rocket+Theme-Joomla+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23fd6f2ab3ebc67c5b920712c90c9869b060af83","infoHashBuffer":{"type":"Buffer","data":[35,253,111,42,179,235,198,124,91,146,7,18,201,12,152,105,176,96,175,131]},"announce":[],"urlList":[]}}