{"title":"Prototype 2 XBOX360-COMPLEX","uid":7198337,"size":8739295405,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:24150deff24fcdef91818c4ffd10587a33e7fc70&amp;dn=Prototype+2+XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":9,"uploader":"boobsman","files":-1,"time":1334854309,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT+2.0 or ABOVE!!!\n\nPrototype 2 XBOX360-COMPLEX\n\nThe sequel to Radical Entertainment's best-selling open-world action game \nof 2009, PROTOTYPE  2 takes the unsurpassed carnage of the original \nPROTOTYPE and continues the experience of becoming the ultimate \nshape-shifting weapon. You are Sgt James Heller, husband to a deceased wife \nand child and a soldier left simply to die. \n  \nAs the game's all-new infected protagonist, players will experience Sgt \nJames Heller cutting a bloody swathe through the wastelands of post-viral \nNew York Zero. Equipped with unparalleled new shapeshifting powers,players \nwill gradually build a vast genetic arsenal of deadly new biological \nweapons and abilities as they hunt, kill and consume their way toward the \nultimate goal - to kill...Alex...Mercer! \n  \n\nPrepare to unleash the ultimate form of shape-shifting devastation. Sgt \nJames Heller's incredible new Tendril power lets you lift and tear apart \ncars and military vehicles, ensnare powerful infected beasts and even rip \nlarge groups of enemies to shreds . Get ready to unleash hell! \n  \nPrototype 2 delivers the raw power of character customization back into \nyour hands, allowing players to creatively mix-n-match a devastating range \nof new Mutation perks into their ultimate Prototype. Faster and bigger \nlocomotion abilities, sharper claws or even enhanced disguise abilities - \nthe choice is yours! \n  \nImagine having the power to track down any enemy by unleashing a \npowerful sonar-pulse from your body! Sgt James Heller brings an all new \ndimension to the Prototype experience by letting you Hunt, Kill and Become \nanyone standing in your way. Disguise yourself as a soldier, scientist or \nanyone at all whilst absorbing their memories and acquiring new abilities. \nIt doesn't get any better than this! \n  \nNext year, gamers will experience the epic story of Sgt James Heller \nattempting to take down the devil himself... Alex Mercer. Unraveled against \nthe explosive backdrop of New York Zero and it's vicious factions warring \nfor control over the infection, Prototype 2 sets the stage for the ultimate \nshowdown &quot;event&quot; videogame of 2012. \n  \nUtilizing the unparalleled technology of Radical's proprietary 'Titanium \n2.0' engine, Prototype 2 will redefine gamer's expectations of over-the-top \nopen world action. Witness building-sized Infected behemoths bullrushing \nentire city streets, whilst gliding and parkouring across swarms of highly \ntrained Blackwatch soldiers. Prototype 2 = Bigger, Badder, Better! \n\nPlatform: XBOX360\nFormat: XGD3 \nRegion: Region Free\nSize: 1DVD\nLanguage: English\nGenre: FPS\n\nXGD3 BURN GUIDE: http://nickthegr33k.eu/XGD3burn.pdf\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-2D69_4F901196.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-2D69_4F901196.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.freeimage.us/image-516E_4F901196.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-516E_4F901196.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:24150deff24fcdef91818c4ffd10587a33e7fc70","amp;dn":"Prototype+2+XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24150deff24fcdef91818c4ffd10587a33e7fc70","infoHashBuffer":{"type":"Buffer","data":[36,21,13,239,242,79,205,239,145,129,140,79,253,16,88,122,51,231,252,112]},"announce":[],"urlList":[]}}