{"title":"OJOsoft VOB Converter 2.6.3.0304-serials incl(archive your dvds)","uid":4828975,"size":10110795,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24c0b89e8134cd605947b5994527e6b4a4a5c4d6&amp;dn=OJOsoft+VOB+Converter+2.6.3.0304-serials+incl%28archive+your+dvds%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"jmb2012","files":2,"time":1239056622,"description":"About OJOsoft VOB Converter\n\nOJOsoft VOB Converter is designed for backing up your favorite DVD movies and videos to your computer by converting VOB files to AVI, MPEG, MPG, WMV, MP4, MOV, 3GP/3G2, H.264, ASF, FLV etc. Also, it can help you convert to VOB from any video format.\n\nBesides, it also allows you to convert VOB to MP3 audio format.\n\nOJOsoft VOB Converter can be used like VOB to iPod converter, VOB to iPhone converter, VOB to Apple TV converter, VOB to 3GP converter, VOB to PSP converter, and VOB to Zune converter.\n\nOJOsoft VOB Converter Supports all the key formats!\nSupported Source File Formats to VOB format\n\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\nVideo Formats \t3GP/3GPP, 3G2/3GP2, MJPEG, AVI, DivX, Xvid, MPG, MPEG(MPEG-1/2), DAT, FLV, MKV(Matroska), QuickTime(MOV,QT), MP4, M4V, VOB, WMV, ASF, TS, MPEG-4 AVC, DVR-MS, H.263, H.264, X.264\n\t\n\t\t\t\t\t\t\n\t\t\t\t\n\t\t\nSupported Target File Formats from VOB format\n\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\nVideo Formats \tMP4, MOV, 3GP, 3G2, MPEG, MPG, VOB, AVI, ASF, WMV, FLV, H.264, MJPEG\nAudio Formats \tMP3\nPortable Players \tSony PSP, Apple iPod nano/video/classic/touch/TV Out, Apple TV, iPhone, Zune, Archos AV 500/700, Archos Gmini402, Creative Zen Vision, iriver PMP-100\n\t\n\t\t\t\t\t\t\n\t\t\t\t\n\t\t\nWhat can OJOsoft VOB Converter do for you?\nConvert VOB files to AVI\n\nThis best VOB converter can help you convert VOB to AVI format with three easy steps.\nConvert VOB to MPEG\n\nThis VOB converter supports converting VOB files to MPEG format with super fast speed and great quality.\nAVI to VOB Converter\n\nIt helps you convert to VOB from AVI file easy and fast.\nConvert VOB files to MPG\n\nEnjoy your favorite MPG files by converting VOB files to MPG format.\nConvert VOB to WMV\n\nThis amazing VOB converter can convert VOB files to Windows Media Video.\nConvert VOB files to MP4\n\nEnjoy your favorite MP4 files on your portable players by converting VOB files to MP4.\nConvert VOB to MOV\n\nConvert VOB files to MOV format with three easy steps.\nConvert VOB files to MPEG2\n\nIt helps you convert VOB files to MPEG2 files with easiest procedures.\nConvert to VOB from WMV\n\nThis amazing VOB converter can help you convert to VOB format from Windows Media Video.\nFeatures of OJOsoft VOB Converter\n\n    * Support converting VOB files to various video and audio formats\n    * Support batch conversion with a task list\n    * Support converting any video format to VOB format\n    * Unmatchable converting speed, wonderful output quality\n    * Windows Vista supported\n    * Have option to select video size, bit rate, NTSC/PAL, frame rate, audio codec, sample rate etc\n    * So easy to modify the name and path of output files\n    * When converting files, you can pause, stop and continue at any moment\n    * With the user- friendly interface, OJOsoft VOB Converter is suited for both veterans and beginners you can complete your conversion as easy as 1-2-3\n    * All decoders and encoders are built in. Once you download and install OJOsoft VOB Converter, all supported formats can be converted without downloading any more codec\n    * Safe to install and viruses-free. We respect your privacy. So there are no spyware and adware in OJOsoft VOB Converter\n\nSystem Requirements for OJOsoft VOB Converter\nMinimum System Requirements\n\nOS : Microsoft Windows XP\nRAM : 128M\nCPU : Intel/AMD compatible at 750 MHz or above\nRecommended System Requirements\n\nOS : Microsoft Windows XP/2003/Vista with all latest updates installed\nRAM : 512M or higher\nCPU : Intel/AMD compatible at 750 MHz or above","torrent":{"xt":"urn:btih:24c0b89e8134cd605947b5994527e6b4a4a5c4d6","amp;dn":"OJOsoft+VOB+Converter+2.6.3.0304-serials+incl%28archive+your+dvds%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24c0b89e8134cd605947b5994527e6b4a4a5c4d6","infoHashBuffer":{"type":"Buffer","data":[36,192,184,158,129,52,205,96,89,71,181,153,69,39,230,180,164,165,196,214]},"announce":[],"urlList":[]}}