{"title":"Charlie Brown and Friends- A Peanuts Collection - Charles M. Sch","uid":11303305,"size":181780301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24ce2da222a630a5e70278002f7fa5c490f6545c&amp;dn=Charlie+Brown+and+Friends-+A+Peanuts+Collection+-+Charles+M.+Sch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"krystine","files":-1,"time":1414446444,"description":"Charlie Brown and Friends: A Peanuts Collection\nAuthor: Charles M. Schulz\n\n\n\nWhat began in the funny pages in 1950 has developed into an enduring classic. Whether you're a fussbudget like Lucy, philosopher like Linus, Flying Ace like Snoopy, or a lovable \n\nloser like Charlie Brown, there is something to touch your heart or make you laugh in Peanuts.\n\nCharles Schulz's Peanuts is one of the most timeless and beloved comic strips ever. Now AMP! helps carry on that legacy with new collections of Peanuts classics focused around \n\ntopics sure to resonate with middle-grade readers. Second in the series is Charlie Brown and Friends. Whether it's the curious relationship between a bird, Woodstock, and a dog, \n\nSnoopy, or the never-ending crush that Peppermint Patty has on Charlie Brown, the gang's interactions are what make Peanuts resonate with kids.\n\nFirst published in 1950, the classic Peanuts strip now appears in more than 2,200 newspapers in 75 countries in 25 languages. Phrases such as &quot;security blanket&quot; and &quot;good \n\ngrief&quot;, which originated in the Peanuts world, are now part of the global vernacular, and images of Charles Schulz's classic characters Charlie Brown kicking the football, Lucy \n\nleaning over Schroeder's piano, are now universally recognized.\n\nTogether these books will introduce a new generation of kids to the lovable cast in time for the new animated Peanuts movie, which hits theaters in 2015!\n\n\n\nGenre: Children","torrent":{"xt":"urn:btih:24ce2da222a630a5e70278002f7fa5c490f6545c","amp;dn":"Charlie+Brown+and+Friends-+A+Peanuts+Collection+-+Charles+M.+Sch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24ce2da222a630a5e70278002f7fa5c490f6545c","infoHashBuffer":{"type":"Buffer","data":[36,206,45,162,34,166,48,165,231,2,120,0,47,127,165,196,144,246,84,92]},"announce":[],"urlList":[]}}