{"title":"Idiot's Guides: Kama Sutra - Dr. Ava Cadell","uid":11683475,"size":30284585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24f79f498c09e213ebcc5113da6dc14ddd22953a&amp;dn=Idiot%27s+Guides%3A+Kama+Sutra+-+Dr.+Ava+Cadell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"MANTESH","files":4,"time":1423206645,"description":"\n\nIdiot's Guides: Kama Sutra  \n\nPublisher: ALPHA\nDr. Ava Cadell\nEnglish \n2015 \nISBN: 1615647147  \n256 pages \nPDF \n28.8 MB\n\n\nIdiot's Guides: Kama Sutra is a fun and insightful guide to the ancient arts of the Kama Sutra, as well as many more contemporary methods and techniques for modern lovemaking. Readers will learn from hundreds of beautiful, full color photos that illustrate not only the traditional movements of the Kama Sutra, but also many of the most contemporary methods for taking lovemaking from tedious to intoxicating! The author takes readers from the roots of the ancients arts of the Kama Sutra through essential warms-ups like aphrodisiacs, erotic massage, and how to turn a lover on through the senses. Other sizzling sections cover orgasms, the G-spot, erogenous zones, and more. Through beautiful, how-to photos readers will learn the fundamental movements of the traditional Kama Sutra (as well as a few more), the oral pleasures, toys and fetishes, and much more. Finally, readers will learn how to keep the fire ignited not only in the bedroom, but in their relationships, and how The Kama Sutra is not just about making love, it's about connecting with and cherishing a lover every day","torrent":{"xt":"urn:btih:24f79f498c09e213ebcc5113da6dc14ddd22953a","amp;dn":"Idiot%27s+Guides%3A+Kama+Sutra+-+Dr.+Ava+Cadell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24f79f498c09e213ebcc5113da6dc14ddd22953a","infoHashBuffer":{"type":"Buffer","data":[36,247,159,73,140,9,226,19,235,204,81,19,218,109,193,77,221,34,149,58]},"announce":[],"urlList":[]}}