{"title":"Risen.3.Titan.Lords-FLT","uid":10750856,"size":7247298560,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2548f49a405b1f1fb049b2ef8213f1a24935a8b3&amp;dn=Risen.3.Titan.Lords-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Taker009","files":-1,"time":1407871070,"description":"Risen.3.Titan.Lords-FLT\n\n\nwnqa9qo.jpg\n\n\nRelease Info:\n\n\nIn Their 28th Year Of Glory, FairLight Released #1155\n\nRisen 3 (c) Deep Silver\n\nSupplied by: FAIRLIGHT\nRelease Date: 11/08/2014\nCracked by: FAIRLIGHT\nGame Type: RPG\nPackaged by: FAIRLIGHT\nImage Format: ISO\nDISCS: 1 Protection: Steam\n\nSystem Requirements : Nobody knows\n\nGame information:\n\n\nThe world has been abandoned by its gods and is scarred from the rampage\nof the Titans. Humanity is struggling to regain strength and rally its\nforces. You, however, have more pressing concerns: your own life has been\nshattered and you must set off to reclaim what is lost amidst the darkness\nthat is spreading throughout the world. Who knows, maybe you'll even save\nthe world at the same time\n\nThree threads of destiny lie before you. Three ways to rise up against the\nTitans and regain your soul. Which path to take? The choice is yours\n\nGame Features:\n\nFreedom: Freely explore and take on quests at your leisure\nQuests will have different ways to tackle them and different\noutcomes. You can play different parts of the game in whatever\norder you wish and shape your character individually\nExploration: Discover quests and characters as you make your way\nthrough the diverse world of Risen 3 - Titan Lords. From quaint\nmedieval-style towns to delving deep into the dank dark of\nmines, to the supernatural shadow world, there is a wealth\nof possibilities waiting to be explored. You will be able\nto traverse this world in a variety of ways, from swimming\nto climbing\nEnhanced combat: Featuring a revamped fighting system, with new\nanimation systems in place that add nuance to the fights\nMagic is back Crystal magic has returned, bringing with it\ndevastating new combat abilities. Wield elements such as\nlightning, fire and ice to obliterate your foes, or make\nuse of a multitude of additional magical skills to aid\nyou in exploration - the choice is yours\nGuilds &amp; factions: Choose to ally yourself with one of three\ndistinct guilds, each offering unique skills, armouries and\nquests allowing you to approach your quest in very different\nways. Discover additional factions that exist to bend the\nbalance of political power in the world, each with their\nown agenda for you to uncover. Be careful which characters\nyou trust - some might ally with you with the intent of\nfulfilling their own sinister plans\n\nInstallation information:\n\nBurn or mount\nInstall\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n","torrent":{"xt":"urn:btih:2548f49a405b1f1fb049b2ef8213f1a24935a8b3","amp;dn":"Risen.3.Titan.Lords-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2548f49a405b1f1fb049b2ef8213f1a24935a8b3","infoHashBuffer":{"type":"Buffer","data":[37,72,244,154,64,91,31,31,176,73,178,239,130,19,241,162,73,53,168,179]},"announce":[],"urlList":[]}}