{"title":"Batavia: Betrayal, Shipwreck, Murder, Sexual Slavery, Courage","uid":15789313,"size":2215599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26040eef2ddcd36f0b654aa4510e054efc847596&amp;dn=Batavia%3A+Betrayal%2C+Shipwreck%2C+Murder%2C+Sexual+Slavery%2C+Courage&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"marty14","files":1,"time":1473370331,"description":"Batavia: Betrayal, Shipwreck, Murder, Sexual Slavery, Courage - Peter FitzSimons [epub]\r\n\r\nThe Shipwreck of the Batavia combines in just the one tale the birth of the world's first corporation, the brutality of colonisation, the battle of good vs evil, the derring-do of sea-faring adventure, mutiny, ship-wreck, love, lust, blood-lust, petty fascist dictatorship, criminality, a reign of terror, murders most foul, sexual slavery, natural nobility, survival, retribution, rescue, first contact with native peoples and so much more. \r\n\r\nDescribed by author Peter FitzSimons as &quot;a true Adults Only version of Lord of the Flies, meeting Nightmare on Elm Street,&quot; the story is set in 1629, when the pride of the Dutch East India Company, the Batavia, is on its maiden voyage en route from Amsterdam to the Dutch East Indies, laden down with the greatest treasure to leave Holland. The magnificent ship is already boiling over with a mutinous plot that is just about to break into the open when, just off the coast of Western Australia, it strikes an unseen reef in the middle of the night. While Commandeur Francisco Pelsaert decides to take the long-boat across 2000 miles of open sea for help, his second-in-command Jeronimus Cornelisz takes over, quickly deciding that 250 people on a small island is unwieldy for the small number of supplies they have. Quietly, he puts forward a plan to 40 odd mutineers how they could save themselves, kill most of the rest and spare only a half-dozen or so women, including his personal fancy, Lucretia Jansz - one of the noted beauties of Holland - to service their sexual needs. A reign of terror begins, countered only by a previously anonymous soldier Wiebbe Hayes, who begins to gather to him those are prepared to do what it takes to survive ... hoping against hope that the Commandeur will soon be coming back to them with the rescue yacht. \r\n\r\nIt all happened, long ago, and it is for a very good reason that Peter FitzSimons has long maintained that this is &quot;far and away the greatest story in Australia's history, if not the world's.&quot; FitzSimons unique writing style has made him the country's best-selling non-fiction writer over the last ten years, and he is perfect man to make this bloody, chilling, stunning tale come alive","torrent":{"xt":"urn:btih:26040eef2ddcd36f0b654aa4510e054efc847596","amp;dn":"Batavia%3A+Betrayal%2C+Shipwreck%2C+Murder%2C+Sexual+Slavery%2C+Courage","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26040eef2ddcd36f0b654aa4510e054efc847596","infoHashBuffer":{"type":"Buffer","data":[38,4,14,239,45,220,211,111,11,101,74,164,81,14,5,78,252,132,117,150]},"announce":[],"urlList":[]}}