{"title":"Innovation: How Innovators Think, Act and Change Our World","uid":9735518,"size":4009458,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26746e5215cd83442feb4e85beb8f9fc0b288acc&amp;dn=Innovation%3A+How+Innovators+Think%2C+Act+and+Change+Our+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"theBooks","files":-1,"time":1394437609,"description":"\n &lt;a href=&quot;\nhttp://s25.postimg.org/lr9rlxalb/Innovation_How_Innovators_Think_Act_Change_Our_W.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s25.postimg.org/lr9rlxalb/Innovation_How_Innovators_Think_Act_Change_Our_W.jpg&lt;/a&gt;\n\nKim Chandler McDonald | 2013 | 475 Pages in ePub | PDF, ePub, Mobi | ISBN-13: 978-0749469665 | 3.82 MB\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nDescription:\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nBusinesses looking to succeed in the digital, global economy must innovate to survive, and !nnovation highlights the pioneers who have broken the mold and led the pack in a wide  range of fields (including business and technology, engineering and energy, government and social policy, the arts and advertising, media, medicine and more).\n\nInnovation expert, Kim Chandler McDonald underlines the common denominators linking these highly creative people, such as their compunction to tell their truth, unpalatable or not, their entrepreneurial instincts and their steadfast protection of their brands.\n\nThis book offers readers:\n\n* Understanding of innovation as a mindset rather than a process\n* Insight on how to start thinking like an innovator and into how this can assist them with their own careers and goals\n* Knowledge of how to cultivate innovation in their own team, department or business\n* Personal accounts from international innovators\n\n!nnovation showcases interviews with over 100 people who have pushed aside the boundaries in their field, such as: Vint Cerf, 'Father of the Internet' and Chief Internet Evangelist at Google; Matt Flannery, CEO/Co-Founder of Kiva, the microfinancing organization working to alleviate poverty; author Seth Godin; Zappos CEO and instigator of Las Vegas' transformational Downtown project, Tony Hsieh; Digital Royalty CEO Amy Jo Martin; and Chief Innovation Officer at the marketing agency MDC Partners, Faris Yakob. Chandler McDonald explores what drives these successful innovators, what makes innovations take off and why innovation is so critical to individuals, economies and to society as a whole.\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nReviews:\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n&quot;Succeeds in being visionary and pragmatic at the same time. Filled with valuable insights and grounded advice. Gives you an urge to improve everything around you - which is the essence of innovation.&quot;\n--Saku Tuominen Founder of Idealist Group and Dreamdo\n\n&quot;We can generalize all we like about innovation, but in the end it boils down to people. Some famous, some not. Some whose efforts shift the world, some whose seismic impacts are on the micro scale. What unites them is the gift to see round corners and press on when more rational (ahem) persons hold back. Here are sharply-focused interviews with these doers and some keen observers. I've read them to my profit, and so will you.&quot;\n--Nigel Cameron, Strategic Adviser President of the Center for Policy on Emerging Technologies in Washington, DC\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nAbout the Author/s:\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nKim Chandler McDonald is Executive Vice President of KimmiC, a company she co-founded with her husband Michael, which specializes in adaptive approaches, robust technologies and leading edge innovations. A thought leader, sought after speaker and advisory board member, Kim is an advocate for disruptive approaches and transformational trends such as Flat World Navigation, meHealth and empowered endusers. \n\nKim has built and maintains a far-reaching network of global thought leaders.  As the world's first, branded, Flat World Navigator, Kim was included in the inaugural 'LinkedIn Power Profiles - Australia' list of 2012.  Formerly, Kim was immersed in media as a writer and editor for national and international newspapers and magazines as well as being one of the host/producers of the award winning English Breakfast radio show. Kim specializes in interviewing international thought leaders and influencers - in particular those who she'd like to share a bottle of bubbles with.\n\nShe loves chocolate, champagne and beer - but not together - usually...\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nNo Password or Surveys. Guaranteed!!!\n\nPlease seed the torrent if you want to Help :)\n\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:26746e5215cd83442feb4e85beb8f9fc0b288acc","amp;dn":"Innovation%3A+How+Innovators+Think%2C+Act+and+Change+Our+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26746e5215cd83442feb4e85beb8f9fc0b288acc","infoHashBuffer":{"type":"Buffer","data":[38,116,110,82,21,205,131,68,47,235,78,133,190,184,249,252,11,40,138,204]},"announce":[],"urlList":[]}}