{"title":"Deutschland 83 S01 - Hardcoded Eng Subs - Sno","uid":13621736,"size":3132119870,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:26ac387b37e4536b55768c4873433d70336126c3&amp;dn=Deutschland+83+S01+-+Hardcoded+Eng+Subs+-+Sno&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":4,"uploader":"Snowhiter","files":9,"time":1455968591,"description":"Deutschland 83 is a gripping coming-of-age story set against the real culture wars and political events of Germany in the 1980s. The drama follows Martin Rauch as the 24 year-old East Germany native is pulled from the world as he knows it and sent to the West as an undercover spy for the Stasi foreign service. Hiding in plain sight in the West German army, he must gather the secrets of NATO military strategy. Everything is new, nothing is quite what it seems and everyone he encounters is harboring secrets, both political and personal.\r\n\r\nS01 E01: Quantum Jump\r\nTaken against his will to the West, East German soldier Martin Rauch has intensive training to become a spy and assumes a new identity as Moritz Stamm, an officer working for a top West German general\r\n\r\nS01 E02: Brave Guy\r\nMoritz is given a dangerous mission to steal a top secret security report from the hotel room of a visiting general, but things don't go to plan and his superiors are baffled by the secret file\r\n\r\nS01 E03: Atlantic Lion\r\nMoritz bonds with General Edel on a trip to Brussels and gets a mission to seduce Linda, the secretary of a top security analyst, and install a microphone in a desk at Nato headquarters\r\n\r\nS01 E04: Northern Wedding\r\nThe bug in Linda's desk is found and Nato goes on high alert. Moritz is forced to recognise the dark reality of the organisation he is working for, while Alex has a vicious row with his father.\r\n\r\nS01 E05: Cold Fire\r\nTischbier turns up unexpectedly and conveys some shocking news. On his way home to become a kidney donor for his mother, Moritz must first deliver a package to a mysterious man in West Berlin.\r\n\r\nS01 E06: Brandy Station\r\nSchweppenstette visits Martin in hospital and insists he returns to his undercover role as Moritz. Alex takes General Jackson hostage and forces him to denounce US military plans in Western Europe.\r\n\r\nS01 E07/E08 (Feature Length Episode): Bold Guard (7) &amp; Able Archer (8) These were joined at Broadcast level . . .\r\n\r\n7/8. Moritz receives a shocking order, and realises the extent of his superiors' paranoia when a training exercise in the West is mistaken for a preemptive attack.\r\n\r\n8/8. Moritz returns to the East in a bid to prevent a war as the NATO exercise reaches its climax and fear of a preemptive nuclear strike grips the HVA. He finds himself an outcast on both sides of the Iron Curtain, but risks his life to save Yvonne from the Stasi. Ingrid comes to Thomas's rescue, and Alex is forced to confront his own demons.\r\n\r\nVideo 852 x 480 / 25 fps / 1000 (approx) kbps / MP4\r\n\r\nAudio 128 kbps AAC\r\n\r\nDuration 0:45 (approx)\r\n\r\nSeed to the Max - Danke vielmals . . .\r\n\r\nSno\r\n \nhttp://www.imdb.com/title/tt4445154\r\n\r\nDeutschland 83, Drama, German, Cold War, HD Rip, Sno\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nI seed all of my torrents to a ratio of 100:1 - please help seed to keep them alive\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nRipped / Encoded / Uploaded by Snowhiter\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nAny Bitcoin Donations Welcome here : 164BRZMwZZHmBHS7WLU2s4ZB3geRZZuV3b","torrent":{"xt":"urn:btih:26ac387b37e4536b55768c4873433d70336126c3","amp;dn":"Deutschland+83+S01+-+Hardcoded+Eng+Subs+-+Sno","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26ac387b37e4536b55768c4873433d70336126c3","infoHashBuffer":{"type":"Buffer","data":[38,172,56,123,55,228,83,107,85,118,140,72,115,67,61,112,51,97,38,195]},"announce":[],"urlList":[]}}