{"title":"Lonely Planet Myanmar (Burma) (Travel Guide, 12th Edition)[MyeBo","uid":11533082,"size":39512622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27036f684969fac309c4c64eb936197c26235f31&amp;dn=Lonely+Planet+Myanmar+%28Burma%29+%28Travel+Guide%2C+12th+Edition%29%5BMyeBo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"MyeBookShelf","files":-1,"time":1416595025,"description":"Lonely Planet Myanmar (Burma) (Travel Guide, 12th Edition)[MyeBookShelf]\nEnglish | ISBN: 1742205755 | 2014 | EPUB | 424 pages | 38 MB\n\nLonely Planet Myanmar (Burma) is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Admire Shwedagon Paya's sheer size and mystical aura, visit the water-bound temples on Inle Lake, or float over Bagan's temple tops in a hot-air balloon; all with your trusted travel companion. Get to the heart of Myanmar (Burma) and begin your journey now!\n\nInside Lonely Planet's Myanmar (Burma) Travel Guide:\n\nColour maps and images throughout\nHighlights and itineraries help you tailor your trip to your personal needs and interests\nInsider tips to save time and money and get around like a local, avoiding crowds and trouble spots\nEssential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\nHonest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\nCultural insights give you a richer, more rewarding travel experience - including customs, religion, history, art, literature, cinema, music, architecture, politics, landscapes, wildlife, cuisine\nOver 60 maps\nCovers Yangon, Mandalay, Bagan, Kayin State, Thazi, Kalaw, Pyin Oo Lwin, Hsipaw, Shwebo, Mrauk U, Myitkyina, Central Myanmar, Northern Myanmar, Eastern Myanmar, Southern Myanmar, Western Myanmar and more\nThe Perfect Choice: Lonely Planet Myanmar (Burma), our most comprehensive guide to Myanmar (Burma), is perfect for both exploring top sights and taking roads less travelled.\n\nLooking for more extensive coverage? Check out Lonely Planet's Southeast Asia on a Shoestring guide.\nAuthors: Written and researched by Lonely Planet, Simon Richmond, Austin Bush, David Eimer, Mark Elliott and Nick Ray.\n\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:27036f684969fac309c4c64eb936197c26235f31","amp;dn":"Lonely+Planet+Myanmar+%28Burma%29+%28Travel+Guide%2C+12th+Edition%29%5BMyeBo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27036f684969fac309c4c64eb936197c26235f31","infoHashBuffer":{"type":"Buffer","data":[39,3,111,104,73,105,250,195,9,196,198,78,185,54,25,124,38,35,95,49]},"announce":[],"urlList":[]}}