{"title":"Odom W. - CisNA Routing and Switching ICND2 200-101 Official Cer","uid":8392780,"size":38602735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:273cd9f886f39e57efe979e7cb7cd91b41434593&amp;dn=Odom+W.+-+CisNA+Routing+and+Switching+ICND2+200-101+Official+Cer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"it_yashar","files":1,"time":1366483603,"description":"Cisco Press has the only Self-Study Guides Approved by Cisco for the New CCNA Routing and Switching Certification. The New Edition of this Best-Selling Official Cert Guide includes Updated Content, New Exercises, Enhanced Practice Exams, and 60 Minutes of Video Training -- PLUS the CCNA Network Simulator Lite Edition with lab exercises.\nCisco CCNA Routing and Switching ICND2 200-101 Official Cert Guide from Cisco Press enables you to succeed on the exam the first time. Best-selling author and expert instructor Wendell Odom shares preparation hints and test-taking tips, helping you identify areas of weakness and improve both your conceptual knowledge and hands-on skills.\n\nThis complete study package includes\n\nA test-preparation routine proven to help you pass the exams\nDo I Know This Already? quizzes, which enable you to decide how much time you need to spend on each section\nChapter-ending and part-ending exercises, which help you drill on key concepts you must know thoroughly\nTroubleshooting sections, which help you master the complex scenarios you will face on the exam\nThe powerful Pearson IT Certification Practice Test software, complete with hundreds of well-reviewed, exam-realistic questions, customization options, and detailed performance reports\nA free copy of the CCNA ICND2 200-101 Network Simulator Lite software, complete with meaningful lab exercises that help you hone your hands-on skills with the command-line interface for routers and switches\nMore than 60 minutes of video mentoring from the author\nA final preparation chapter, which guides you through tools and resources to help you craft your review and test-taking strategies\nStudy plan suggestions and templates to help you organize and optimize your study time\n\nThe official study guide helps you master all the topics on the CCNA exam, including\n\nSpanning Tree Protocol (STP)\nTroubleshooting LAN switching\nIPv4 routing\nVPNs\nOSPF and EIGRP configuration and troubleshooting\nWide area networks and Frame Relay\nIPv6 implementation and troubleshooting\nNetwork management","torrent":{"xt":"urn:btih:273cd9f886f39e57efe979e7cb7cd91b41434593","amp;dn":"Odom+W.+-+CisNA+Routing+and+Switching+ICND2+200-101+Official+Cer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"273cd9f886f39e57efe979e7cb7cd91b41434593","infoHashBuffer":{"type":"Buffer","data":[39,60,217,248,134,243,158,87,239,233,121,231,203,124,217,27,65,67,69,147]},"announce":[],"urlList":[]}}