{"title":"Ingrid Michaelson - Lights Out (2014) [FLAC]","uid":9984275,"size":344425682,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:276a222cfd22e208ed34c7b5ef922da43460df96&amp;dn=Ingrid+Michaelson+-+Lights+Out+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":20,"uploader":"politux","files":-1,"time":1397770530,"description":"\n  Ingrid Michaelson - Lights Out (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Singer/Songwriter, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Home\n  02 Girls Chase Boys\n  03 Wonderful Unknown \n  04 You Got Me\n  05 Warpath \n  06 Handsome Hands \n  07 Time Machine \n  08 One Night Town \n  09 Open Hands\n  10 Ready To Lose \n  11 Stick\n  12 Afterlife\n  13 Over You\n  14 Everyone Is Gonna Love Me Now\n\n  Ingrid Michaelson's sixth studio album, 2014's Lights Out, is a polished, well-produced effort that magnifies all of the sounds and lyrical themes she's been working with since breaking through with 2007's Girls and Boys. Michaelson even seems to reference that album with her Lights Out lead single, the infectious &quot;Girls Chase Boys.&quot; However, where Girls and Boys centered around Michaelson's intimate ukulele and acoustic guitar-driven dorm room pop, Lights Out features a broadened sonic palette and a much more robust vocal performance; it's a transformation she's been perfecting since 2009's Everybody and 2012's Human Again. This time out, Michaelson has enlisted a handful of producers who include, among others, her bandmate bassist Chris Kuffner, Jacquire King (Modest Mouse, Norah Jones), and singer/songwriter Katie Herzig. Michaelson even reunites with longtime collaborator Dan Romer for the epic ballad &quot;Over You,&quot; featuring A Great Big World. While there are a few of Michaelson's trademark intimate breakup songs here, including the tear-inducing &quot;Open Hands,&quot; overall the album reveals Michaelson to be in a bright, upbeat state of mind. Cuts like the bluesy, handclap-heavy &quot;Warpath&quot; and the similarly fiery &quot;Time Machine,&quot; with its '90s-esque sax samples, are more emblematic of the album's ambitious, empowered tone. Elsewhere, we get the catchy dance-pop duet &quot;One Night Town&quot; with Mat Kearney and the uplifting anthem &quot;Afterlife.&quot; There's also a very in-the-moment feeling of both poignancy and happiness to Lights Out, which is perhaps best expressed in the midtempo Beatlesque ballad &quot;Wonderful Unknown,&quot; featuring Michaelson's husband, singer/songwriter Greg Laswell. In it, Michaelson ruminates on the small details of her everyday life, singing &quot;We make bread on Sundays and the little ones are climbing the walls/Up the walls/Nothing lasts forever but the sound of love astounds me every time that it calls.&quot; Ultimately, on Lights Out, Michaelson has captured that sound of love.","torrent":{"xt":"urn:btih:276a222cfd22e208ed34c7b5ef922da43460df96","amp;dn":"Ingrid+Michaelson+-+Lights+Out+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"276a222cfd22e208ed34c7b5ef922da43460df96","infoHashBuffer":{"type":"Buffer","data":[39,106,34,44,253,34,226,8,237,52,199,181,239,146,45,164,52,96,223,150]},"announce":[],"urlList":[]}}