{"title":"Vanishing.of.the.Bees.XviD.AC3..avi","uid":10079745,"size":1176752128,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2794e78f2dd16504ca9be502e998529b5f6867ec&amp;dn=Vanishing.of.the.Bees.XviD.AC3..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":4,"uploader":"metheguy","files":-1,"time":1398982353,"description":"TV : Documentary : DVD Rip : English\nVanishing of the Bees\nScience Documentary hosted by Emila Fox, published by Film4 in 2009 - English narration\n\nVanishing of the Bees\nIs a fascinating documentary about the mysterious disappearance of bees from beehives all around the world. The film's aim is a better understanding of 'Colony Collapse Disorder' (CCD), a phenomena in which honey bees abruptly abandon both their queen and brood for reasons as yet not fully known. The situation is dire and only stands to get worse and so, with that in mind, the documentary examines all scientific and environmental links to CCD.\nImagine half a million adults skipping town and leaving their children behind. Picture an opened suitcase filled with bundles of cash at a bus stop and yet no robber wants to snatch it. The apiary science mystery known as 'Colony Collapse Disorder' displays these very symptoms. Not only do the bees abandon their hive, but the queen and the brood as well. Unnatural. Unheard of. Even the predators that usually raid the hive for honey stay far away. At first, this occurrence sounds like an urban legend or an exaggerated tale. Except it s not. The situation is both dire and all too real. Bees are disappearing all over the planet and no one knows why.","torrent":{"xt":"urn:btih:2794e78f2dd16504ca9be502e998529b5f6867ec","amp;dn":"Vanishing.of.the.Bees.XviD.AC3..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2794e78f2dd16504ca9be502e998529b5f6867ec","infoHashBuffer":{"type":"Buffer","data":[39,148,231,143,45,209,101,4,202,155,229,2,233,152,82,155,95,104,103,236]},"announce":[],"urlList":[]}}