{"title":"Gavin de Becker - The Gift of Fear","uid":10247352,"size":921298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27c57eab88882721962bbcb97619a739df736e18&amp;dn=Gavin+de+Becker+-+The+Gift+of+Fear&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":2,"uploader":"Abykale","files":3,"time":1401307912,"description":"My very first torrent; constructive criticism only please.\n\nContains:\ncover.jpg\nThe Gift of Fear - Gavin de Becker.epub\nThe Gift of Fear - Gavin de Becker.mobi (original format)\n\n\nA stranger in a deserted parking lot offers to help carry a woman's groceries. Is he a good Samaritan or is he after something else? A fired employee says &quot;You'll be sorry.&quot; Will he return with a gun? After their first date, a man tells a woman it is their &quot;destiny&quot; to be married. What will he do when she won't see him again? A mother has an uneasy feeling about the nice babysitter she's just hired. Should she not go to work today?\n\nThese days, no one in America feels immune to violence. But now, in this extraordinary groundbreaking book, the nation's leading expert on predicting violent behavior unlocks the puzzle of human violence and shows that, like every creature on earth, we have within us the ability to predict the harm others might do us and get out of its way. Contrary to popular myth, human violence almost always has a discernible motive and is preceded by clear warning signs.\n\nThrough dozens of compelling examples from his own career, Gavin de Becker teaches us how to read the signs, using our most basic but often most discounted survival skill - our intuition. The Gift of Fear is a remarkable, unique combination of practical guidance on leading a safer life and profound insight into human behavior.","torrent":{"xt":"urn:btih:27c57eab88882721962bbcb97619a739df736e18","amp;dn":"Gavin+de+Becker+-+The+Gift+of+Fear","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27c57eab88882721962bbcb97619a739df736e18","infoHashBuffer":{"type":"Buffer","data":[39,197,126,171,136,136,39,33,150,43,188,185,118,25,167,57,223,115,110,24]},"announce":[],"urlList":[]}}