{"title":"Diary of a Mad Diva - Joan Rivers - Audiobook MP3","uid":10471233,"size":197748946,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:27e8b1c547e6b13ce55b5eed4b31e3f2614a76c7&amp;dn=Diary+of+a+Mad+Diva+-+Joan+Rivers+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404255996,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nDiary of a Mad Diva\n\nWritten by: Joan Rivers\nNarrated by: Joan Rivers\nLength: 6 hrs and 50 mins\nFormat: Unabridged\nRelease Date:07-01-14\nProgram Type: Audiobook\n\nAnais Nin, Anne Frank and Sylvia Plath wrote the world's most famous diaries. And where are they today? Dead. But the world's other great diarist, Joan Rivers, is alive and kicking. And complaining.\n\nIn the extraordinary tradition of The Habit of Being: Letters of Flannery O'Connor and George Orwell's Diaries, comes an intimate and enriching glimpse into the mind of the most illuminating woman-of-letters of her generation - the provocative exploration of an age in which she has lived on and on and on and on.\n\nFollowing up the phenomenal success of her headline-making New York Times best seller I Hate Everyone...Starting with Me, the unstoppable Joan Rivers is at it again. When her daughter Melissa gives her a diary for Christmas, at first Joan is horrified - who the hell does Melissa think she is? That fat pig, Bridget Jones? But as Joan, being both beautiful and introspective, begins to record her day-to-day musings, she realizes she has a lot to say.\n\nAbout everything. And everyone, God help them.\n\nThe result? A no-holds-barred, delightfully vicious and always hilarious look at the everyday life of the ultimate diva. Follow Joan on a family vacation in Mexico and on trips between New York and Los Angeles where she mingles with the stars, never missing a beat as she delivers blistering critiques on current events, and excoriating insights about life, pop culture, and celebrities (from A to D list), all in her relentlessly funny signature style.\n\nThis is the Diary of a Mad Diva. For the first time in a century, a diary by someone that's actually worth listening to and worth suing.","torrent":{"xt":"urn:btih:27e8b1c547e6b13ce55b5eed4b31e3f2614a76c7","amp;dn":"Diary+of+a+Mad+Diva+-+Joan+Rivers+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27e8b1c547e6b13ce55b5eed4b31e3f2614a76c7","infoHashBuffer":{"type":"Buffer","data":[39,232,177,197,71,230,177,60,229,91,94,237,75,49,227,242,97,74,118,199]},"announce":[],"urlList":[]}}