{"title":"Quantum Mechanics for Pedestrians 1: Fundamentals [2014] [PDF]","uid":12164243,"size":5069009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:280843e93abc3250973ce908f98607e00db4346f&amp;dn=Quantum+Mechanics+for+Pedestrians+1%3A+Fundamentals+%5B2014%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":2,"uploader":"NoctDeath","files":3,"time":1437994657,"description":"Title: Quantum Mechanics for Pedestrians 1: Fundamentals \nSeries: Undergraduate Lecture Notes in Physics \nAuthor: Jochen Pade \nFormat: PDF \nHardcover: 400 pages \nPublisher: Springer; 2014 edition (November 19, 2013) \nLanguage: English \nISBN: 978-3319007977 \n\n\nThis book provides an introduction into the fundamentals of non-relativistic quantum mechanics. In Part 1, the essential principles are developed. Applications and extensions of the formalism can be found in Part 2. The book includes not only material that is presented in traditional textbooks on quantum mechanics, but also discusses in detail current issues such as interaction-free quantum measurements, neutrino oscillations, various topics in the field of quantum information as well as fundamental problems and epistemological questions, such as the measurement problem, entanglement, Bell's inequality, decoherence, and the realism debate. A chapter on current interpretations of quantum mechanics concludes the book. To develop quickly and clearly the main principles of quantum mechanics and its mathematical formulation, there is a systematic change between wave mechanics and algebraic representation in the first chapters. The required mathematical tools are introduced step by step. Moreover, the appendix collects compactly the most important mathematical tools that supplementary literature can be largely dispensed. In addition, the appendix contains advanced topics, such as Quantum- Zeno effect, time-delay experiments, Lenz vector and the Shor algorithm. About 250 exercises, most of them with solutions, help to deepen the understanding of the topics. Target groups of the book are student teachers and all students of physics, as minor or major, looking for a reasonably easy and modern introduction into quantum mechanics","torrent":{"xt":"urn:btih:280843e93abc3250973ce908f98607e00db4346f","amp;dn":"Quantum+Mechanics+for+Pedestrians+1%3A+Fundamentals+%5B2014%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"280843e93abc3250973ce908f98607e00db4346f","infoHashBuffer":{"type":"Buffer","data":[40,8,67,233,58,188,50,80,151,60,233,8,249,134,7,224,13,180,52,111]},"announce":[],"urlList":[]}}