{"title":"How To Become An Alpha Male - John Alexander - xboyxlk  - Trance","uid":4602623,"size":8483337,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2813697ac8ee4100132dddebab65ebf4d594ee39&amp;dn=How+To+Become+An+Alpha+Male+-+John+Alexander+-+xboyxlk++-+Trance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"XBoyXLK","files":5,"time":1230305124,"description":" &lt;a href=&quot;http://www.amazon.com/How-Become-Alpha-Male-Successful/dp/1411636600&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.amazon.com/How-Become-Alpha-Male-Successful/dp/1411636600&lt;/a&gt;\n\nAlone in my bed, jerking off and feeling rejected. For years that was my entire love life.\n\nI was a senior at a southern party college -- and STILL a virgin. The school was loaded with hot, horny girls... but success was always for other guys, never for me.\n\nSure I made a few female friends, and I was the nice guy who listened to their feelings and jumped at any chance to hang out with them.\n\nBut it was always the other guys who got laid. Girls would complain to me about how much of a &quot;jerk&quot; some guy was and how &quot;all he wants is sex.&quot; Then they'd add, &quot;why can't he be a nice guy like you?&quot;\n\nThe girls never had sex with me of course. They never do with low self-esteem beta males no matter how &quot;nice&quot; they are.\n\nI didn't have much going for me. I wasn't athletic. I wasn't outgoing or good at making conversation. Nor was I a guy who could make you laugh. And I didn't have any money, a nice car or good looks.\n\nThe only advantage I had was my obsessive study of human psychology and biology and my drive for self improvement.\n\nYou see, I've always had a passion for the human mind and why people act the way they do.\n\nIn the corporate world, top CEOs act a certain way and their employees follow them like robots. In the primate world, the silverback gorilla displays behaviors that gets him all the female gorillas automatically.\n\nAnd so, I thought, could there also be a way to trigger certain automatic buttons in a woman's mind... which makes them lust for you as the alpha man they've always dreamed of? I mean, what was it about these alpha males in society who get laid merely by carrying themselves in a certain way?\n\nWhat I stumbled on were the secrets that changed my life in the most incredible way you could imagine. And what was amazing was how easy it is to get girls. I look around and see other seduction systems that require you to memorize gobs of routines, hypnotic patterns, and other tricks that require a lot of work.\n\nBut the fact is any guy can get women... no matter what you look like... how little money you have... and even if you're a total loser with women. You just have to use the mind you were born with.\n\nAnd that's what I will show you how to do.  &lt;a href=&quot;\nhttp://rsdnation.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rsdnation.com/&lt;/a&gt;\n\n----------------\n\nxboyx seed","torrent":{"xt":"urn:btih:2813697ac8ee4100132dddebab65ebf4d594ee39","amp;dn":"How+To+Become+An+Alpha+Male+-+John+Alexander+-+xboyxlk++-+Trance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2813697ac8ee4100132dddebab65ebf4d594ee39","infoHashBuffer":{"type":"Buffer","data":[40,19,105,122,200,238,65,0,19,45,221,235,171,101,235,244,213,148,238,57]},"announce":[],"urlList":[]}}