{"title":"Field Marshal: The Life and Death of Erwin Rommel","uid":15811018,"size":1922125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2843d06f720955bba301791bf8059b4098408dba&amp;dn=Field+Marshal%3A+The+Life+and+Death+of+Erwin+Rommel&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"marty14","files":1,"time":1473636039,"description":"Field Marshal: The Life and Death of Erwin Rommel - Daniel Allen Butler [epub]\r\n\r\nErwin Rommel was a complex man: a born leader, brilliant soldier, a devoted husband and proud father; intelligent, instinctive, brave, compassionate, vain, egotistical, and arrogant. In France in 1940, then for two years in North Africa, then finally back in France again, at Normandy in 1944, he proved himself a master of armored warfare, running rings around a succession of Allied generals who never got his measure and could only resort to overwhelming numbers to bring about his defeat. \r\n\r\nAnd yet for all his military genius, Rommel was also naive, a man who could admire Adolf Hitler at the same time that he despised the Nazis, dazzled by a Führer whose successes blinded him to the true nature of the Third Reich. Above all, he was the quintessential German patriot, who ultimately would refuse to abandon his moral compass, so that on one pivotal day in June 1944 he came to understand that he had mistakenly served an evil man and evil cause. He would still fight for Germany even as he abandoned his oath of allegiance to the Führer, when he came to realize that Hitler had morphed into nothing more than an agent of death and destruction. In the end Erwin Rommel was forced to die by his own hand, not because, as some would claim, he had dabbled in a tyrannicidal conspiracy, but because he had committed a far greater crime – he dared to tell Adolf Hitler the truth.\r\n\r\nIn Field Marshal historian Daniel Allen Butler not only describes the swirling, innovative campaigns in which Rommel won his military reputation, but assesses the temper of the man who finally fought only for his country, and no dark depths beyond","torrent":{"xt":"urn:btih:2843d06f720955bba301791bf8059b4098408dba","amp;dn":"Field+Marshal%3A+The+Life+and+Death+of+Erwin+Rommel","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2843d06f720955bba301791bf8059b4098408dba","infoHashBuffer":{"type":"Buffer","data":[40,67,208,111,114,9,85,187,163,1,121,27,248,5,155,64,152,64,141,186]},"announce":[],"urlList":[]}}