{"title":"Adele - 21 [24 bit FLAC] vinyl","uid":8173456,"size":1024752238,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:28c41e2daf69d9b8c3472a430130dceb0aa3e4b2&amp;dn=Adele+-+21+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"24.96","files":-1,"time":1361469608,"description":"  Adele - 21 (2011) [24 bit FLAC] vinyl\n\n  Released: 2011\n  Duration: 48:00\n  Genre: Pop/Rock\n  Style: Adult Alternative Pop, Soul\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Rolling in the Deep\n  02. Rumour Has It\n  03. Turning Tables\n  04. Don't You Remember\n  05. Set Fire to the Rain\n  06. He Won't Go\n  07. Take It All\n  08. I'll Be Waiting\n  09. One and Only\n  10. Lovesong\n  11. Someone Like You\n\n  Adele's 2009 debut album, 19, was a Grammy-winning smash hit that revealed the British singer/songwriter's knack for bittersweet soul and folk-infused love songs that brought to mind an infectious mix of Dusty Springfield and Terry Callier. The album earned her a ton of fans, and interest was high for the inevitable follow-up. In many ways, her sophomore album, the similarly age-appropriate-titled 21, is a continuation of the sounds and themes Adele was working with on 19. She is still the bluesy pop diva with a singer/songwriter's soul and seemingly bottomless capacity for heartbreak. If the tastefully organic production and overabundance of well-known co-writers come off a bit too on-the-nose in terms of delivering to fan expectations, then the best thing the album does is to showcase Adele's titanic vocal ability, which -- more than a few times on 21 -- is simply spine-tingling. Last time around we got the gauzy, Callier-esque folk-soul ballad &quot;Daydreamer&quot; to slowly draw us into the album; here, Adele immediately injects us with the propulsive gospel fever-blues anthem &quot;Rolling in the Deep.&quot; While the track certainly owes a heavy debt to the punk-blues of Beth Ditto and the Gossip, it is also ridiculously sexy and one of the best singles of any decade -- and, unfortunately, completely sets the bar way too high for everything else on 21. Which isn't to say that 21 is bad; on the contrary, tracks like the similarly blues-inflected Ryan Tedder co-write &quot;Rumour Has It&quot; and the old-school-style soul cut &quot;He Won't Go&quot; are terrifically catchy, booty-shaking numbers, and exactly the kind of songs you want and expect from Adele. That said, if Adele's voice goes on forever here, so apparently does her appetite for bad relationship mojo. An inordinate amount of the material on 21 is about yearning for lost love. In fact, the centerpiece of the album, the mega-ballad showstopper &quot;Take It All&quot; -- co-written by her &quot;Chasing Pavements&quot; partner Francis White -- begins with Adele proclaiming &quot;Didn't I give it all?&quot; Delivered starkly at first with Adele set against simple piano accompaniment and later backed by a gospel choir, it's an instant-classic sort of song in the tradition of &quot;The Rose,&quot; &quot;And I Am Telling You I Am Not Going,&quot; and &quot;All by Myself&quot; that could stand over the years as a career landmark for the singer and a cathartic moment for fans who identify with their idol's Pyrrhic lovelorn persona. For others, over the course of the album, that persona and the insistence of track after track of heartbreak can get a bit alienating. Ultimately, however, Adele does give us her all on 21, and for now that is enough.","torrent":{"xt":"urn:btih:28c41e2daf69d9b8c3472a430130dceb0aa3e4b2","amp;dn":"Adele+-+21+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28c41e2daf69d9b8c3472a430130dceb0aa3e4b2","infoHashBuffer":{"type":"Buffer","data":[40,196,30,45,175,105,217,184,195,71,42,67,1,48,220,235,10,163,228,178]},"announce":[],"urlList":[]}}