{"title":"125 Physics Projects for the Evil Genius - Jerry Silver [Epub &amp;a","uid":9825715,"size":14276906,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2923d06a856f9b8a3d1aa5e76fa55bd72daecb97&amp;dn=125+Physics+Projects+for+the+Evil+Genius+-+Jerry+Silver+%5BEpub+%26a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"krystine","files":-1,"time":1395772273,"description":"Description\n125 Physics Projects for the Evil Genius\nAuthor: Jerry Silver\nPublished: 2009\nPublisher: McGraw-Hill/TAB Electronics\nISBN: 9780071621311\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\n\n125 Wickedly Fun Ways to Test the Laws of Physics!\n\nNow you can prove your knowledge of physics without expending a lot of energy. 125 Physics Projects for the Evil Genius is filled with hands-on explorations into key areas of this fascinating field. Best of all, these experiments can be performed without a formal lab, a large budget, or years of technical experience!\n\nUsing easy-to-find parts and tools, this do-it-yourself guide offers a wide variety of physics experiments you can accomplish on your own. Topics covered include motion, gravity, energy, sound, light, heat, electricity, and more. Each of the projects in this unique guide includes parameters, a detailed methodology, expected results, and an explanation of why the experiment works. 125 Physics Projects for the Evil Genius:\n\nFeatures step-by-step instructions for 125 challenging and fun physics experiments, complete with helpful illustrations\nAllows you to customize each experiment for your purposes\nIncludes details on the underlying principles behind each experiment\nRemoves the frustration factor--all required parts are listed, along with sources\n125 Physics Projects for the Evil Genius provides you with all of the information you need to demonstrate:\n\nConstant velocity\nCircular motion and centripetal force\nGravitational acceleration\nNewton's laws of motion\nEnergy and momentum\nThe wave properties of sound\nRefraction, reflection, and the speed of light\nThermal expansion and absolute zero\nElectrostatic force, resistance, and magnetic levitation\nThe earth's magnetic field\nThe size of a photon, the charge of an electron, and the photoelectric effect\nAnd more","torrent":{"xt":"urn:btih:2923d06a856f9b8a3d1aa5e76fa55bd72daecb97","amp;dn":"125+Physics+Projects+for+the+Evil+Genius+-+Jerry+Silver+%5BEpub+%26a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2923d06a856f9b8a3d1aa5e76fa55bd72daecb97","infoHashBuffer":{"type":"Buffer","data":[41,35,208,106,133,111,155,138,61,26,165,231,111,165,91,215,45,174,203,151]},"announce":[],"urlList":[]}}