{"title":"Squidbillies Seasons 1-5 DVD Rips (includes extras)","uid":8494239,"size":12795145302,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:294eb1e5d32eef3cb22b9db649cc01999112ffd0&amp;dn=Squidbillies+Seasons+1-5+DVD+Rips+%28includes+extras%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":7,"uploader":"cin_jaxon","files":-1,"time":1369088697,"description":"Squidbillies is an animated television series about the Cuylers, an impoverished family of anthropomorphic hillbilly mud squids living in the Appalachian region of Georgia's mountains. The show is produced by Williams Street Studios for the Adult Swim programming block of Cartoon Network and premiered on October 16, 2005. It is written by Dave Willis, co-creator of Aqua Teen Hunger Force, and Jim Fortier, previously of The Brak Show, both of whom worked on the Adult Swim series Space Ghost Coast to Coast. The animation is done by Awesome Incorporated, with background design by Ben Prisk.\n\n\n\n\nThis is the first 5 DVD sets released (Seasons 1-6). All episodes and special features were ripped by me and encoded to be the best quality for the lowest download size. I personally use these files now instead of the DVD's when I have my Squidbillies marathons because there is no quality difference at all.\n\nI hope you all enjoy this torrent and the show. If you're from the North American South then you'll laugh your ass off at this show. So grab a womern and some party liquor and have you a hell of a time!\n\nAll episodes are mkv format and labeled correctly to easily be incorporated into any htpc device!","torrent":{"xt":"urn:btih:294eb1e5d32eef3cb22b9db649cc01999112ffd0","amp;dn":"Squidbillies+Seasons+1-5+DVD+Rips+%28includes+extras%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"294eb1e5d32eef3cb22b9db649cc01999112ffd0","infoHashBuffer":{"type":"Buffer","data":[41,78,177,229,211,46,239,60,178,43,157,182,73,204,1,153,145,18,255,208]},"announce":[],"urlList":[]}}