{"title":"Hero Generations v1.16","uid":11827095,"size":58828998,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:29c84b41240ef72d2698377aabe3a088e0e0e939&amp;dn=Hero+Generations+v1.16&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"dauphong","files":1,"time":1429528687,"description":"v1.16 Update is Live! (Bug fixes, in-game menu)\n\nI've just pushed the 2nd update to Hero Generations (v1.16) which addresses a number of bug fixes and community requested features. Here's the full list, be sure to restart steam and grab the update!\n\n    Fixed soft crash when moving onto a cleared Spirit Statue node.\n    Fixed crash during loading when returning to a world where you had already killed the boss. Existing broken games stuck here should now work again.\n    Player life icon now only turns red and throbs when the player lifespan is 10 or less.\n    Trait Books now properly pick a random trait (fixed bug where it was always the &quot;haggler&quot; trait)\n    Changed hover description text of Monster Lairs once cleared so fast-travel behavior is more discover-able.\n    Hitting the ESC key on the main game board will bring up a exit to menu dialogue, which takes you to the main menu. Allows for settings adjustment.\n    You can now exit the game from within the game UI using the new main menu exit button (upper left corner)\n    Temples now cost 1000g and spawn life potions every 16 years (up from 15).\n    The hover info UI for world objects now dynamically changes position to avoid overlaps with objects on the bottom of the game board.\n    Shortened description text of some legendary items.\n    Increased text size on main message box for OUYA version.\n    Other minor fixes, tweaks, and under-the-hood code cleanup. \n\n\nNext week roadmap:\n-fixing annoyances with dropping/picking up multiple items in the same space.\n-Clearer Trait Choice UI when your trait slots are full.\n-General performance improvements\n-More polish to &quot;white space&quot; areas on larger resolutions.\n-OUYA build improvements\n-Fullscreen investigation (estimate of work involved)\n-New gameplay items and content","torrent":{"xt":"urn:btih:29c84b41240ef72d2698377aabe3a088e0e0e939","amp;dn":"Hero+Generations+v1.16","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c84b41240ef72d2698377aabe3a088e0e0e939","infoHashBuffer":{"type":"Buffer","data":[41,200,75,65,36,14,247,45,38,152,55,122,171,227,160,136,224,224,233,57]},"announce":[],"urlList":[]}}