{"title":"Fantastic Four (v1 - v5 + Extras) (1961 - Ongoing) (Digital+Scan","uid":11544324,"size":23743761878,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:29fd80b58fe8ec4ddd99b8a9d91ef631d26fd00d&amp;dn=Fantastic+Four+%28v1+-+v5+%2B+Extras%29+%281961+-+Ongoing%29+%28Digital%2BScan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":51,"uploader":"nemesis43","files":769,"time":1416705288,"description":"Fantastic Four (v1 - v5 + Extras) (1961 - Ongoing)(Digital+Scans(Minutemen+Empire)\n\n\nReed Richards was a scientist and the inventor of the first spaceship capable of reaching planets beyond our moon. After much planning, expense and hard work; the ship was built and was nearing its launch date. However, as the launch neared, the federal government was about to cut funding for the flight. Reed decided there was no choice but to launch the ship before the whole effort was scrapped and wasted.\nReed invited his girlfriend Susan Storm along for the trip and her brother Johnny Storm insisted on coming along in order to keep her safe. Wanting a pilot with both the ability and the guts to make the flight, Reed turned to his former college roommate and very close friend Ben Grimm, a highly accomplished former test pilot for the United States Air Force. The crew now set, everyone was ready for launch when Reed received a warning from the authorities concerning the effects of the cosmic rays on human bodies so far out in space. Reed's request for launch was denied and the mission aborted.\nMore desperate than ever to make the flight, Reed's crew waited until the changing of the guards that night and then sneaked onto the ship and launched before any planes could be scrambled to intercept them and/or shoot them down using missiles. Successful in leaving the Earth's atmosphere, they were halfway along on their mission when they entered a sub-space storm and were bombarded by intense cosmic rays both before they expected and stronger than they expected. This unexpectedly intense cosmic ray storm had strange and disorienting effects on the crew, making them unable to continue the trip. They turned back, returned to Earth and crash-landed in a small opening in a forested area.\nLuckily, they survived the crash but were radically changed. Ben felt his body become heavy and found he'd turned into a monster. Reed tried to calm him down and restrain him when he realized that he'd reflexively stretched and wrapped his body around Ben; he now had elastic stretching abilities. Johnny burst into flames while Sue panicked and turned invisible. Gathering their wits, they soon managed to calm themselves and agreed to use their new-found powers for the good of humanity and stay together as a team. Johnny called himself the &quot; Human Torch,&quot; Sue took the name &quot;Invisible Girl&quot; (and later changed it to the Invisible Woman). Ben chose the name &quot; Thing&quot; and Reed decided to call himself &quot; Mr. Fantastic.&quot; Thus, the Fantastic Four were born","torrent":{"xt":"urn:btih:29fd80b58fe8ec4ddd99b8a9d91ef631d26fd00d","amp;dn":"Fantastic+Four+%28v1+-+v5+%2B+Extras%29+%281961+-+Ongoing%29+%28Digital%2BScan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29fd80b58fe8ec4ddd99b8a9d91ef631d26fd00d","infoHashBuffer":{"type":"Buffer","data":[41,253,128,181,143,232,236,77,221,153,184,169,217,30,246,49,210,111,208,13]},"announce":[],"urlList":[]}}