{"title":"9 Songs Unrated Version [2004][DVD-Rip][Xvid][ENG]","uid":4175506,"size":1073786794,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2a0bc4b0187cebdacf4ca5107f17c7076a88d03c&amp;dn=9+Songs+Unrated+Version+%5B2004%5D%5BDVD-Rip%5D%5BXvid%5D%5BENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"circlensess","files":1,"time":1210102278,"description":"9 Songs / Nine Songs - Unrated Version\t\n     \nAn exploration into the destructive nature of a relationship built on lust instead of love. Sexually explicit and UNrated this film is for over 18&amp;#039;s only. It gained general release in this format.\n &lt;a href=&quot;\nhttp://img227.imageshack.us/img227/6358/poster02640xe2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img227.imageshack.us/img227/6358/poster02640xe2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0411705/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0411705/&lt;/a&gt;\n\nMatt, a young glaciologist, soars across the vast, silent, icebound immensities of the South Pole as he recalls his love affair with Lisa. They meet at a mobbed rock concert in a vast music hall--London&amp;#039;s Brixton Academy. They are in bed at night&amp;#039;s end. Together, over a period of several months, they pursue a mutual sexual passion whose inevitable stages unfold in counterpoint to nine live-concert songs.\n\n\nMargot Stilley never wanted to be credited in the film because of the un-simulated, explicit sex scenes. She asked the director to refer to her in interviews as &quot;Lisa&quot;, the name of her character in the film.\n\nThis was the first film featuring explicit sex scenes to receive a certificate in the Republic of Ireland.\n\nThe first sexually explicit film to be directly awarded a French mainstream certificate (and not the &quot;X classification&quot; created in 1975 for &quot;pornographic or violence-inciting movies&quot;).\n\nAccording to the &quot;Variety&quot; review, the transfer of the film, which was shot in DV, was done by photographing a digital projection of the movie on a white wall, to create a negative from which prints for release could be made.\n\nThe sex scenes were shot with only the two actors, the director, the cameraman, and the soundman on the set.\n\nThe two leads only had three days to get acquainted before filming.\n\nCast (Cast overview, first billed only)\n\tKieran O&amp;#039;Brien\t... \tMatt\n\tMargo Stilley\t... \tLisa\n\tHuw Bunford\t... \tHimself (Super Furry Animals)\n\tCian Ciaran\t... \tHimself (Super Furry Animals)\n\tThe Dandy Warhols\t... \tThemselves\n\tElbow\t... \tThemselves\n\tFranz Ferdinand\t... \tThemselves\n\tBobby Gillespie\t... \tHimself (Primal Scream)\n\tBob Hardy\t... \tHimself (Franz Ferdinand)\n\tDafydd Ieuan\t... \tHimself (Super Furry Animals)\n\tAlex Kapranos\t... \tHimself (Franz Ferdinand)\n\tMani\t... \tHimself (Primal Scream)\n\tNick McCarthy\t... \tHimself (Franz Ferdinand)\n\tMichael Nyman\t... \tHimself\n\tGuto Pryce\t... \tHimself (Super Furry Animals)\n\nDirector Winterbottom shot over 200 hours of digital video.\n\n&amp;#039;Kieran OBrien and Margo Stilley did not communicate with each other between filming so that their off-screen relationship would not affect the one they had on screen.\n\nShooting time for the film was projected as ten weeks. The cast and crew ended up shooting for five months. &lt;a href=&quot;\nhttp://img136.imagevenue.com/img.php?image=10872_o_123_424lo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img136.imagevenue.com/img.php?image=10872_o_123_424lo.jpg&lt;/a&gt;\n\nAuthor: tedg from Virginia Beach \n\nWhen I saw Scorsese&amp;#039;s &quot;Last Waltz,&quot; I thought that I would never again see a concert film as true. And I haven&amp;#039;t, until now.\n\nThe Band were the last popular musicians to tell stories, have nearly all those stories be in the third person and tell them without irony. To do this is impossible today, or at least non- commercial. Scorsese is a flawed filmmaker, his flaw being that he is overly invested in character-driven storytelling. The two: Band and Marty, were a perfect mix: cinematic rock. Pure, without that nightmare stew of MTV videos.\n\nNow along comes Winterbottom. Nearly all viewers will be unable to accept a movie with sex in it as anything but a movie about sex. Shame on them. Confront it folks. That&amp;#039;s his point: why is it so difficult to accept the difference?\n\nBut the hangups of the viewing public are less interesting to me than the way he constructed this experiment. It is a rock concert (with a Nyman interlude). Nine songs, with us participating in the songs themselves, participating in the going to the concerts to listen to the songs, and participating in the experience that the songs are about: namely obsessive sex. And also, remembering (or even inventing the memory of) the sex, drugs and rock and roll we&amp;#039;ve seen. This latter is done by our hero in Antarctica. He serves as narrator, by the way.\n\nThankfully, this intense sex avoids the theatrics of &quot;Damage,&quot; and works to be as genuine as possible emotionally. \n\nIs it a good movie? Could it change your life? Will it change cinema forever?\n\nProbably yes.\n\nTed&amp;#039;s Evaluation -- 3 of 3: Worth watching.","torrent":{"xt":"urn:btih:2a0bc4b0187cebdacf4ca5107f17c7076a88d03c","amp;dn":"9+Songs+Unrated+Version+%5B2004%5D%5BDVD-Rip%5D%5BXvid%5D%5BENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a0bc4b0187cebdacf4ca5107f17c7076a88d03c","infoHashBuffer":{"type":"Buffer","data":[42,11,196,176,24,124,235,218,207,76,165,16,127,23,199,7,106,136,208,60]},"announce":[],"urlList":[]}}