{"title":"Gustave Flaubert - Madame Bovary &amp; other works (5 books)","uid":9194580,"size":70570403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ae619603a4b0ff9a134e0f7ad1637b1acaa8a1d&amp;dn=Gustave+Flaubert+-+Madame+Bovary+%26amp%3B+other+works+%285+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"workerbee","files":-1,"time":1384458917,"description":"\nGUSTAVE FLAUBERT (1821 - 1880) was an influential French writer who is counted among the greatest novelists in Western literature.  \n\nWhile still a schoolboy, full of romantic scorn for the bourgeois world, he professed himself &quot;disgusted with life&quot;.  At the age of eighteen he was sent to study law in Paris, but had no regrets when a mysterious nervous ailment interrupted this career after only three years.  Flaubert retired to live with his widowed mother in the family home at Croisset, on the banks of the river Seine, near Rouen.  Supported by a private income, he devoted himself to his writing.\n\nFlaubert is known especially for his scrupulous devotion to his art and style, a perfectionism that cost him enormous toil and brought him only limited success in his own lifetime.  After the publication of MADAME BOVARY in 1857, he was prosecuted for offending public morals.  SENTIMENTAL EDUCATION (1869), intended as the moral history of his generation, was largely misunderstood by the critics and received a cool public reception.  After his death in 1880, Flaubert's fame and reputation grew steadily, strengthened by the publication of his unfinished and savagely satiric BOUVARD AND PÃ‰CUCHET (1881) and the many remarkable volumes of his Correspondence.\n\nMADAME BOVARY, Flaubert's masterpiece, is now considered a seminal work of Realism and one of the most influential novels ever written.  For Henry James, the book &quot;has a perfection that not only stamps it, but that makes it stand almost alone; it holds itself with such a supreme unapproachable assurance as both excites and defies judgment.&quot;  Three translations of MADAME BOVARY are collected here, including those by Margaret Mauldon (2004) and Lydia Davis (2010).\n\n\nThe books are in either EPUB or PDF formats as follows:\n\n* BOUVARD AND PÃ‰CUCHET (Dalkey Archive, 2005).  Translated by Mark Polizzotti.  Includes the &quot;Dictionary of Accepted Ideas&quot; and the &quot;Catalogue of Fashionable Ideas&quot;. -- EPUB\n\n* MADAME BOVARY (Norton Critical Edition, 2nd edn., 2005).  Edited by Margaret Cohen; translated by Eleanor Marx Aveling and Paul de Man. -- PDF\n\n* MADAME BOVARY (Penguin, 2010).  Translated by Lydia Davis. -- EPUB\n\n* MADAME BOVARY (Oxford University Press, 2004).  Translated by Margaret Mauldon. -- PDF\n\n* SENTIMENTAL EDUCATION (Penguin, 2004).  Translated by Robert Baldick, revised with an Introduction and Notes by Geoffrey Wall. -- EPUB\n","torrent":{"xt":"urn:btih:2ae619603a4b0ff9a134e0f7ad1637b1acaa8a1d","amp;dn":"Gustave+Flaubert+-+Madame+Bovary+%26amp%3B+other+works+%285+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ae619603a4b0ff9a134e0f7ad1637b1acaa8a1d","infoHashBuffer":{"type":"Buffer","data":[42,230,25,96,58,75,15,249,161,52,224,247,173,22,55,177,172,170,138,29]},"announce":[],"urlList":[]}}