{"title":"2 Girls 1 Cup (Hungry Bitches, MFX-1209, Complete Video) PERLiTE","uid":4380119,"size":635351532,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2bcb1a1b5ae9c1268634d9c773d7277a6d897274&amp;dn=2+Girls+1+Cup+%28Hungry+Bitches%2C+MFX-1209%2C+Complete+Video%29+PERLiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"Perlite","files":1,"time":1220614030,"description":"Screens: &lt;a href=&quot;\nhttp://filetracker.org/torrents/visuals.php?if_id=275&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://filetracker.org/torrents/visuals.php?if_id=275&lt;/a&gt;\n\nDESCRIPTION:\n\nKarla and Latifa are two girls who just want to have fun. Latifa says that she is hungry, but Karla do not have any food to offer. But this is not a big problem for Latifa who wants to surprise Karla with a special warm meal. She shits a big poop on the glass so they can delight themselves and they do it! In addition they serve some delicious vomit and have a great meal!\n\n\nTHE LEGEND:\n\n2 Girls 1 Cup is a copy of the trailer for Hungry Bitches, a pornographic film produced by MFX-Media, edited so that the URL &quot;2girls1cup.com&quot; is superimposed under the pre-existing text &quot;MFX 1209&quot; (the product code for Hungry Bitches). The trailer features two women defecating into a cup, taking turns consuming the excrement, and vomiting into each other's mouths. HervÃƒÆ’Ã‚Â© Roy's &quot;Lovers Theme&quot; plays throughout.\n\nThis one-minute trailer is an Internet viral video that became a well-known Internet meme among bloggers and Internet forums for the reactions its graphic content elicited from its viewers. Around mid-October 2007, video sites such aswere flooded with videos depicting others' reactions to watching the video for the first time.\n\n\nORIGIN:\n\nThe video originated from a Brazilian, Marco Fiorito, who describes himself as a &quot;compulsive fetishist&quot;. Fiorito originally produced foot fetish videos but soon moved on to coprophagia. The film was produced by MFX-Video, one of several companies owned by Fiorito. Fiorito contends his films are legal in Brazil, but authorities in the United States have branded some of his films as obscene and filed charges against Danilo Croce, a Brazilian lawyer living in Florida, listed as an officer of a company distributing Fiorito's films in the United States. Croce accepted a plea bargain and was sentenced to 3 years of unsupervised probation and forfeiture of $98,000. Fiorito claimed he did not know his films were illegal in the United States and that his films often contained chocolate instead of feces to appease some of his actors who were willing to appear in scat films but not actually eat fecal matter.\n\nThe first few seconds of the 2 Girls 1 Cup video contain the text &quot;MFX 1209&quot; (the product code for Hungry Bitches) and the URL mfxvideos.com, the website of Fiorito's MFX-Video, leading some in the media to incorrectly believe the video is one of the many Croce had to surrender to the Department of Justice but was somehow leaked in the process.\n\n\nREACTIONS:\n\nPart of what has facilitated 2 Girls 1 Cup's spread are the reactions it causes. Hundreds of videos exist onof users showing the original video to their friends and taping their reactions. Even Joe Rogan, host of Fear Factor, a show notorious for the disgusting things its contestants eat, had to turn away in a reaction video posted to his blog. A reaction video starring Kermit the Frog proved very popular on the community-based popularity website Digg. In January 2008, Slate magazine documented the reaction video phenomenon with a slideshow featuring various reactions.\n\nViolet Blue, an author, described this website as becoming &quot;the new &quot;tubgirl&quot; and goatse all in one disgusting moment of choco-poo-love&quot; in a San Francisco Chronicle article.\n\n\nPARODIES:\n\nThe video has inspired several parodies, such as a short film by singer and comedian John Mayer to his blog entitled &quot;2 Guys 1 Cup&quot; where Mayer and Best Week Ever correspondent Sherrod Small enjoy Pinkberry frozen yogurt in the same manner that the women in the original consumed the fecal matter. Celebrity blogger Perez Hilton also made a parody titled &quot;1 Guy 1 Jar&quot;, which he posted toFilmmakers Justin Roiland and Christian Le Guilloux made a 5-minute series called &quot;2 Girls, 1 Cup: The Show&quot; for the short film competition site, Channel 101. It debuted in first place on January 27, 2008. Canadian comedian Jon Lajoie also made a song named &quot;2 Girls 1 Cup song&quot;, which gained an instant popularity, gaining over 3 million views.\n\n\nMEDIA RECOGNITION:\n\nMany in the media have taken the video's popularity as a sign of society's declining morals. The video was featured on VH1's Best Week Ever, where the video's existence and propagation was declared to cause &quot;Moral Bankruptcy&quot; to have the &quot;Best Week Ever!&quot; Esquire magazine showed the video to actor George Clooney during an interview, prompting him to compare it to a rodeo, saying the point of the video was to see &quot;how long you can last.&quot; The video was also mentioned in an episode of Family Guy, as a set up for a joke. Stewie is shown watching the video on the computer with Brian behind him telling him to keep watching. Stewie is disgusted and says: &quot;I'm never gonna be able to eat ice cream again!&quot; Another reference can be seen in the movie Superhero movie: Rick Riker, while browsing the internet, sees a scrambled clip where Professor_Xavier tells him, among other things: squatting on a glass table two girls one cup.\n\n\nTo view individual reactions from watching the trailer to this movie, go here:(some of these are quite funny to watch)\n\n\nSupport the file sharing community - SEED YOUR TORRENTS!\n\n\nMORE PERLiTE DVD: &lt;a href=&quot;\nhttp://filetracker.org/torrents/browse.php?if_login=Perlite&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://filetracker.org/torrents/browse.php?if_login=Perlite&lt;/a&gt; &lt;a href=&quot;\nhttp://thepiratebay.se/user/Perlite&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Perlite&lt;/a&gt;","torrent":{"xt":"urn:btih:2bcb1a1b5ae9c1268634d9c773d7277a6d897274","amp;dn":"2+Girls+1+Cup+%28Hungry+Bitches%2C+MFX-1209%2C+Complete+Video%29+PERLiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bcb1a1b5ae9c1268634d9c773d7277a6d897274","infoHashBuffer":{"type":"Buffer","data":[43,203,26,27,90,233,193,38,134,52,217,199,115,215,39,122,109,137,114,116]},"announce":[],"urlList":[]}}