{"title":"Dark Alliance: The CIA, the Contras and the Crack Cocaine ...","uid":16044617,"size":1176512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c1d6b136c2191cf8dd0cdcdc1c7ac700798b840&amp;dn=Dark+Alliance%3A+The+CIA%2C+the+Contras+and+the+Crack+Cocaine+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"marty14","files":1,"time":1476550623,"description":"Dark Alliance: The CIA, the Contras and the Crack Cocaine Explosion - Gary Webb [epub]\r\n\r\nIn August 1996, Pulitzer Prize-winning journalist Gary Webb stunned the world with a series of articles in the San Jose Mercury News reporting the results of his year-long investigation into the roots of the crack cocaine epidemic in America, specifically in Los Angeles. The series, titled &quot;Dark Alliance,&quot; revealed that for the better part of a decade, a Bay Area drug ring sold tons of cocaine to Los Angeles street gangs and funneled millions in drug profits to the CIA-backed Nicaraguan Contras.\r\n\r\nGary Webb pushed his investigation even further in his book, Dark Alliance. Drawing from then newly declassified documents, undercover DEA audio and videotapes that had never been publicly released, federal court testimony, and interviews, Webb demonstrates how our government knowingly allowed massive amounts of drugs and money to change hands at the expense of our communities. \r\n\r\nWebb's original article spurred an immediate outcry. Within days of publication, both of California's senators made formal requests for investigations of the U.S. government's relationship with the cocaine ring. As a result, public demonstrations erupted in L.A., Washington D.C., and New York. Then-chief of the CIA, John Deutsch, made an unprecedented attempt at crisis control by going to South Central L.A. to hold a public forum. Representative Maxine Waters later said in George magazine, &quot;I was shocked by the level of corruption and deceit and the way the intelligence agencies have knowledge of big-time drug dealing.&quot;\r\nThe allegations in Webb's story blazed over the Internet and the Mercury News' website on the series was deluged with hits—over a million in one day.\r\n\r\nWebb's own stranger-than-fiction experience is also woven into the book. His excoriation by the media—not because of any wrongdoing on his part, but by an insidious process of innuendo and suggestion that in effect blamed Webb for the implications of the story—had been all but predicted. Webb was warned off doing a CIA expose by a former Associated Press journalist who lost his job when, years before, he had stumbled onto the germ of the &quot;Dark Alliance&quot; story. And though Internal investigations by both the CIA and the Justice Department eventually vindicated Webb, he had by then been pushed out of the Mercury News and gone to work for the California State Legislature Task Force on Government Oversight. He died in 2004","torrent":{"xt":"urn:btih:2c1d6b136c2191cf8dd0cdcdc1c7ac700798b840","amp;dn":"Dark+Alliance%3A+The+CIA%2C+the+Contras+and+the+Crack+Cocaine+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c1d6b136c2191cf8dd0cdcdc1c7ac700798b840","infoHashBuffer":{"type":"Buffer","data":[44,29,107,19,108,33,145,207,141,208,205,205,193,199,172,112,7,152,184,64]},"announce":[],"urlList":[]}}