{"title":"Classic Penguin_ Cover to Cover","uid":15792841,"size":44603044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c1f0d8cbddc9e2c27b13a9fb95cf9b5813ef87e&amp;dn=Classic+Penguin_+Cover+to+Cover+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"mr_mando","files":2,"time":1473404237,"description":"\nFrom Drop Caps to Deluxes, Penguin Creative Director Paul Buckley presents a visual overview of the innovative covers that have put Penguin Classics at the forefront of the book design world\r\n \r\nSince the launch of Penguin Classics in 1946, innovative cover design has been one of its defining aspects. Today, Penguin Classics remains at the leading edge of the book-design world. In this curated tour featuring illuminating commentary by artists and writers, including Malika Favre, Mike Mignola, James Franco, Jessica Hische, Jillian Tamaki and many more, Penguin creative director Paul Buckley showcases more than a decade of stunning cover designs and the stories behind them. For lovers of classic literature, book design, and all things Penguin, Classic Penguin has you covered.\r\n \r\nPaul Buckley is creative director for Penguin Classics and oversees a large staff of exceptionally talented designers and art directors working on the jackets and covers of sixteen imprints within the Penguin Random House publishing group. Over the past two decades, his iconic design and singular art direction have been showcased on thousands of covers and jackets, winning him many awards and frequent invitations to speak in the United States and abroad. In 2010, he edited and introduced Penguin 75.\r\n\r\nMatt Vee is a designer and illustrator who attended School of Visual Arts and Pratt Institute. He has received two Gold Scholastic Art Awards and created logos for worldwide brands. His work has appeared in The Washington Post, The Huffington Post, Slate, Print magazine, Paste magazine, and UnderConsideration’s Brand New.\r\n\r\nAudrey Niffenegger is a visual artist and writer. In addition to the bestselling novels The Time Traveler’s Wife and Her Fearful Symmetry, she is the author of three illustrated novels and the editor of Ghostly.\r\n\r\nElda Rotor is vice president and publisher for Penguin Classics. She has created and edited several series, including Penguin Civic Classics, Penguin Threads, Couture Classics, Penguin Horror, and Penguin Drop Caps","torrent":{"xt":"urn:btih:2c1f0d8cbddc9e2c27b13a9fb95cf9b5813ef87e","amp;dn":"Classic+Penguin_+Cover+to+Cover+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c1f0d8cbddc9e2c27b13a9fb95cf9b5813ef87e","infoHashBuffer":{"type":"Buffer","data":[44,31,13,140,189,220,158,44,39,177,58,159,185,92,249,181,129,62,248,126]},"announce":[],"urlList":[]}}