{"title":"Hotel Costes I-XII Mixed By Stephane Pompougnac (1999 - 2009)","uid":5455004,"size":2100731207,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c48ffd9a144fca8291f4fcbb46d0f29cfe0fa3e&amp;dn=Hotel+Costes+I-XII+Mixed+By+Stephane+Pompougnac+%281999+-+2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"lenonx","files":-1,"time":1269295025,"description":"ARTIST : VA\n\nALBUM  : Hotel Costes Vol. 1-12 (mixed by Stephane Pompougnac)\n\nGENRE  : Chillout, Downtempo, Lo-Fi, Tango, Latin, Jazz etc..\n\nDATES  : 1999 - 2009\n\nENCODER: Lame 3.97 - 3.98\n\nQUALITY: 320 kbps\n\nLABEL  : PSCHENT\n\nMORE INFO: Id3tag include album descriptions and album art.\n\n\nInfo from AllMusic.com:\nAt the age of 18, StÃƒÂ©phane Pompougnac made his DJ debut in clubs such as the Ubu, the Colony, and the Dream in Bordeaux, France, during the mid-'80s. After finishing his studies and national service, he spent six months in London before returning to Paris in 1992 where he mixed at clubs, such as Queen, Folies Pigalle, the Locomotive, and Privilege. One year later, he became the resident DJ at les Bains et Douche . Albert De Paname ostensibly first introduced him to Jean-Louis Costes although Pompougnac had worked as a waiter for Costes some ten years prior at Cafe Costes in Les Halles. This time, however, Costes offered Pompougnac a more coveted position: resident DJ at the famous Hotel Costes. He accepted. \n\nHotel Costes is one of France's most famous and regularly sports stars of the film and fashion world. Pompougnac released his first CD in 1999, titled CafÃƒÂ© Costes. Pompougnac's second CD, Costes, La Suite, met with more success and the song &quot;Sympatique&quot; was used for a car ad in France sending record sales over 100,000. His first two albums were released in France through Barclay Universal; his increased success, however, saw a deal with MSI for his third compilation, Etage 3, released in October 2000. His first three compilations together sold nearly half a million copies. Pompougnac also spins for Les Venues de la Mode (the fashion Oscars) and has provided the music for various fashion shows by Gucci and Yves Saint-Laurent.\t\t\n\n","torrent":{"xt":"urn:btih:2c48ffd9a144fca8291f4fcbb46d0f29cfe0fa3e","amp;dn":"Hotel+Costes+I-XII+Mixed+By+Stephane+Pompougnac+%281999+-+2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c48ffd9a144fca8291f4fcbb46d0f29cfe0fa3e","infoHashBuffer":{"type":"Buffer","data":[44,72,255,217,161,68,252,168,41,31,79,203,180,109,15,41,207,224,250,62]},"announce":[],"urlList":[]}}