{"title":"The Mixed-Media Artist - Art Tips, Tricks, Secrets and Dreams fr","uid":11329127,"size":18227203,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cbdd342894bf69445de93ea4cb769fd40f2a987&amp;dn=The+Mixed-Media+Artist+-+Art+Tips%2C+Tricks%2C+Secrets+and+Dreams+fr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"gnv65","files":-1,"time":1414657158,"description":"The Mixed-Media Artist - Art Tips, Tricks, Secrets and Dreams from Over 40 Amazing Artists\nby Seth Apter\nNorth Light Books | November 2013 | ISBN-10: 1440329338 | ePUB | 161 pages | 17.3 mb\n\nMixed media or mystery?\nThere's a secret to understanding the mystery behind the hidden message in a work of mixed-media art. As Seth Apter knows, if you can get to know the artist, you will get to know the art. The Mixed Media Artist unlocks this mystery and provides an intimate look into the hearts, souls and creative processes of over 40 inspiring artists. Surprising self-portraits, innermost self-reflections and practical art-making tutorials are just some of the keys you'll find here to unlocking the door to a greater understanding of how and why art is made.\n-  Helpful how-tos: Throughout each section, artists share favorite tools, secret ingredients and step-by-step processes that go beyond the who to provide the how.\n-  44 artists share creative perspectives and intimate thoughts: Provocative questions are answered not only in words, but multiple times as art, spotlighting the forces that make the art and the artists what and who they are.\n-  Compelling poll data: Answers collected from thousands of individuals reveal statistical insights on the creative community at large.\n-  Additional online content: Links to downloads, tutorials, videos and more are sprinkled throughout the book.\nImmerse yourself in the creative words and works of The Mixed Media Artist and get to know the artist behind your own art!\n\nAbout the Author\nSeth Apter is a mixed media artist, instructor, author and designer from New York City. His artwork has been exhibited in multiple exhibitions and can be found in numerous books, independent zines, and national magazines. He is the voice behind The Pulse, a series of international, collaborative projects that are the basis for his first book The Pulse of Mixed Media: Secrets and Passions of 100 Artists Revealed, released in March 2012 by North Light Books. His second book, The Mixed-Media Artist: Art Tips, Tricks, Secrets and Dreams From Over 40 Amazing Artists, was recently released in October 2013, also by North Light. He is the artist behind two workshop DVDs released in June 2012: Easy Mixed Media Surface Techniques and Easy Mixed Media Techniques for the Art Journal. His live workshops have been held throughout the United States and he will also be teaching in Mexico and Australia in 2014. He is a member of CHA, a blogger for Spellbinders Paper Arts, and a stencil designer for StencilGirl Products","torrent":{"xt":"urn:btih:2cbdd342894bf69445de93ea4cb769fd40f2a987","amp;dn":"The+Mixed-Media+Artist+-+Art+Tips%2C+Tricks%2C+Secrets+and+Dreams+fr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cbdd342894bf69445de93ea4cb769fd40f2a987","infoHashBuffer":{"type":"Buffer","data":[44,189,211,66,137,75,246,148,69,222,147,234,76,183,105,253,64,242,169,135]},"announce":[],"urlList":[]}}