{"title":"WHAT THE BLEEP DO WE KNOW.DOWN THE RABBIT HOLE.DVDRip.Xvid.720x5","uid":4238316,"size":1811924480,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2d13c411964afeceaef35da80056a73edbf214db&amp;dn=WHAT+THE+BLEEP+DO+WE+KNOW.DOWN+THE+RABBIT+HOLE.DVDRip.Xvid.720x5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"el_marco931","files":1,"time":1213403468,"description":"Following the release of What the BLEEP Do We Know!?, in QA after QA, conference after conference, the filmmakers were besieged by requests for more: More information, more science, more applications to their personal lives. August 1, 2006 marks the response to these requests with the release of What the BLEEP - Down the Rabbit Hole, Quantum Edition multi-disc DVD set.\n\nFeaturing two (!) extended versions of What the BLEEP Do We Know!?, never before seen DVD programming features, 20 minutes of new animation, new interviews, along with 5 hours of uncut interviews and a filmmakers QA, the Quantum Edition contains over 15 hours of material on 6 DVD sides.\n\nNot only does this compendium of topics BLEEP give the viewer enough material for weeks/months of exploration, but with the programming features, it allows them to specify &quot;How far down the Rabbit Hole&quot; they wish to go. Or, if they wish to &quot;Go Quantum&quot; by using a randomization function on their DVD player, the film restructures itself every time it&amp;#039;s viewed so it&amp;#039;s never the same film twice.\n\nThe original WTBDWK was made for a theatrical experience of under two hours. With these new expanded versions, the filmmakers were finally able to include all the topics as originally intended. The completed picture presents all the elements that are intrinsic to the worldview put forth in BLEEP. Topics such as Quantum Entanglement, the Double Slit Experiment, Healing and the Cell, the split and re-unification of spirit and science - all are addressed in the detail required to tell the story. Hopefully they stimulate the viewer to seek further explorations. It may be the definitive BLEEP, but it is not the last word - it&amp;#039;s the final beginning.\n &lt;a href=&quot;\nhttp://www.whatthebleep.com/rabbithole/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.whatthebleep.com/rabbithole/&lt;/a&gt;\n\nRelated torrent : What the bleep do we know VOSTFR\n\nDuration : 2h27m28\nQuality : DVDrip\nEncoding : Xvid 2pass 1500 Kbps, MP3 128K\nSize : 720x576\nFrame Rate : 25 fps (PAL)\nLanguage : English\nSubs : French","torrent":{"xt":"urn:btih:2d13c411964afeceaef35da80056a73edbf214db","amp;dn":"WHAT+THE+BLEEP+DO+WE+KNOW.DOWN+THE+RABBIT+HOLE.DVDRip.Xvid.720x5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d13c411964afeceaef35da80056a73edbf214db","infoHashBuffer":{"type":"Buffer","data":[45,19,196,17,150,74,254,206,174,243,93,168,0,86,167,62,219,242,20,219]},"announce":[],"urlList":[]}}