{"title":"Sew What! Bags: 18 Pattern-Free Projects You Can Customize to Fi","uid":10726226,"size":11841381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d15cc1ecde01ba2c045bc54924781d9b31f1f63&amp;dn=Sew+What%21+Bags%3A+18+Pattern-Free+Projects+You+Can+Customize+to+Fi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"Jallentino","files":3,"time":1407564018,"description":"Lexie Barnes, &quot;Sew What! Bags: 18 Pattern-Free Projects You Can Customize to Fit Your Needs&quot;\nISBN: 1603420924 | EPUB | 152 pages | 11 MB\n\n\nAs the plastic bag is increasingly banished from stores, the cloth bag is stepping up to save the day. Whether toting groceries, books, baby supplies, gardening tools, or a wallet and some electronic gadgets, eco-conscious crafters will find a bag design to fit their needs in Sew What! Bags. The focus is on simple, pattern-free sewing that requires no previous experience - just an inventive spirit, some fun fabric, and a basic sewing machine.\n\nAuthor Lexie Barnes is a nationally known brand in the bag world, noted for contemporary designs that combine practical detail with stellar functionality. Her unique approach to bag design - starting with the need and then customizing the bag to fit it perfectly - is inspiring and freeing. She encourages crafters to jumpstart their creativity with &quot;warm-up projects&quot; that will carry just a single object, from a pair of eyeglasses to a pack of tissues.\n\nThe 18 core projects in Sew What! Bags show how to use bold, contemporary fabrics to make totes, drawstring sacks, messenger bags, organizers, satchels, and purses in a wide range of sizes and shapes. Every project is shown in a full-color photo accompanied by step-by-step, illustrated instructions. Many more variations in size, fabric combinations, and styling features are also pictured to show just a few of the dozens of possibilities for customizing each project.\n\nCrafters of all levels are sure to be carried away by Lexie Barnes's inspired approach to creating the bag of your dreams.\n &lt;a href=&quot;\nhttp://i.imgur.com/XBjsO1H.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/XBjsO1H.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2d15cc1ecde01ba2c045bc54924781d9b31f1f63","amp;dn":"Sew+What%21+Bags%3A+18+Pattern-Free+Projects+You+Can+Customize+to+Fi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d15cc1ecde01ba2c045bc54924781d9b31f1f63","infoHashBuffer":{"type":"Buffer","data":[45,21,204,30,205,224,27,162,192,69,188,84,146,71,129,217,179,31,31,99]},"announce":[],"urlList":[]}}