{"title":"Confucius - The Analects (Penguin Classics)","uid":11399963,"size":14859672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d5a67384b9b1a7f112cccbb921d162dc0e5dddb&amp;dn=Confucius+-+The+Analects+%28Penguin+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"workerbee","files":-1,"time":1415409708,"description":"\nConfucius - THE ANALECTS (Penguin Classics, 2014).  Translated with Introduction and Commentary by Annping Chin.  432 pp. -- ePUB + MOBI\n\n\nOne of the most influential books in human history, in a revelatory new translation.\n\nThe book that the Chinese have returned to repeatedly for reflection, renewal, and validation of their own views, THE ANALECTS was compiled by the disciples of Confucius (551-479 BCE), China's earliest teacher and moral thinker, from his remarks and his conversations with rulers, political operators, and people he happened to meet.  It laid the foundation of the Chinese idea of what is moral and what is politically viable, what is a good government and who has integrity.\n \nFeaturing both the English and Chinese texts, this new translation, by one of the pre-eminent scholars of Confucius, draws on the most recent excavated manuscripts and centuries of scholarship to illuminate the historical context of Confucius' teachings, explaining who the many local figures referenced are, and navigating a rich tradition of historical commentaries.  The result is a map of Confucian thought that brings us as close as possible to experiencing Confucius as his followers might have 2,500 years ago.\n\n\nReviews\n\n&quot;For more than two millennia, the teachings of Confucius have served as a guide for a substantial portion of humanity. English-language readers seeking to understand this remarkable body of thought are fortunate to have Annping Chin's highly readable and judiciously annotated edition of The Analects.&quot; -- Henry A. Kissinger\n\n&quot;An astonishingly lucid exposition of The Analects.  A kind of serene insight pervades the commentaries.&quot; -- Harold Bloom\n\n&quot;An incomparable new volume that combines a fresh and sympathetic translation with a wonderfully readable annotation.  It is a joy to use and will unlock a whole new level of meaning for English-language readers.&quot; -- Orville Schell\n\n_______________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n               &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:2d5a67384b9b1a7f112cccbb921d162dc0e5dddb","amp;dn":"Confucius+-+The+Analects+%28Penguin+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d5a67384b9b1a7f112cccbb921d162dc0e5dddb","infoHashBuffer":{"type":"Buffer","data":[45,90,103,56,75,155,26,127,17,44,204,187,146,29,22,45,192,229,221,219]},"announce":[],"urlList":[]}}