{"title":"The Encyclopedia of Volcanoes - 2nd Edition (2015).pdf Gooner","uid":12235352,"size":357991831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2dd2e07a8f8c81950a596812ddde951cb1f9fae3&amp;dn=The+Encyclopedia+of+Volcanoes+-+2nd+Edition+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1439654894,"description":"Publisher: Academic Press; 2 edition (April 14, 2015)\nLanguage: English\nISBN-10: 0123859387\nISBN-13: 978-0123859389\n\nVolcanoes are unquestionably one of the most spectacular and awe-inspiring features of the physical world. Our paradoxical fascination with them stems from their majestic beauty and powerful, sometimes deadly, destructiveness. Notwithstanding the tremendous advances in volcanology since ancient times, some of the mystery surrounding volcanic eruptions remains today. The Encyclopedia of Volcanoes summarizes our present knowledge of volcanoes; it provides a comprehensive source of information on the causes of volcanic eruptions and both the destructive and beneficial effects. The early chapters focus on the science of volcanism (melting of source rocks, ascent of magma, eruption processes, extraterrestrial volcanism, etc.).  Later chapters discuss human interface with volcanoes, including the history of volcanology, geothermal energy resources, interaction with the oceans and atmosphere, health aspects of volcanism, mitigation of volcanic disasters, post-eruption ecology, and the impact of eruptions on organismal biodiversity.\nProvides the only comprehensive reference work to cover all aspects of volcanology\nWritten by nearly 100 world experts in volcanology\nExplores an integrated transition from the physical process of eruptions through hazards and risk, to the social face of volcanism, with an emphasis on how volcanoes have influenced and shaped society\nPresents hundreds of color photographs, maps, charts and illustrations making this an aesthetically appealing reference\nOn-line supplement includes additional multimedia\nGlossary of 3,000 key terms with definitions of all key vocabulary items in the field is included","torrent":{"xt":"urn:btih:2dd2e07a8f8c81950a596812ddde951cb1f9fae3","amp;dn":"The+Encyclopedia+of+Volcanoes+-+2nd+Edition+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dd2e07a8f8c81950a596812ddde951cb1f9fae3","infoHashBuffer":{"type":"Buffer","data":[45,210,224,122,143,140,129,149,10,89,104,18,221,222,149,28,177,249,250,227]},"announce":[],"urlList":[]}}