{"title":"Wet and Wild Butt (Brazzers) (2016) DVDRip","uid":15952310,"size":2327477875,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2e079bde601b2c206f3399f001ec8b1983157d59&amp;dn=Wet+and+Wild+Butt+%28Brazzers%29+%282016%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":25,"uploader":"distinc","files":1,"time":1475585328,"description":"Wet and Wild Butt (Brazzers) (2016) DVDRip\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=7117594993\r\n \nhttp://imagedisco.net/?g=8526682509\r\n\r\n\r\nPlot:\r\n\r\nDirector: Studio: Brazzers\r\nStarring: Britney Amber, Sarah Vandella, Anikka Albrite, Mandy Muse, Candice Dare, Bella Bellz, Mick Blue, Keiran Lee, Brick Danger.\r\nTechnical information\r\nVideo: 720x404, 1600 kbps, H.264, MP4, DVDRip\r\nAudio: 109 kbps, AAC\r\n\r\nDuration: 2:59\r\nDescription:\r\nAll Anal! Anal For Anikka\r\nWhen it was time for Anikka Albrite to get a nice anal pounding, we sent in our man Keiran Lee to fuck that ass right. First, Anikka teased the camera, shaking her ass and exposing her big natural tits in the shower. Then she fucked that fat cock, rubbing her clit until she came as Keiran fucked her tight little asshole.\r\nSpin Class With Extra Ass\r\nThere's nothing that sexy slut Sarah Vandella likes more than a little anal sex. She was on the treadmill getting sweaty and staying tight and toned when Brick came in to give her a real workout. Brick fucked her round ass hard while she came on his big cock, and then he gave her a big facial that she slurped up like a protein shake!\r\nOn The Pole\r\nIf there's one thing Britney Amber knows, it's how to work the pole. So we set her up with a stripper's pole and Jordan Ash's big dick so she could show off all of her best moves. Britney teases us with her big tits and juicy butt before Jordan's dick makes its grand entrance and Britney gives him a super spitty and sloppy blowjob.\r\nHome Alone And Down To Bone\r\nAfter making those cheeks clap and teasing you in every room of her house Mandy headed to her pool to splash in the water and feel the jets on her clit. When her fuck buddy Mick showed up, he buried his face between her thick ass cheeks and tongued her pristine asshole, before throwing his hammer deep in her tight ass.\r\nBella's Big Booty\r\nBella starts off by giving us a nice show, stripping down and shaking her booty to get Keiran's dick nice and hard. Then she let Keiran fuck her face until her pussy is dripping wet. He pounds her tight pussy and big juicy butt until she's cumming all over his dick and then busts a fat nut all over her pretty face!\r\n\r\nGenre:Anal , Gonzo , Blowjob , Hardcore , Oiled","torrent":{"xt":"urn:btih:2e079bde601b2c206f3399f001ec8b1983157d59","amp;dn":"Wet+and+Wild+Butt+%28Brazzers%29+%282016%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e079bde601b2c206f3399f001ec8b1983157d59","infoHashBuffer":{"type":"Buffer","data":[46,7,155,222,96,27,44,32,111,51,153,240,1,236,139,25,131,21,125,89]},"announce":[],"urlList":[]}}