{"title":"Data Smart- Foreman, 2013 (Wiley) [PDF]","uid":9373710,"size":67774444,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e14b88f098436d851d15abdb1973777ff3b3782&amp;dn=Data+Smart-+Foreman%2C+2013+%28Wiley%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"F1restorm","files":-1,"time":1387579023,"description":"Data Smart : Using Data Science to Transform Information into Insight \nAuthor: John W Foreman\nPublished: October 31, 2013\nPublisher: Wiley\nISBN: 9781118661482\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_____________________________________________________________________________________\n\nData Science gets thrown around in the press like it's magic. Major retailers are predicting everything from when their customers are pregnant to when they want a new pair of Chuck Taylors. It's a brave new world where seemingly meaningless data can be transformed into valuable insight to drive smart business decisions.\n\nBut how does one exactly do data science? Do you have to hire one of these priests of the dark arts, the &quot;data scientist,&quot; to extract this gold from your data? Nope.\n\nData science is little more than using straight-forward steps to process raw data into actionable insight. And in Data Smart, author and data scientist John Foreman will show you how that's done within the familiar environment of a spreadsheet. \n\nWhy a spreadsheet? It's comfortable! You get to look at the data every step of the way, building confidence as you learn the tricks of the trade. Plus, spreadsheets are a vendor-neutral place to learn data science without the hype. \n\nBut don't let the Excel sheets fool you. This is a book for those serious about learning the analytic techniques, the math and the magic, behind big data.\n\nEach chapter will cover a different technique in a spreadsheet so you can follow along:\n-Mathematical optimization, including non-linear programming and genetic algorithms\n-Clustering via k-means, spherical k-means, and graph modularity\n-Data mining in graphs, such as outlier detection\n-Supervised AI through logistic regression, ensemble models, and bag-of-words models\n-Forecasting, seasonal adjustments, and prediction intervals through monte carlo simulation\n-Moving from spreadsheets into the R programming language\nYou get your hands dirty as you work alongside John through each technique. But never fear, the topics are readily applicable and the author laces humor throughout. You'll even learn what a dead squirrel has to do with optimization modeling, which you no doubt are dying to know.\n","torrent":{"xt":"urn:btih:2e14b88f098436d851d15abdb1973777ff3b3782","amp;dn":"Data+Smart-+Foreman%2C+2013+%28Wiley%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e14b88f098436d851d15abdb1973777ff3b3782","infoHashBuffer":{"type":"Buffer","data":[46,20,184,143,9,132,54,216,81,209,90,189,177,151,55,119,255,59,55,130]},"announce":[],"urlList":[]}}