{"title":"MDSolids v4.1.0 with Key [TorDigger]","uid":9176672,"size":18517584,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2ee3825ead1ea4f223605974a36092e14fbd70ea&amp;dn=MDSolids+v4.1.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"TorDigger","files":11,"time":1384162846,"description":"MDSolids\n\nMDSolids is software for topics taught in the Mechanics of Materials course (also commonly called Strength of Materials or Mechanics of Deformable Solids). This course is typically a part of civil, mechanical, and aerospace engineering programs and a number of related programs. The software also features a number of modules for topics taught in the Statics course.\nMDSolids consists of routines for beams and flexural members, torsional assemblies, axial assemblies, trusses, columns, pressure vessels, section properties, Mohr's circle analysis (including stress transformations and strain transformations), and many more topics.\n\nFor over a decade, MDSolids has been meeting the needs of students and engineering professionals. These users will tell you that no engineering software is easier to use or more versatile. Please have a look at the features of MDSolids to discover what this software can do for you.\n\nStyle\n\n-Throughout MDSolids, the user is offered graphical or intuitive choices for all of the required data or units. In drawing shear force and bending moment diagrams, for example, the user can click on a picture of an arrow pointed down and enter the magnitude of the load to define a downward vertical point load rather than having to remember to enter a negative number for the load. \n\n-In most cases, four common units (two US and two SI) are provided for each variable. For example, stress can be computed in psi, ksi, kPa, or MPa. The user is free to mix the units in any way desired. For example, a beam cross-section could be defined in millimeters, a beam length in inches, a moment diagram in kN-m, and the resulting bending stress could be shown in psi. \n\n-All of these choices for forces and units are made by simply clicking the appropriate buttons on the displayed forms. The mechanics of materials concepts are difficult enough without adding confusion about software sign conventions and unit systems. \n\nWhat's New?\n\nStandard European and British steel shape properties for wide-flange, channel, and hollow structural sections.\nUpdate AISC column design formulas to current specification.\nAdded new data import capabilities to the stress-strain routine.\nAdditions to the help documents.\nGeneral enhancements throughout the program.\n\nSupported OS:\n\nWindows 8, Windows 7, and all prior versions of Windows\n\nHomepage: http://www.mdsolids.com/\n\nInstallation Instructions: \n\n- Install program.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:2ee3825ead1ea4f223605974a36092e14fbd70ea","amp;dn":"MDSolids+v4.1.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ee3825ead1ea4f223605974a36092e14fbd70ea","infoHashBuffer":{"type":"Buffer","data":[46,227,130,94,173,30,164,242,35,96,89,116,163,96,146,225,79,189,112,234]},"announce":[],"urlList":[]}}