{"title":"Ian Douglas - Star Carrier [Books 1-6]","uid":12345470,"size":2142223845,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2ef474b9f53bc9db65a7db66f3c87ed23c9c6eb6&amp;dn=Ian+Douglas+-+Star+Carrier+%5BBooks+1-6%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"Cybotage","files":6,"time":1441348899,"description":"\n\nEarth Strike - There is a milestone in the evolution of every sentient race, a Tech Singularity Event, when the species achieves transcendence through its technological advances. Now the creatures known as humans are near this momentous turning point. But an armed threat is approaching from deepest space, determined to prevent humankind from crossing over that boundary - by total annihilation if necessary.\n\nCenter of Gravity - On the far side of known human space, the Marines are under siege, battling the relentless servant races of the Sh'daar aggressor. With a task force stripped to the bone and the Terran Confederation of States racked by dissent, rogue Admiral Alexander Koenig must make the momentous decision that will seal his fate and the fate of humankind.\n\nSingularity - There is an unseen power in the universe - a terrible force that was dominating the galaxy tens of thousands of years before the warlike Sh'daar were even aware of the existence of Sol and its planets. As humankind approaches the Singularity, when transcendence will be achieved through technology, contact will be made. In the wake of the near destruction of the solar system, the political powers on Earth seek a separate peace with an inscrutable alien life form that no one has ever seen.\n\nDeep Space - Humanity had appeared to fend off the Sh'daar assault once and for all, though they never learned why the alien empire was driven to halt Earth's advancement toward technological Singularity. But in this war of worlds, victory is always elusive. And now a new battle begins. After 20 years of peace, not one but two fragile truces are unraveling. Alexander Koenig, the former Navy commander whose heroics forced the Sh'daar into submission, has won a second term as President of the United States of North America. But pursuing his mandate - sovereignty from the centuries-old Earth Confederation - becomes a risky proposition...\n\nDark Matter - The United States of North America is now engaged in a civil war with the Earth Confederation, which wants to yield to the demands of the alien Sh'daar, limit human technology, and become a part of the Sh'daar Galactic Collective. USNA President Koenig believes that surrendering to the Sh'daar will ultimately doom humankind. But when highly advanced, seemingly godlike aliens appear through an artificial wormhole in the Omega Centauri Cluster 16,000 light years from Earth, President Koenig is faced with a tremendous choice.\n\nDeep Time - Once rebels find themselves facing off against the Earth Confederation, the United States of North America is now the dominant force in negotiations with the interstellar Sh'daar Collective. But just as the marines root out the last violent dissenters, an alien ship of unknown origin suddenly flees Earth's orbit. Is it mere coincidence...or a terrifying omen?\n\n\n\nRead by Nick Sullivan\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged\n\nType: Unabridged\nNarrator: Nick Sullivan\nQuality: 64 kbps / 2.0 Stereo / 44100 hz","torrent":{"xt":"urn:btih:2ef474b9f53bc9db65a7db66f3c87ed23c9c6eb6","amp;dn":"Ian+Douglas+-+Star+Carrier+%5BBooks+1-6%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ef474b9f53bc9db65a7db66f3c87ed23c9c6eb6","infoHashBuffer":{"type":"Buffer","data":[46,244,116,185,245,59,201,219,101,167,219,102,243,200,126,210,60,156,110,182]},"announce":[],"urlList":[]}}