{"title":"The True History of the Black Adder: At Last, THE Cunning Plan","uid":15789334,"size":2197706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f18c25dddbc1ff0b8ecd777869cc60fcd487a5d&amp;dn=The+True+History+of+the+Black+Adder%3A+At+Last%2C+THE+Cunning+Plan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"marty14","files":1,"time":1473371317,"description":"The True History of the Black Adder: At Last, THE Cunning Plan, in All Its Hideous Hilarity - J.F. Roberts [epub]\r\n\r\nThe complete history of the series, with the cooperation of writers Richard Curtis and Ben Elton, producer John Lloyd, and cast and crew. Hitherto unseen material includes extracts from a previously unseen and unproduced Christmas special.\r\n\r\nThis is the very first in-depth examination of the creation of a British institution like no other—arguably the greatest sitcom of all time—not to mention the first historical investigation into the lives of the Blackadder family, one of the UK's most vilified dynasties. Using existing archive footage and rare literature, plus new revelations from personal interviews with the makers including John Lloyd, Tony Robinson, Richard Curtis, Ben Elton, Stephen Fry, Brian Blessed, Rowan Atkinson, and many more, this history relates the full scope of the tale of how the 1970s alumni of three great universities — Oxford, Cambridge, and not Hull, but Manchester — discovered a unique chemistry that would see them build a timeless comic masterpiece. At last Blackadder enthusiasts can now uncover THE cunning plan, in all its hideous hilarity","torrent":{"xt":"urn:btih:2f18c25dddbc1ff0b8ecd777869cc60fcd487a5d","amp;dn":"The+True+History+of+the+Black+Adder%3A+At+Last%2C+THE+Cunning+Plan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f18c25dddbc1ff0b8ecd777869cc60fcd487a5d","infoHashBuffer":{"type":"Buffer","data":[47,24,194,93,221,188,31,240,184,236,215,119,134,156,198,15,205,72,122,93]},"announce":[],"urlList":[]}}