{"title":"History of Western Philosophy - Bertrand Russell (AUDIOBOOK)","uid":5036209,"size":582310506,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:300033170f47cf19ea630db77136207634ef1096&amp;dn=History+of+Western+Philosophy+-+Bertrand+Russell+%28AUDIOBOOK%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"renumeratedfrog","files":79,"time":1249135362,"description":"First published in 1946, History of Western Philosophy went on to become the best-selling philosophy book of the twentieth century. A dazzlingly ambitious project, it remains unchallenged to this day as the ultimate introduction to Western philosophy. Providing a sophisticated overview of the ideas that have perplexed people from time immemorial, Russell's History of Western Philosophy offered a cogent prÃƒÂ©cis of its subject. Of course this cannot be the only reason it ended up the best selling philosophy book of the twentieth century. Russell's book was 'long on wit, intelligence and curmudgeonly scepticism', as the New York Times noted, and it is this, coupled with the sheer brilliance of its scholarship, that has made Russell's History of Western Philosophy one of the most important philosophical works of all time.\n\n\nNOTE:\n\nThis is a fixed version of the original torrent. Following changes were made:\n- Fixed the annoying hiss from the cassette tape\n- Divided the cassette volumes into actual chapters corresponding to the book\n- Used VBR (effective 100kbps) to halve the size of the files\n\nThanks to tonytiger01 for the original torrent.","torrent":{"xt":"urn:btih:300033170f47cf19ea630db77136207634ef1096","amp;dn":"History+of+Western+Philosophy+-+Bertrand+Russell+%28AUDIOBOOK%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"300033170f47cf19ea630db77136207634ef1096","infoHashBuffer":{"type":"Buffer","data":[48,0,51,23,15,71,207,25,234,99,13,183,113,54,32,118,52,239,16,150]},"announce":[],"urlList":[]}}