{"title":"Photo Mechanic 5.0 Build 13158","uid":7522888,"size":36610501,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:300f3f6e6e5765b37dfe31a50337d7a8635a774a&amp;dn=Photo+Mechanic+5.0+Build+13158&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"openarena","files":-1,"time":1344684676,"description":"Photo Mechanic is a photographer's image browser tool. It is the answer for professional digital photographers looking for a fast and easy-to-use image browser for digital camera files. Photo Mechanic's innovative batch captioning, renaming, speedy browsing, and Photoshop connectivity features have made it the choice of thousands of photojournalists and professional photographers worldwide. Optimized for use with professional cameras from Nikon, Canon, Olympus and Pentax, Photo Mechanic has become the standard tool for digital image browsing.\n\nPhoto Mechanic is a standalone image browser that lets you view your digital photos with convenience and speed. Photo Mechanic displays the &quot;thumbnails&quot; of photos on a camera disk or folder in familiar &quot;contact sheet&quot; display windows. You can quickly rotate, preview, copy, delete, tag, rename, and add caption / keyword (IPTC news record) information to photos both individually and in batches. Photo Mechanic helps you find the best photo amongst several similar shots with its preview display that lets you flip through a group of selected photos at high resolution. Photo Mechanic can then pass the photos you select on to Adobe Photoshop for image retouching.\n\nPhoto Mechanic's unique Image Variable technology unleashes the power of metadata. Metadata can be information saved with each photo such as image capture data or IPTC fields, or other information like the current date and time. Standard image capture data like aperture, shutter speed, ISO, and focal length can be accessed through &quot;variables&quot; and tucked-away in any IPTC field such as the caption. You can also use variables representing the current or capture time, date, or frame number, for example, for file renaming purposes. IPTC fields can be extracted using variables for use in renaming - even the filename variable can be placed in an IPTC field. One important variable called the sequence variable can be used for sequential naming or to serialize certain IPTC fields. In all, Photo Mechanic has more than 60 variables that enable customized workflows for captioning and renaming photos. The possibilities are endless!\n\nPhoto Mechanic can also print contact sheets and export HTML for Web pages. You can control the layout and size of your thumbnails, and even use Photo Mechanic's image variables to customize the text for thumbnail titles and page headers or footers, making Photo Mechanic one of the most flexible tools available for formatting your output.\n\nWhat's New v5.0: Release notes were unavailable when this listing was updated.\nRequirements\n\nPPC / Intel\nMac OS X 10.6.8 or later","torrent":{"xt":"urn:btih:300f3f6e6e5765b37dfe31a50337d7a8635a774a","amp;dn":"Photo+Mechanic+5.0+Build+13158","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"300f3f6e6e5765b37dfe31a50337d7a8635a774a","infoHashBuffer":{"type":"Buffer","data":[48,15,63,110,110,87,101,179,125,254,49,165,3,55,215,168,99,90,119,74]},"announce":[],"urlList":[]}}