{"title":"Ty Segall - Sleeper (2013) [FLAC]","uid":8833340,"size":232004460,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:30125c53826d82035f4d832dc8cb5ccf6f36b682&amp;dn=Ty+Segall+-+Sleeper+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"politux","files":-1,"time":1377046801,"description":"\n  Ty Segall - Sleeper (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Garage Rock, Psychedelic \n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Sleeper\n  02 The Keepers\n  03 Crazy\n  04 The Man Man \n  05 She Don't Care\n  06 Come Outside\n  07 6th Street\n  08 Sweet C.C.\n  09 Queen Lullabye\n  10 The West   \n\n  If there was ever any question whether Ty Segall was at his creative peak, Sleeper, his tenth studio album in five years, should put any doubts to rest. Perhaps his biggest departure, this outing abandons his usual style of quick and scuzzy lo-fi rock tunes, and finds the artist dipping his brush straight into a neo-psych palette of dreamy acoustic songs firmly indebted to the late '60s British folk recordings of Pink Floyd, David Bowie, and the Kinks. Minus the muscle, Segall's songs still manage to pack an emotional powerful punch due to a thick undercurrent of sentimentality and nostalgia. Jay Reatard's stripped acoustic numbers and the retro-stylings of Brian Jonestown Massacre bear some similarities to Segall's new face; but cleanly recorded in a wide open studio with hot ribbon mikes to capture all the blemishes, the uniqueness of his musical voice is undeniable. There is no trashy fuzz to hide behind. In fact, it's only on song four (&quot;The Man Man&quot;) that distorted guitars even come into play. Most are simply built with an acoustic and layered strings and vocals, with the occasional foot stop or tambourine hit for percussion. Heartfelt unplugged compositions like &quot;She Don't Care&quot; are bound to send chills up spines with its cooing chorus of falsetto harmonies, and raise awareness that he is anything but a mere garage rocker. A full, concentrated album of ballads may seem startling even for die-hard fans, not just because the new full-on singer/songwriter mode is such a departure, but also because of how beautifully weary and evocative his songs tend to be when he allows a glimpse at his unplugged intimate side.","torrent":{"xt":"urn:btih:30125c53826d82035f4d832dc8cb5ccf6f36b682","amp;dn":"Ty+Segall+-+Sleeper+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30125c53826d82035f4d832dc8cb5ccf6f36b682","infoHashBuffer":{"type":"Buffer","data":[48,18,92,83,130,109,130,3,95,77,131,45,200,203,92,207,111,54,182,130]},"announce":[],"urlList":[]}}