{"title":"Cameron Crawford - Black Ops Hypnosis. Dark Side Edition","uid":12938124,"size":175111648,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:30da7794704905b90adfd6f0d7508e2edfeadf6d&amp;dn=Cameron+Crawford+-+Black+Ops+Hypnosis.+Dark+Side+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"acer47x","files":25,"time":1449603992,"description":"Black hypnosis ops, or covert hypnosis, or shortly just Black ops, is the synergy of four fields of persuasion: NLP, seduction, hypnosis, and social engineering. Experts from each of these fields came together and started testing the most effective techniques and strategies that combined together bring about the most impact and persuade on the spot.\r\n\r\n\r\nDarkside Hypnosis contains some of the most insanely controversial material that has ever been available in any hypnosis or persuasion course and it even goes as far\r\nas revealing for the first time the &quot;forbidden&quot; October Man Sequence and the highly sought after Dark Shadow technique.\r\n\r\nThese two techniques have been whispered about for years in the hypnosis and persuasion inner circles, but this is the first time that anyone has ever released the to the public.\r\n\r\nThe creator of the Darkside Hypnosis course, Cameron Crawford has spent the last ten years of his life hunting down every powerful Darkside Hypnosis technique that has ever existed, and he's collaborated with some of the most powerful persuaders in history to bring us a course which has the ability to turn you into a persuasion machine.\r\n\r\nI was recently lucky enough to get a sneak peak of Darkside Hypnosis, and let me tell you... this course will be in the record book for sure.\r\n\r\nDarkside Hypnosis consists of over eight hours worth of audio, full transcripts of the course, and it also comes with three bonuses that you will not find anywhere else.\r\n\r\nContents:\r\n\r\nDark side Hypnosis REVEALED (27 minutes). If you want to know exactly how these advanced tactics are work and exactly what Dark Side Hypnosis is then this is the section for you.\r\n\r\nThe Godfather Method (46 minutes). In this audio we go into intense detail about the EXTREMELY RARE and COVETED Godfather Method that let's you become someone of value who people naturally want to be controlled by.\r\n\r\nThe Authority Hijack (50 minutes). Ever wonder how to enter any social situation or any group of people and instantly command attention, and all without setting off alarm bells? In this section I go over Covert tactics that will let you fly in under the radar and control any social dynamic!\r\n\r\nThe Powerful EMPIRE MAN Technique (55 minutes). In this section I reveal to you the secret &quot;EMPIRE MAN&quot; technique to give you more ROCK SOLID, unshakeable core confidence then you ever thought possible. Your life will be literally transformed by this one powerful, belief altering technique alone.\r\n\r\nThe Dangerously Effective Dark Shadow Technique (37 minutes). For the first time I'm going to reveal this advanced tactic that will give you a window into anyone's soul so you can reflect it back to them and demonstrate a powerful understanding of their reality and pull them into your world which will let you persuade anyone to do almost anything!\r\n\r\nThe Hidden Persuaders (1 hour, 19 minutes). This section teaches you the skills for covert, conversational hypnosis so that you can bend someone's mind around to your way of thinking by just having normal conversation.\r\n\r\nThe Forbidden OCTOBER MAN Sequence (40 minutes). Saying these magic words will instantly get anyone so attracted to you they'll want to tear your clothes off and take you home right away. This one amazing technique will let you create a powerful &quot;love at first sight&quot; connection with anyone you meet instantly.\r\n\r\nThe Lie Detector (1 hour, 10 minutes). This section reveals the secrets to detecting deceit so you will never be lied to again so that you can protect yourself from anyone trying to manipulate you","torrent":{"xt":"urn:btih:30da7794704905b90adfd6f0d7508e2edfeadf6d","amp;dn":"Cameron+Crawford+-+Black+Ops+Hypnosis.+Dark+Side+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30da7794704905b90adfd6f0d7508e2edfeadf6d","infoHashBuffer":{"type":"Buffer","data":[48,218,119,148,112,73,5,185,10,223,214,240,215,80,142,46,223,234,223,109]},"announce":[],"urlList":[]}}