{"title":"Trotsky: A Biography","uid":15760426,"size":2051156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3119860a8598283fb7532f47112b95af4ef16e2e&amp;dn=Trotsky%3A+A+Biography&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"marty14","files":1,"time":1473107745,"description":"Trotsky: A Biography - Robert Service [epub]\r\n\r\nRobert Service completes his masterful trilogy on the founding figures of the Soviet Union in an eagerly anticipated, authoritative biography of Leon Trotsky.\r\n\r\nTrotsky is perhaps the most intriguing and, given his prominence, the most understudied of the Soviet revolutionaries. Using new archival sources including family letters, party and military correspondence, confidential speeches, and medical records, Service offers new insights into Trotsky. He discusses Trotsky’s fractious relations with the leaders he was trying to bring into a unified party before 1914; his attempt to disguise his political closeness to Stalin; and his role in the early 1920s as the progenitor of political and cultural Stalinism. Trotsky evinced a surprisingly glacial and schematic approach to making revolution.\r\n\r\nService recounts Trotsky’s role in the botched German revolution of 1923; his willingness to subject Europe to a Red Army invasion in the 1920s; and his assumption that peasants could easily be pushed onto collective farms. Service also sheds light on Trotsky’s character and personality: his difficulties with his Jewish background, the development of his oratorical skills and his preference for writing over politicking, his inept handling of political factions and coldness toward associates, and his aversion to assuming personal power.\r\n\r\nAlthough Trotsky’s followers clung to the stubborn view of him as a pure revolutionary and a powerful intellect unjustly hounded into exile by Stalin, the reality is very different. This illuminating portrait of the man and his legacy sets the record straight","torrent":{"xt":"urn:btih:3119860a8598283fb7532f47112b95af4ef16e2e","amp;dn":"Trotsky%3A+A+Biography","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3119860a8598283fb7532f47112b95af4ef16e2e","infoHashBuffer":{"type":"Buffer","data":[49,25,134,10,133,152,40,63,183,83,47,71,17,43,149,175,78,241,110,46]},"announce":[],"urlList":[]}}