{"title":"Monopoly City - Full PreCracked - Foxy Games","uid":6889638,"size":63099759,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:31364fe8aa9706c8fed53d4966e8d8bc8ae518c2&amp;dn=Monopoly+City+-+Full+PreCracked+-+Foxy+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"redfoxygames","files":-1,"time":1323962382,"description":"At first you think you are playing good old Monopoly where they just add some extra buildings to give a little twist. But the longer you play, the more you realise they actually made a whole new game. You start with more money than usual, which gives you the idea you will last longer (with a bit of luck maybe). The fact that now you can build right away when you bought a property, gives so much dynamic to the game. No more waiting until you have the whole set, or not having the set because one player refuses to trade. Even with a couple of single properties you can win the game.\nBut not so fast. Everybody wants to win of course. And with the 80 extra buildings they added to the game, nothing was ever so uncertain. On every property you can build residential or industrial buildings. The first is not protected against negative buildings (hazards) and requires positive buildings otherwise the property becomes worthless. The industrial buildings on the other hand are protected but they cost twice as much! So you will have to make choice. And the added electronic device will, besides timing deals, always indicate how many buildings you can exactly make.\n &lt;a href=&quot;\nhttp://images.amazon.com/images/G/01/toys/detail-page/B001RNHE6W-2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://images.amazon.com/images/G/01/toys/detail-page/B001RNHE6W-2.jpg&lt;/a&gt;\n\nThere is also no community chest anymore, only chance. But they have changed the content of the cards which makes the game less predictable and more fun to play- watch your buildings being crushed because of an earthquake or not getting your rent because a player evades the number thrown with the dice.\n\nBesides these changes, there are many more twists to the game which I will not reveal here but be sure that they all add to the greatness that once was and that now has even become better.\n\nMonopoly City made its first public appearance at the Nuremberg Toy Fair 2009.\n\nFeatures :\n\n* Save progress for up to 5 different games\n* Create individual player profiles\n* Optional in-game advisor provides tips\n* Rich, full-screen graphics and crisp sound\n* No internet connection required\n\nSystem Requirements:\n* Windowx XP/Vista/7\n* 100% DPI\n* 800MHz Processor or better\n* 512MB RAM\n* 65MB Hard Drive Space\n* 32MB Graphics Card\n* DirectX 9.0 or higher\n* 1-4 players","torrent":{"xt":"urn:btih:31364fe8aa9706c8fed53d4966e8d8bc8ae518c2","amp;dn":"Monopoly+City+-+Full+PreCracked+-+Foxy+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31364fe8aa9706c8fed53d4966e8d8bc8ae518c2","infoHashBuffer":{"type":"Buffer","data":[49,54,79,232,170,151,6,200,254,213,61,73,102,232,216,188,138,229,24,194]},"announce":[],"urlList":[]}}