{"title":"Friedrich Schiller - Literary and Philosophical Works (11 books)","uid":15500674,"size":35087933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31417a4bdfe6aaef8c5bead6e2ee09d2a298f44a&amp;dn=Friedrich+Schiller+-+Literary+and+Philosophical+Works+%2811+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"workerbee","files":22,"time":1470501271,"description":"\nFRIEDRICH VON SCHILLER (1759-1805) was a leading German poet, philosopher, physician, historian, and playwright.  He is perhaps best remembered for such dramas as THE ROBBERS (1781), the WALLENSTEIN trilogy (1800-01), MARIA STUART (1801), and WILHELM TELL (1804).  Critics have noted his innovative use of dramatic structure and his creation of new forms, such as the melodrama and the bourgeois tragedy.\r\n\r\nSchiller also wrote many philosophical papers on ethics and aesthetics, synthesizing the thought of Kant with that of Idealist philosophers.  He elaborated the concept of &quot;die schöne Seele&quot; (the beautiful soul), a human being whose emotions have been educated by reason, so that duty and inclination are no longer in conflict with one another.  Thus beauty, for Schiller, was not merely an aesthetic experience, but a moral one too.  His philosophical work was also concerned with the question of human freedom, a preoccupation which also guided his historical researches, such as the Thirty Years' War and the Dutch Revolt, and then found its way as well into his dramas.\r\n\r\nOne of the most profound works of German philosophy, ON THE AESTHETIC EDUCATION OF MAN (1794), was inspired by Schiller's deep disenchantment about the French Revolution and its degeneration into violence.  It examines politics, revolution, and the history of ideas in order to argue that art should have a greater role in shaping society.  He conceives of art as the vehicle of education, one that can liberate individuals from the constraints and excesses of either pure nature or pure mind.  Through aesthetic experience, he asserts, people can reconcile the inner antagonism between sense and intellect, nature and reason.\r\n\r\n\r\nThe following books are in PDF or ePUB format as indicated:\r\n\r\n* Complete Poetical Works and Plays (Delphi Classics, 2013).  Various translators. -- ePUB\r\n\r\n* Don Carlos and Mary Stuart (Oxford World's Classics, 1999).  Translated by Hilary Collier Sy-Quia and Peter Oswald. -- ePUB\r\n\r\n* Friedrich Schiller: An Anthology for Our Time (Ungar, 1959).  Translated by Jane Bannard Greene, Charles E. Passage, and Alexander Gode-von Aesch. -- PDF\r\n\r\n* Friedrich Schiller: Poet of Freedom, Vol. 1 (Schiller Institute, 1985).  Various translators.  [Contains: Don Carlos, Infante of Spain / Letters on Don Carlos / Theater Considered as a Moral Institution / Over the Aesthetical Education of Man / Poems / The Ghost Seer.] -- PDF\r\n\r\n* Friedrich Schiller: Poet of Freedom, Vol. 3 (Schiller Institute, 1990).  Various translators.  [Contains: Poetry / The Virgin of Orleans / Homage to the Arts / Introduction to &quot;The History of the Revolt of the United Netherlands Against Spanich Rule&quot; / Aesthetic and Philosophical Essays.] -- PDF\r\n\r\n* Man Who Sees Ghosts, The (Pushkin Press, 2003).  Translated by David Bryer. -- ePUB\r\n\r\n* Mary Stuart (Oberon, 2005).  In a new version by Peter Oswald. -- ePUB\r\n\r\n* Naive and Sentimental Poetry / On the Sublime (Ungar, 1966).  Translated by Julius A. Elias. -- PDF\r\n\r\n* On the Aesthetic Education of Man (Dover, 2004).  Translated by Reginald Snell. -- ePUB\r\n\r\n* Poems (Dodo, 2007).  Translated by E. B. Lytton. -- PDF\r\n\r\n* Robbers, The / Wallenstein (Penguin Classics, 1979).  Translated by F. J. Lamport. -- ePUB\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                                    \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:31417a4bdfe6aaef8c5bead6e2ee09d2a298f44a","amp;dn":"Friedrich+Schiller+-+Literary+and+Philosophical+Works+%2811+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31417a4bdfe6aaef8c5bead6e2ee09d2a298f44a","infoHashBuffer":{"type":"Buffer","data":[49,65,122,75,223,230,170,239,140,91,234,214,226,238,9,210,162,152,244,74]},"announce":[],"urlList":[]}}