{"title":"The Sons of Caesar Imperial Rome's First Dynasty","uid":15744622,"size":32350648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31de57472ee103c17cc6596c88da3efca2eba458&amp;dn=The+Sons+of+Caesar+Imperial+Rome%27s+First+Dynasty&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"marty14","files":1,"time":1472953797,"description":"The Sons of Caesar: Imperial Rome's First Dynasty by Philip Matyszak [epub]\r\n\r\nThe story of one of the most colorful dynasties in history, from Caesar's rise to power in the first century BC to Nero's death in AD 68\r\n\r\nThis engaging new study reviews the long history of the Julian and Claudian families in the Roman Republic and the social and political background of Rome. At the heart of the account are the lives of six men ― Julius Caesar, Augustus, Tiberius, Caligula, Claudius, and Nero ― men who mastered Rome and then changed it from a democracy to a personal possession. It was no easy task: Caesar and Caligula were assassinated, Nero committed suicide, and Claudius was poisoned. Only Augustus and Tiberius died natural deaths and even that is uncertain.\r\n\r\nThe Julio-Claudian saga has a host of other intriguing characters, from Cicero, the last great statesman of the Republic, to Livia, matriarch of the Empire; the passionate Mark Antony and the scheming Sejanus; and Agrippina, mother of Nero and sister of Caligula, who probably murdered her husband and was in turn killed by her son. Set against a background of foreign wars and domestic intrigue, the story of Rome's greatest dynasty is also the story of the birth of an imperial system that shaped the Europe of today. 90 Illustrations","torrent":{"xt":"urn:btih:31de57472ee103c17cc6596c88da3efca2eba458","amp;dn":"The+Sons+of+Caesar+Imperial+Rome%27s+First+Dynasty","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31de57472ee103c17cc6596c88da3efca2eba458","infoHashBuffer":{"type":"Buffer","data":[49,222,87,71,46,225,3,193,124,198,89,108,136,218,62,252,162,235,164,88]},"announce":[],"urlList":[]}}