{"title":"Thermoelectric Bi2Te3 Nanomaterials - Oliver Eibl et al.","uid":16032511,"size":4728828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:325594f72590ab058c48e79f9790c740174ecf77&amp;dn=Thermoelectric+Bi2Te3+Nanomaterials+-+Oliver+Eibl+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"clouderone","files":1,"time":1476441746,"description":"Thermoelectric Bi2Te3 Nanomaterials - Oliver Eibl et al. (Wiley-VCH, 2015).pdf\r\n\r\nEdited by the initiators of a priority research program funded by the German Science Foundation and written by an international team of key players, this is the first book to provide an overview of nanostructured thermoelectric materials – putting the new developments into perspective alongside conventional thermoelectrics.\r\n\r\nAs such, it reviews the current state of research on thermoelectric Bi2Te3 nanomaterials, covering advanced methods of materials synthesis, characterization of materials structures and thermoelectric properties, as well as advances in the theory and modeling of transport properties. Nanomaterials-based thermoelectric devices are also discussed with respect to their properties, their suitability for different energy generation applications, and in light of their commercialization potential. An outlook on the chances, challenges, and future directions of research rounds off the book, giving a straightforward account of the fundamental and technical problems – plus ways to overcome them","torrent":{"xt":"urn:btih:325594f72590ab058c48e79f9790c740174ecf77","amp;dn":"Thermoelectric+Bi2Te3+Nanomaterials+-+Oliver+Eibl+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"325594f72590ab058c48e79f9790c740174ecf77","infoHashBuffer":{"type":"Buffer","data":[50,85,148,247,37,144,171,5,140,72,231,159,151,144,199,64,23,78,207,119]},"announce":[],"urlList":[]}}