{"title":"History Decoded (audiobook) by Keith Ferrell, Brad Meltzer 2013","uid":9136496,"size":176728613,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:32ce0c91cb901fab9efd8ac979a37af474b76adb&amp;dn=History+Decoded+%28audiobook%29+by+Keith+Ferrell%2C+Brad+Meltzer+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"BosuxRedsux","files":20,"time":1383421852,"description":"Keith Ferrell, Brad Meltzer, Scott Brick (Narrator), &quot;History Decoded: The 10 Greatest Conspiracies of All Time&quot;\nISBN: 1622312783, ASIN: B00FARKOKO | 2013 | MP3@64 kbps | ~06:08:00 | 170 MB\n\nIt's an irresistible combination: Brad Meltzer, a born storyteller, counting down the world's most intriguing unsolved mysteries. And to make this richly illustrated book even richer, each chapter invites the reader along for an interactive experience through the addition of removable facsimile documents-the evidence! It's a treasure trove for conspiracy buffs, a Griffin and Sabine for history lovers. Adapted from Decoded, Meltzer's hit show on the HISTORY network, History Decoded explores fascinating, unexplained questions. Is Fort Knox empty? Why was Hitler so intent on capturing the Roman &quot;Spear of Destiny&quot;? What's the government hiding in Area 51? Where did the Confederacy's $19 million in gold and silver go at the end of the Civil War? And did Lee Harvey Oswald really act alone? Meltzer sifts through the evidence; weighs competing theories; separates what we know to be true with what's still-and perhaps forever-unproved or unprovable; and in the end, decodes the mystery, arriving at the most likely solution. Along the way we meet Freemasons, Rosicrucians, Nazi propagandists, and the real DB Cooper.\n\nBound in at the beginning of each story is a custom-designed envelope-a faux 19th-century leather satchel, a U.S. government classified file-containing facsimiles of relevant evidence: John Wilkes Booth's alleged unsigned will, a map of the Vatican, Kennedy's death certificate. The whole is a riveting, interactive adventure through the compelling world of mysteries and conspiracies.","torrent":{"xt":"urn:btih:32ce0c91cb901fab9efd8ac979a37af474b76adb","amp;dn":"History+Decoded+%28audiobook%29+by+Keith+Ferrell%2C+Brad+Meltzer+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32ce0c91cb901fab9efd8ac979a37af474b76adb","infoHashBuffer":{"type":"Buffer","data":[50,206,12,145,203,144,31,171,158,253,138,201,121,163,122,244,116,183,106,219]},"announce":[],"urlList":[]}}