{"title":"Bedtime Stories for Grown-ups - Ben Holden [EN EPUB] [ebook] [p_","uid":16034807,"size":5701659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32ce89f20aa634a656fb4ae3834f42a4e4a5072a&amp;dn=Bedtime+Stories+for+Grown-ups+-+Ben+Holden+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"perfect_stan","files":1,"time":1476468034,"description":"Bedtime Stories for Grown-ups by Ben Holden\r\nEnglish | 2016 | General Fiction | 5.4 MB\r\n\r\n\r\nThere are few more precious routines than that of the bedtime story. So why do we discard this invaluable ritual as grown-ups to the detriment of our well-being and good health?\r\nIn this groundbreaking anthology, Ben Holden, editor of the bestselling Poems That Make Grown Men Cry, challenges how we think about life, a third of which is spent asleep. He deftly explores not only the science of sleep but also why we endlessly tell stories – even to ourselves, as we dream.\r\nHolden combines his own illuminating storytelling with a treasure trove of timeless classics and contemporary gems. Poems and short stories, fairy tales and fables, reveries and nocturnes – from William Shakespeare to Haruki Murakami, Charles Dickens to Roald Dahl, Rabindranath Tagore to Nora Ephron, Vladimir Nabokov to Neil Gaiman – are all woven together to replicate the journey of a single night’s sleep.\r\nSome of today’s greatest storytellers reveal their choice of the ideal grown-up bedtime story: writers such as Margaret Drabble, Ken Follett, Tessa Hadley, Joanne Harris; Robert Macfarlane, Patrick Ness, Tony Robinson and Warsan Shire.\r\nFold away your laptop and shut down your mobile phone. Curl up and crash out with the ultimate bedside book, one you’ll return to again and again. Full of laughter and tears, moonlight and magic,Bedtime Stories for Grown-ups joyfully provides the dream way to end the day – and begin the night . . .\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:32ce89f20aa634a656fb4ae3834f42a4e4a5072a","amp;dn":"Bedtime+Stories+for+Grown-ups+-+Ben+Holden+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32ce89f20aa634a656fb4ae3834f42a4e4a5072a","infoHashBuffer":{"type":"Buffer","data":[50,206,137,242,10,166,52,166,86,251,74,227,131,79,66,164,228,165,7,42]},"announce":[],"urlList":[]}}