{"title":"Art of the late Middle Ages (Art Ebook).pdf","uid":11894406,"size":46989175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32f3ee3a1266d48c5908bf8a3e18afca8c562cbf&amp;dn=Art+of+the+late+Middle+Ages+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"STBGD","files":1,"time":1431113834,"description":"pdf / English / 272 pages / 1968 Harry Abrams / ISBN-10: 0810980037 / 44.8 MB\n\n&quot;Designed for the non-expert reader, the author takes us through the early architecture of the medieval period that later that became widely known as Gothic. Example after example of Gothic Cathedrals demonstrate the development of this unusual style with outstanding views of Reims Cathedral in France, Lincoln and Wells Cathedrals in England, and Westminster Abbey in London. While Italy is usually associated with artistic styles from the Renaissance (the subject of another book in this excellent series) there are Gothic examples in Pisa and Assisi and the Gothic masterpiece of the Milan Cathedral.\nOther, secular building styles are also seen from the medieval period in the walled city of Carcassonne and Palace if the Popes in Avignon in France. Towards the end of the book are examples late medieval French tapestries and German church works of painting on panels. It is also possible to discern across a number of media types that the visual subjects from Germany become less and less static and more dramatic in style with examples from Durer and others.\n\nLater Renaissance critics sneered at this Gothic style as paintings had little perspective, figures hung in the air with dangling feet and Cathedrals were so high one needed a telescope to see the glass windows. Even the book's author does not use the term Gothic in the title. One of the unusual characteristics of the age was that most of these artistic gothic creations were carried out by unknown artists, so we are not familiar today with the creator of Reims Cathedral as we are of St Peter's in Rome.\n\nThis edition is designed as much for the general reader as it is for the student of medieval or western art, but its small size means it is better suited for your library than the coffee table.&quot;\n\nAmazon","torrent":{"xt":"urn:btih:32f3ee3a1266d48c5908bf8a3e18afca8c562cbf","amp;dn":"Art+of+the+late+Middle+Ages+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f3ee3a1266d48c5908bf8a3e18afca8c562cbf","infoHashBuffer":{"type":"Buffer","data":[50,243,238,58,18,102,212,140,89,8,191,138,62,24,175,202,140,86,44,191]},"announce":[],"urlList":[]}}