{"title":"Marcus Cicero - Political and Philosophical Works (30 books)","uid":15432829,"size":94017851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3369b11634ea9f4abe10b90087736a236546fc78&amp;dn=Marcus+Cicero+-+Political+and+Philosophical+Works+%2830+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"workerbee","files":62,"time":1469739661,"description":"MARCUS TULLIUS CICERO (106 BCE - 43 BCE) was a Roman philosopher, politician, lawyer, orator, political theorist, consul and constitutionalist.  He came from a wealthy municipal family of the Roman equestrian order, and is widely considered one of Rome's greatest orators and prose stylists.\n\n\nHis influence on the Latin language was so immense that the subsequent history of prose in not only Latin but European languages up to the 19th century was said to be either a reaction against or a return to his style.  According to Michael Grant, &quot;the influence of Cicero upon the history of European literature and ideas greatly exceeds that of any other prose writer in any language&quot;.  The peak of his authority and prestige came during the eighteenth-century Enlightenment, and his impact on leading Enlightenment thinkers such as John Locke, David Hume, and Montesquieu was substantial.  His works rank among the most influential in European culture, and today still constitute one of the most important bodies of primary material for the writing and revision of Roman history, especially the last days of the Roman Republic.\n\nIn addition to the works of Cicero, Anthony Everitt's biography is also included here. \n\nThe following books are in ePUB and/or PDF format as indicated:\n\n* Against Verres, 2.1.53-86: Latin text with Introduction, Study Questions, Commentary and English translation (OpenBook, 2011).  Edited by Ingo Gildenhard. -- PDF\n\n* An Attack on an Enemy of Freedom (Penguin, 2005).  Translated by Michael Grant. -- ePUB\n\n* Back From Exile: Six Speeches Upon His Return (American Philological Association, 1991).  Translated with Introductions and Notes by D. R. Shackleton Bailey. -- PDF\n\n* Cicero on the Emotions: Tusculan Disputations 3 and 4 (Chicago UP, 2002).  Translated with Commentary by Margaret Graver. -- PDF\n\n* Complete Works (Delphi Classics, 2014).  Various translators (in the public domain). -- ePUB\n\n* De Provinciis  Consularbus Oratio (Oxford UP, 2015).  Introduction and Commentary by Luca Grillo. -- PDF\n\n* How To Run A Country: An Ancient Guide for Modern Leaders (Princeton UP, 2013).  Selected, translated, and with an Introduction by Philip Freeman. -- PDF\n\n* How To Win An Election: An Ancient Guide for Modern Politicians (Princeton UP, 2012).  Selected, translated, and with an Introduction by Philip Freeman. -- PDF\n\n* In Defence of the Republic (Penguin Classics, 2011).  Translated with Introduction and Notes by Siobhan McElduff. -- ePUB\n\n* Murder Trials (Penguin Classics, 1990).  Translated with Introduction by Michael Grant. -- ePUB\n\n* Nature of the Gods, The (Penguin Classics, 1972).  Translated by Horace C. P. McGregor. -- ePUB\n\n* O Tempora! O Mores: Cicero's &quot;Catilinarian Orations&quot;: A Student Edition with Historical Essays (Oklahoma UP, 2005).  Edited by Susan O. Shapiro. -- PDF\n\n* On Academic Scepticism (Hackett, 2006).  Translated with Introduction and Notes by Charles Brittain. -- PDF\n\n* On Divination: De Divinatione, Book I (Clarendon, 2006).  Translated with Introduction and Historical Commentary by David Wardle. -- PDF\n\n* On Duties (Cambridge UP, 1991).  Edited by M. T. Griffin and E. M. Atkins. -- PDF\n\n* On Government (Penguin Classics, 1993).  Translated by Michael Grant. -- ePUB\n\n* On Moral Ends (Cambridge UP, 2004).  Edited by Julia Annas; translated by Raphael Woolf. -- PDF + ePUB\n\n* On the Commonwealth &amp; On the Laws (Cambridge UP, 1999).  Edited by James E. G. Zetzel. -- PDF\n\n* On the Good Life (Penguin Classics, 1971).  Translated with an Introduction by Michael Grant. -- ePUB\n\n* Political Speeches (Oxford World's Classics, 2006).  Translated with Introduction and Notes by D. H. Berry. -- PDF + ePUB\n\n* Pro L. Murena Oratio (Oxford UP, 2013).  Introduction and Commentary by Elaine Fantham. -- PDF\n\n* Pro M. Caelio Oratio (Clarendon, 1960).  Third edition, edited with Introduction and Commentary by R. G. Austin. -- PDF\n\n* Republic, The / The Laws (Oxford World's Classics, 1998).  Translated by Niall Rudd, with Introduction and Notes by Jonathan Powell and Niall Rudd. -- ePUB\n\n* Selected Letters (Penguin Classics, 1986).  Translated with an Introduction by D. R. Shackleton Bailey. -- ePUB\n\n* Selected Letters (Oxford World's Classics, 2008).  Translated with Introduction and Notes by P. G. Walsh. -- PDF\n\n* Selected Political Speeches (Penguin Classics, 1989).  Translated with an Introduction by Michael Grant. -- ePUB\n\n* Selected Works (Penguin Classics, 1971).  Translated with an Introduction by Michael Grant. -- ePUB\n\n* Speech On Behalf of Publius Sestius (Clarendon, 2006).  Translated with Introduction and Commentary by Robert A. Kaster. -- PDF\n\n* Topica (Oxford UP, 2003).  Edited with a Translation, Introduction, and Commentary by Tobias Reinhardt. -- PDF\n\n\nBonus book ==&gt; Anthony Everitt - CICERO: THE LIFE AND TIMES OF ROME'S GREATEST POLITICIAN (Random House, 2002). -- ePUB\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n                                 \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:3369b11634ea9f4abe10b90087736a236546fc78","amp;dn":"Marcus+Cicero+-+Political+and+Philosophical+Works+%2830+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3369b11634ea9f4abe10b90087736a236546fc78","infoHashBuffer":{"type":"Buffer","data":[51,105,177,22,52,234,159,74,190,16,185,0,135,115,106,35,101,70,252,120]},"announce":[],"urlList":[]}}