{"title":"BeamNG.drive v0.4.0.5","uid":12056439,"size":1851607112,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:336b122266d02947cecc81b1bddc857c9bc3c174&amp;dn=BeamNG.drive+v0.4.0.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":3,"uploader":"dauphong","files":1,"time":1435139602,"description":"About This Game\nBeamNG.drive is a realistic, immersive driving game offering near-limitless possibilities. Our soft-body physics engine simulates every component of a vehicle in real time, resulting in realistic, dynamic behavior.\nThe driving feel is authentic and visceral, and crashes are realistic and violent; yet the physics are accessible enough to drive with a keyboard or gamepad while still being authentic with a full racing wheel with uncompromising realism.\n\nEnvironments and vehicles in BeamNG.drive are hand-crafted with passionate attention to detail. With years of meticulous design, research, and experience, we authentically recreate the feeling and excitement of real world driving.\n\nWe are a small team from around the world with no obligations to publishers or outside interests. Our users and modding community are our first priority. Help us make BeamNG.drive the ultimate driving experience and discover what an open and uncompromising soft-body vehicle simulator can be.\nWhy is BeamNG.drive the game for you?\nAs an open world vehicle simulator, BeamNG.drive will cover a large array of vehicular disciplines - everything from a delivery mission in a box truck to a high speed rally race or a destruction derby. The vehicle customization and detail will allow you to make your car or truck all your own - fix it up, upgrade it, or strip away body panels to reduce weight. There are a lot of different types of gameplay we want to implement beyond just racing and crashing, such as police chases, stunt challenges, and other specialized minigames. Eventually we would like to have some kind of single player open world career mode, with persistent vehicle ownership and procedurally generated used vehicles to buy and events to run them in.\n\nIn some ways, BeamNG.drive is about doing anything you want with a car or truck - the stuff other games don't let you do. You can go off-roading in a family sedan or hurl a delivery truck around a racing circuit, all with beautiful soft-body simulation physics. You can mod those same vehicles to be racing beasts, derby monsters, or off-road behemoths - or just thrash them stock. At the end of the day, BeamNG.drive gives you the gameplay you want, and doesn't force you to do anything that you don't think is fun or interesting.\nThe future of the game and our physics engine\nAs we optimize our game and computer technology improves, the amount of vehicles which can be simultaneously simulated at a smooth framerate will increase. Right now you can run 4 to 6 cars at one time on a high end quad-core processor. Each vehicle has around 400 nodes and 4000 beams, all being simulated 2000 times per second. We hope to expand the number of simultaneous vehicles possible to at least 8 with a mid-range processor.\n\nWe will also look towards having multiplayer in the future, but it may be some time before we can create the multiplayer experience everyone is expecting. We are well aware of the demand for multiplayer and we want it just as much as you, but for the short term we are focusing on the single player career mode, various driving events, fixing bugs, and creating more content. It is feasible that we could implement local and/or same PC multiplayer in the interim.\n\nAlso, the possibilities extend beyond land vehicles. Users in our community have already made planes and helicopters that fly purely with the existing vehicle aerodynamic physics, with no cheating whatsoever. BeamNG can simulate aircraft in a very authentic way due to its soft-body physics. All the flex that happens to a real plane's airframe arises naturally in BeamNG, and the consequences of excessive stress are also modeled. Fly too fast and your wings will start to bend and rip off. The potential for the BeamNG physics engine is huge.\nAlpha Access Features\n\n    All future updates to BeamNG.drive included for free (alpha, beta), also including the final game\n    Soft-body physics sandbox\n    7 detailed, customizable, destructible vehicles, with more to come\n    7 terrains to explore and drive across, with more to come\n    Frequent updates adding terrains, vehicles, features, gameplay, and bug fixes\n    Full modding and content creation capabilities - make maps and vehicles, and script gameplay\n    Use the built-in terrain editor and any 3D modeling, image editing, and text editing software\n    Online authentication is only necessary to update; the game itself does not need an internet connection to run.\n    Exclusive access to a section of our forum where you can talk directly to the devs and report bugs, suggest features, etc.\n    The exclusive forum section also contains 3rd-party content, including vehicles and terrains.\n    In addition, you get a little BeamNG.drive logo under your avatar on the BeamNG forums","torrent":{"xt":"urn:btih:336b122266d02947cecc81b1bddc857c9bc3c174","amp;dn":"BeamNG.drive+v0.4.0.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"336b122266d02947cecc81b1bddc857c9bc3c174","infoHashBuffer":{"type":"Buffer","data":[51,107,18,34,102,208,41,71,206,204,129,177,189,220,133,124,155,195,193,116]},"announce":[],"urlList":[]}}