{"title":"Gardner's Art through the Ages - Volumes I &amp; II (14th Ed)(gn","uid":9538462,"size":276254489,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34469fa0a98aa91bd972730e213cfbed925c2687&amp;dn=Gardner%27s+Art+through+the+Ages+-+Volumes+I+%26amp%3B+II+%2814th+Ed%29%28gn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"gnv65","files":-1,"time":1390983926,"description":"Gardner's Art through the Ages - The Western Perspective, Volumes I &amp; II (14th Ed)\nby Fred S. Kleiner \nCengage Learning | January 2013 | ISBN-10: 1133954812/1133954804 | True PDF | 496/576 pages | 131/131 mb\n\nGARDNER'S ART THROUGH THE AGES: THE WESTERN PERSPECTIVE, Fourteenth Edition, provides you with a comprehensive, beautifully illustrated tour of the world's great artistic traditions! Easy to read and understand, the fourteenth edition of the most widely-read art history book in the English language continues to evolve, providing a rich cultural backdrop for each of the covered periods and geographical locations, and incorporating new artists and art forms--all reproduced according to the highest standards of clarity and color fidelity. A complete online environment, including all images and an eBook, is also available. The unique scale feature will help you better visualize the actual size of the artworks shown in the book. Within each chapter, the &quot;Framing the Era&quot; overviews, a new timeline, and the chapter-ending section entitled &quot;The Big Picture&quot;, make it easier to understand the cultural and historical forces that influenced each artwork.\n\nAbout the Author\nFred S. Kleiner (Ph.D., Columbia University) is the author or co-author of the 10th, 11th, 12th, 13th, and 14th editions of ART THROUGH THE AGES: A GLOBAL HISTORY, as well as the 1st, 2nd, and 3rd editions of ART THROUGH THE AGES: A CONCISE HISTORY, and more than a hundred publications on Greek and Roman art and architecture, including A HISTORY OF ROMAN ART, also published by Wadsworth. He has taught the art history survey course for more than three decades, first at the University of Virginia and, since 1978, at Boston University, where he is currently Professor of Art History and Archaeology and Chair of the Department of History of Art and Architecture. From 1985 to 1998, he was Editor-in-Chief of the American Journal of Archaeology. Long acclaimed for his inspiring lectures and dedication to students, Professor Kleiner won Boston University's Metcalf Award for Excellence in Teaching as well as the College Prize for Undergraduate Advising in the Humanities in 2002, and he is a two-time winner of the Distinguished Teaching Prize in the College of Arts and Sciences Honors Program. In 2007, he was elected Fellow of the Society of Antiquaries of London, and, in 2009, in recognition of lifetime achievement in publication and teaching, Fellow of the Text and Academic Authors Association. ","torrent":{"xt":"urn:btih:34469fa0a98aa91bd972730e213cfbed925c2687","amp;dn":"Gardner%27s+Art+through+the+Ages+-+Volumes+I+%26amp%3B+II+%2814th+Ed%29%28gn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34469fa0a98aa91bd972730e213cfbed925c2687","infoHashBuffer":{"type":"Buffer","data":[52,70,159,160,169,138,169,27,217,114,115,14,33,60,251,237,146,92,38,135]},"announce":[],"urlList":[]}}