{"title":"1001 Great Ideas for Teaching &amp; Raising Children with Autism","uid":10001633,"size":3384267,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:349ed7d039db49a7dabf5f3ce8c4d0732130f222&amp;dn=1001+Great+Ideas+for+Teaching+%26amp%3B+Raising+Children+with+Autism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1397986887,"description":" \n[i][color=orangered]This book belongs to [user=&quot;Chitrapathi&quot;] and is being uploaded on her request.[/color][/i]\n \n[img]http://s20.postimg.org/oi29tmgyl/1001_Great_Ideas.jpg[/img]\n \n[i][color=green]Winner of  a Silver medal in the Independent Publishers Book Awards and Learning Magazine's Teachers Choice Award, 1001 Great Ideas has been a treasured resource in the autism community since 2004. In this expanded second edition, Ellen Notbohm (best-selling author of the revolutionary book Ten Things Every Child with Autism Wishes You Knew) and Veronica Zysk (award-winning author and former editor of Autism Asperger's Digest magazine) present parents and educators with over 1800 ideas try-it-now tips, eye-opening advice, and grassroots strategies. More than 600 fresh ideas join tried and true tactics from the original edition, offering modifications for older kids, honing in on Asperger's challenges, and enhancing already-effective ways to help your child or student achieve success at home, in school, and in the community. This one-stop-shop of solutions, explanations, and strategies guides the reader to quickly find ideas that speak to the variety of developmental levels, learning styles, and abilities inherent in children with autism and Asperger's.[/color][/i]\n \n[i][color=red]Review[/color][/i]\n \n[i][color=green]&quot;Genuine, commonsense advice that all parents and educators can quickly and easily use!&quot; --TEMPLE GRANDIN, PH.D., autism expert and self-advocate, and author of Thinking in Pictures and The Way I See It: A Personal Look at Autism and Asperger's\n\n&quot;I was amazed at the number and quality of ideas, and strongly recommend that parents read and apply the advice. I learned some really good ideas!&quot; --TONY ATTWOOD, PH.D., author of The Complete Guide to Asperger's Syndrome\n\n&quot;1001 Great Ideas is just that, a treasure trove of wonderful ideas and activities! This hope-filled book not only connects the reader to the world of Autism Spectrum Disorders but also provides a multitude of practical solutions to the broad range of challenges that parents and professional face each and every day. 1001 Great Ideas is a resource that both parents and professionals will continually turn to.&quot; --Scott Tanner, School Psychologist &amp; Director of Clinical Services[/color][/i]\n \n[i][color=red]About the Authors[/color][/i]\n \n[i][color=green]Ellen Notbohm\n\nThree-time ForeWord Book of the Year finalist Ellen Notbohm is author of one of the autism community's most beloved books, Ten Things Every Child with Autism Wishes You Knew. She is also author of Ten Things Your Student with Autism Wishes You Knew and the Eric Hoffer Book Award finalist, The Autism Trail Guide: Postcards from the Road Less Traveled. Her articles, commentary and book excerpts have appeared in hundreds of magazines, newspapers, academic journals, training manuals and websites around the world. Ellen welcomes reader feedback and newsletter sign-ups through her website at ellennotbohm.com.\n\nVeronica Zysk\n\nVeronica Zysk has been working in the field of autism since 1991. She served as Executive Director of the Autism Society of America from 1991-1996, and then joined Future Horizons, moving into an editorial position within the company in 1999, as Managing Editor and visionary for the first national magazine on autism spectrum disorders, the Autism Asperger's Digest, winner of multiple Gold awards for excellence. She continues in that position today. In addition to her writing collaborations with Ellen Notbohm, she has co-authored and/or edited 14 other books on autism and Asperger s, working with noted authors such as Temple Grandin (Unwritten Rules of Social Relationships; The Way I See It), James Ball (Early Intervention and Autism: Real-life Questions, Real-life Answers), Jean Duane (Bake Deliciously Gluten &amp; Dairy Free), and Michelle Garcia Winner (Think Social!; Thinking About You Thinking About Me; Socially Curious and Curiously Social; A Politically Incorrect Look at Evidence-based Practices &amp; Teaching Social Skills). Veronica makes her home in the beautiful western mountains of North Carolina.[/color][/i]","torrent":{"xt":"urn:btih:349ed7d039db49a7dabf5f3ce8c4d0732130f222","amp;dn":"1001+Great+Ideas+for+Teaching+%26amp%3B+Raising+Children+with+Autism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"349ed7d039db49a7dabf5f3ce8c4d0732130f222","infoHashBuffer":{"type":"Buffer","data":[52,158,215,208,57,219,73,167,218,191,95,60,232,196,208,115,33,48,242,34]},"announce":[],"urlList":[]}}