{"title":"Farm Frenzy Series (All In One Pack)","uid":7732729,"size":945123738,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:34bd479c96303d113bdc83ea59840043d1ce4c12&amp;dn=Farm+Frenzy+Series+%28All+In+One+Pack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"Hshardik","files":40,"time":1350383854,"description":"Publisher....: Alawar Games\nDeveloper....: Alawar Games\nRelease Date.: 2010\nGenre........: Time Management\nLanguage.....: English\n\n\n\nThe goal in a Farm Frenzy game is to raise animals, process the goods they produce and sell the products for cash. To raise animals, the player must regularly water the grass they eat. A well with a limited capacity supplies the water and costs money to refill. Once the player buys an animal, the animal starts eating grass and dropping goods for the player to pick up.\nFor example, chickens lay eggs, sheep produce wool and cows produce milk. The goods the player picks up are stored in a warehouse with limited capacity. \n\nEach level in a Farm Frenzy game has a unique set of objectives. These might include owning so many of a particular animal, producing a certain number of goods or having a specific amount of cash on hand. The animal and money goals are checked off as soon as the player completes those objectives, and remain checked off even if the player sells the animals or spends the cash. The game also keeps track of the number of goods the player picks up. If the player uses or sells a good he's collected, the game doesn't reduce the tally. The player must complete the goals for a level within a specific time limit. Skilled players can earn Silver and Gold awards by completing levels within shorter time limits.\n\nWhen a player completes a level, he earns stars with which he can unlock upgrades. Once an upgrade is unlocked, the player can purchase it while playing a level.Other upgrades are connected to the items found on the farm. When upgraded, processing facilities are able to process more than one item at once, the truck and plane travel faster and can hold more cargo, and the warehouse increases in size. In order to access certain levels, the player must have already unlocked specific upgrades.\n\nSystem Requirements :\nOS: Windows XP, Vista or 7\nCPU: 1.2 GHz\nRAM: 512 MB\nDirectX: 9.0\nHard Drive: 83 MB\n\nJust Install and paste the crack in the installation directory...\nEnjoy...","torrent":{"xt":"urn:btih:34bd479c96303d113bdc83ea59840043d1ce4c12","amp;dn":"Farm+Frenzy+Series+%28All+In+One+Pack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34bd479c96303d113bdc83ea59840043d1ce4c12","infoHashBuffer":{"type":"Buffer","data":[52,189,71,156,150,48,61,17,59,220,131,234,89,132,0,67,209,206,76,18]},"announce":[],"urlList":[]}}