{"title":"Empire of Tea: The Asian Leaf That Conquered the World 2015","uid":15455692,"size":7853131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:352ca6fa0e3eddd1a4ecb7e3e2e936e9fac86428&amp;dn=Empire+of+Tea%3A+The+Asian+Leaf+That+Conquered+the+World+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Horisarte","files":1,"time":1469982845,"description":"http://www.reaktionbooks.co.uk/display.asp?ISB=9781780234403\r\n\r\n\r\nTea has a rich and well-documented past. The beverage originated in Asia long before making its way to seventeenth-century London, where it became an exotic, highly sought after commodity. Over the subsequent two centuries, tea’s powerful psychoactive properties seduced British society, becoming popular across the nation from castle to cottage. Now the world’s most popular drink, tea was one of the first truly global products to find a mass market, with tea drinking now stereotypically associated with British identity. \r\n\r\nImported by the East India Company in increasing quantities across the eighteenth century, tea inaugurated the first regular exchange between China and Britain, both commercial and cultural. While European scientists struggled to make sense of its natural history and medicinal properties, the delicate flavour profile and hot preparation of tea inspired poets, artists and satirists. Becoming central to everyday life, tea was embroiled in controversy, from the gossip of the domestic tea table to the civil disorder occasioned by smuggling, and the political scandal of the Boston Tea Party to the violent conflict of the Anglo–Chinese Opium War. Such stories shaped the contexts for the imperial tea industry that later developed across India and Sri Lanka. Empire of Tea is based on extensive original research, providing a rich cultural history that explores how the British ‘way of tea’ became the norm across the Anglophone world","torrent":{"xt":"urn:btih:352ca6fa0e3eddd1a4ecb7e3e2e936e9fac86428","amp;dn":"Empire+of+Tea%3A+The+Asian+Leaf+That+Conquered+the+World+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"352ca6fa0e3eddd1a4ecb7e3e2e936e9fac86428","infoHashBuffer":{"type":"Buffer","data":[53,44,166,250,14,62,221,209,164,236,183,227,226,233,54,233,250,200,100,40]},"announce":[],"urlList":[]}}