{"title":"Pokemon il Film - Mew contro Mewtwo [DivX iTA Mp3] [TNT Village]","uid":6373974,"size":718782464,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:35787c6205e51a16b7ec5d7f74519ff78983958c&amp;dn=Pokemon+il+Film+-+Mew+contro+Mewtwo+%5BDivX+iTA+Mp3%5D+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"TaxiDriverTNT","files":1,"time":1304786182,"description":"Pokemon: il Film - Mew vs Mewtwo [DivX iTA Mp3] [TNT Village]\n\n.: Info Generiche :.\n\nTitolo originale: Mewtwo Strikes Back \nAnno: 1999\nNazione: Giappone/Usa\nGenere: Avventura\nProduzione:  Choji Yoshikawa\nStoria: Takeshi Shudo\nRegia: Michael Haigney (USA), Kunohiko Yuyama (JAP)\nColonna sonora: John Siegler, John Loeffler, Ralph Schuckett\n\n.: Trama :.\n\nIl lungometraggio vero e proprio ha inizio in un laboratorio biologico, dove prende vita una strana creatura di nome Mewtwo, clonato dai frammenti di DNA di un pokÃƒÂ©mon antichissimo: Mew.\nMewtwo, dotato peraltro di enormi poteri psichici tali da renderlo la creatura piÃƒÂ¹ potente del pianeta, si pone molte domande sul perchÃƒÂ© della sua esistenza e, non trovando risposte ai suoi dubbi, e rifiutando di fare da cavia per gli scenziati che lo hanno creato, distrugge il laboratorio in cui ÃƒÂ¨ nato e per un po' di tempo accetta di lavorare per Giovanni, il capo del Team Rocket, che promette a Mewtwo di aiutarlo a controllare i suoi poteri per fargli dominare il mondo. Tuttavia, dopo un po' di tempo, essendosi reso conto della malvagitÃƒÂ  di Giovanni, Mewto si convince sempre di piÃƒÂ¹ della perfidia del genere umano, e si convince del fatto che tra uomini e pokemon non puÃƒÂ² esistere amicizia. CosÃƒÂ¬ abbandona Giovanni e inizia a mettere in atto il suo piano per la conquista del mondo.\nNel frattempo, Ash e i suoi amici Brock e Misty, nel loro &quot;viaggio di formazione&quot; nel mondo dei pokÃƒÂ©mon, ricevono un invito da parte di un misterioso allenatore, e assieme ai piÃƒÂ¹ bravi allenatori del mondo, ed insieme a Jessie, James e Meowth, i tre membri del Team Rocket intenzionati a rubare Pikachu ad Ash, si recano al castello di New Island, una piccola isola in mezzo all'oceano, sfidando un terribile temporale.\nGiunti all'isola scoprono l'identitÃƒÂ  del misterioso allenatore: egli non ÃƒÂ¨ altro che Mewtwo, il cui piano ÃƒÂ¨ creare dei potentissimi cloni, con i pokemon degli allenatori, attraverso una speciale macchina in suo possesso, e con questi dominare il mondo.\nIl suo piano sembra destinato a realizzarsi, ma improvvisamente entra in scena un pokÃƒÂ©mon che ormai tutti ritenevano essere scomparso: Mew!\n\n.: Dettagli Tecnici :.\n\nContainer: .AVI\nFilesize: 685Mb\nRuntime: 01:11:57\nVideo Codec: DivX5\nVideo Bitrate: 1.2Mbps\nFrame Size: 480x278\nFrame Rate: 25fps\nAudio Codec: Mp3\nAudio Bitrate: 96Kbps\nAudio Freq: 48KHz\nAudio Channels: Stereo \n\n","torrent":{"xt":"urn:btih:35787c6205e51a16b7ec5d7f74519ff78983958c","amp;dn":"Pokemon+il+Film+-+Mew+contro+Mewtwo+%5BDivX+iTA+Mp3%5D+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35787c6205e51a16b7ec5d7f74519ff78983958c","infoHashBuffer":{"type":"Buffer","data":[53,120,124,98,5,229,26,22,183,236,93,127,116,81,159,247,137,131,149,140]},"announce":[],"urlList":[]}}