{"title":"Army Men RTS Full Game, Cracked &amp; ready to play! - UNIDOGMA","uid":4662499,"size":192376148,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3593c56ad567e5ddc8baf106f5ac74dd6da921df&amp;dn=Army+Men+RTS+Full+Game%2C+Cracked+%26+ready+to+play%21+-+UNIDOGMA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"unidogma","files":-1,"time":1232445378,"description":"FULL GAME - Cracked and ready to go by &gt;&gt;StormeR&lt;&lt;\n\nThis is a classic title, still being played by old timers in Gamespy. I myself was very fond of it at one point and still pop in now and then for a little bash!.\n\nThis torrent includes the TEST maps created by me and some cool HQ skins!\n\n\nCoka Cola\nFanta\n7up\nPepsi\n\n\n\nMultiplayer addictive!\n\nTop game! ----PLZ SEED and PLEASE leave comments to provide security to other users!\n\n\nINSTALL INSTRUCTIONS&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\n\nExtract the Zip file first!, Do not run the RAR files from within the Zip file.\n\nAfter you have extracted the Zip file, you ar left with part1.rar and part2.rar.\n\nUsing Winrar or some other tool, Run the RAR file, this will extract the Army Men Rts.exe set up program.\n\nRun the .exe file to begin installation. The install directory is set to C:program files and can't be changed as this is needed for the extra's etc.\n***If anyone has problems and needs me to release a version for any directory just let me know and i will do it :(***\n\nCompiled by myself &amp; 100% Virus Free - Checked on 1st Jan 2009 by Symantec Corporate Antivirus 9.0.0.38 scan Engine: 81.3.0.30\n\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\n\n\nDescription.\n\n\nArmy Men RTS brings your fantasy fights between plastic army guys to life (well, kind of) in a solid real time strategy game.\n\nYour job is to lead Sarge and his band of bazooka men, grenadiers, machine gunners, flame throwers, and plastic military vehicles in a campaign to defeat the evil Tan army. Build bases, use trucks to siphon off plastic and electricity from objects to make men, and build an army fit to defeat the rebels.\n\n&quot;Army Men RTS has hit on something -- it's serious, it's primal, it's wacky and it's fun, all at once. You get all the fun of RTS fundamentals combined with the kitsch appeal of plastic soldiers.&quot; - IGN \nOne of the best things about Army Men RTS is its faithfulness to bring the nostalgia of army toys into something you can really play and command. Included are some great characters like Sarge, the commander and other hero fighters that join you on different missions. You can even build tanks, choppers, artillery, anti-aircraft, guard towers and alot more.\n\n&quot;Overall Army Men: RTS does a good job of creating a real-time strategy game based on the classic line of plastic toys.&quot; - Gamespot \nWhile playing Army Men RTS you will:\n\nHave a blast commanding all the familiar army men types and vehicles you used to play with (or blow up with firecrackers like I did). \nBe incredibly amused by the antics of the plastic toys and their serious battle determination. \nLearn the game quickly through the Bootcamp tutorials \nBe thoroughly entertained by the cutscenes between missions \nFind even more great challenge playing people online with the multiplayer setting \nSucceed in defeating the evil Tan army? Download it now and find out!\n\n\n\n       *******   *******   *******   *****        **     **    *******\n       *         *         *         *    *       * *   * *    *\n       *         *         *         *     *      *  * *  *    *    \n       *******   ****      ****      *     *      *  * *  *    ******\n             *   *         *         *     *      *   *   *    *  \n             *   *         *         *    *       *       *    *\n       *******   *******   *******   *****        *       *    *******\n\n\n\nI know it's hard to get at first, and people leach to often, so I will try my best to seed as much as possible, but please be patient, I will almost defenatly seed at night constantly from around 11pm to the morning UK Time! Please do the same!\n","torrent":{"xt":"urn:btih:3593c56ad567e5ddc8baf106f5ac74dd6da921df","amp;dn":"Army+Men+RTS+Full+Game%2C+Cracked+%26+ready+to+play%21+-+UNIDOGMA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3593c56ad567e5ddc8baf106f5ac74dd6da921df","infoHashBuffer":{"type":"Buffer","data":[53,147,197,106,213,103,229,221,200,186,241,6,245,172,116,221,109,169,33,223]},"announce":[],"urlList":[]}}