{"title":"Yo La Tengo - 5 Albums + 1 EP (1993 - 2006)","uid":4818564,"size":348224345,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:35c50cfc1ffcb136c8c719349bad6e2f828a4422&amp;dn=Yo+La+Tengo+-+5+Albums+%2B+1+EP+%281993+-+2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"guud23","files":74,"time":1238652300,"description":"\nArtist: Yo La Tengo\n5 Studio Albums from 1993 - 2006\n\n# Painful (Matador, 1993)\n# I Can Hear the Heart Beating as One (Matador, 1997)\n# And Then Nothing Turned Itself Inside Out (Matador, 2000); US #138\n# Summer Sun (Matador, 2003); US #115\n# I Am Not Afraid of You and I Will Beat Your Ass (Matador, 2006); US #66\n\nPlus:\nToday Is the Day - EP (Matador, 2003)\n\nIra Kaplan and Georgia Hubley, a husband/wife duo, formed the band in 1984. They went through several other band members before stabilizing with lead guitarist Dave Schramm and bass player Mike Lewis (founding bass player of Boston garage-punk mainstays DMZ and Lyres, and a member of Brooklyn garage band The A-Bones throughout his tenure in Yo La Tengo) for their debut recording, &quot;The River of Water&quot;. In 1986, their first LP Ride the Tiger was released.\n\nSchramm and Lewis left the band, and Stephan Wichnewski joined, with Kaplan taking on the role of lead guitar. New Wave Hot Dogs (1987) did much to establish the band's reputation among rock critics, though it sold poorly. President Yo La Tengo (1989) continued this trend, with rave reviews yet poor sales. Wichnewski left the band after this. Kaplan, though typically a pragmatist, starting carrying a bug trapped in amber in his pocket from this point on; for luck.\n\n1990 saw the release of Fakebook, an album of mostly acoustic tunes, including covers from Cat Stevens, Gene Clark, The Kinks, Daniel Johnston, among others, and several songs by Yo La Tengo themselves. May I Sing with Me (1992) included new bassist James McNew (of Christmas and Dump), who has stayed with the band ever since. Painful (1993), Electr-O-Pura (1995) and I Can Hear the Heart Beating as One (1997) marked a steady progression towards a sprawling, multi-faceted style, which included such disparate elements as folk, punk rock, shoegazing, long instrumental noise-jams and electronica oriented songs. Painful was also the beginning of the band's fruitful creative relationship with producer Roger Moutenot, who has produced every subsequent Yo La Tengo album release. During these years their cult grew and, thanks to almost constant touring and unrelenting critical praise, they became one of the most prominent American indie rock bands. They released And Then Nothing Turned Itself Inside Out in 2000 and Summer Sun in 2003.\n\nThe band is renowned for its encyclopedic repertoire of cover songs, and every year plays live on the New Jersey freeform radio station, WFMU, as part of the station's annual fundraising marathon, performing (with guitarist Bruce Bennett of Norton Records The A-Bones, and occasional additional guests like Hamish Kilgour of New Zealand's The Clean and Pacific Northwest folk-punk chanteuse Lois Maffeo) impromptu cover-song requests from listeners who call in to pledge money to the station. In 2006 the band released an album compiling performances from the marathons between 1996 and 2003 titled Yo La Tengo Is Murdering the Classics. Yo La Tengo also did a version of the Simpsons' end credits theme for the episode &quot;D'oh-in in the Wind&quot;.\n\nIn 1996, Yo La Tengo appeared briefly (along with their friend Tara Key of the band Antietam) as the Velvet Underground in the film I Shot Andy Warhol. In 2001, they recorded an instrumental soundtrack for eight short undersea documentaries of Jean PainlevÃƒÂ©, entitled The Sounds of the Sounds of Science. Yo La Tengo also provided the soundtracks for the films Junebug, Game 6, Shortbus, as well as Kelly Reichardt's award-winning 2006 feature film Old Joy. Three songs from May I Sing With Me (&quot;Always Something&quot;, &quot;Sleeping Pill&quot; and &quot;Some Kinda Fatigue&quot;) were featured on the soundtrack to American indie filmmaker Hal Hartley's 1992 movie Simple Men. Their song &quot;Tears Are In Your Eyes&quot; was also in the &quot;Family&quot; episode of Buffy the Vampire Slayer. The track 'Autumn Sweater' off I Can Hear the Heart Beating as One was in an episode of the third season of 24.\n\nThe group collaborated with Yoko Ono as well on the 2003 album Wig in a Box, Songs From and Inspired by Hedwig and the Angry Inch, made as a charity album to support the Harvey Milk High School.\n\nMarch 2005 saw the group release a 2-disc greatest hits package, entitled Prisoners of Love. A bonus edition included a 3rd disc of rarities and unreleased tracks.\n\nThe album I Am Not Afraid of You and I Will Beat Your Ass followed in September 2006.\n\nIn 2007, Yo La Tengo's covers of the Bob Dylan songs &quot;I Wanna Be Your Lover&quot; and &quot;Fourth Time Around&quot; were released on the soundtrack album for I'm Not There.\n\nIn March 2008, Yo La Tengo performed under the name &quot;Condo Fucks&quot; at Brooklyn's Magnetic Field.[3] As Condo Fucks, they are releasing an album Fuckbook with Matador in 2009.[4]\n\n&lt;From Wikipedia.org&gt;","torrent":{"xt":"urn:btih:35c50cfc1ffcb136c8c719349bad6e2f828a4422","amp;dn":"Yo+La+Tengo+-+5+Albums+%2B+1+EP+%281993+-+2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35c50cfc1ffcb136c8c719349bad6e2f828a4422","infoHashBuffer":{"type":"Buffer","data":[53,197,12,252,31,252,177,54,200,199,25,52,155,173,110,47,130,138,68,34]},"announce":[],"urlList":[]}}