{"title":"Introduction to Nuclear and Particle Physics","uid":4725149,"size":18934567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:361c40f580c6af71999101bc618b7af42f152543&amp;dn=Introduction+to+Nuclear+and+Particle+Physics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1234714738,"description":"&quot;The original edition of Introduction to Nuclear and Particle Physics was used with great success for single-semester courses on nuclear and particle physics offered by American and Canadian universities at the undergraduate level. It was also translated into German, and used overseas. Being less formal but well-written, this book is a good vehicle for learning the more intuitive rather than formal aspects of the subject. It is therefore of value to scientists with a minimal background in quantum mechanics, but is sufficiently substantive to have been recommended for graduate students interested in the fields covered in the text.\n\nIn the second edition, the material begins with an exceptionally clear development of Rutherford scattering and, in the four following chapters, discusses sundry phenomenological issues concerning nuclear properties and structure, and general applications of radioactivity and of the nuclear force. This is followed by two chapters dealing with interactions of particles in matter, and how these characteristics are used to detect and identify such particles. A chapter on accelerators rounds out the experimental aspects of the field. The final seven chapters deal with elementary- particle phenomena, both before and after the realization of the Standard Model. This is interspersed with discussion of symmetries in classical physics and in the quantum domain, bringing into full focus the issues concerning CP violation, isotopic spin, and other symmetries. The final three chapters are devoted to the Standard Model and to possibly new physics beyond it, emphasizing unification of forces, supersymmetry, and other exciting areas of current research.\n\nThe book contains several appendices on related subjects, such as special relativity, the nature of symmetry groups, etc. There are also many examples and problems in the text that are of value in gauging the reader's understanding of the material.&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!\n","torrent":{"xt":"urn:btih:361c40f580c6af71999101bc618b7af42f152543","amp;dn":"Introduction+to+Nuclear+and+Particle+Physics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"361c40f580c6af71999101bc618b7af42f152543","infoHashBuffer":{"type":"Buffer","data":[54,28,64,245,128,198,175,113,153,145,1,188,97,139,122,244,47,21,37,67]},"announce":[],"urlList":[]}}