{"title":"Sharpe Series - Bernard Cornwell","uid":9084964,"size":7683952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:363806317db6b65956535f9cb78d68ce2597cf83&amp;dn=Sharpe+Series+-+Bernard+Cornwell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Mohammad_AT","files":23,"time":1382475942,"description":"Sharpe is a series of historical fiction stories by Bernard Cornwell centred on the character of Richard Sharpe. The stories formed the basis for an ITV television series wherein the eponymous character was played by Sean Bean.\n\nCornwell's series (composed of several novels and short stories) charts Sharpe's progress in the British Army during the Napoleonic Wars. He begins in Sharpe's Tiger as a Private in the 33rd Regiment of foot, who becomes a Sergeant by the end of the book, and an Ensign in the 74th Regiment who is transferred to the newly formed 95th Rifles as a Second-Lieutenant during Sharpe's Trafalgar. He is gradually promoted through the ranks, finally becoming a Lieutenant Colonel in Sharpe's Waterloo.\n\nThe stories dramatise Sharpe's struggle for acceptance and respect from his fellow officers and from the men he commands. Sharpe was born a guttersnipe in the rookeries of London. Commissioned an officer on the battlefield, he overcomes class in an army where an officer's rank is often bought. Unlike many of the officers with whom he serves, Sharpe is an experienced soldier.\n\nSharpe is described as &quot;brilliant but wayward&quot; in Sharpe's Sword, and is portrayed by the author as a 'loose cannon'. A highly skilled leader of light troops, he takes part in a range of historical events during the Napoleonic Wars and other conflicts, including the Battle of Waterloo. The earliest chronological books (they were published in non-chronological order) are set in India, and chronicle Sharpe's years in the ranks and as an ensign. He is known as a dangerous man to have as an enemy; he is a skilled marksman and grows to be a good swordsman. In most of the novels he is a Rifle Officer, armed with a 1796 pattern heavy cavalry sword and Baker rifle, although by Sharpe's Waterloo he has also acquired a pistol. He is described as being six feet tall, having an angular, tanned face, long black hair and blue eyes. His most obvious physical characteristic is a deep scar on his right cheek, which pulls his right eye in such a way as to give his face a mocking expression when relaxed, but which disappears when he smiles, which is not too frequently.","torrent":{"xt":"urn:btih:363806317db6b65956535f9cb78d68ce2597cf83","amp;dn":"Sharpe+Series+-+Bernard+Cornwell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363806317db6b65956535f9cb78d68ce2597cf83","infoHashBuffer":{"type":"Buffer","data":[54,56,6,49,125,182,182,89,86,83,95,156,183,141,104,206,37,151,207,131]},"announce":[],"urlList":[]}}