{"title":"Electric Light Orchestra Greatest Hits [FLAC+MP3]","uid":9508129,"size":389839778,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:370be75f5537858f2c75c8c5c9b8dbdabb1da40f&amp;dn=Electric+Light+Orchestra+Greatest+Hits+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":8,"uploader":"Big-Papi","files":-1,"time":1390353474,"description":"Source: CD\n\nRock-Roll doesn't get much better than this.  Hello, how are you??  Have you been alright??- Big Papi\n\n\nBy Lonnie E. Holder VINE VOICE \nI liked Electric Light Orchestra from the very first song I heard on the radio. Putting their music into perspective, I now consider ELO to be Progressive Rock - Light, or heavy pop. Their heavily orchestrated and symphonic works, loaded with electronics and high-pitched vocals, have the trappings of progressive rock, yet were firmly rooted in pop music.\nThis CD chronicles many of the better known Electric Light Orchestra songs from the 70s, all of which received various amounts of air play. My favorites tend to be the longer compositions, reflecting my enjoyment of progressive rock. &quot;Mr. Blue Sky&quot; starts out like a Beatles song, but progresses quickly into traditional ELO. My all-time favorite ELO song.\n\n&quot;Can't Get It Out of My Head&quot; starts out with wonderfully evocative lyrics:\n\nMidnight on the water.\nI saw the ocean's daughter.\nWalking on a wave's chicane,\nstaring as she called my name.\n\nI've never quite understood what this song is about. It mixes surreal images with a section about bank robbery and heroic historic figures that is somewhat confusing to me. I've wondered whether it is just a song about meditating on life and the choices we make, or something else.\n\n&quot;Livin' Thing&quot; starts with an almost Gypsy feeling, then jumps into a pop beat, but then flips back into the Gypsy violin sound. The lyrics again rely on strange imagery versus clearly trying to convey a point.\n\nEnjoying &quot;Strange Magic&quot; is a guilty pleasure. The music is beautiful, and the lyrics are poetic, but the choruses are repetitive and lengthy. The song is easy on the ears, and easy to sing, but there should have been more meat to the lyrics. But the song is still catchy and I enjoy it.\n\nBecause of the juxtaposition of lyrics that rely on emotional imagery and flashes of insight barely tasted and music that ranges from near-classical to hard rock, I find it easy to consider that ELO is progressive rock. With the strong pop beat that infuses much of their music, that progressive rock is in a different category from Yes, The Moody Blues, King Crimson and others, but so too are those groups very different from each other. The best way of describing ELO is that they are what might have resulted if The Beatles combined with members of Yes and The Moody Blues. The result can sometimes be a little strange, but for those who enjoy it, this is wonderful music.","torrent":{"xt":"urn:btih:370be75f5537858f2c75c8c5c9b8dbdabb1da40f","amp;dn":"Electric+Light+Orchestra+Greatest+Hits+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370be75f5537858f2c75c8c5c9b8dbdabb1da40f","infoHashBuffer":{"type":"Buffer","data":[55,11,231,95,85,55,133,143,44,117,200,197,201,184,219,218,187,29,164,15]},"announce":[],"urlList":[]}}