{"title":"Charlie Daniels Band - The Devil Went Down to Georgia 320cbr Sin","uid":9443913,"size":8659219,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:374e63da8eef8a491b92302c2fb4b53e5a333f9b&amp;dn=Charlie+Daniels+Band+-+The+Devil+Went+Down+to+Georgia+320cbr+Sin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389057612,"description":"Charlie Daniels Band - The Devil Went Down to Georgia 320cbr (Big Papi Single)\n\n\n\n&quot;The Devil Went Down To Georgia&quot;\n\nThe Devil went down to Georgia. He was lookin' for a soul to steal.\nHe was in a bind 'cause he was way behind. He was willing to make a deal\nWhen he came across this young man sawin' on a fiddle and playin' it hot.\nAnd the Devil jumped upon a hickory stump and said &quot;Boy, let me tell you what.&quot;\n\n&quot;I bet you didn't know it, but I'm a fiddle player, too.\nAnd if you'd care to take a dare I'll make a bet with you. \nNow you play a pretty good fiddle, boy, but give the Devil his due.\nI'll bet a fiddle of gold against your soul 'cause I think I'm better than you.&quot;\n\nThe boy said, &quot;My name's Johnny, and it might be a sin,\nBut I'll take your bet; and you're gonna regret 'cause I'm the best there's ever been.&quot;\n\nJohnny, rosin up your bow and play your fiddle hard.\n'Cause Hell's broke loose in Georgia and the Devil deals the cards.\nAnd if you win you get this shiny fiddle made of gold,\nBut if you lose the devil gets your soul.\n\nThe Devil opened up his case and he said, &quot;I'll start this show.&quot;\nAnd fire flew from his fingertips as he rosined up his bow. \nAnd he pulled the bow across the strings and it made an evil hiss. \nAnd a band of demons joined in and it sounded something like this. \n\nWhen the Devil finished, Johnny said, &quot;Well, you're pretty good ol' son,\nBut sit down in that chair right there and let me show you how it's done.&quot;\n\n&quot;Fire on the Mountain.&quot; Run, boys, run! \nThe Devil's in the house of the rising sun; \nChicken's in the bread pan picking out dough.\nGranny, does your dog bite? No, child, no.\n\nThe Devil bowed his head because he knew that he'd been beat.\nAnd he laid that golden fiddle on the ground at Johnny's feet.\nJohnny said, &quot;Devil, just come on back if you ever wanna try again, \n'Cause I've told you once--you son of a bitch--I'm the best there's ever been.&quot;\nAnd he played: \n\n&quot;Fire on the Mountain.&quot; Run, boys, run! \nThe Devil's in the house of the rising sun; \nChicken's in the bread pan picking out dough.\nGranny, does your dog bite? No, child, no.","torrent":{"xt":"urn:btih:374e63da8eef8a491b92302c2fb4b53e5a333f9b","amp;dn":"Charlie+Daniels+Band+-+The+Devil+Went+Down+to+Georgia+320cbr+Sin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"374e63da8eef8a491b92302c2fb4b53e5a333f9b","infoHashBuffer":{"type":"Buffer","data":[55,78,99,218,142,239,138,73,27,146,48,44,47,180,181,62,90,51,63,155]},"announce":[],"urlList":[]}}