{"title":"Tentacle Hentai Pack","uid":8781607,"size":4727022321,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:37acbb6e0ec23ac478c23814dec1877fa59e9615&amp;dn=Tentacle+Hentai+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"horrorhound","files":18,"time":1375725938,"description":"FF-force\n\n\nYear:2001\nEpisodes:3\nCategories:18 Restricted, Action, Demons, Erotic Game, Super Power\nDirector:Aoi Yousaku \nProduction:Discovery \nVideo:\tOGM XviD 640x480 23.976 fps 965 Kbps\nAudio:\tJapanese/English ogg 48 KHz 72 Kbps\nSubtitles:\tEnglish softsubs (SRT)\n\n\nPlot:\nThe gorgeous, supernaturally powered Alicia has been kidnapped by demons, enslaved for their unspeakably perverted pleasures. Her only hope for survival is a team of 6 busty fighters known as the F-Force! Will they be able to rescue Alicia or will they be kidnapped themselves and forced into some extreme pleasure. \n\n\n\nsex craft\n\nYear:\t2003 - 2004\nEpisodes:\t2 x ~28 mins\nCategories:\t18 Restricted, Manga, Nudity, Sex\nProduction:\tMilky Animation Label\nVideo:\t640x480 (4:3) VFR AVC ~1100 Kbps\nAudio:\tVorbis ~ 100 Kbps 2.0 #1 Japanese #2 English\nSubtitles:\tEnglish Softsubs ASS\n\n\nPlot:\n&quot;When Kumi and her friends Reina and Mari play around with a witchboard, they accidently summon a malevolent ghost. The ghost possesses the girls, using them to steal people's sexual energy. Soon, Kumi is no longer acting on her own free will and is unconsciously seeking sex with men. Frightened, Kumi seeks the council of an exorcist, Tsunoda Mia. Meanwhile, a rapist with other-worldly powers is on the loose. When exorcist Mia investigates, she finds a man with an insatiable sexual appetite looking to fulfill his lust in death that he couldn't in life. \n\n\n\n\nidol of darkness\n\nYear:\t1997\nEpisodes:\t1 x ~45 mins\nCategories:\t18 Restricted, Romance, Demons, Rape\nProduction:\tPink Pineapple\nVideo:\t640x340 20.000 fps XviD ~1000 Kbps\nAudio:\tJapanese Vorbis ~96Kbps 2ch\nSubtitles:\tEnglish Subrip\n\n\nPlot:\n&quot;Ikumi is an up and coming pop singer with millions of fans and a promising acting career. She should be looking at the world through rose-colored glasses, but she's got man trouble. The love of her life just isn't sure he can handle Ikumi's fame and fortune. To make matters worse, while shooting on location, a jealous co-star finds a strange wooden idol in an abandoned temple, and uses it to invoke a hedeous demon to be the instrument of her revenge. Will Ikumi's next concert be her last curtain call? She's about to dicover that there really are fates worse than death. \n\n\n\n\n\nOni Tensei (Uncensored)\n\nAlternate Titles: Possession\nCategories: 18 Restricted, Demons, Fantasy, Rape, Sex, Violence, Yuri\nYear: 2000\nVolumes: 4\nVideo: DivX 3 640x480 23.98fps\nAudio: Japanese - MPEG Audio Layer 3 48000Hz stereo\nSubtitles: English Hard Sub\n\n\n\nPlot:\nReiko Kure is a female detective with a strange massacre on her hands. Some kind of huge animal savagely murdered thirteen members of the mafia, and only the quiet Ema Nozomi is left at the scene.\nEma is taken into protective custody, but every man left with her is killed and every woman is brutally raped. Reiko must solve the mystery before she is the next one to be attacked, but there are no clues.\nThere is only the innocent Ema`s strange tattoo, perfectly depicting a demon...\n\n\n\n\n\nNecromancer \n\n\n\nYear:\t04/28/2006\nEpisodes:\t1\nCategories:\tAnal, Demons, Magic, Virgins\nProduction:\tAnimac\nVideo:\t640x480, VFR, H264/AVC, 1219 kBit/s\nAudio:\tJapanese - 2.0 Stereo, Vorbis, 89 kBit/s\nSubtitles:\tEnglish Soft Styled Subs (ASS)\n\n\n\nPlot\nA brother and his sister are madly in love with each other. However, their love would not last forever. Suffering from an illness that can not be cured, the brother does everything he can to help his sister. Things were going well until one day he meets a girl. With her introduction, things quickly changed for him and suddenly his sister's illness takes a turn for the worse and eventually leads to her death. However, his love for her is far too great to forget his memories of her. Feeling that God has betrayed him, he goes against his teachings and turns to a greater power...the demon! The demon agrees to help him out in exchange for a virgin girl's blood...his new friend.\n\n\n\n\nLesson of Darkness \n\n\n\nYear:\t29.11.1996\nEpisodes:\t1 episode (45 min)\nCategories:\t18 Restricted, Demons, Horror, Nudity, Rape, Sex, Tentacles,\nDirector:\tTsutomu Ono\nProduction:\tPinkPineapple\nVideo:\tXviD 640x360 29.97 fps 929 Kbit/s\nAudio:\tJapanese MP3 Stereo 106 Kbit/s\nSubtitles:\tEnglish hard subs\n\n\nPlot\nSeventy years ago, several mysterious murders occurred in Tokyo, Japan. Young, beautiful women were found dead, their bodies dried up like ancient mummies. Now young women are dying the same way and Miho, a 19 year-old college student discovers that a weird stranger is stalking her. While her best friend Azusa, is busy seducing their professor, she discovers he is not human at all, but a horrible tentacle-endowed monster. Now that his dark secret is revealed, both girls are on the run for their life, but can she escape from the hideous monster disguised as a mild-mannered professor.\n\n\nFeast of Victims \n\n\nRelease Dates:\t21 Jan 2000 till 28 April 2000\nEpisodes:\t2 with runtimes of ~27 to ~28 min each\nCategories:\tDemons, Rape, Tentacles, Uncensored\nDirector:\tMisumi Ran\nProduction:\tPink Pineapple\nVideo:\t512x384 23.976 fps DivX3 at ~925 Kbps in .avi container\nAudio:\tJapanese language MP3 2 channel 48KHz ~120Kbps\nSubtitles:\tEnglish language Hard Subs\n\n\nPlot:\nConsists of short stories.\n\n\n\n\n\nTokyo Requiem\n\n\nYear:25.04.2005 till 25.03.2006\nEpisodes: 2\nCategories: 18 Restricted, Anal, Large Breasts, Nudity, Rape, Sex, Tentacles\nDirector: Kenzo Hideshime\nProduction:Milky, Tokyo Requiem Production\nVideo: 640x480, H264/AVC\nAudio: Japanese, 2.0 Stereo, Vorbis (Ogg Vorbis) \nSubtitle: English (styled subs ASS/SSA)\n\n\nPlot\nBased on the manga by Nakamura Nishiki \n\nAn underground society lies beneath the surface of Tokyo. This society has kept silent for many years, but now, they are on the move. They are kidnapping the four micos, Hinomico, Mizunomico, Kazenomico and Tsuchinomico, and use their powers to awaken the long forgotten &quot;God&quot;. To stop them from awakening this god, a group of government special agents is dispatched to get hold of each mico and protect them before they reach them. Why is the secret society trying to awaken God? Who are these four micos? Who are these special agents? The long forgotten legend is awakening from the depths or darkness.\n\n\nAdvancer Tina\n\n\n\n~ OVA INFORMATION ~\nJap. Title:\t??????Â·???\nRelease Date:\t21.08.1996\nRuntime:\t46 min\nCategories:\tAliens, Rape, Sci-Fi, Tentacles\nDirector:\tKan Fukumoto\nProduction:\tDandelion\nVideo:\t640x480 (4:3), DivX 5 ~1370 kBit/s, 29.97 fps\nAudio:\tJapanese, 2.0 Stereo, AC-3 192 kBit/s, 48 kHz\nEnglish, 2.0 Stereo, AC-3 192 kBit/s, 48 kHz\nSubtitles:\tEnglish, Unstyled SRT\n1: Orchid Emblem 2: Advancer Tina 3: Battle Team Lakers EX\n\n\nPlot\nAs Mankind expands out into the galaxy, new colonies are created under the control of the Earth government. For the outer planets, however, space is governed by no law. Tina Owen has been sentenced to 2000 years in jail, with only one chance to redeem herself, by investigating the mysterious planet Omega 13. ","torrent":{"xt":"urn:btih:37acbb6e0ec23ac478c23814dec1877fa59e9615","amp;dn":"Tentacle+Hentai+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37acbb6e0ec23ac478c23814dec1877fa59e9615","infoHashBuffer":{"type":"Buffer","data":[55,172,187,110,14,194,58,196,120,194,56,20,222,193,135,127,165,158,150,21]},"announce":[],"urlList":[]}}