{"title":"Inside the Publishing Revolution: The Adobe Story","uid":15841860,"size":19391666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37b4112e3b349afdc2f3c1c2fd992f3806783ce1&amp;dn=Inside+the+Publishing+Revolution%3A+The+Adobe+Story&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"vbobarth","files":1,"time":1474053531,"description":"Inside the Publishing Revolution: The Adobe Story 1st Edition by Pamela Pfiffner \r\n\r\nPublisher: Adobe Press; 1 edition (September 26, 2002)\r\nLanguage: English\r\nISBN-10: 0321115643\r\nISBN-13: 978-0321115645\r\n\r\nTech journalist Pamela Pfiffner explores the rich history behind the modern publishing revolution, as seen through the lens of one of its most important players. In the past 20 years, Adobe Systems has become synonymous with great design tools, and the company's impact on how we work in publishing, graphic arts, and on the Web is unmatched. Join Pfiffner on a colorful journey from the roots of the desktop publishing revolution through the rise of the Web and interactive design. Along the way, you'll witness the birth and evolution of PostScript, the explosion of the Photoshop market, the realization of the paperless office, and other events that have shaped the way we communicate.\r\n\r\nInside the Publishing Revolution is not one of those dull historical tomes you know and loathe from high school. Pfiffner packs its pages with lively, insightful interviews with world-class designers and illustrators, as well as personal insights and recollections from John Warnock, Chuck Geschke, Jonathan Seybold, and other publishing luminaries. Richly illustrated and beautifully designed, the book features galleries of historically significant work by leading artists and rare photographs from the Adobe archives. For added perspective, Pfiffner walks you through an illustrated timeline of the publishing revolution. As with history, the final chapter of the Adobe story remains to be written, so the book ends with an eye toward the future: an exclusive overview of the company's vision of publishing in the next decade","torrent":{"xt":"urn:btih:37b4112e3b349afdc2f3c1c2fd992f3806783ce1","amp;dn":"Inside+the+Publishing+Revolution%3A+The+Adobe+Story","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37b4112e3b349afdc2f3c1c2fd992f3806783ce1","infoHashBuffer":{"type":"Buffer","data":[55,180,17,46,59,52,154,253,194,243,193,194,253,153,47,56,6,120,60,225]},"announce":[],"urlList":[]}}