{"title":"Understanding Qi Gong - Part 1","uid":5490966,"size":733912523,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:37cb98795a1a0bd61bb3b7468336491992fae3d5&amp;dn=Understanding+Qi+Gong+-+Part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"Porkka666","files":3,"time":1270996164,"description":"-- info --\nUnderstanding Qigong 1 - DVD\nWhat is Qigong?\nThe Human Qi Circulatory System\nby Dr. Yang, Jwing-Ming\n\nReview\nDr. Yang merits the highest praise for his efforts to meld Eastern and Western medical understanding. --Dr. T Guttheil, Harvard, U\n\nProduct Description\nThis program is part one in a six-DVD series designed to lead a complete beginner to a thorough understanding of the theory and practice of qigong. Search &quot;Understanding Qigong&quot; on Amazon for more.\n\nThe Chinese word Qigong (chee - kung) means 'energy cultivation'. Qigong is the ancient art of using the mind to naturally develop the body's Qi (energy) for improved health and longevity. Some Qigong is practiced sitting or standing still, while other Qigong can be a kind of moving meditation.\n\nAs millions of people worldwide are turning to Chinese medicine and healing practices such as Qigong and Tai Chi, it is important to understand what Qigong is and how it works. In these two video courses, renowned Qigong expert and author Dr. Yang, Jwing-Ming explains the concepts of Qigong and the human energetic circulatory system. Dr. Yang's systematic approach to teaching offers deep insight into the subject of Qigong with modern scientific data to support his theory from both an Eastern and Western perspective.\n\nDrawing on his 35 years of training in Qigong and his Western scientific background in Physics and Mechanical Engineering, Dr. Yang presents a clear and fascinating explanation of his Qigong theory, and offers a simple Qigong exercise for students to begin experiencing their Qi. This program is a must for Qigong practitioners, acupuncturists, energy healers, and anyone interested in understanding exactly of how and why Qigong works.\n\nIf you ve never attended a Qigong seminar with Dr. Yang, here s a home version you won t want to miss!\n\n&quot;One of America's most sought-after instructors of Qigong&quot; - The Omega Institute\n-- info --\n\n\n\nThis is a great primer on how the human body works. Recommended for anybody who wants to know how the human body functions, what is Chi and how we can use it. This first part of six. Originally ripped by somebody else, I'm just reseeding. Dr Yang can really explains these things in a scientific way, so a westerner can understand thousands of years old Chinese foundings too :)\n\n- 13360","torrent":{"xt":"urn:btih:37cb98795a1a0bd61bb3b7468336491992fae3d5","amp;dn":"Understanding+Qi+Gong+-+Part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37cb98795a1a0bd61bb3b7468336491992fae3d5","infoHashBuffer":{"type":"Buffer","data":[55,203,152,121,90,26,11,214,27,179,183,70,131,54,73,25,146,250,227,213]},"announce":[],"urlList":[]}}