{"title":"Figure Drawing for Artists - Making Every Mark Count","uid":15631928,"size":101071501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:382ca6401102a541dcff8664f490447c6a657d01&amp;dn=Figure+Drawing+for+Artists+-+Making+Every+Mark+Count&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Replicant70","files":2,"time":1471965967,"description":"http://ititli.com/images/fwbF6eM7.jpg\r\n\r\nHow often does an aspiring artist read a book or take a class on drawing the human body, only to end up with page after page of stiff lifeless marks rather than the well-conceived figure the course promised?\r\n\r\nThough there are many books on drawing the human figure, none teach how to draw a figure from the first few marks of the quick sketch to the last virtuosic stroke of the finished masterpiece, let alone through a convincing, easy-to-understand method.\r\n\r\nThat changes now.\r\n\r\nIn Figure Drawing for Artists: Making Every Mark Count, award-winning fine artist Steve Huston shows beginners and pros alike the two foundational concepts behind the greatest masterpieces in art and how to use them as the basis for their own success.\r\n\r\nEmbark on a drawing journey and discover how these twin pillars of support are behind everything from the Venus De Milo to Michelangelo’s Sibyl to George Bellow’s Stag at Sharkey’s, how they’re the fundamental tools for animation studios around the world, and how the best comic book artists from the beginnings of the art form until now use them whether they know it or not.\r\n\r\nFigure Drawing for Artists: Making Every Mark Count sketches out the same two-step method taught to the artists of DreamWorks, Warner Brothers, and Disney Animation, so pick up a pencil and get drawing.\r\n\r\nFigure Drawing for Artists: Making Every Mark Count by Steve Huston\r\n2016 | ISBN: 1631590650 | English | 192 pages | PDF/EPUB | 65 MB/31 MB","torrent":{"xt":"urn:btih:382ca6401102a541dcff8664f490447c6a657d01","amp;dn":"Figure+Drawing+for+Artists+-+Making+Every+Mark+Count","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"382ca6401102a541dcff8664f490447c6a657d01","infoHashBuffer":{"type":"Buffer","data":[56,44,166,64,17,2,165,65,220,255,134,100,244,144,68,124,106,101,125,1]},"announce":[],"urlList":[]}}