{"title":"Pretenders - Original Album Series [5 CD's][2009][320 KBPS]","uid":10586189,"size":655469145,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:382e66ba02e69caa7636cb273f3f2dd46312f8ec&amp;dn=Pretenders+-+Original+Album+Series+%5B5+CD%27s%5D%5B2009%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"LameDuck69","files":75,"time":1405744926,"description":"Pretenders - Original Album Series [5 Albums][2009]\n\n\n\n\n\nDisc 1 [Pretenders][1980]\n\n\n01. Precious   \n02. The Phone Call   \n03. Up The Neck   \n04. Tattooed Love Boys   \n05. Space Invader    \n06. The Wait   \n07. Stop Your Sobbing   \n08. Kid    \n09. Private Life    \n10. Brass In Pocket    \n11. Lovers Of Today    \n12. Mystery Achievement\n\n \n\n\n\nDisc 2 [Pretenders II][1981]\n\n\n01. The Adultress   \n02. Bad Boys Get Spanked    \n03. Message Of Love   \n04. I Go To Sleep   \n05. Birds Of Paradise    \n06. Talk Of The Town   \n07. Pack It Up   \n08. Waste Not Want Not   \n09. Day After Day   \n10. Jealous Dogs    \n11. The English Roses   \n12. Louie, Louie \n\n\n\n\nDisc 3 [Learning To Crawl][1984]\n\n\n01. Middle Of The Road    \n02. Back On The Chain Gang    \n03. Time The Avenger   \n04. Watching The Clothes   \n05. Show Me    \n06. Thumbelina   \n07. My City Was Gone   \n08. Thin Line Between Love And Hate   \n09. I Hurt You   \n10. 2000 Miles \n\n\n\n\nDisc 4 [Get Close][1986]\n\n\n01. My Baby   \n02. When I Change My Life   \n03. Light Of The Moon  \n04. Dance  \n05. Tradition Of Love   \n06. Don't Get Me Wrong   \n07. I Remember You   \n08. How Much Did You Get For Your Soul?   \n09. Chill Factor   \n10. Hymn To Her   \n11. Room Full Of Mirrors \n\n\n\n\nDisc 5 [Last Of The Independents][1994]\n\n\n01. Hollywood Perfume   \n02. Night In My Veins   \n03. Money Talk   \n04. 977    \n05. Revolution   \n06. All My Dreams   \n07. I'll Stand By You   \n08. I'm A Mother   \n09. Tequila   \n10. Every Mother's Son   \n11. Rebel Rock Me   \n12. Love Colours   \n13. Forever Young \n\n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art \n\n\n\n\n\n\nFrom Wikipedia:\n\n\nPretenders are an English-American rock band formed in Hereford, England, in March 1978. The original band comprised initiator and main songwriter Chrissie Hynde (lead vocals, rhythm guitar), James Honeyman-Scott (lead guitar, backing vocals, keyboards), Pete Farndon (bass guitar, backing vocals), and Martin Chambers (drums, backing vocals, percussion). Following the drug-related deaths of Honeyman-Scott and Farndon, the band has experienced numerous subsequent personnel changes, with Hynde as the only consistent member, and Chambers returning after an absence of several years.\n\n--------------------------------------------------------------------------------\n\nPretenders is the debut studio album by the British-American band The Pretenders, released on 27 December 1979 under Real Records (Sire Records in the United States). A combination of rock, punk, and pop music, this album made the band famous. The album features the singles &quot;Stop Your Sobbing&quot; &quot;Kid&quot; and &quot;Brass in Pocket&quot;.\n\n--------------------------------------------------------------------------------\n\n\nPretenders II is the second studio album by British rock band the Pretenders.\n\nThe success of the Pretenders' debut album in 1980 created a great demand for more material from the fledgling band; however, a lack of songs precluded the quick release of a follow-up album. In the UK, the band released two hit singles in 1980 and early 1981: &quot;Talk of the Town&quot; and &quot;Message of Love,&quot; respectively. In the US, where standalone singles had become rare, these tracks were combined with three others for a stopgap EP release called Extended Play, in March 1981. Their second album, Pretenders II, was released a scant two months later, to mixed critical reception, partly because two of the better songs on the album had been previously released, and partly because many of the songs were viewed as overly-similar (though not quite as groundbreaking) to the band's debut. Nevertheless, several of the album's songs became hits and the album has increased in critical stature with time.\n\nThe album is notable for the inclusion of a cover of The Kinks' &quot;I Go to Sleep&quot; (they had covered that band's &quot;Stop Your Sobbing&quot; on their debut album, and band leader Chrissie Hynde would have a personal relationship with Kinks' frontman Ray Davies), as well as the sexually-forward tunes &quot;Bad Boys Get Spanked&quot; and &quot;The Adultress&quot;. Perhaps the album's most ambitious track, &quot;Day After Day&quot; spins a common second-album narrative of unaccustomed celebrity, with the band rushing from gig to gig, hotel to hotel, head-spun from the swiftness of it all. The song ends suddenly, mid-guitar-solo, with the sound of a crashing fighter plane. The song &quot;Louie, Louie&quot; is an original composition and not a version of identically titled and often covered song by Richard Berry.\n\n--------------------------------------------------------------------------------\n\nLearning to Crawl is the Pretenders' third album, released in 1984 after a two-year hiatus, during which time James Honeyman-Scott and Pete Farndon both died of drug overdoses.\n\nAfter Farndon's dismissal from the band and Honeyman-Scott's death, Chrissie Hynde and Martin Chambers initially recruited Rockpile's Billy Bremner and Big Country's Tony Butler to fill in a caretaker line-up of the band in 1982. Bremner played guitar and Butler played bass on the band's September 1982 single &quot;Back on the Chain Gang/My City Was Gone&quot;, both sides of which were later included on Learning to Crawl. As the album sessions got under way, Bremner, Graham Parker's bass player Andrew Bodnar, and Paul Carrack (formerly of Squeeze, Ace and Roxy Music) played guitar, bass and piano respectively for the track &quot;Thin Line Between Love and Hate&quot;.\n\nFinally, Robbie McIntosh (guitar) and Malcolm Foster (bass) were recruited to join Hynde and Chambers, and the band was now officially a quartet. It was this line-up that recorded the majority of the tracks featured on Learning to Crawl.\n\nThe November 1983 single &quot;2000 Miles/Fast or Slow (The Law's the Law)&quot; was the newly reconstituted foursome's first release, followed shortly by the full Learning to Crawl album in January 1984.\n\nHynde named the album &quot;Learning to Crawl&quot; because her daughter, Natalie Rae Hynde, was learning to crawl at the time that Chrissie was trying to determine a name for the album.\n\n--------------------------------------------------------------------------------\n\nGet Close is the fourth album by rock group The Pretenders, released in 1986. Officially, the band for this album now consisted of Chrissie Hynde (vocals, guitar), Robbie McIntosh (guitar), T.M. Stevens (bass) and Blair Cunningham (drums); however, this line-up (often augmented by session players) played on only five of the album's eleven tracks. As well, the track &quot;Room Full of Mirrors&quot; was in fact performed by the Learning to Crawl-era line up of Hynde, Mcintosh, Malcolm Foster and Martin Chambers, with keyboards by Rupert Black. The rest of the album was performed by Hynde and McIntosh, backed by session musicians. The album contained the band's two biggest Mainstream Rock Tracks chart hits, &quot;Don't Get Me Wrong&quot; and &quot;My Baby&quot;, both of which reached #1. McIntosh and Cunningham would be re-united in 1991 as members of Paul McCartney's backing band. They appear together on McCartney's 1991 album Unplugged, 1993 album Off the Ground and the subsequent live release Paul Is Live.\n\n--------------------------------------------------------------------------------\n\nLast of the Independents is the sixth album by rock group The Pretenders, released in 1994. For this album, the band is officially credited as being Chrissie Hynde (vocals, guitar), Adam Seymour (guitar), Andy Hobson (bass) and Martin Chambers (drums). However, this line-up only plays together on one track (&quot;All My Dreams&quot;); the rest of the album is performed by Hynde and Seymour in conjunction with a rotating series of musicians on bass and drums. These musicians include Hobson and Chambers, as well as bassists Andy Rourke, Tom Kelly and David Paton, and drummers Jimmy Copley and J.F.T. Hood. A few other session musicians also appear, including Ian Stanley, and one-time Pretenders guitarist Robbie McIntosh, who plays alongside Hynde and Seymour on &quot;I'm a Mother&quot;.\n\nThe album also marked the official return of Chambers, who had been fired by Hynde eight years prior.","torrent":{"xt":"urn:btih:382e66ba02e69caa7636cb273f3f2dd46312f8ec","amp;dn":"Pretenders+-+Original+Album+Series+%5B5+CD%27s%5D%5B2009%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"382e66ba02e69caa7636cb273f3f2dd46312f8ec","infoHashBuffer":{"type":"Buffer","data":[56,46,102,186,2,230,156,170,118,54,203,39,63,63,45,212,99,18,248,236]},"announce":[],"urlList":[]}}