{"title":"William the Conqueror by Edward Freeman","uid":15749477,"size":283872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3891948692483b843a2f5c0045737a1b240bbc32&amp;dn=William+the+Conqueror+by+Edward+Freeman&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"marty14","files":1,"time":1473013662,"description":"William the Conqueror - Edward Freeman [epub]\r\n\r\nThe history of England, like the land and its people, has been specially insular, and yet no land has undergone deeper influences from without. No land has owed more than England to the personal action of men not of native birth. Britain was truly called another world, in opposition to the world of the European mainland, the world of Rome. In every age the history of Britain is the history of an island, of an island great enough to form a world of itself. In speaking of Celts or Teutons in Britain, we are speaking, not simply of Celts and Teutons, but of Celts and Teutons parted from their kinsfolk on the mainland, and brought under the common influences of an island world. The land has seen several settlements from outside, but the settlers have always been brought under the spell of their insular position. Whenever settlement has not meant displacement, the new comers have been assimilated by the existing people of the land. When it has meant displacement, they have still become islanders, marked off from those whom they left behind by characteristics which were the direct result of settlement in an island world.\r\n\r\nThe Norman Conquest of England has, in its nature and in its results, no exact parallel in history. And that it has no exact parallel in history is largely owing to the character and position of the man who wrought it. That the history of England for the last eight hundred years has been what it has been has largely come of the personal character of a single man. That we are what we are to this day largely comes of the fact that there was a moment when our national destiny might be said to hang on the will of a single man, and that that man was William, surnamed at different stages of his life and memory, the Bastard, the Conqueror, and the Great…","torrent":{"xt":"urn:btih:3891948692483b843a2f5c0045737a1b240bbc32","amp;dn":"William+the+Conqueror+by+Edward+Freeman","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3891948692483b843a2f5c0045737a1b240bbc32","infoHashBuffer":{"type":"Buffer","data":[56,145,148,134,146,72,59,132,58,47,92,0,69,115,122,27,36,11,188,50]},"announce":[],"urlList":[]}}