{"title":"Bombay Bicycle Club - Discography (2007-2014) [FLAC]","uid":9566361,"size":1657476297,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:38ddfca28003c78954857036b016104d42cc5b86&amp;dn=Bombay+Bicycle+Club+-+Discography+%282007-2014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":4,"uploader":"politux","files":-1,"time":1391523406,"description":"\n  Bombay Bicycle Club - Discography (2007-2014) [FLAC]\n \n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: CD\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  Albums\n\n  2009 I Had the Blues But I Shook Them Loose\n  2010 Flaws \n  2011 A Different Kind of Fix\n  2014 So Long, See You Tomorrow \n\n  EP's / Singles\n\n  2007 The Boy I Used to Be\n  2007 How We Are \n  2011 Lights Out, Words Gone \n  2012 Leave It  \n  \n  Bombay Bicycle Club is a melodic, guitar-driven indie rock outfit from North London, comprised of frontman Jack Steadman, guitarist Jamie MacColl, drummer Suren de Saram, and bassist Ed Nash. Steadman, MacColl, and Saram -- who at the time were all students at University College School (attending at the same time as members of Cajun Dance Party), and not one of them over the age of 15 -- formed the group in Crouch End in 2005, initially calling themselves &quot;the Canals.&quot; They adopted different names over the course of the next year until Nash was brought on board in 2006, at which point the fledgling group dubbed itself Bombay Bicycle Club, in reference to an Indian restaurant chain. Bombay Bicycle Club entered Virgin Mobile's &quot;Road to V&quot; battle-of-the-bands contest soon after, a move that would effectively launch them out of obscurity and into the spotlight as one of that year's most hyped indie acts in Britain.\n\n  Blending together sensual, reverb-slicked, post-punk sensibilities with the kind of quirky, rhythmically adventurous bubbliness that evoked acts like Orange Juice, Bloc Party, and Vampire Weekend, Bombay Bicycle Club ended up winning the competition -- which, in previous years, had been won by the likes of Young Knives -- and were given a spot opening up V Festival that August. A flurry of offers from several big labels came in, but Bombay Bicycle Club opted to self-release their first disc on their homegrown label, Mmm.... Produced by Jim Abiss (who'd previously worked with the Arctic Monkeys), Bombay Bicycle Club's debut EP, The Boy I Used to Be, was released in February 2007; the disc was given a warm critical reception, notably from the folks at NME. Another EP, How We Are, was released that October, debuting at the number two spot on the U.K. indie singles chart.\n \n  The members of Bombay Bicycle Club graduated upper secondary school the following June, and the rest of their summer was dominated by the release of a new single, &quot;Evening/Morning&quot; (released on the Young and Lost Club label), and a flurry of U.K. tour dates. Teaming up once again with Abiss, they recorded their debut full-length at Konk Studios that fall. Bombay Bicycle Club signed with Island Records as the year came to a close; their debut full-length on that label, I Had the Blues But I Shook Them Loose, was released the following summer. In July of 2010, Bombay Bicycle Club released its sophomore effort, Flaws, which found the bandmates unplugging their instruments and recording acoustic songs including a cover of Joanna Newsom's &quot;Swansea.&quot; In 2011, Bombay Bicycle Club returned to a fully electric sound with the release of the Abiss-produced A Different Kind of Fix. The plugged-in, pop/rock approach was evident on the atmospheric dance-oriented lead-off single, &quot;Shuffle.&quot; Bombay Bicycle Club returned in 2014 with the hypnotic So Long, See You Tomorrow featuring songs influenced by Steadman's trip through Europe and India.","torrent":{"xt":"urn:btih:38ddfca28003c78954857036b016104d42cc5b86","amp;dn":"Bombay+Bicycle+Club+-+Discography+%282007-2014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38ddfca28003c78954857036b016104d42cc5b86","infoHashBuffer":{"type":"Buffer","data":[56,221,252,162,128,3,199,137,84,133,112,54,176,22,16,77,66,204,91,134]},"announce":[],"urlList":[]}}