{"title":"Books on Writing (Mobi,Epub,PDF)","uid":9257770,"size":1290267776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39861737738c0f87ed71ff8d003ff8a13a6283e1&amp;dn=Books+on+Writing+%28Mobi%2CEpub%2CPDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"dbwriter","files":1,"time":1385578397,"description":"A collection of eBooks on Writing collected together in one place.  Enjoy and Seed.\n\n\nTitle  Authors  \nCalibre Quick Start Guide  John Schember  \nThe 90-Day Novel  Alan Watt  \nThe Supernatural Book of Monsters, Spirits, Demons, and Ghouls  Alex Irvine  \nHow to Write a Damn Good Thriller: A Step-By-Step Guide for Novelists and Screenwriters  James N. Frey  \nKey: How to Write Damn Good Fiction Using the Power of Myth  James N. Frey  \nBullies, Bastards &amp; Bitches: How to Write the Bad Guys of Fiction  Jessica Morrell  \nManage Your Day-To-Day: Build Your Routine, Find Your Focus, and Sharpen Your Creative Mind  Jocelyn K. Glei, 99u  \nOxford Guide to English Gramma  John Eastwood  \nDostoevsky: A Writer in His Time  Joseph Frank  \nAPA Style Guide to Electronic References, Sixth Edition  American Psychological Association  \nPublication Manual of the American Psychological Association  American Psychological Association  \nLiterary Rogues: A Scandalous History of Wayward Authors  Andrew Shaffer  \nThe Adweek Copywriting Handbook: The Ultimate Guide to Writing Powerful Advertising and Marketing Copy From One of America's Top Copywriters  Joseph Sugarman  \nWriting Academic English With Criterion(TM) Publisher's Version  Alice Oshima  \nBird by Bird: Some Instructions on Writing and Life  Anne Lamott  \nElements of Writing FictionÂ -Plot  Ansen Dibell  \nFiction Writer's Workshop  Josip Novakovich  \nThe Oxford Dictionary of Idioms  Judith Siefring  \nThe Artist's Way  Julia Cameron  \nWriter's Digest Flip Dictionary  Barbara Ann Kipfer  \nThe Handbook of English Linguistics  Bas Aarts  \nBeyond WikiLeaks: Implications for the Future of Communications, Journalism and Society  Benedetta Brevini, Arne Hintz, Patrick McCurdy  \nThe AMA Handbook of Business Writing: The Ultimate Guide to Style, Grammar, Punctuation, Usage, Construction, and Formatting  Kevin Wilson  \nTake Control of Scrivener 2  Kirk McElhearn  \nTelling Lies for Fun &amp; Profit  Lawrence Block, Sue Grafton  \nWired for Story: The Writer's Guide to Using Brain Science to Hook Readers From the Very First Sentence  Lisa Cron  \nGrant Writing for Dummies  Beverly A. Browning  \nBryson's Dictionary of Troublesome Words: A Writer's Guide to Getting It Right  Bill Bryson  \nThe Novel Writer's Toolkit: A Guide to Writing Novels and Getting Published  Bob Mayer  \nQuick Access Compact (Custom Joliet Junior College Edition)  Lynn Quitman Troyka, Douglas Hesse  \nWriting From Sources  Brenda Spatt  \nDaily Rituals: How Artists Work  Mason Currey  \nWriting Feature Articles  Brendan Hennessy  \nThe Chicago Guide to Writing About Numbers  Jane E. Miller  \nPrinciples of Successful Freelancing  Miles Burke  \nCreative Writer's Workbook, The  Cathy Birch  \nElements of Fiction WritingÂ -Beginnings, Middles &amp; Ends  Nancy Kress  \nElements of Fiction WritingÂ -Characters &amp; Viewpoint: Proven Advice and Timeless Techniques for Creating Compelling Characters by an Award-Winning Author  Orson Scott Card  \nHarbrace Essentials  Cheryl Glenn, Loretta Gray  \nPaperback Oxford English Dictionary  Oxford Dictionaries  \nTalking About Detective Fiction  P. D. James  \nThe Harbrace Guide to Writing, Concise Edition  Cheryl Glenn  \nThe No Plot? No Problem! Novel-Writing Kit  Chris Baty  \nEncyclopedia of 19th-and 20th-Century British Writers  Christine L. Krueger, George Stade, Karen Karbiener  \nThe Oxford Book of English Detective Stories  Patricia Craig  \nHow to Write Reports and Proposals  Patrick Forsyth  \nReading of Theoretical Texts  Peter Ekegren  \nThe Writer's Journey: Mythic Structure for Writers  Christopher Vogler  \nThe Encyclopedia of the Novel  Peter Melville Logan  \nEssays and Poems  Ralph Waldo Emerson  \nA Guide to Writing as an Engineer  David F. Beer, David A. McMurrey  \nThe Describer's Dictionary: A Treasury of Terms &amp; Literary Quotations  David Grambs  \nThe Cambridge Introduction to Creative Writing  David Morley  \nThe College Writer: A Guide to Thinking, Writing, and Researching  Randall VanderMey, Patrick Sebranek, Verne Meyer, John van Rys  \nWriting Popular Fiction  Dean R. Koontz  \nThe Extreme Searcher's Internet Handbook: A Guide for the Serious Searcher  Randolph Hock, Gary Price  \nZen in the Art of Writing  Ray Bradbury  \nReference and Research Guide to Mystery and Detective Fiction  Richard J. Bleiler  \nThe St. Martin's Guide to Writing  Rise B. Axelrod, Charles R. Cooper  \n2012 Writer's Market  Robert Lee Brewer  \n20 Master Plots and How to Build Them  Ronald B Tobias  \nWriting for Academic Journals  Rowena Murray  \nExercises for a Writer's Reference Large Format  Diana Hacker, Nancy Sommers  \nThe Psychology of Creative Writing  Scott Barry Kaufman  \nStein on Writing  Sol Stein, Christopher Lane  \nRules for Writers  Diana Hacker, Nancy I. Sommers  \nFundamentals of New Testament Greek  Stanley E. Porter  \nOn Writing: A Memoir of the Craft  Stephen King  \nThe Marshall Plan for Novel Writing  Evan Marshall  \nThe Handbook of Creative Writing  Steven Earnshaw  \nWriting Mysteries  Sue Grafton  \nWriting Systems of the World  Florian Coulmas  \nLiterary Theory: An Introduction  Terry Eagleton  \nEnglish Grammar for Today: A New Introduction  Geoffrey Leech  \nThe Theory of the Novel  Georg Lukacs  \nThe Oxford Companion to the English Language  Tom McArthur, Thomas McArthur  \nWriting a Novel and Getting Published for Dummies  George Green, Lizzy Kremer  \nThe Oxford Essential Guide to Writing  Thomas S. Kane  \nLifehacker: 88 Tech Tricks to Turbocharge Your Day  Gina Trapani  \nWriting Fiction: The Practical Guide From New York's Acclaimed Creative Writing School  Alexander Steele, Gotham Writers' Workshop  \nOn Creative Writing  Graeme Harper  \nMugging the Muse: Writing Fiction for Love and Money: Second Edition: New and Updated  Holly Lisle  \nThe 100 Most Influential Writers of All Time  J. E. Luebering  \nThe Writer's Idea Book: How to Develop Great Ideas for Fiction, Nonfiction, Poetry, &amp; Screenplays  Jack Heffron  \nThe Oxford Book of American Detective Stories  Rosemary Herbert  \nHow to Write a Damn Good Novel, 2: Advanced Techniques for Dramatic Storytelling  James N. Frey  \nCritical Thinking: A Concise Guide  Tracy Bowell, Gary Kemp  \nHow to Write a Damn Good Novel  James N. Frey  \nWriting  Tricia Hedge, Alan Maley  \nThe Oxford Dictionary of Quotations  Elizabeth Knowles  \nStory Structure Architect  Victoria Lynn Schmidt  \nSerial Crime, Second Edition: Theoretical and Practical Issues in Behavioral Profiling  Wayne Petherick  \nA Jane Austen Education: How Six Novels Taught Me About Love, Friendship, and the Things That Really Matter  William Deresiewicz  \nOn Writing Well: The Classic Guide to Writing Nonfiction  William Zinsser  \nThe Elements of Style by William Strunk  William Strunk  \nWriting for Journalists  Wynford Hicks  \nHandbook of Research on Digital Libraries: Design, Development, and Impact  Yin-Leng Theng, Schubert Foo, Dion Goh, Jin Cheon Na  \nThe Anatomy of Story: 22 Steps to Becoming a Master Storyteller  John Truby  \nFrom Inquiry to Academic Writing: A Text and Reader  Stuart Greene, April Lidinsky  \nArt of Plotting: Add Emotion Suspense and Depth to Your Screenplay  Linda J. Cowgill  \nStory Physics: Harnessing the Underlying Forces of Storytelling  Larry Brooks  \nPolitics and the English Language and Other Essays  George Orwell  \nWriting Fiction for Dummies  Randy Ingermanson, Peter Economy  \nWriting: A Manual for the Digital Age, Brief  David Blakesley, Jeffrey Laurence Hoogeveen  \nCrafting Novels &amp; Short Stories: Everything You Need to Know to Write Great Fiction  Editors Of Writer's Digest  \nA Writer's Book of Days: A Spirited Companion &amp; Lively Muse for the Writing Life  Judith Reeves  \nPersecution and the Art of Writing  Leo Strauss  \nSchaum's Quick Guide to Writing Great Short Stories  Margaret Lucke  \nWrite Good or Die  Various  \nThe Emotion Thesaurus: A Writer's Guide to Character Expression  Angela Ackerman, Becca Puglisi  \nPlotting and Writing Suspense Fiction  Patricia Highsmith  \nWriters Workshop of Science Fiction &amp; Fantasy  Michael Knost  \nHow to Write Great Essays  Learningexpress Editors  \nThe Complete Handbook of Novel Writing  Editors Of Writers Digest Books  \nThe Facts on File Dictionary of Allusions  Martin H. Manser  \nIt Was the Best of Sentences, It Was the Worst of Sentences: A Writer's Guide to Crafting Killer Sentences  June Casagrande  \nPocket Oxford American Dictionary &amp; Thesaurus  Oxford University Press, Usa  \n2011 Children's Writer's and Illustrator's Market  Alice Pope  \nTime and Narrative, Volume 1  Paul Ricoeur  \nMLA Handbook for Writers of Research Papers  Joseph Gibaldi, Modern Language Association Of America  \nWriter's Reference (Instructor's Edition)  Diana Hacker, Nancy Sommers  \nSimon &amp; Schuster Handbook for Writers  Lynn Quitman Troyka, Douglas Dean Hesse  \nThe Chicago Manual of Style, 16th Edition  University Of Chicago Press Staff  \nA Practical Guide to Graphics Reporting: Information Graphics for Print, Web &amp; Broadcast  Jennifer George-Palilonis  \nScientific Writing = Thinking in Words  David Lindsay  \nOn the Commerce of Thinking: Of Books and Bookstores  Jean-Luc Nancy, David Wills  \nRules of Thumb: A Guide for Writers: 7th (Seventh) Edition  Elaine Hughes, Diana Roberts Wienbroer Jay Silverman  \nDictionary of Problem Words and Expression  Harry Shaw  \nContent Rules: How to Create Killer Blogs, Podcasts, Videos, Ebooks, Webinars (And More) That Engage Customers and Ignite Your Business  Ann Handley, C. C. Chapman  \nThe Dramatic Writer's Companion: Tools to Develop Characters, Cause Scenes, and Build Stories  Will Dunne  \nNarrative in Fiction and Film: An Introduction  Jakob Lothe  \nHow to Be a Writer: Secrets From the Inside  Stewart Ferris  \nWriting Fiction: An Introduction to the Craft  Garry Disher  \nJournalism, Ethics and Society  David Berry  \nWriting FAST: How to Write Anything With Lightning Speed  Jeff Bollow  \nIn a Word: 750 Words and Their Fascinating Stories and Origins  Rosalie Baker, Tom Lopes  \nThe New American Webster Handy College Dictionary  Albert H. Morehead, Loy Morehead, Philip D. Morehead  \nThe Fable of the Southern Writer  Lewis P. Simpson  \nWriters on Writing  Robert Pack, Jay Parini  \nInternet Guide for Writers, The  Malcolm Chilsholm  \nAncient Gonzo Wisdom: Interviews With Hunter S. Thompson  Anita Thompson  \nCareers in Publishing  Blythe Camenson  \nGrant Application Writer's Handbook  Liane Reif-Lehrer  \nEncyclopedia of Beat Literature  Kurt Hemmer  \nThe Facts on File Companion to the World Novel: 1900 to the Present, 2-Volume Set  Michael D. Sollars  \nCareers for Writers &amp; Others Who Have a Way With Words  Robert Bly  \nWriting for Scholarly Publication: Behind the Scenes in Language Education  Christine Pearson Casanave, Stephanie Vandrick  \nWriting Groups Inside and Outside the Classroom  Edited By Beverly J. Moss  \nResources for Writers: An Annotated Bibliography  R. Baird Shuman  \nResearching for Writers: How to Gather Material for Articles, Novels and Non-Fiction Books  Marion Field  \nCreative Writing: How to Develop Successful Writing Skills for Fiction and Non-Fiction Publication  Adele Ramet  \nWriting Features &amp; Interviews: 2nd Edition  Christine Hall  \nAcademic Writing and Publishing: A Practical Handbook  James Hartley  \nTalking With Texas Writers: Twelve Interviews  Patrick Bennett  \nOn the Art of Writing Copy  Herschell Gordon Lewis  \nClassic Mystery Writers  Harold Bloom  \nModern Crime and Suspense Writers  Harold Bloom  \nLandmark Essays on Basic Writing  Kay Halasek, Nels P. Highberg  \nScientific Writing 2.0: A Reader and Writer'S Guide  Lebrun Jean-Luc  \nLinguistics for Writers  Colleen Donnelly  \nThe Irish Writer and the World  Declan Kiberd  \nCareers in Writing  Blythe Camenson  \nThe Writer's Legal Guide: An Authors Guild Desk Reference  Tad Crawford, Kay Murray  \nTechnical Writing  Julie M. Zeleznik, Philippa Jane Benson, Rebecca E. Burnett  \nProfessional Feature Writing  Bruce Garrison  \nClassic Crime and Suspense Writers  Harold Bloom  \nKurt Vonnegut: A Critical Companion  Thomas Marvin, Thomas F. Marvin  \nSouthern Writers and Their Worlds  Susan A. Eacker, Anne Goodwyn Jones, Bertram Wyatt-Brown,  \nWriting Research: Transforming Data Into Text, 1e (Clare, Writing Research)  Judith Clare Rn Ba Ma(hons) Phd Frcna, Helen Hamilton Rn Ba  \nModern Mystery Writers  Harold Bloom  \nThe Bedford Introduction to Literature: Reading, Thinking, Writing  Michael Meyer  \nThe Fiction Writer's Toolkit  Bob Mayer  \nWriting Well: The Essential Guide  Mark Tredinnick  \n$30 Writing School  Michael W. Dean  \nRevision &amp; Self-Editing: Techniques for Transforming Your First Draft Into a Finished Novel  James Scott Bell  \nConcise Oxford English Dictionary  Catherine Soanes, Angus Stevenson  \nThe Concise Oxford Dictionary of Literary Terms  Chris Baldick  \nThe Concise Oxford Companion to English Literature  Dinah Birch, Katy Hooper  \nDictionary of the Bible  John L. Mckenzie  \nA Dictionary of World History  Edmund Wright, Jonathan Law  \nThe Oxford Dictionary of English Grammar  Sylvia Chalker, Edmund Weiner  \nThe Oxford Dictionary of Idioms  Jennifer Speake  \nThe Oxford Dictionary of Philosophy  Simon Blackburn  \nThe Oxford Dictionary of Twentieth-Century Quotations  Elizabeth Knowles  \nOxford Paperback Thesaurus  Maurice Waite  \nSelf-Editing for Fiction Writers  Renni Browne, Dave King, George Booth  \nI Never Knew There Was a Word for It  Adam Jacot de Boinod  \nInterviewing for Journalists  Sally Adams, Wynford Hicks  \nThe Artful Edit: On the Practice of Editing Yourself  Susan Bell  \nOn Writing: 10th Anniversary Edition: A Memoir of the Craft  Stephen King  \nThe Best American Crime Reporting 2009  Jeffrey Toobin, Otto Penzler, Thomas H. Cook  \nThe Best American Crime Writing 2006  Mark Bowden, Otto Penzler, Thomas H. Cook  \nThe Best American Crime Writing: 2003 Edition: The Year's Best True Crime Reporting  Otto Penzler, Thomas H. Cook  \nThe Call to Write  John Trimbur  \nThe Plot Whisperer: Secrets of Story Structure Any Writer Can Master  Martha Alderson  \nKeys for Writers  Ann Raimes, Susan K. Miller-Cochran  \nThe Imaginative Argument: A Practical Manifesto for Writers  Frank L. Cioffi  \nThe 101 Habits of Highly Successful Screenwriters: Insider's Secrets From Hollywood's Top Writers  Karl Iglesias  \nThe Big Sleep &amp; Farewell, My Lovely: AND Farewell My Lovely  Raymond Chandler  \nWhy We Read Fiction: Theory of Mind and the Novel  Lisa Zunshine  \n\n","torrent":{"xt":"urn:btih:39861737738c0f87ed71ff8d003ff8a13a6283e1","amp;dn":"Books+on+Writing+%28Mobi%2CEpub%2CPDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39861737738c0f87ed71ff8d003ff8a13a6283e1","infoHashBuffer":{"type":"Buffer","data":[57,134,23,55,115,140,15,135,237,113,255,141,0,63,248,161,58,98,131,225]},"announce":[],"urlList":[]}}