{"title":"Pink Floyd - Pulse [Japanese Limited LP Replica Third Issue] (20","uid":9846839,"size":1353612309,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:39df97c99248766db73bf05a951cd45a1aec7ab3&amp;dn=Pink+Floyd+-+Pulse+%5BJapanese+Limited+LP+Replica+Third+Issue%5D+%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"Beolab1700","files":79,"time":1396051204,"description":"[center]\n\n[size=5]Pink Floyd - Pulse [Japanese Limited LP Replica Third Issue] (2008) FLAC Beolab1700[/size]\n\n[IMG]http://i.imgur.com/sDmRmyY.jpg[/IMG]\n\n---------------------------------------------------------------------\n               Pink Floyd - Pulse (Disc 1) (MHCP 689)\n---------------------------------------------------------------------\n\nArtist...............: Pink Floyd\nAlbum................: Pulse (Disc 1) (MHCP 689)\nGenre................: Progressive Rock\nSource...............: CD\nYear.................: 1995\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 59 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\nInformation..........: CD IMAGE - LOG - CUE - FULL SCANS\n\nPosted by............: Beolab1700 on 29/03/2014\n\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\nDisc 1\n\n1. Shine On You Crazy Diamond (13:34)\n2. Astronomy Domine (4:20)\n3. What Do You Want From Me (4:09)\n4. Learning To Fly (5:16)\n5. Keep Talking (6:53)\n6. Coming Back To Life (6:56)\n7. Hey You (4:38)\n8. A Great Day For Freedom (4:30)\n9. Sorrow (10:48)\n10. High Hopes (7:53)\n11. Another Brick In The Wall (Part II) (7:08)\n\nDisc 2: The Dark Side Of The Moon\n\n1. Speak To Me (2:27)\n2. Breathe (2:39)\n3. On The Run (3:44)\n4. Time (6:48)\n5. The Great Gig In The Sky (5:51)\n6. Money (8:53)\n7. Us And Them (6:58)\n8. Any Colour You Like (3:20)\n9. Brain Damage (3:46)\n10. Eclipse (2:37)\n11. Wish You Were Here (6:35)\n12. Comfortably Numb (9:29)\n13. Run Like Hell (8:39)\n\n---------------------------------------------------------------------\n\nNotes\n\nCatalog Number: MHCP-689 ~ 90\nBar Code: 4 571191 051639\nMatrix Information:\nDisc 1: Bottom: DP-7638-1 1 + ++ ++++++++ IFPI L278 [IFPI 45J9]\nDisc 2: Bottom: PRS-569X 1 + ++ ++++++++ IFPI L277 [IFPI 45K3]\nPressing Plant: Sony Records pressing plant, Japan\nProduction Mastering: Sony mastering\nRelease Date: May 18, 2005. Reissued March 14, 2008.\nRelease Information: Third Japanese release. Issued in a CD sized box.\n\nAlbum Notes\n\nJapanese limited LP replica sleeve edition of the original album release from 1995. The package faithfully recreates the original LP box sleeve with four &quot;album jackets&quot; representing the original LP's and their innersleeves are included as well. Also includes a miniaturized edition of the original picture booklet that came with the album, the two CD's with the complete audio program and label miniatures which replicate the record labels. Also includes a bonus booklet with all the track information and lyrics in both English and Japanese.\n\nRecorded live in Europe and The United Kingdom in 1994.No matter which of Pink Floyd's leaders (Barrett, Waters, Gilmour) is at the controls, the band has always been about grandeur. The epic scale of their psychedelic explorations, the life-altering themes of their recordings, their ground-breaking, conceptual stagings, have all helped in the construction of the group's mythology. And more than any other rock band's, Pink Floyd's myths have endured even as the band and its fans have grown older.A live double album, PULSE works not only as an extended postcard of 1994's biggest tour, but as the Floyd's myth re-charger. Consider the facts: the release was celebrated with a laser-light show atop the Empire State Building, and the spine of the CD package features a perpetually blinking light. But, as is always the case with Pink Floyd, there is method in their madness. The blinking light harkens back to the heartbeat that is the unifying theme of their classic DARK SIDE OF THE MOON album, which is performed in its entirety on disc two.Disc one is an approximation of the band's first set, featuring a powerful run through Syd Barrett's &quot;Astronomy Domine&quot; (the definition of late-'60s British psychedelia), as well as a host of songs from 1987's MOMENTARY LAPSE OF REASON and '94s DIVISION BELL. But the second set is the true keeper of the two. Having made its tour debut on the 25th anniversary of the Apollo moon landing, DARK SIDE loses none of its glow when transferred to a live setting. David Gilmour ably handles Roger Waters' vocal parts, and emphasizes instrumental interludes--&quot;On The Run,&quot; for instance, sounds like a true precursor to The Orb's ambient noodlings. The radio hits (&quot;Money,&quot; &quot;Us and Them,&quot; &quot;Brain Damage&quot;) are all re-interpreted enough to sound novel, but still retain a comforting familiarity.\n\nJapanese OBI MINI REPLICA BOX SET\n\nWHAT IS A JAPAN &quot;MINI-LP-SLEEVE&quot; CD?\n\nHave you ever lamented the loss of one of the 20th Century's great art forms, the 12&quot; vinyl LP jacket? Then &quot;mini-LP-sleeve&quot; CD's may be for you.\n\nMini-sleeve CDs are manufactured in Japan under license. The disc is packaged inside a 135MM X 135MM cardboard precision-miniature replica of the original classic vinyl-LP album. Also, anything contained in the original LP, such as gatefolds, booklets, lyric sheets, posters, printed LP sleeves, stickers, embosses, special LP cover paper/inks/textures and/or die cuts, are precisely replicated and included. An English-language lyric sheet is always included, even if the original LP did not have printed lyrics.\n\nThen, there's the sonic quality: Mini-sleeves have dedicated remastering (20-Bit, 24-Bit, DSD, K2/K2HD, and/or HDCD), and can often be superior to the audio on the same title anywhere else in the world. There also may be bonus tracks unavailable elsewhere.\n\nEach Japan mini-sleeve has an &quot;obi&quot; (&quot;oh-bee&quot;), a removable Japan-language promotional strip. The obi lists the Japan street date of that particular release, the catalog number, the mastering info, and often the original album's release date. Bonus tracks are only listed on the obi, maintaining the integrity of the original LP artwork. The obi's are collectable, and should not be discarded.\n\nAll mini-sleeve releases are tremendously limited editions mainly pressed on future orders only and once released immediately out of print. This fact along with other latter features we've mentioned make these titles rare collectibles that sell in the collectors markets for $100's of dollars apiece.\n\n---------------------------------------------------------------------\n\n[/center]","torrent":{"xt":"urn:btih:39df97c99248766db73bf05a951cd45a1aec7ab3","amp;dn":"Pink+Floyd+-+Pulse+%5BJapanese+Limited+LP+Replica+Third+Issue%5D+%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39df97c99248766db73bf05a951cd45a1aec7ab3","infoHashBuffer":{"type":"Buffer","data":[57,223,151,201,146,72,118,109,183,59,240,90,149,28,212,90,26,236,122,179]},"announce":[],"urlList":[]}}