{"title":"Electrical &amp; Electronic Principles &amp; Technology - 5th Ed","uid":11430177,"size":6346219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a055ae50f39189ba5d2b6c0d9a081a24b07bc0f&amp;dn=Electrical+%26amp%3B+Electronic+Principles+%26amp%3B+Technology+-+5th+Ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1415715605,"description":"This much-loved textbook introduces electrical and electronic principles and technology to students who are new to the subject.\n\nReal-world situations and engineering examples put the theory into context. The inclusion of worked problems with solutions really help aid your understanding and further problems then allow you to test and confirm you have mastered each subject. In total the books contains 410 worked problems, 540 further problems, 340 multiple-choice questions, 455 short-answer questions, and 7 revision tests with answers online.\n\nThis an ideal text for vocational courses enabling a sound understanding of the knowledge required by technicians in fields such as electrical engineering, electronics and telecommunications. It will also be an excellent refresher for foundation and undergraduate degree students.\n\nIt is supported by a companion website that contains solutions to the 540 questions in the practice exercises, formulae to help students answer the questions, multiple choice questions linked to each of the 23 chapters and information about the famous mathematicians and scientists mentioned in the book. Lecturers also have access to full solutions and the marking scheme for the 7 revision tests, lesson plans and illustrations from the book","torrent":{"xt":"urn:btih:3a055ae50f39189ba5d2b6c0d9a081a24b07bc0f","amp;dn":"Electrical+%26amp%3B+Electronic+Principles+%26amp%3B+Technology+-+5th+Ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a055ae50f39189ba5d2b6c0d9a081a24b07bc0f","infoHashBuffer":{"type":"Buffer","data":[58,5,90,229,15,57,24,155,165,210,182,192,217,160,129,162,75,7,188,15]},"announce":[],"urlList":[]}}