{"title":"La Roux - Trouble In Paradise (2014) {FLAC} vtwin88cube","uid":10593407,"size":316111161,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3b1c57055a021536211da800037a8d1a9cca0c13&amp;dn=La+Roux+-+Trouble+In+Paradise+%282014%29+%7BFLAC%7D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1405829640,"description":"La Roux\nTrouble In Paradise (2014)\n\n\n\n\n\nallmusic.com...\n\nMeaning &quot;red-haired one&quot; in French, La Roux is the synth pop project of flame-haired singer/songwriter Elly Jackson and keyboardist/producer Ben Langmaid. Before they collaborated, Jackson, the daughter of actress Trudie Goodwin, grew up listening to folk artists and singer/songwriters like Nick Drake and Joni Mitchell, and drew inspiration from their sounds for her early music. However, Jackson's style changed as she got into the rave scene, taking her music in a more electronic direction. Meanwhile, Langmaid had gone to school with Rollo from Faithless, and the two recorded as house duo Huff &amp; Puff in the mid-'90s; Langmaid also recorded as Atomic and as one half of Huff &amp; Herb for Rollo's label, and was a songwriter for the group Kubb. Jackson and Langmaid began working together in 2006, when they were introduced by a mutual acquaintance. Initially, they called their project Automan and wrote largely acoustic music before scrapping that name and sound for the sleek Prince, David Bowie, and the Knife-inspired style they pursued as La Roux, a moniker Jackson found in a book of baby names. Their debut single, &quot;Quicksand,&quot; was released by Kitsune in fall 2008, and earned the band acclaim from the BBC and the Guardian. La Roux supported Lily Allen on her 2009 U.K. tour around the time their second single, &quot;In for the Kill,&quot; was released that spring and debuted at 11 on the U.K. charts, reaching a peak position of two; that summer, the single &quot;Bulletproof&quot; debuted at number one a week before La Roux's self-titled album was released. La Roux arrived in the States that fall. Late that year, the duo began working on new material that steered away from the heavy '80s influence of its debut. In early 2010, Skream's remix of &quot;In for the Kill&quot; won Best Dancefloor Filler at the NME Shockwave Awards. That summer, &quot;Bulletproof&quot; entered the Top Ten of Billboard's Hot 100 singles chart, and La Roux released the mix album Sidetracked. \n\n\nGenre................: Pop\nYear.................: 2014\nQuality..............: Free Lossless Audio Codec (FLAC)\nIncluded.............: Front Cover, Cue, Audiochecker\n\n\n01.Uptight Downtown\n02.Kiss And Not Tell\n03.Cruel Sexuality\n04.Paradise Is You\n05.Sexotheque\n06.Tropical Chancer\n07.Silent Partner\n08.Let Me Down Gently\n09.The Feeling\n\n\n\n\n\nSupport The Artists.\nBuy it if you like it!\n\nThanks for Seeding\nCheers...","torrent":{"xt":"urn:btih:3b1c57055a021536211da800037a8d1a9cca0c13","amp;dn":"La+Roux+-+Trouble+In+Paradise+%282014%29+%7BFLAC%7D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b1c57055a021536211da800037a8d1a9cca0c13","infoHashBuffer":{"type":"Buffer","data":[59,28,87,5,90,2,21,54,33,29,168,0,3,122,141,26,156,202,12,19]},"announce":[],"urlList":[]}}