{"title":"Veronica Rossi - Wereld zonder hemel trilogie. NL Ebook. DMT ","uid":11680218,"size":1348064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b43ec51edcb727ccfab0669dfda95ec2fc08485&amp;dn=Veronica+Rossi+-+Wereld+zonder+hemel+trilogie.+NL+Ebook.+DMT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":5,"uploader":"BiWild","files":6,"time":1423050421,"description":"Veronica Rossi - Wereld zonder hemel trilogie. NL Ebook. DMT \n\nAuteur: Veronica Rossi\nPagina's: 280/248/289\nTaal: Dutch/Nederlands\nUitgever: De Boekerij B.V\nJaar van uitgifte: 2014\nGenre: Jeugd / Fantasie\n\nSamenvatting\n\nAfbeelding\n\n(1) Een wereld zonder hemel \nIn haar futuristische debuutroman heeft Veronica Rossi de mensheid in twee kampen verdeeld. Of je woont in een koepel en leidt een \nzo goed als compleet virtueel leven, of je woont buiten de koepel en bent overgeleverd aan de wetten van de natuur.Aria weet dat haar \noverlevingskansen in de woestenij oftewel de Winkel des Doods minimaal zijn nu ze is verstoten van haar thuis; de hermetisch afgesloten \nstad Reverie. Als ze al niet in handen valt van rondzwervende kannibalen, dan raakt ze waarschijnlijk wel gewond tijdens een van de zeer \nagressieve elektrische stormen die over de vlakte jagen en waarvan alleen de vrijgekomen lucht al dodelijk kan zijn. Wanneer ze de \nvlaktebewoner Perry tegenkomt, lijkt hij haar enige hoop om in leven te blijven. Ze besluiten samen op te trekken en luiden op die manier \neen nieuw tijdperk in voor iedereen die leeft in de wereld zonder hemel.\n\nAfbeelding\n\n(2) De eindeloze nacht \nAria weet al maanden dat haar moeder is overleden, net zo lang als ze Perry niet heeft gezien. Nu staan de geliefden op het punt \nelkaar weer te ontmoeten. Een moment waar ze naartoe leven, maar is het het wachten waard? Aria heeft moeite om weer een plek \nte vinden in de Getijen en Perry heeft moeite met zijn leiderschap. Nu de stormen elke dag erger worden, lijkt de enige hoop op \nvrede en veiligheid te vinden in een oude legende.Sterke verleidingen en valse vriendschappen stellen de liefde \ntussen Aria en Perry op de proef. Is die sterker dan de eindeloze nacht?\n\nAfbeelding\n\n(3)Het stille blauw \nPerry en Aria hebben voor hun liefde gevochten en hebben de zware tests van hun leiderschap doorstaan. Nu zijn ze klaar \nom een laatste poging te ondernemen om de twee kampen samen te brengen in een nieuwe wereld.\n\nMet dank aan de originele poster !! \n\n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATR","torrent":{"xt":"urn:btih:3b43ec51edcb727ccfab0669dfda95ec2fc08485","amp;dn":"Veronica+Rossi+-+Wereld+zonder+hemel+trilogie.+NL+Ebook.+DMT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b43ec51edcb727ccfab0669dfda95ec2fc08485","infoHashBuffer":{"type":"Buffer","data":[59,67,236,81,237,203,114,124,207,171,6,105,223,218,149,236,47,192,132,133]},"announce":[],"urlList":[]}}