{"title":"Distilling Knowledge - Alchemy, Chemistry, and the Scientific Re","uid":15563365,"size":855133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c169c09a53866da5bb31256cc9b145fc028da8b&amp;dn=Distilling+Knowledge+-+Alchemy%2C+Chemistry%2C+and+the+Scientific+Re&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"clouderone","files":1,"time":1471166126,"description":"Distilling Knowledge - Alchemy, Chemistry, and the Scientific Revolution - Bruce T.Moran (HUP, 2005).pdf\r\n\r\nAlchemy can't be science--common sense tells us as much. But perhaps common sense is not the best measure of what science is, or was. In this book, Bruce Moran looks past contemporary assumptions and prejudices to determine what alchemists were actually doing in the context of early modern science. Examining the ways alchemy and chemistry were studied and practiced between 1400 and 1700, he shows how these approaches influenced their respective practitioners' ideas about nature and shaped their inquiries into the workings of the natural world. His work sets up a dialogue between what historians have usually presented as separate spheres; here we see how alchemists and early chemists exchanged ideas and methods and in fact shared a territory between their two disciplines. Distilling Knowledge suggests that scientific revolution may wear a different appearance in different cultural contexts. The metaphor of the Scientific Revolution, Moran argues, can be expanded to make sense of alchemy and other so-called pseudo-sciences--by including a new framework in which &quot;process can count as an object, in which making leads to learning, and in which the messiness of conflict leads to discernment.&quot; Seen on its own terms, alchemy can stand within the bounds of demonstrative science","torrent":{"xt":"urn:btih:3c169c09a53866da5bb31256cc9b145fc028da8b","amp;dn":"Distilling+Knowledge+-+Alchemy%2C+Chemistry%2C+and+the+Scientific+Re","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c169c09a53866da5bb31256cc9b145fc028da8b","infoHashBuffer":{"type":"Buffer","data":[60,22,156,9,165,56,102,218,91,179,18,86,204,155,20,95,192,40,218,139]},"announce":[],"urlList":[]}}