{"title":"The Basics of Web Hacking- Syngress 2013 [Epub]","uid":8922931,"size":3779395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c7389ef8241bb455a95daa471c157ee22ce3d04&amp;dn=The+Basics+of+Web+Hacking-+Syngress+2013+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"F1restorm","files":-1,"time":1379297072,"description":"The Basics of Web Hacking: Tools and Techniques to Attack the Web\nAuthor: Josh Pauli\nPublished: August 5, 2013\nPublisher: Syngress\nISBN: 9780124166004 \nFormat: Retail Epub\nReaders: Adobe Digital Editons V2.0, Calibre, MoonReader for Android etc\nTested on laptop and Android tablet. Some of the little checkboxes turn out as question marks in ADE Version 1, was fine on Version 2.0, Calibre and MoonReader\n_____________________________________________________________________________\n\nThe Basics of Web Hacking introduces you to a tool-driven process to identify the most widespread vulnerabilities in Web applications. No prior experience is needed. Web apps are a &quot;path of least resistance&quot; that can be exploited to cause the most damage to a system, with the lowest hurdles to overcome. This is a perfect storm for beginning hackers. The process set forth in this book introduces not only the theory and practical information related to these vulnerabilities, but also the detailed configuration and usage of widely available tools necessary to exploit these vulnerabilities.\n\nThe Basics of Web Hacking provides a simple and clean explanation of how to utilize tools such as Burp Suite, sqlmap, and Zed Attack Proxy (ZAP), as well as basic network scanning tools such as nmap, Nikto, Nessus, Metasploit, John the Ripper, web shells, netcat, and more. Dr. Josh Pauli teaches software security at Dakota State University and has presented on this topic to the U.S. Department of Homeland Security, the NSA, BlackHat Briefings, and Defcon. He will lead you through a focused, three-part approach to Web security, including hacking the server, hacking the Web app, and hacking the Web user.\n\nWith Dr. Pauli's approach, you will fully understand the what/where/why/how of the most widespread Web vulnerabilities and how easily they can be exploited with the correct tools. You will learn how to set up a safe environment to conduct these attacks, including an attacker Virtual Machine (VM) with all necessary tools and several known-vulnerable Web application VMs that are widely available and maintained for this very purpose. Once you complete the entire process, not only will you be prepared to test for the most damaging Web exploits, you will also be prepared to conduct more advanced Web hacks that mandate a strong base of knowledge.\n\nProvides a simple and clean approach to Web hacking, including hands-on examples and exercises that are designed to teach you how to hack the server, hack the Web app, and hack the Web user\nCovers the most significant new tools such as nmap, Nikto, Nessus, Metasploit, John the Ripper, web shells, netcat, and more!\n","torrent":{"xt":"urn:btih:3c7389ef8241bb455a95daa471c157ee22ce3d04","amp;dn":"The+Basics+of+Web+Hacking-+Syngress+2013+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c7389ef8241bb455a95daa471c157ee22ce3d04","infoHashBuffer":{"type":"Buffer","data":[60,115,137,239,130,65,187,69,90,149,218,164,113,193,87,238,34,206,61,4]},"announce":[],"urlList":[]}}