{"title":"Crimson Skies - Tested on Windows 7 x64 Ultimate","uid":5654429,"size":347769668,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3c9f16882c763a5e4b2880f159542b696ecbf9a8&amp;dn=Crimson+Skies+-+Tested+on+Windows+7+x64+Ultimate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"altrego99","files":2,"time":1277740919,"description":"Game: Crimson Skies\nYear: 2000\nPublisher: Microsoft\nDecompressed Size: 805mb\nVersion: 1.02\n\nMore info on game here -\nhttp://en.wikipedia.org/wiki/Crimson_Skies_%28video_game%29\n\nFonts\n-----\nYou can install these additional fonts if your system does not already have them -\nAndy, Pepita MT, Secret Service Typewriter\n\nThe game reads from these fonts, and the only difference they will make is that the mission history and newspaper cutouts will look slightly different when you install them.\n\nInstallation\n------------\nTo install, you need to manually unzip the files to a folder and call it Crimson Skies. You will need either 7Zip or WinRAR to unzip the files.\n\nImportant Note: This does not come with installation, and it does not need one. You can put the Crimson Skies folder anywhere, and create a shortcut of crimson.exe to your desktop or Start Menu to run. On first run, it will ask for video device. Select the one with &quot;Accelerator&quot; mentioned in it - this is your graphics card.\n\nTested with Windows 7 x64 Ultimate, using DX11. Works fine!\n\nSome drawbacks -\n1. Max resolution is 1024x768\n2. No shadows (although you won't miss it much, as in the sky there is hardly anything to cast shadow on)\n3. You may not like the text rendering\n\nSome plus points -\n1. No hassle DnP (download and play) installation\n2. No hassle easy to use and smooth flight control\n3. Amazing dogfights give hours of fun\n4. The superb script and voice acting makes you feel like a real pirate leader\n\nScreenshots from installed game\nhttp://bayimg.com/HanCmaACG\nhttp://bayimg.com/haNcpaACG\n\nOriginal crimson.exe is backed up as crimson.exe_. dontrun.zip contains a few additional files that were present in the installtion folder, but not required to be run for any reason.\n\nUninstallation\n--------------\nTo uninstall, you can use the !uninstall.reg to remove the registry entries. Then you have to remove the Crimson Skies folder manually.\n\nRegistry Uninstallation - It only adds minimal nodes to your registry. If you want to get rid of them, advice you to open !uninstall.reg in a text editor and remove them manually from registry, or double click the file to remove automatically if you are sure. However if you are not confident about changing the registry, you can let them be.\n\nIf you have installed the fonts, it is upto you if you want to uninstall them.\n\n","torrent":{"xt":"urn:btih:3c9f16882c763a5e4b2880f159542b696ecbf9a8","amp;dn":"Crimson+Skies+-+Tested+on+Windows+7+x64+Ultimate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c9f16882c763a5e4b2880f159542b696ecbf9a8","infoHashBuffer":{"type":"Buffer","data":[60,159,22,136,44,118,58,94,75,40,128,241,89,84,43,105,110,203,249,168]},"announce":[],"urlList":[]}}