{"title":"Applied Materials Science - Deborah D.L. Chung","uid":15869321,"size":1687462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ca222c0647cffc0979fa42b94caf5b4297db58c&amp;dn=Applied+Materials+Science+-+Deborah+D.L.+Chung&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"clouderone","files":1,"time":1474410981,"description":"Applied Materials Science - Deborah D.L. Chung (CRC, 2001).pdf\r\n\r\nMaterials are the foundation of technology. As such, most universities provide engineering undergraduates with the fundamental concepts of materials science, including crystal structures, imperfections, phase diagrams, materials processing, and materials properties. Few, however, offer the practical, applications-oriented background that their students need to succeed in industry.\r\n\r\nApplied Materials Science: Applications of Engineering Materials in Structural, Electronics, Thermal, and Other Industries fills that gap. From a cross-disciplinary perspective that reflects both the multifunctionality of many materials and the wide scope industrial needs, the author examines the practical applications of metal, ceramic, polymer, cement, carbon, and composite materials across a broad range of industries. The topics addressed include electronic packaging, smart materials, thermal management, nondestructive evaluation, and materials development. The text is clear, coherent, and tutorial in style, includes numerous up-to-date references, and provides background material in a series of appendices.\r\n\r\nUnique in its breadth of coverage of both materials and their applications, Applied Materials Science is both scientifically rich and technologically relevant. If you work or teach those that aspire to work in an engineering capacity, you will find no text or reference that better prepares its readers for real-world applications of engineering materials","torrent":{"xt":"urn:btih:3ca222c0647cffc0979fa42b94caf5b4297db58c","amp;dn":"Applied+Materials+Science+-+Deborah+D.L.+Chung","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ca222c0647cffc0979fa42b94caf5b4297db58c","infoHashBuffer":{"type":"Buffer","data":[60,162,34,192,100,124,255,192,151,159,164,43,148,202,245,180,41,125,181,140]},"announce":[],"urlList":[]}}