{"title":"Blindspot - Season 1 - Episodes 1 thru 10","uid":13694670,"size":4894447436,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3cb0f544b72880a727baac7a9935e5f7f609e957&amp;dn=Blindspot+-+Season+1+-+Episodes+1+thru+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":9,"uploader":"POtHS11","files":18,"time":1456664846,"description":"\nS1, Ep1\r\n21 Sep. 2015\r\nPilot\r\nJane Doe gets discovered and together with a team of FBI agents, they try to discover her past and who she is.\r\n \r\nA Stray Howl\r\nS1, Ep2\r\n28 Sep. 2015\r\nA Stray Howl\r\nA tattoo points to an Air Force pilot with a difficult past; a disturbing memory haunts Jane; Weller believes he knows Jane's identity.\r\n \r\nEight Slim Grins\r\nS1, Ep3\r\n5 Oct. 2015\r\nEight Slim Grins\r\nA member of a jewel heist crew is caught during a robbery &amp; physical evidence shows he has unknown ties to Jane Doe. Someone from her past visits her but is unable to relay any useful information in time.\r\n \r\nBone May Rot\r\nS1, Ep4\r\n12 Oct. 2015\r\nBone May Rot\r\nPatterson and her puzzle-expert boyfriend, David decode a tattoo clue that sends the team to the Centers for Disease Control (CDC). While at the CDC, the team discovers a hidden message on Jane's body that uncovers a plot that could have catastrophic global consequences. Meanwhile, Jane and Weller grow closer.\r\n \r\nSplit the Law\r\nS1, Ep5\r\n19 Oct. 2015\r\nSplit the Law\r\nAfter a seemingly straightforward hostage situation turns out to have deeper international implications, the CIA and FBI find themselves racing against each other to apprehend the same criminal with a dark history. Carter expresses concern about Jane's trustworthiness, causing friction with Mayfair and testing Reade's loyalty to the team. Meeting Weller's family proves overwhelming for Jane as she grapples with her identity.\r\n \r\nCede Your Soul\r\nS1, Ep6\r\n26 Oct. 2015\r\nCede Your Soul\r\nWhen an assassination leads the team to a dangerous app that allows criminals to track government vehicles, they have to work with the app's surprising creator to take it down. Jane and Weller attempt to keep their relationship professional. Zapata struggles with a moral issue.\r\n \r\nSent on Tour\r\nS1, Ep7\r\n2 Nov. 2015\r\nSent on Tour\r\nOne of Jane's tattoos sends the team to a remote location where they find themselves face to face with a dangerous criminal in a case that puts Jane and Weller's strained relationship to the test and threatens to expose Mayfair's secrets. Meanwhile, Patterson breaks the rules to solve a tattoo puzzle.\r\n \r\nPersecute Envoys\r\nS1, Ep8\r\n9 Nov. 2015\r\nPersecute Envoys\r\nAfter a police officer is murdered, Patterson unlocks a disturbing tattoo that appears to have predicted his killing, and the team chases a violent clue trail to stop further attacks. Mayfair reveals secrets from her past to Weller, seriously testing their relationship.\r\n \r\nAuthentic Flirt\r\nS1, Ep9\r\n16 Nov. 2015\r\nAuthentic Flirt\r\nJane and Weller go undercover as a top-notch assassin couple in order to protect some lethal info. Meanwhile, David tries to repair his relationship with Patterson; and Carter and Mayfair disagree about how to deal with a menacing person.\r\n \r\nEvil Handmade Instrument\r\nS1, Ep10\r\n23 Nov. 2015\r\nEvil Handmade Instrument\r\nSleeper spies get activated and prepare for assassinations so the team rushes to stop them","torrent":{"xt":"urn:btih:3cb0f544b72880a727baac7a9935e5f7f609e957","amp;dn":"Blindspot+-+Season+1+-+Episodes+1+thru+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cb0f544b72880a727baac7a9935e5f7f609e957","infoHashBuffer":{"type":"Buffer","data":[60,176,245,68,183,40,128,167,39,186,172,122,153,53,229,247,246,9,233,87]},"announce":[],"urlList":[]}}