{"title":"UDEMY WEBSITE HACKING IN PRACTICE TUTORIAL","uid":12060060,"size":402614433,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3cf00328bdf2fba5db71d76f393b02765221f59a&amp;dn=UDEMY+WEBSITE+HACKING+IN+PRACTICE+TUTORIAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"RandalPaul","files":21,"time":1435231064,"description":"UDEMY WEBSITE HACKING IN PRACTICE TUTORIAL\n\nWelcome to Hacking School: Website Hacking in\nPractice course!\n\nBefore we begin the practical use of the training you are\ngoing to see has been proven by vast group of people\nbeginners and computer geeks as well. People who make their first\nsteps in computer / network security and professionals:\nnetwork administrators, programmers, black- and white hat\nhackers. Please, read carefully what we'd like to share with\nyou\n\nThe course covers all important hacking techniques\nused by hackers and system administrators. About\nthe Ethical Hacking Training course (what you can\nexpect):\n\n* It is a step by step training on Website and\nWeb-application ethical hacking and security\n* It covers almost all of the Top 10 Most Critical Web\nApplication Attacks presented yearly by OWASP organization (Open\nWeb Application Security Project) + 10 common techniques /\nvulnerabilities more\n* It can be treated as a valuable source of knowledge for any\nwhite hat hacker, web developer, system administrator or IT\nsecurity consultant\n* You will learn how to hack using 21 interesting techniques and\nsee how each of them can be used in a practical\nreal-life example\n* You will get access to all the lectures in PDF\nformat and live Ethical Hacking Video Training\nsessions you can watch on-line\n* Every lecture also contains a video session\ntranscript with screen shots - you can print it\nand use it during your training\n* Finally you will be provided with all the source codes and\nexamples shown in the course. You can simply download the zip\npackage from our server [proxy]\n\nWHAT YOU WILL LEARN in this Ethical Hacking Training:\n\n* Module 01. Introduction and environment\nconfiguration - you will learn how to configure\nand prepare your system for the further training\nAll you need is a Windows system\n* Module 02. Deep data hiding\n* Module 03. Brute-force and dictionary attacks\nyou will get to know how an attacker could perform a\nbrute-force or a dictionar attack on your website or web\napplication containing a password protected data\n* Module 04. Account lockout attack\n* Module 05. Web parameter tampering - you will learn how to\ntamper hidden data used by websites. You will use the\npresented technique in a real-life example. Very important\nlesson\n* Module 06. Path and information disclosure\n* Module 07. Forced browsing - you will see how an\nattacker could &quot;sniff&quot; a sensitive data from a\nwebsite using a forced browsing\n* Module 08. Path traversal - you will learn a path\ntraversal method and use it in practice in your\ntraining environment\n* Module 09. Unicode encoding - encoding related\nvulnerabilities\n* Module 10. Parameter delimiter - you will learn how to take\nadvantage of input filtering bugs. After this lesson you will be\nable to create an admin account - of course without having the\nadministrator privileges\n* Module 11. PHP injection - you will be demonstrated a PHP\ncode injection practical attack. Very important lesson. You will\nsee how a malicious data can be injected into a website, e.g\nusing a crafted image or text string\n* Module 12. Direct static code injection - you\nwill learn what a ststic code injection is and how\nit could be used by an attacker\n* Module 13. SQL injection - one of the TOP3\ntechniques used by attackers nowadays. Step by\nstep practical demonstration. You can hack the\ntraining website yourself (without harming\nanybody)\n* Module 14. XSS - Cross Site Scripting attack - you will see\nfor yourself why XSS is considered the most popular hackers'\ntarget. By the end on this lesson you will intercept a user\nsession\n* Module 14B. XST - Cross Site Tracing attack\n* Module 15. XSRF - Cross Site Request Forgery attack - you will\nlearn how an attacker can force an unaware user to reset a\npassword\n* Module 16. Spying on data with a browser - no\nadditional comment needed\n* Module 17. Session hijacking - lesson on session\nhijacking and consequences\n* Module 18. Session fixation\n* Module 19. Phishing - one of the most popular\nattacks. You will learn some tips to protect\nagainst it\n* Module 20. Automated security testing - you will be taught\nusing automated security testing tools and learn what white\nblack and grey box testing is. Useful knowledge for web\ndevelopers and IT security consultants\n\nIN EACH MODULE YOU WILL ALSO SEE HOW YOU CAN PROTECT YOUR\nWEBSITE OR WEB APPLICATION AGAINST EVERY VULNERABILITY DESCRIBED\nIN THE COURSE. MODULES ARE DIVIDED INTO: 1)\nTHEORETICAL INTRODUCTION, 2) PRACTICAL ATTACK\nEXAMPLE, 3) SECURITY GUIDANCE\n\nWHAT YOU NEED TO KNOW BEFORE YOU BEGIN:\n\n* This ethical hacking course is intended to help you\nregardless of your current knowledge and skills. All you need\nis a basic computer knowledge and a Windows system\n* We will show you how to prepare your training environment. In\nthis environment you can experiment freely, without doing harm to\nanybody\n* All the modules were recorded in Windows 7 (from the attacker /\nvictim point of view) but it doesn't mean that the presented\ntechniques apply only to Windows. Most of them are OS\nindependent\n* You will download the ZIP package with all the\nsource codes and examples from our server before\nyou begin to avoid unnecessary code retyping\n* Every module (lesson) contains the attack related\npart, as well as a guidance to protect your own\nwebsite, web application or web server\n\nWhat you will find inside can also be used by beginners - thanks\nto live Video Training attached to the course. Almost every\nmodule covered inside has been presented by a professional web\ndeveloper\n\nPlease be advised that all the techniques presented in &quot;Website\nHacking in Practice&quot; course can only be used\nethically and in your own testing / researching\nenvironment. Note that you will get all the\nrequired tools and information to prepare your own\ntraining system. Please see the Legal information\nin the 1st section for further legal reference\n\nWe guarantee your 100% satisfaction or you will get your money\nback. You have 30 days to decide if the &quot;Website Hacking in\nPractice&quot; training is for you. You will get access to the\nwhole system. If for any reason you're not satisfied with your\ntraining, we will give you full refund. No questions asked\n\nWe wish you the best\nThe Hacking School Team","torrent":{"xt":"urn:btih:3cf00328bdf2fba5db71d76f393b02765221f59a","amp;dn":"UDEMY+WEBSITE+HACKING+IN+PRACTICE+TUTORIAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cf00328bdf2fba5db71d76f393b02765221f59a","infoHashBuffer":{"type":"Buffer","data":[60,240,3,40,189,242,251,165,219,113,215,111,57,59,2,118,82,33,245,154]},"announce":[],"urlList":[]}}