{"title":"Lonely Planet - Discover Europe - 3rd Ed (2013).epub Gooner","uid":13645729,"size":250897693,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d3e19b488238c261cd5014c3c9142445058e12f&amp;dn=Lonely+Planet+-+Discover+Europe+-+3rd+Ed+%282013%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1456163117,"description":"Lonely Planet - Discover Europe (Travel Guide) - 3rd Edition (2013).epub Gooner\r\n\r\nPublisher: Lonely Planet; 3 edition (December 1, 2013)\r\nLanguage: English\r\nISBN-10: 1742205631\r\nISBN-13: 978-1742205632\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet's Discover Europe is your passport to all the most relevant and up-to-date advice on what to see, what to skip and what hidden discoveries await you. Wander the corridors of Versailles, gaze up at the Sistine Chapel's remarkable ceiling and sip ale in historic London pubs, all with your trusted travel companion. Discover the best of Europe and begin your journey now!\r\n\r\nInside Lonely Planet's Discover Europe:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\r\n\r\n* Insider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - including hours of operation, phone numbers, websites, transit tips and prices\r\n\r\n* Honest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping and hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer and more rewarding travel experience - including give you a richer and more rewarding travel experience - including history, art, architecture, family travel, food &amp; drink and landscapes\r\n\r\n* Over 70 colour maps\r\n\r\n* Useful features - including Itineraries, Month by Month (annual festival calendar) and 24 illustrated features\r\n\r\n* Coverage of Austria, Belgium, Britain, the Czech Republic, France, Germany, Greece, Ireland, Italy, the Netherlands, Spain and Switzerland\r\n\r\nThe Perfect Choice: Lonely Planet's Discover Europe, our easy-to-use guide, is perfect for travelers who seek the most popular attractions a destination has to offer. Filled with inspiring and colorful photos, this guide focuses on the best of the best.\r\n\r\n* Looking for just a few of the destinations included in this guide? Check out the relevant Lonely Planet Travel Guides, our most comprehensive guides that cover both the top sights and take the roads less traveled, or Lonely Planet's Discover Guides, which are photo-rich guides to those countries' most popular attractions.\r\n\r\nAuthors: Written and researched by Lonely Planet, Oliver Berry, Alexis Averbuck, Mark Baker, Kerry Christiani, Mark Elliott, Duncan Garwood, Anthony Ham, Virginia Maxwell, Craig McLachlan, Andrea Schulte-Peevers, Ryan Ver Berkmoes, Nicola Williams, Neil Wilson\r\n\r\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places they find themselves in","torrent":{"xt":"urn:btih:3d3e19b488238c261cd5014c3c9142445058e12f","amp;dn":"Lonely+Planet+-+Discover+Europe+-+3rd+Ed+%282013%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d3e19b488238c261cd5014c3c9142445058e12f","infoHashBuffer":{"type":"Buffer","data":[61,62,25,180,136,35,140,38,28,213,1,76,60,145,66,68,80,88,225,47]},"announce":[],"urlList":[]}}