{"title":"Mark Of The Ninja Special Edition (GOG)","uid":11196490,"size":2562329010,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3e0eb25cda9dbd6e53af2b2f46784867cc49ab39&amp;dn=Mark+Of+The+Ninja+Special+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":3,"uploader":"Sarah116","files":-1,"time":1413097589,"description":"Hey, here Mark of the ninja. This is the special edition of the game. Hope you enjoy and please help seed.\n\n\n--------------\n\n\nIncluded FREE goodies: \n\n* 3 wallpapers\n\n* 3 avatars\n\n\n--------------\n\n\nIn Mark of the Ninja: Special Edition, you'll know what it is to truly be a ninja. You must be silent, agile and clever to outwit your opponents in a world of gorgeous scenery and flowing animation. Marked with cursed tattoos giving you heightened senses, every situation presents you with options. Will you be an unknown, invisible ghost, or a brutal, silent assassin? Mark of the Ninja: Special Edition expands the critically-acclaimed 2D stealth experience not only with new challenges and tools, but by adding developer commentary throughout the entire game. This Special Edition encourages playing Mark of the Ninja in new ways, experimenting with new techniques and learning more about the game's development and the team who created it.\n\n\n   \n* Includes: Mark of the Ninja and Mark of the Ninja: Special Edition Upgrade.\n   \n* True Stealth Experience - Player-centric gameplay rewards choice, be it finishing the game without killing anyone or assassinating all who stand in your way\n   \n* Stunning Visuals - Unique 2D visual style featuring award-winning animation and hand-painted environments.\n \n* Deep Experience - Each level has three score challenges, optional objectives and hidden collectibles. A diversity of unlockable abilities, items and play styles allow exploring many avenues of play.\n \n* Developer Commentary - Over 25 pages of commentary, written by many members of the team and distributed throughout the game, provides interesting insights andabout Mark of the Ninja's development\n\n\n---------------\n &lt;a href=&quot;\nhttp://www.gog.com/game/mark_of_the_ninja_special_edition&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/mark_of_the_ninja_special_edition&lt;/a&gt;","torrent":{"xt":"urn:btih:3e0eb25cda9dbd6e53af2b2f46784867cc49ab39","amp;dn":"Mark+Of+The+Ninja+Special+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e0eb25cda9dbd6e53af2b2f46784867cc49ab39","infoHashBuffer":{"type":"Buffer","data":[62,14,178,92,218,157,189,110,83,175,43,47,70,120,72,103,204,73,171,57]},"announce":[],"urlList":[]}}