{"title":"Enemy at the Gates: The Battle for Stalingrad","uid":15810998,"size":4320296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e3a1843e01ea1c1182c36f736e8f312540504c3&amp;dn=Enemy+at+the+Gates%3A+The+Battle+for+Stalingrad&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"marty14","files":1,"time":1473635580,"description":"Enemy at the Gates: The Battle for Stalingrad - William Craig [epub]\r\n\r\nOn August 5, 1942, giant pillars of dust rose over the Russian steppe, marking the advance of the 6th Army, an elite German combat unit dispatched by Hitler to capture the industrial city of Stalingrad and press on to the oil fields of Azerbaijan. The Germans were supremely confident; in three years, they had not suffered a single defeat.The Luftwaffe had already bombed the city into ruins. German soldiers hoped to complete their mission and be home in time for Christmas.\r\n \r\nThe siege of Stalingrad lasted five months, one week, and three days. Nearly two million men and women died, and the 6th Army was completely destroyed. Considered by many historians to be the turning point of World War II in Europe, the Soviet Army’s victory foreshadowed Hitler’s downfall and the rise of a communist superpower.\r\n\r\nBestselling author William Craig spent five years researching this epic clash of military titans, traveling to three continents in order to review documents and interview hundreds of survivors. Enemy at the Gates is the enthralling result: the definitive account of one of the most important battles in world history. It became a New York Times bestseller and was also the inspiration for the 2001 film of the same name, starring Joseph Fiennes and Jude Law","torrent":{"xt":"urn:btih:3e3a1843e01ea1c1182c36f736e8f312540504c3","amp;dn":"Enemy+at+the+Gates%3A+The+Battle+for+Stalingrad","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e3a1843e01ea1c1182c36f736e8f312540504c3","infoHashBuffer":{"type":"Buffer","data":[62,58,24,67,224,30,161,193,24,44,54,247,54,232,243,18,84,5,4,195]},"announce":[],"urlList":[]}}