{"title":"Built to Last: Successful Habits of Visionary Companies OnlyGill","uid":7138500,"size":6693870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e54667f5ce4fe426d4a55b9b641a7e9324b4011&amp;dn=Built+to+Last%3A+Successful+Habits+of+Visionary+Companies+OnlyGill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"OnlyGill","files":2,"time":1332929338,"description":"[b]Built to Last: Successful Habits of Visionary Companies[/b]\n&quot;This is not a book about charismatic visionary leaders. It is not about visionary product concepts or visionary products or visionary market insights. Nor even is it about just having a corporate vision. This is a book about something far more important, enduring, and substantial. This is a book about visionary companies.&quot; So write James C. Collins and Jerry I. Porras in this groundbreaking book that shatters myths, provides new insights, and gives practical guidance to those who would like to build landmark companies that stand the test of time.Drawing upon a six-year research project at the Stanford University Graduate School of Business, Collins and Porras took eighteen truly exceptional and long-lasting companies -- they have an average age of nearly one hundred years and have outperformed the general stock market by a factor of fifteen since 1926 -- and studied each company in direct comparison to one of its top competitors. They examined the companies from their very beginnings to the present day -- as start-ups, as midsize companies, and as large corporations. Throughout, the authors asked: &quot;What makes the truly exceptional companies different from other companies?&quot;What separates General Electric, 3M, Merck, Wal-Mart, Hewlett-Packard, Walt Disney, and Philip Morris from their rivals? How, for example, did Procter &amp; Gamble, which began life substantially behind rival Colgate, eventually prevail as the premier institution in its industry? How was Motorola able to move from a humble battery repair business into integrated circuits and cellular communications, while Zenith never became dominant in anything other than TVs? How did Boeing unseat McDonnell-Douglas as the world's best commercial aircraft company -- what did Boeing have that McDonnell-Douglas lacked?By answering such questions, Collins and Porras go beyond the incessant barrage of management buzzwords and fads of the day to discover timeless qualities that have consistently distinguished outstanding companies. They also provide inspiration to all executives and entrepreneurs by destroying the false but widely accepted idea that only charismatic visionary leaders can build visionary companies.Filled with hundreds of specific examples and organized into a coherent framework of practical concepts that can be applied by managers and entrepreneurs at all levels, Built to Last provides a master blueprint for building organizations that will prosper long into the twenty-first century and beyond.","torrent":{"xt":"urn:btih:3e54667f5ce4fe426d4a55b9b641a7e9324b4011","amp;dn":"Built+to+Last%3A+Successful+Habits+of+Visionary+Companies+OnlyGill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e54667f5ce4fe426d4a55b9b641a7e9324b4011","infoHashBuffer":{"type":"Buffer","data":[62,84,102,127,92,228,254,66,109,74,85,185,182,65,167,233,50,75,64,17]},"announce":[],"urlList":[]}}