{"title":"Brian Weiss - 5 Books (gnv64)","uid":8293745,"size":29403697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e9fe06095a330c0a90fd52732c990b358226aae&amp;dn=Brian+Weiss+-+5+Books+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"gnv65","files":-1,"time":1364116569,"description":"About the Author\nBrian Leslie Weiss (born November 6, 1944), M.D., is an American psychiatrist. His research includes reincarnation, past life regression, future-life progression and survival of the human soul after death.\nWeiss graduated from the Yale University School of Medicine in 1970, completing an internship in internal medicine at the New York University Medical Center then returning to Yale for a two-year residency in psychiatry.[1] He is the Chairman Emeritus of the Department of Psychiatry at the Mount Sinai Medical Center in Miami.\nWeiss currently lives with his wife Carole in Miami, Florida, where he writes and conducts public seminars on the subject of reincarnation.\n\nHis Works:\n- Many Lives, Many Masters: The True Story of a Prominent Psychiatrist, His Young Patient, and the Past-Life Therapy That Changed Both Their Lives (1988). ISBN 0-671-65786-0\n- Through Time into Healing: Discovering the Power of Regression Therapy to Erase Trauma and Transform Mind, Body and Relationships (1993). ISBN 0-7499-1835-7.\n- Only Love Is Real: A Story of Soulmates Reunited (1997) ISBN 0-7499-1620-6.\n- Messages From the Masters: Tapping into the Power of Love (2001). ISBN 0-7499-2167-6\n- Mirrors of Time: Using Regression for Physical, Emotional, and Spiritual Healing (2002). ISBN 1-5617-0929-8.\n- Same Soul, Many Bodies: Discover the Healing Power of Future Lives through Progression Therapy (2005). ISBN 0-7499-2541-8. ISBN 0-7432-6434-7.\n- Miracles Happen: The Transformational Healing Power of Past Life Memories (2012) ISBN 978-0-06-220122-5\n\nI was able to get 5 of his 7 books all of which I have scanned &amp; presented here. They are all in PDF format with OCR, bookmarks &amp; covers. If someone has rhe remaining 2 books, Kindly share with us!","torrent":{"xt":"urn:btih:3e9fe06095a330c0a90fd52732c990b358226aae","amp;dn":"Brian+Weiss+-+5+Books+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e9fe06095a330c0a90fd52732c990b358226aae","infoHashBuffer":{"type":"Buffer","data":[62,159,224,96,149,163,48,192,169,15,213,39,50,201,144,179,88,34,106,174]},"announce":[],"urlList":[]}}