{"title":"The Time Traveler's Almanac - Ann Vandermeer, Jeff VanderMeer.ep","uid":10033472,"size":1362102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ed311d580947bb756e66b2f01a6c1ec4eb6479f&amp;dn=The+Time+Traveler%27s+Almanac+-+Ann+Vandermeer%2C+Jeff+VanderMeer.ep&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1398369114,"description":"The Time Traveler's Almanac is the largest and most definitive collection of time travel stories ever assembled. Gathered into one volume by intrepid chrononauts and world-renowned anthologists Ann and Jeff VanderMeer, this book compiles more than a century's worth of literary travels into the past and the future that will serve to reacquaint readers with beloved classics of the time travel genre and introduce them to thrilling contemporary innovations.This marvelous volume includes nearly seventy journeys through time from authors such as Douglas Adams, Isaac Asimov, Ray Bradbury, William Gibson, Ursula K. Le Guin, George R. R. Martin, Michael Moorcock, H. G. Wells, and Connie Willis, as well as helpful non-fiction articles original to this volume (such as Charles Yu's &quot;Top Ten Tips For Time Travelers&quot;).In fact, this book is like a time machine of its very own, covering millions of years of Earth's history from the age of the dinosaurs through to strange and fascinating futures, spanning the ages from the beginning of time to its very end. The Time Traveler's Almanac is the ultimate anthology for the time traveler in your life.","torrent":{"xt":"urn:btih:3ed311d580947bb756e66b2f01a6c1ec4eb6479f","amp;dn":"The+Time+Traveler%27s+Almanac+-+Ann+Vandermeer%2C+Jeff+VanderMeer.ep","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ed311d580947bb756e66b2f01a6c1ec4eb6479f","infoHashBuffer":{"type":"Buffer","data":[62,211,17,213,128,148,123,183,86,230,107,47,1,166,193,236,78,182,71,159]},"announce":[],"urlList":[]}}