{"title":"CISSP For Dummies- Fourth Edition [Epub]","uid":8805154,"size":3226879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ee62444e7032d2aff8e91824b61711109380fc9&amp;dn=CISSP+For+Dummies-+Fourth+Edition+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"F1restorm","files":-1,"time":1376269082,"description":"CISSP For Dummies- Fourth Edition\nAuthors: Lawrence Miller and Peter H Gregory\nPublished: 2012\nPublisher: Wiley\nFormat: Retail Epub\n___________________________________________________________________________\n\nA fully updated guide to CISSP certification\n\nCISSP certification is the most prestigious and highly valued of the security certifications. This is the book you need to approach the exam with confidence and become CISSP certified! The CISSP Body of Knowledge underwent many changes in 2012, and this book covers them all. With a down-to-earth approach, it provides all the information covered in the exam plus numerous self-assessment tools, Quick Assessment and Prep tests to give you practice, a sample exam, and hundreds of randomly generated review questions on the Dummies Test Engine, available on the companion website.\n\nThe coveted CISSP certification is the most prestigious of the security certifications; this popular guide covers all the latest updates to prepare you for the exam\nIncludes various self-assessment tools to help you gauge your progress, including Quick Assessment tests at the beginning of every chapter, a Prep Test at the end of every chapter, a sample exam, and hundreds of randomly generated test questions\nFeatures the popular Dummies Test Engine on the companion website\nOffers test-taking tips and plenty of resources for further study\nCISSP For Dummies, 4th Edition gives you the tools to take the CISSP exam with confidence and earn your certification!","torrent":{"xt":"urn:btih:3ee62444e7032d2aff8e91824b61711109380fc9","amp;dn":"CISSP+For+Dummies-+Fourth+Edition+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ee62444e7032d2aff8e91824b61711109380fc9","infoHashBuffer":{"type":"Buffer","data":[62,230,36,68,231,3,45,42,255,142,145,130,75,97,113,17,9,56,15,201]},"announce":[],"urlList":[]}}