{"title":"Al Green 18 Main Albums","uid":4866677,"size":1402093608,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f2a6858443ab2edcf9a0052925acf0bc329b552&amp;dn=Al+Green+18+Main+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"tamroi","files":220,"time":1240562196,"description":"Biography by Stephen Thomas Erlewine \nAl Green was the first great soul singer of the '70s and arguably the last great Southern soul singer. With his seductive singles for Hi Records in the early '70s, Green bridged the gap between deep soul and smooth Philadelphia soul. He incorporated elements of gospel, interjecting his performances with wild moans and wails, but his records were stylish, boasting immaculate productions that rolled along with a tight beat, sexy backing vocals, and lush strings. The distinctive Hi Records sound that the vocalist and producer Willie Mitchell developed made Al Green the most popular and influential soul singer of the early '70s, influencing not only his contemporaries, but also veterans like Marvin Gaye. Green was at the peak of his popularity when he suddenly decided to join the ministry in the mid-'70s. At first, he continued to record secular material, but by the '80s, he was concentrating solely on gospel. During the late '80s and '90s, he occasionally returned to R&amp;B, but he remained primarily a religious performer for the rest of his career. Nevertheless, Green's classic early- '70s recordings retained their power and influence throughout the decades, setting the standard for smooth soul.\n\nGreen was born in Forrest City, AR, where he formed a gospel quartet, the Green Brothers, at the age of nine. The group toured throughout the South in the mid-'50s, before the family relocated to Grand Rapids, MI. The Green Brothers continued to perform in Grand Rapids, but Al's father kicked the boy out of the group after he caught his son listening to Jackie Wilson. At the age of 16, Al formed an R&amp;B group, Al Green &amp; the Creations, with several of his high-school friends. Two Creation members, Curtis Rogers and Palmer James, founded their own independent record company, Hot Line Music Journal, and had the group record for the label. By that time, the Creations had been re-named the Soul Mates. The group's first single, &quot;Back Up Train,&quot; became a surprise hit, climbing to number five on the R&amp;B charts early in 1968. The Soul Mates attempted to record another hit, but all of their subsequent singles failed to find an audience.\n\nIn 1969, Al Green met bandleader and Hi Records vice president Willie Mitchell while on tour in Midland, Texas. Impressed with Green's voice, he signed the singer to Hi Records, and began collaborating with Al on his debut album. Released in early 1970, Green's debut album, Green Is Blues, showcased the signature sound he and Mitchell devised -- a sinewy, sexy groove highlighted by horn punctuations and string beds that let Green showcase his remarkable falsetto. While the album didn't spawn any hit singles, it was well-received and set the stage for the breakthrough success of his second album. Al Green Gets Next to You (1970) launched his first hit single, &quot;Tired of Being Alone,&quot; which began a streak of four straight gold singles. Let's Stay Together (1972) was his first genuine hit album, climbing to number eight on the pop charts; its title track became his first number one single. I'm Still in Love With You, which followed only a few months later, was an even greater success, peaking at number four and launching the hits &quot;Look What You Done for Me&quot; and &quot;I'm Still in Love With You.&quot;\n\nBy the release of 1973's Call Me, Green was known as both a hitmaker and an artist who released consistently engaging, frequently excellent, critically-acclaimed albums. His hits continued uninterrupted through the next two years, with &quot;Call Me,&quot; &quot;Here I Am,&quot; and &quot;Sha-La-La (Make Me Happy)&quot; all becoming Top Ten gold singles. At the height of his popularity, Green's former girlfriend, Mrs. Mary Woodson, broke into his Memphis home in October 1974 and poured boiling grits on the singer as he was bathing, inflicting second-degree burns on his back, stomach, and arm; after assaulting Green, she killed herself with his gun. Green interpreted the violent incident as a sign from God that he should enter the ministry. By 1976, he had bought a church in Memphis and had become an ordained pastor of the Full Gospel Tabernacle. Though he had begun to seriously pursue religion, he had not given up singing R&amp;B and he released three other Mitchell-produced albums -- Al Green Is Love (1975), Full of Fire (1976), Have a Good Time (1976) -- after the incident. However, his albums began to sound formulaic, and his sales started to slip by the end of 1976, with disco cutting heavily into his audience.\n\nIn order to break free from his slump, Green stopped working with Willie Mitchell in 1977 and built his own studio, American Music, where he intended to produce his own records. The first album he made at American Music was The Belle Album, an intimate record that was critically acclaimed but failed to win a crossover audience. Truth and Time (1978) failed to even generate a major R&amp;B hit. During a concert in Cincinnati in 1979, Green fell off the stage and nearly injured himself seriously. Interpreting the accident as a sign from God, Green retired from performing secular music and devoted himself to preaching. Throughout the '80s, he released a series of gospel albums on Myrrh Records. In 1982, Green appeared in the gospel musical Your Arms Too Short to Box With God with Patti Labelle. In 1985, he reunited with Willie Mitchell for He Is the Light, his first album for A&amp;M Records.\n\nGreen tentatively returned to R&amp;B in 1988 when he sang &quot;Put a Little Love in Your Heart&quot; with Annie Lennox for the Bill Murray comedy Scrooged. Four years later, he recorded his first full-fledged soul album since 1978 with the U.K.-only Don't Look Back. Al Green was inducted to the Rock &amp; Roll Hall of Fame in 1995. That same year, he released Your Heart's in Good Hands, an urban contemporary record that represented his first secular album to be released in America since Truth and Time. Though the album received positive reviews, it failed to become a hit. Green did achieve widespread recognition eight years later with his first album for Blue Note, I Can't Stop. One and a half years later, he followed it with Everything's OK. His third Blue Note album, 2008's Lay It Down, featured an updated sound that still echoed the feel of his classic earlier soul style.\n \n","torrent":{"xt":"urn:btih:3f2a6858443ab2edcf9a0052925acf0bc329b552","amp;dn":"Al+Green+18+Main+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f2a6858443ab2edcf9a0052925acf0bc329b552","infoHashBuffer":{"type":"Buffer","data":[63,42,104,88,68,58,178,237,207,154,0,82,146,90,207,11,195,41,181,82]},"announce":[],"urlList":[]}}