{"title":"Wall Street Warriors - Season 1 &amp; 2","uid":6381723,"size":2935074816,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3f651ab9d508e349aa320ed4f4514c660d504771&amp;dn=Wall+Street+Warriors+-+Season+1+%26+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"anon001","files":16,"time":1305052251,"description":"Wall Street Warriors Season 1 &amp; 2, Complete:\n\n\n\nWall Street Warriors Season 1:\n\nWall Street Warriors follows the daily lives of ten successful individuals who deal in millions in the marketplace. As the series unfolds, some lives intersect in surprising ways, as financial big shots are whisked by limo from the frenzied American Stock Exchange trading floor to exclusive dinners, to posh midtown offices, to homes and families, down to fast paced Wall Street, or off to the polo grounds of the Hamptons.\n\nTake a step into a world rarely seen from the outside, in a heart pounding series that follows the most brilliant, driven and competitive power brokers of the financial world when millions are at stake every minute.\n\nGreed and arrogance run rampant on Wall Street, making it home to some of the most stressful jobs on earth. There is only one bottom line on Wall Street: how much money you make.\n\n\n\nWall Street Warriors Season 2:\n\nWelcome back to Wall Street, the land of raging bulls and hungry bears, where winners wheel and deal and losers crash and burn. Witness the extreme power and intense competition that defines Wall Street through the eyes of those who thrive there - from seasoned veterans and established traders to ambitious newbies fresh out of school - in an all new season.After the closing bell, follow these six players as they are jetted off to their second homes in the Hamptons and to weekend vacations in fabulous destinations. But don?t be fooled by the mansion parties and luxurious vacation activities- for these Wall Street Warriors, the networking never stops. Get an inside look at the fast-paced lives and take-no-prisoners attitudes of MOJO?s Wall Street Warriors, Season 2.","torrent":{"xt":"urn:btih:3f651ab9d508e349aa320ed4f4514c660d504771","amp;dn":"Wall+Street+Warriors+-+Season+1+%26+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f651ab9d508e349aa320ed4f4514c660d504771","infoHashBuffer":{"type":"Buffer","data":[63,101,26,185,213,8,227,73,170,50,14,212,244,81,76,102,13,80,71,113]},"announce":[],"urlList":[]}}