{"title":"Might and Magic 7 - For Blood and Honor GoG","uid":8147594,"size":832494757,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3fabd677016a82bcd45fac2e246b4f0b82eaa3cd&amp;dn=Might+and+Magic+7+-+For+Blood+and+Honor+GoG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"AN0NYMOUS142857","files":-1,"time":1360962431,"description":"Might and Magic 7: For Blood and Honor is a first-person perspective cRPG and is considered by many to be the best installment of the series.\nA deep, involving storyline with memorable characters and many endings is to be expected of a game with such a strong pedigree, and there's enough of it to keep you busy for weeks. The story comes packed with great presentation, especially its absolutely phenomenal musical score.\nWhat's more, if you're a fan of Heroes of Might and Magic, you're in for a treat, as you'll no doubt recognize many of the monsters from the third part of the series.\nFinally, Might and Magic 7 features its very own trading card game, called Acromage. Its rules are simple, but it's a full game in its own right and you might end up playing the RPG just to feed your Arcomage addiction!\nWhat's cool about it:\n\n    * Arguably the best installment of the Might and Magic series.\n    * Over a hundred hours of great adventure in the Might and Magic universe.\n    * A great soundtrack, an epic story, memorable locations and an addictive card game: Arcomage!\n\nOverview:\n\nTo experience great adventures, you ll have to take a step back in time. Might and Magic VII - For Blood and Honor brings back the fantasy role-playing genre with an enhanced game engine and thrilling gameplay. It brings to life a fantasy world replete with fearsome dragons, horrifying monsters and exotic races. This game has everything the experienced role-player desires, including new character classes, skills, spells, magic items and a compelling story that will keep you absorbed for hours on end. Might and Magic VII - For Blood and Honor brings to life the most fantastic, engrossing and intense role-playing experience ever created.\n\nAge requirements: ESRB Rating: TEEN with Animated Violence, Animated Blood.\n\nMinimum system requirements: Windows XP or Windows Vista, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 8 (compatible with DirectX 9 recommended), 4GB HDD, CD/DVD drive (or drive emulation utility), Mouse, Keyboard.\nInstall and play!","torrent":{"xt":"urn:btih:3fabd677016a82bcd45fac2e246b4f0b82eaa3cd","amp;dn":"Might+and+Magic+7+-+For+Blood+and+Honor+GoG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fabd677016a82bcd45fac2e246b4f0b82eaa3cd","infoHashBuffer":{"type":"Buffer","data":[63,171,214,119,1,106,130,188,212,95,172,46,36,107,79,11,130,234,163,205]},"announce":[],"urlList":[]}}