{"title":"Medal Of Honor - Allied Assault War Chest GOG","uid":7902076,"size":2909029640,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3fdb230c1608dea358407a135b2ca3adc8eadd6c&amp;dn=Medal+Of+Honor+-+Allied+Assault+War+Chest+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":4,"uploader":"AN0NYMOUS142857","files":-1,"time":1354986958,"description":"Genre: Shooter / FPP / Historical \nRelease date: March 2, 2004 \nCompatible with: Windows (XP, Vista, 7, 8) \nDeveloper / Publisher: Electronic Arts \nGame modes: single-player, multi-player \nESRB Rating: Teen with Violence. PEGI Rating: 12+ with Violence. \n\nMultiplayer notice: The game's multiplayer servers are no longer supported by the publisher and the only option available is LAN (no CD-key required). \n\n=== \n\nBecome part of an Army Ranger team as you battle your way through enemy-infested towns, regain control of the Atlantic, and establish a beachhead as part of the D-Day invasion force on Omaha Beach in Medal of Honor: Allied Assault. Medal of Honor: Allied Assault - Spearhead chronicles the last year of the war on the European front. Parachute behind enemy lines during Operation Overlord, halt the German offensive during the Battle of the Bulge, and engage the German forces as they desperately try to defend the heart of the Reich, Berlin. In Medal of Honor: Allied Assault - Breakthrough, you ll join U.S. Army Sergeant John Baker as fights in the battle at Kasserine Pass in North Africa, race to capture Messina in Sicily, and finally repel the German army at the historic battle of Monte Battaglia in the heart of Italy. \n\nMedal of Honor: Allied Assault War Chest is a treasure trove of historical battles presented as a gritty World War II action FPS. Call in artillery and air strikes against the opposing forces and keep your squad away from the jaws of defeat and despair. Drive various assault vehicles, always charging onwards to victory. Uncle Sam wants YOU! \n\nFeatures: \n    - Medal of Honor: Allied Assault War Chest includes Medal of Honor: Allied Assault and its two expansions: Spearhead and Breakthrough. \n    - Wage war in vast and stunning locales--from North Africa to Norway, occupied France all the way to the heart of Germany. \n    - Over 48 carefully researched and authentic weapons from World War II. \n\n=== \n\nIncludes: \n  * manuals \n  * wallpapers \n  * strategy guides \n  * Valor in Victory interviews \n  * avatars \n  * artwork \n\nInstall and Play.","torrent":{"xt":"urn:btih:3fdb230c1608dea358407a135b2ca3adc8eadd6c","amp;dn":"Medal+Of+Honor+-+Allied+Assault+War+Chest+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fdb230c1608dea358407a135b2ca3adc8eadd6c","infoHashBuffer":{"type":"Buffer","data":[63,219,35,12,22,8,222,163,88,64,122,19,91,44,163,173,200,234,221,108]},"announce":[],"urlList":[]}}