{"title":"Cisco IOS for Dynamips Dynagen and GNS3 - Dec2009","uid":5220251,"size":11043926262,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:3feac61e02b6dd9a79a84e98b38f374d1fcafaa5&amp;dn=Cisco+IOS+for+Dynamips+Dynagen+and+GNS3+-+Dec2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"armadillo1984","files":4,"time":1260903809,"description":"Cisco IOS for Dynamips, Dynagen and GNS3 - December 2009\n----------------------------------------------------------\n\nThis is my collection of Cisco IOS for use with Dynamips.\n\nThe originals .bin files has been unzipped and renamed to .image,\nand recompressed with RAR to save disk space. Dynamips works\nbetter with an unzipped IOS, the router boot faster. You need\nto decompress the file with WinRar, UnRar, 7Zip, etc, to obtain\nthe .image file and store it in the image folder.\n\nThis compilation includes several IOS for PIX (IOS and ASDM) and\nspecial IOS called Pagent and Callgen.\n\nPagent is a set of data networking test tools, based on the\nCisco IOS (Internetwork Operating System) and developed\nwithin Cisco. The test tools are included in special IOS\nPagent images.\n\nCallgen is a set of Voice-Over-IP networking test tools,\nbased on the Cisco IOS and developed within Cisco. The\ntest tools are included in special IOS Callgen images.\n\nThe primary function of the Pagent and Callgen toolsets\nis to provide cost effective test tools to the Cisco testing\ncommunity. The secondary function is to provide testing\ncapabilities that are not available anywhere else and can be\nused in customer environments. One essential function is to\ngenerate valid simulated traffic necessary for testing\nnetworks under stress. The tools are not able to test the\nphysical network layer and some parts of the data-link layer;\nthat is, they can not affect frame checksums, preambles, inter\nframe gap times, inject hardware failures, or transmit invalid\npacket sizes.\n\nThe Pagent programs are best used for testing layer 3\nprotocols and above; that is, emulating routing protocols,\nmulticast, TCP sessions and HTTP sessions.\n\nPagent is an enhanced Cisco IOS image that contains both\nAdvanced IP or IP Base Services and the IP traffic generation\ntools. Pagent generates realistic traffic and bottlenecks to\ntest QoS features such as IP Classification, IP Marking, and\nQueuing.\n\nCallGen is a Cisco IOS-based bulk call generation tool\nimplemented through extensions to the regular Cisco IOS image,\nwhich provides commands and utilities used to simulate\noriginating and terminating calls on routers and access servers.\n\nThe file &quot;Patch for Dynamips.txt&quot; contains the instructions\nfor patch Dynamips (for use with Dynagen or GNS3) to use this IOS.\n\nIn every folder, the TXT file includes the description of\nall IOS: name, features and RAM memory in Mb.\n","torrent":{"xt":"urn:btih:3feac61e02b6dd9a79a84e98b38f374d1fcafaa5","amp;dn":"Cisco+IOS+for+Dynamips+Dynagen+and+GNS3+-+Dec2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3feac61e02b6dd9a79a84e98b38f374d1fcafaa5","infoHashBuffer":{"type":"Buffer","data":[63,234,198,30,2,182,221,154,121,168,78,152,179,143,55,77,31,202,250,165]},"announce":[],"urlList":[]}}