{"title":"The Epic of Gilgamesh (3 translations)","uid":9434297,"size":30821646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ff34df02dbfb3f270927c4baa88ca866e5013fc&amp;dn=The+Epic+of+Gilgamesh+%283+translations%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"workerbee","files":-1,"time":1388867961,"description":"\nTHE EPIC OF GILGAMESH, an epic poem from Mesopotamia, is one the earliest surviving works of literature.\n\nThe Babylonians believed the poem to have been the responsibility of a man called Sin-liqe-unninni, a learned scholar of Uruk whom modern scholars consider to have lived some time between 1300-1000 BC.  However, we now know that &quot;He who saw the Deep&quot; is a revision of one or more earlier versions of the epic.  The oldest surviving fragments of the epic are the work of an anonymous Babylonian poet writing more than 3700 years ago.  The Babylonian epic was composed in Akkadian, but its literary origins lie in five Sumerian poems of even greater antiquity.  The Sumerian texts gained their final form probably as court entertainments sung for King Shulgi of Ur of the Chaldees, who reigned in the 21st century BC.\n\n\nThree modern translations are presented here -- a prose translation by N. K. Sandars, originally published in 1960, and two newer verse translations by Andrew George (1999) and Stephanie Dalley (2000), both of which feature more extensive critical apparatus:\n\n* THE EPIC OF GILGAMESH (Penguin Classics, 1972).  Revised edition incorporating new material.  Translated by N. K. Sandars. -- EPUB\n\n* THE EPIC OF GILGAMESH: The Babylonian Epic Poem and Other Texts in Akkadian and Sumerian (Penguin Classics, 1999).  Translated by Andrew George. -- PDF\n\n* MYTHS FROM MESOPOTAMIA: Creation, the Flood, Gilgamesh, and Others (Oxford World's Classics, 2000).  Revised edition.  Edited and translated by Stephanie Dalley. -- PDF\n","torrent":{"xt":"urn:btih:3ff34df02dbfb3f270927c4baa88ca866e5013fc","amp;dn":"The+Epic+of+Gilgamesh+%283+translations%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff34df02dbfb3f270927c4baa88ca866e5013fc","infoHashBuffer":{"type":"Buffer","data":[63,243,77,240,45,191,179,242,112,146,124,75,170,136,202,134,110,80,19,252]},"announce":[],"urlList":[]}}