{"title":"Dungeon of Cum - DOCR - Sep 12, 2016 - Ginger Lee Fix","uid":16008558,"size":270526926,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:401141ed67807244078134d4575802e01faa5868&amp;dn=Dungeon+of+Cum+-+DOCR+-+Sep+12%2C+2016+-+Ginger+Lee+Fix&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":10,"uploader":"merzedes","files":207,"time":1476207822,"description":"&quot;Sexy Southern Slut&quot; \r\nDungeon of Cum : Redux\r\n Ginger Lee\r\n\r\nMp4 + Pics. \r\n\r\nOtto Bauer is one lucky man as he gets to take a bite of the juicy southern peach Ginger Lee. To start things off, Ginger is gagged and tied naked in a compromising and vulnerable position for Mr. Bauer. Otto walks in and immediately goes to work on Ginger's fantastic little body, by tagging her ass, thighs and pussy with some good slaps. Then, he heads south and gets a nice, long taste of her freshly shaven cunt. Next, he breaks out the magic wand and gives Ginger a nice hard vibing before clamping her hot little nipples with some clothes pins. With Ginger's nipples clamped, Otto breaks his cock out and violates her a bit from behind. Now that the juices are flowing, we suspend Ginger ass up from the ceiling. Seeing that wide open gash, Otto seizes the opportunity to again shove his cock into Ginger, wisely using Ginger's suspension ropes to gain traction to slam her cunt even harder. After getting a good pussy fucking, it's time for Ginger to give some head. Otto hastily removes her gag only to gag her with his cock instead. This sets up another trademark face to pussy volley by Otto as he inserts his shaft into her cunt then mouth. Finally, we get Ginger tied doogie style to a metal bench. Again, Otto enters her brutally from behind. And then, we fasten our seat belts as Otto unleashes a mind blurring, face and pussy fucking fury that culminates in Ginger taking a massive load in her cute, little, southern belle mouth\r\n\r\nScreens \r\n    \nhttp://www.dungeoncorp.com/updates16/DRE/GIN_060407/index.php\r\n\r\nUploaded by Merzedes and Shallow2 \r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect. \r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:) \r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!! \r\n\r\nAny Questions ?? Read our FAQ!! \r\n    \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg \r\n    \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg \r\n\r\nCheers :-) \r\n\r\nKAT RIP","torrent":{"xt":"urn:btih:401141ed67807244078134d4575802e01faa5868","amp;dn":"Dungeon+of+Cum+-+DOCR+-+Sep+12%2C+2016+-+Ginger+Lee+Fix","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"401141ed67807244078134d4575802e01faa5868","infoHashBuffer":{"type":"Buffer","data":[64,17,65,237,103,128,114,68,7,129,52,212,87,88,2,224,31,170,88,104]},"announce":[],"urlList":[]}}