{"title":"Far Cry 4 [v1.10] Complete Edition - RePack by CorePack","uid":12971936,"size":10381960757,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:41730942d794cbd0d0f70d954cbc9004e4ab695b&amp;dn=Far+Cry+4+%5Bv1.10%5D+Complete+Edition+-+RePack+by+CorePack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":3,"uploader":"TheRival","files":2,"time":1449954469,"description":"Information :\r\n\r\nTitle: Far Cry 4 Complete Edition http://i38.servimg.com/u/f38/16/94/13/48/fc4box10.jpg\r\nDeveloped by: Ubisoft Studios\r\nPublished by: Ubisoft\r\nReleased on: 18 November 2014\r\nGenre: Action-Adventure\r\nCrack: RELOADED (v1.10)\r\nOfficial Site: http://corepacks.com\r\n\r\nDescription :\r\n\r\nYou are Ajay Ghale, a young man returning to the country of your birth in the Himalayas to fulfill your mother’s final wish. She had fled from civil war in Kyrat 25 years ago and has asked you to return to scatter her ashes. What she hasn’t told you is that your family, the Ghales, founded a rebellion that is struggling, fighting a war against a despotic, self-appointed King, Pagan Min.\r\n\r\nAs you explore and discover more about Kyrat, you will become involved in the Rebellion and The Golden Path, following your parents’ footsteps. The rebels are willing and able but their leadership is divided and, through your actions, you will begin to make choices which will steer the Golden Path towards the liberation of Kyrat, one way or another...\r\n\r\nSystem Requirements :\r\n\r\nMinimum System Requirements:\r\nCPU: Core i5-750 2.66GHz\r\nRAM: 4GB\r\nGPU: GeForce GTX 460\r\nDX: 11\r\nOS: Windows V/7/8/8.1 -64-bit\r\nHDD: 45 GB\r\n\r\nKey Features :\r\n\r\nDuring the game, the players progressively get to know the secrets of Kyrat. Thanks to its specific situation, a fictional country offers varied and interesting locations - from the snowy mountain routes to the thick forests as well as the cities, old ruins and so on. While the game, the players can move freely on the territory of the Himalayan country that is a large and open map. The players can also make a use of various means of transport. Moreover, the protagonist can take part in meditations which can move him to a fantastic land of Shangri-La.\r\n\r\nWhile taking part in the campaign, the players complete story missions as well as various side quests and optional tasks such as frees checkpoints, time trial or hunting wild animals. It is the FPS genre production so the players can make a use of a rich arsenal of weapons from simple pistols to heavy machine guns. There are also different types of daggers, knives and arches. For the first time in the history of the series, there is an opportunity to use a crossbow","torrent":{"xt":"urn:btih:41730942d794cbd0d0f70d954cbc9004e4ab695b","amp;dn":"Far+Cry+4+%5Bv1.10%5D+Complete+Edition+-+RePack+by+CorePack","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41730942d794cbd0d0f70d954cbc9004e4ab695b","infoHashBuffer":{"type":"Buffer","data":[65,115,9,66,215,148,203,208,208,247,13,149,76,188,144,4,228,171,105,91]},"announce":[],"urlList":[]}}