{"title":"The Science Ebook Collection   (epub/mobi)","uid":6825957,"size":798716460,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41750347516568f9919c00ecd1d1bc340e464f8f&amp;dn=The+Science+Ebook+Collection+++%28epub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":5,"uploader":"neil1966hardy","files":884,"time":1321562967,"description":"Science Book Collection\n\nBrought to you from the Digital Librarian\n\n\n\n\n    Everyware: The Dawning Age of Ubiquitous Computing - Adam Greenfield\n    The World Without Us - Alan Weisman\n    Wicked Plants - Amy Stewart\n    How God Changes Your Brain - Andrew Newberg, M. D., Mark Robert Waldman\n    The Story of Stuff - Annie Leonard, Ariane Conrad\n    Fingerprints of God: The Search for the Science of Spirituality - Barbara Bradley Hagerty\n    The Secret Life of the Grown-Up Brain: The Surprising Talents of the Middle-Aged Mind. Barbara Strauch - Barbara Strauch\n    Bad Science - Ben Goldacre\n    Summer World: A Season of Bounty - Bernd Heinrich\n    Winter World: The Ingenuity of Animal Survival - Bernd Heinrich\n    A Short History of Nearly Everything - Bill Bryson\n    Seeing Further: The Story of Science &amp; the Royal Society - Bill Bryson\n    The Most Human Human: What Talking With Computers Teaches Us About What It Means to Be Alive - Brian Christian\n    Wonders of the Universe - Brian Cox, Andrew Cohen\n    Why Does E=mc2? - Brian Cox, Jeffrey Robert Forshaw\n    The Hidden Reality: Parallel Universes and the Deep Laws of the Cosmos - Brian Greene\n    The Elegant Universe - Brian Greene\n    Total Recall - C. Gordon Bell, Jim Gemmell\n    The Demon-Haunted World: Science as a Candle in the Dark - Carl Sagan\n    Cosmos - Carl Sagan\n    Pale Blue Dot - Carl Sagan\n    A Planet of Viruses - Carl Zimmer\n    Now You See It: How the Brain Science of Attention Will Transform the Way We Live, Work, and Learn - Cathy N. Davidson\n    The Origin of Species by Means of Natural Selection, Or, the Preservation of Favored Races in the Struggle for Life - Charles Darwin\n    Sun in a Bottle - Charles Seife\n    Tropic of Chaos: Climate Change and the New Geography of Violence - Christian Parenti\n    The Fallen Sky - Christopher Cokinos\n    Social Engineering: The Art of Human Hacking - Christopher Hadnagy\n    Moonshot: The Inside Story of Mankind's Greatest Adventure - Dan Parry\n    The Discoverers - Daniel Joseph Boorstin\n    Galileo's Daughter: A Historical Memoir of Science, Faith, and Love - Dava Sobel\n    Longitude - Dava Sobel\n    A More Perfect Heaven - Dava Sobel\n    The Illustrated Longitude: The True Story of a Lone Genius Who Solved the Greatest Scientific Problem of His Time - Dava Sobel, William J. H. Andrewes\n    The Beginning of Infinity: Explanations That Transform the World - David Deutsch\n    Reef Madness: Charles Darwin, Alexander Agassiz, and the Meaning of Coral - David Dobbs\n    The Song of the Dodo: Island Biogeography in an Age of Extinctions - David Quammen\n    Natural Acts: A Sidelong View of Science and Nature - David Quammen\n    Dirt: The Erosion of Civilizations - David R. Montgomery\n    I Am a Strange Loop - Douglas R. Hofstadter\n    The Clockwork Universe: Isaac Newton, the Royal Society, and the Birth of the Modern World - Edward Dolnick\n    The Sound of a Wild Snail Eating - Elisabeth Tova Bailey\n    Darwin Slept Here - Eric N. Simons\n    Cathedral, Forge, and Waterwheel: Technology and Invention in the Middle Ages - Frances Gies, Joseph Gies\n    The Pleasure Instinct: Why We Crave Adventure, Chocolate, Pheromones, and Music - Gene Wallenstein\n    Why Aren't We Saving the Planet? - Geoffrey Beattie\n    The Next Decade: What the World Will Look Like - George Friedman\n    Gut Feelings - Gerd Gigerenzer\n    A World Without Ice - H. N. Pollack\n    Sweetness and Light: The Mysterious History of the Honeybee - Hattie Ellis\n    The Weather of the Future: Heat Waves, Extreme Storms, and Other Scenes From a Climate-Changed Planet - Heidi Cullen\n    Engineers of Dreams: Great Bridge Builders and the Spanning of America - Henry Petroski\n    The Evolution of Useful Things - Henry Petroski\n    The Battery - Henry Schlesinger\n    Insectopedia - Hugh Raffles\n    The Master and His Emissary: The Divided Brain and the Making of the Western World - Iain McGilchrist\n    Ecological Intelligence: Rediscovering Ourselves in Nature - Ian McCallum\n    Extraterrestrial Civilizations - Isaac Asimov\n    The Day the Universe Changed - James Burke\n    Genius: The Life and Science of Richard Feynman - James Gleick\n    Chaos - James Gleick\n    Eels: An Exploration, From New Zealand to the Sargasso, of the World's Most Mysterious Fish - James Prosek\n    No Bone Unturned: Inside the World of a Top Forensic Scientist and His Work on America's Most Notorious Crimes and Disasters - Jeff Benedict\n    Why Evolution Is True - Jerry A. Coyne\n    The Book of Nothing - John D. Barrow\n    The Great Influenza: The Story of the Deadliest Pandemic in History - John M. Barry\n    Our Magnificent Bastard Tongue: The Untold Story of English - John McWhorter\n    The Golden Spruce: A True Story of Myth, Madness and Greed - John Vaillant\n    Breakthrough!: How the 10 Greatest Discoveries in Medicine Saved Millions and Changed Our View of the World - Jon Queijo\n    Proust Was a Neuroscientist - Jonah Lehrer\n    How We Decide - Jonah Lehrer\n    Long for This World: The Strange Science of Immortality - Jonathan Weiner\n    Demon Fish: Travels Through the Hidden World of Sharks - Juliet Eilperin\n    Kingpin: How One Hacker Took Over the Billion Dollar Cyber Crime Underground - Kevin Poulsen\n    The World in 2050: Four Forces Shaping Civilization's Northern Future - Laurence C. Smith\n    The Physics of Star Trek - Lawrence Maxwell Krauss\n    Drunkard's Walk - Leonard Mlodinow\n    Knocking on Heaven's Door - Lisa Randall\n    Quantum: Einstein, Bohr and the Great Debate About the Nature of Reality - Manjit Kumar\n    The Animal Manifesto: Six Reasons for Expanding Our Compassion Footprint - Marc Bekoff\n    The Day We Found the Universe - Marcia Bartusiak\n    Quantum Theory Cannot Hurt You: A Guide to the Universe - Marcus Chown\n    The Golden Ratio: The Story of Phi, the World's Most Astonishing Number - Mario Livio\n    Edison and the Electric Chair: A Story of Light and Death - Mark Essig\n    Hubble Space Telescope: New Views of the Universe - Mark Voit\n    Sex on Six Legs: Lessons on Life, Love, and Language From the Insect World - Marlene Zuk\n    Windswept: The Story of Wind and Weather - Marq de Villiers\n    Packing for Mars: The Curious Science of Life in the Void - Mary Roach\n    The Red Queen: Sex and the Evolution of Human Nature - Matt Ridley\n    Complexity: A Guided Tour - Melanie Mitchell\n    Absolutely Small - Michael D. Fayer\n    Human - Michael S. Gazzaniga\n    The Believing Brain - Michael Shermer\n    Denialism: How Irrational Thinking Hinders Scientific Progress, Harms the Planet, and Threatens Our Lives - Michael Specter\n    Physics of the Future: How Science Will Shape Human Destiny and Our Daily Lives by the Year 2100 - Michio Kaku\n    How I Killed Pluto and Why It Had It Coming - Mike Brown\n    Riding Rockets - Mike Mullane\n    The American Plague - Molly Caldwell Crosby\n    Death by Black Hole: And Other Cosmic Quandaries - Neil deGrasse Tyson\n    Why Don't Penguins' Feet Freeze?: And 114 Other Questions - New Scientist\n    Why Can't Elephants Jump? - New Scientist\n    Deadly Choices: How the Anti-Vaccine Movement Threatens Us All - Paul A. Offit\n    The Great Disruption: How the Climate Crisis Will Transform the Global Economy - Paul Gilding\n    Collider - Paul Halpern\n    The Whale: In Search of the Giants of the Sea - Philip Hoare\n    Death From the Skies! - Philip Tate Phd., Philip C. Plait\n    Lost Woods: The Discovered Writing of Rachel Carson - Rachel Carson, Linda Lear\n    Strange New Worlds - Ray Jayawardhana\n    The Selfish Gene - Richard Dawkins\n    The Greatest Show on Earth - Richard Dawkins\n    Unweaving the Rainbow: Science, Delusion and the Appetite for Wonder - Richard Dawkins\n    The Age of Wonder: The Romantic Generation and the Discovery of the Beauty and Terror of Science - Richard Holmes\n    The Bell Curve: Intelligence and Class Structure in American Life - Richard J. Herrnstein, Charles A. Murray\n    The 4 Percent Universe: Dark Matter, Dark Energy, and the Race to Discover the Rest of Reality - Richard Panek\n    Paranormality: Why We See What Isn't There - Richard Wiseman\n    Catching Fire: How Cooking Made Us Human - Richard Wrangham\n    Everything Is Going to Kill Everybody: The Terrifyingly Real Ways the World Wants You Dead - Robert Brockway\n    Alice in Quantumland: An Allegory of Quantum Physics - Robert Gilmore\n    The Theory of Almost Everything: The Standard Model, the Unsung Triumph of Modern Physics - Robert Oerter\n    Rats: A Year With New York's Most Unwanted Inhabitants - Robert Sullivan\n    The Logic of Lying - Robert Trivers\n    Anatomy of an Epidemic - Robert Whitaker\n    What Einstein Told His Barber: More Scientific Answers to Everyday Questions - Robert Wolke\n    The Moral Landscape: How Science Can Determine Human Values - Sam Harris\n    The Disappearing Spoon: And Other True Tales of Madness, Love, and the History of the World From the Periodic Table of the Elements - Sam Kean\n    From Eternity to Here - Sean Carroll\n    The Mind and the Brain - Sharon Begley, Jeffrey M. Schwartz\n    Survival of the Sickest: A Medical Maverick Discovers Why We Need Disease - Sharon Moalem, Jonathan Prince\n    Curious Folks Ask: 162 Real Answers on Amazing Inventions, Fascinating Products, and Medical Mysteries - Sherry Seethaler\n    Alone Together: Why We Expect More From Technology and Less From Each Other - Sherry Turkle\n    How We Die: Reflections on Life's Final Chapter - Sherwin B. Nuland\n    Shape of Inner Space - Shing-tung Yau, Steve Nadi\n    The Emperor of All Maladies: A Biography of Cancer - Siddhartha Mukherjee\n    The Science of Evil: On Empathy and the Origins of Cruelty - Simon Baron-Cohen\n    When Science Goes Wrong - Simon Levay\n    Krakatoa: The Day the World Exploded: August 27, 1883 - Simon Winchester\n    Illustrated Theory of Everything: The Origin and Fate of the Universe - Stephen Hawking\n    A Briefer History of Time - Stephen Hawking\n    A Brief History of Time - Stephen Hawking, Grover Gardner\n    The Grand Design - Stephen Hawking, Leonard Mlodinow\n    Darwin's Island: The Galapagos in the Garden of England - Steve Jones\n    The Ghost Map: A Street, an Epidemic and the Two Men Who Battle to Save Victorian London - Steven Johnson\n    Water: The Epic Struggle for Wealth, Power, and Civilization - Steven Solomon\n    Honeybee Democracy - Thomas D. Seeley\n    The Ego Tunnel - Thomas Metzinger\n    Coming of Age in the Milky Way - Timothy Ferris\n    Traffic: Why We Drive the Way We Do (And What It Says About Us) - Tom Vanderbilt\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:41750347516568f9919c00ecd1d1bc340e464f8f","amp;dn":"The+Science+Ebook+Collection+++%28epub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41750347516568f9919c00ecd1d1bc340e464f8f","infoHashBuffer":{"type":"Buffer","data":[65,117,3,71,81,101,104,249,145,156,0,236,209,209,188,52,14,70,79,143]},"announce":[],"urlList":[]}}