{"title":"Outkast - Stankonia  [ FLAC ]","uid":4744239,"size":510159235,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:419b8917f42ce707ae27adc1554cbeb487c81c39&amp;dn=Outkast+-+Stankonia++%5B+FLAC+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"aszeran","files":-1,"time":1235735187,"description":"Stankonia by Outkast in lossless quality, Help with sharing swag and help seeding please.\n\nAsz.\n\n\nOriginally titled &quot;Sandbox&quot;, the pair's fourth album, Stankonia was released in October 2000 to excellent reviews. It debuted at number-two on the Billboard 200 in the U.S., and would eventually be certified quadruple-platinum. Stankonia's first single was &quot;B.O.B. (Bombs Over Baghdad)&quot;, a high-tempo jungle-influenced record. The second single, &quot;Ms. Jackson,&quot; combined a pop hook with lyrics about divorce and relationship breakups, particularly AndrÃƒÂ©'s breakup with singer Erykah Badu; the titular &quot;Ms. Jackson&quot; character being a doppelgÃƒÂ¤nger for Badu's mother. It was at this time that AndrÃƒÂ© changed his stage name to the current &quot;AndrÃƒÂ© 3000&quot;.\n\nThe single became their first pop dropped hit, landing the number-one position on the Billboard Hot 100 chart, and the number-two position on the UK Singles Chart. The album's final single was the Organized Noize-produced &quot;So Fresh, So Clean&quot;, featuring a credited guest appearance from regular guest vocalist and Organized Noize-member Sleepy Brown and garnered a remix featuring Snoop Dogg. All three singles' videos had heavy MTV2 airplay, and Outkast won two 2001 Grammy Awards, one for Best Rap Performance by a Duo or Group for &quot;Ms. Jackson&quot;, and another for Stankonia as Best Rap Album.\n\nDuring the recording of Stankonia Outkast and Mr. DJ began producing tracks for the artists on their Aquemini Records imprint through Columbia, including Slimm Cutta Calhoun and Killer Mike, who made his debut on Stankonia's &quot;Snappin' &amp; Trappin.&quot;","torrent":{"xt":"urn:btih:419b8917f42ce707ae27adc1554cbeb487c81c39","amp;dn":"Outkast+-+Stankonia++%5B+FLAC+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"419b8917f42ce707ae27adc1554cbeb487c81c39","infoHashBuffer":{"type":"Buffer","data":[65,155,137,23,244,44,231,7,174,39,173,193,85,76,190,180,135,200,28,57]},"announce":[],"urlList":[]}}