{"title":"Oren Lavie - The Opposite Side Of The Sea - 2007 CD mp3 [QG]","uid":4715618,"size":57245208,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:42331f3bcbc2b1d6f58c721dcac1ecc895ec0374&amp;dn=Oren+Lavie+-+The+Opposite+Side+Of+The+Sea+-+2007+CD+mp3+%5BQG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"QuietGeek","files":-1,"time":1234264506,"description":"Oren Lavie\nSinger, songwriter\n\nURLs:\nhttp://www.orenlavie.com\nmyspace(dot)com/orenlavie\nhttp://en.wikipedia.org/wiki/Oren_Lavie\nhttp://www.tuition-music.com/oren_lavie.html\n\nAlbum:\nThe Opposite Side Of The Sea\n(2007 CD and vinyl releases in Europe, 2008 release in the US on iTunes only, early 2009 CD release in the US to come)\n11 tracks (37:05); all VBR mp3 at 64-320 kbps (avg ~200 kbps) 44 kHz joint stereo (clear high quality sound); correct ID3v1 and v2 tags.\n\nTracklist\t\t\t\t\t\n01 Her Morning Elegance\t\t\t\t3:34\n02 The Man Who Isn't There\t\t\t3:35\n03 The Opposite Side Of The Sea\t\t\t3:14\n04 Locked In A Room\t\t\t\t4:40\n05 Ruby Rises\t\t\t\t\t3:31\n06 A Dream Within A Dream\t\t\t3:38\n07 Trouble Don't Rhyme\t\t\t\t3:13\n08 A Short Goodbye\t\t\t\t3:24\n09 Don't Let Your Hair Grow Too Long\t\t2:20\n10 Blue Smile\t\t\t\t\t3:44\n11 Unhidden Track: Quarter past Wonderful\t2:12\n\nYes, another discovery through TV ad music: Oren Lavie, one of the coolest, most talented but understated artists on the indie scene. No lack of writing talent here - there's poetry in every lyric, not to mention the throaty, intimate (maybe even sexy?) delivery of those words into silky, very male, odes of expression. Rounding out the package are playful and original musical arrangements of the folk/rock genre that keep your ears at attention no matter how relaxing the voice. Luckily, the good taste and strong effort is sustained throughout the album - filler material is just not part of this opus.\n\nA very edgy, forward use of Lavie's music, but oh how lovingly poetic in a boomer father-daughter kind of way, is in a car ad promoting safety throughout the young life of said daughter. You can find the video of the Chevy Malibu commercial at YouTube, featuring a part of the &quot;Her Morning Elegance&quot; track (slightly modified):\nyoutube(dot)com/watch?v=EgNQ2tns0Gs\n\nThe official music video of the track has just been released (Jan. 2009); see it at orenlavie.com or myspace(dot)com/orenlavie or at:\nyoutube(dot)com//watch?v=2_HXUhShhmY\n\nThe most succinct summary of Oren Lavie's bio is at Artistdirect (below); the funniest is the self-written one at Myspace; the most extensive, at tuition-music. His flash-based official site (orenlavie.com) is very complete and quite original in that it opens its own browser window with a virtual booklet like you find in the CD case. You even hear the paper page turning when you drag the corner of a page with the mouse pointer.\n\nNote that this artist publishes his work on his own indie label so the promotion of the album is very low-key, mostly through his sparse touring. On the torrent scene, there's nothing (other than a song from a movie soundtrack) - hence the sharing in this torrent.\nIncluded are 2 front covers: apparently they're interchangeable - the different releases use either.\n &lt;a href=&quot;\nhttp://www.artistdirect.com/nad/music/artist/bio/0,,3871886,00.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.artistdirect.com/nad/music/artist/bio/0,,3871886,00.html&lt;/a&gt;\n\nBiography\n\nOren Lavie's music doesn't come right at you through the front door; its elliptical nature is mysterious and dense and remains slightly unresolved. His vignettes of life are heartbreaking. his songs unfold like a collection of short stories in musical poetic form, bringing to mind songwriters the likes of Leonard Cohen and Jacque Brel.\n\nRecorded in the intimate setting of his apartment, the album's acoustic arrangements and Oren's dark voice are underscored by distant chamber strings, suggesting images of wider landscapes unseen behind closed walls. The Opposite Side of The Sea is a collage of fragile moments, as much as it is an uncompromising presence of a new distinct voice.\n\nBorn in Tel-Aviv, Israel, Oren began his creative journey as a playwright. At the age of 21 he wrote and directed a play for the Israeli Fringe Theater Festival, which won the awards for best newcomer writer and director. In 1999 he moved to London on a scholarship to attend the London Academy of Music and Dramatic Arts. While still at school he wrote a play which he later directed in an Off West-end theater to critical acclaim. The production was named by Time-Out London as one of the best 5 shows in London during its run. In 2002, Oren moved to NY where he gradually began to shift his focus from playwriting to a shorter form of storytelling, the song. Two years later he relocated to Berlin and began work on 'The Opposite Side of The Sea'.\n\nThe Opposite Side of the Sea was recorded in Oren's Berlin apartment during a period of three years and was released in Europe, in 2007, to positive reviews. But it wasn't until it has reached KCRW in California several months later that things began to happen; the album's repeated airplay attracted the attention of movie and television music supervisors, and before long the album track 'Her Morning Elegance' was picked to be featured in a Chevy Malibu commercial which debuted during the 2008 Grammys.\n","torrent":{"xt":"urn:btih:42331f3bcbc2b1d6f58c721dcac1ecc895ec0374","amp;dn":"Oren+Lavie+-+The+Opposite+Side+Of+The+Sea+-+2007+CD+mp3+%5BQG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42331f3bcbc2b1d6f58c721dcac1ecc895ec0374","infoHashBuffer":{"type":"Buffer","data":[66,51,31,59,203,194,177,214,245,140,114,29,202,193,236,200,149,236,3,116]},"announce":[],"urlList":[]}}