{"title":"The Dilbert Collection (1989-2011|1000px|Color|1010011010-DCP)","uid":9936029,"size":787621361,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:42b7bdbc3293e49b4d7bb154a9598dba29bc8b97&amp;dn=The+Dilbert+Collection+%281989-2011%7C1000px%7CColor%7C1010011010-DCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"VikTSlick","files":-1,"time":1397160824,"description":"For more information on this comic strip, please check out the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dilbert&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dilbert&lt;/a&gt;\n\nFor the official site of the strip, with current comics, check out the website here: &lt;a href=&quot;\nhttp://www.dilbert.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dilbert.com/&lt;/a&gt;\n\n\nScott Adams' hilarious and often amazingly true-to-life comic strip Dilbert first appeared in 1989, and it has become a major success and a staple of newspapers all over the word since. The strip revolves around the titular character, who is an engineer in perhaps the worst-run and most poorly managed company known to man; his pets, who are anthropomorphic and constantly hatching schemes of their own (especially Dogbert, who often takes advantage of idiots to become rich or rule the corporate world, and Catbert, frequently portrayed as the evil Director of Human Resources) ; his co-workers, which include the reliably lazy Wally and the constantly angry and frustrated Alice; and of course the remarkably incompetent Pointy-Haired Boss who usually interferes when it isn't needed, makes a mess of things and forces others to take the blame, does virtually nothing productive and is typically the dumbest person in the room at all times. Suffice to say, if you've never read the strip, you are missing out on some comedy gold.\n\nWhile there are a few different collected versions of the strip in various torrents, I can safely say that this is by far the BEST version you can possibly get. Every single strip from 1989 up to 2011 is included, all in FULL COLOR!!! What's more, these are 1000px HR versions formatted especially for .cbr format and viewing on a computer or digital device. They look absolutely terrific on my comic book reader and I'm sure the same will be true for you. HUGE, MASSIVE thanks to 1010011010-DCP for doing these scans, I can't really recommend them highly enough. Just fantastic work. Hope you all enjoy these as much as I will - please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:42b7bdbc3293e49b4d7bb154a9598dba29bc8b97","amp;dn":"The+Dilbert+Collection+%281989-2011%7C1000px%7CColor%7C1010011010-DCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b7bdbc3293e49b4d7bb154a9598dba29bc8b97","infoHashBuffer":{"type":"Buffer","data":[66,183,189,188,50,147,228,155,77,123,177,84,169,89,141,186,41,188,139,151]},"announce":[],"urlList":[]}}