{"title":"Germany's Last Mission: The Failed Voyage of U-234 to Japan","uid":15811061,"size":2480887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:438dbe198d52a357c45a5f7594c05dfb776f505c&amp;dn=Germany%27s+Last+Mission%3A+The+Failed+Voyage+of+U-234+to+Japan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"marty14","files":1,"time":1473636302,"description":"Germany's Last Mission: The Failed Voyage of U-234 to Japan - Joseph Mark Scalia [epub]\r\n\r\nWhen U-234 slipped out of a Norwegian harbor in March 1945 destined for Japan, it was loaded with some of the most technically advanced weaponry and electronic detection devices of the era, along with a select group of officials. En route, word came that Germany had surrendered, and the boat's commander suddenly found himself with a rogue submarine, a precious assortment of cargo, and two Japanese naval officers still at war. This dramatic account of the voyage offers an intriguing look at the individuals involved.\r\n\r\nOne of these individuals was Luftwaffe General Ulrich Kessler, who was a member of Von Stauffeberg's Valkyrie conspiracy to assassinate of Hitler. Kessler was aboard U-234 to escape the wrath of Hitler, because he had been tabbed by Von Stauffeberg to replace Hermann Goering as the commander of the Luftwaffe.\r\n\r\nScalia draws on U.S. Navy interrogation records, European and Japanese archives, and interviews with former U-234 crew members and other principals to develop a full portrait of the group. He also evaluates the technology of the armament on board, which included 560 kg. of uranium oxide, whose presence continues to provoke questions about a Nazi plan to build an atom bomb in Japan","torrent":{"xt":"urn:btih:438dbe198d52a357c45a5f7594c05dfb776f505c","amp;dn":"Germany%27s+Last+Mission%3A+The+Failed+Voyage+of+U-234+to+Japan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"438dbe198d52a357c45a5f7594c05dfb776f505c","infoHashBuffer":{"type":"Buffer","data":[67,141,190,25,141,82,163,87,196,90,95,117,148,192,93,251,119,111,80,92]},"announce":[],"urlList":[]}}