{"title":"Garrys Mod 12 - November 2010","uid":5933577,"size":3206383677,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:43a18ec868975fecca6ac98f40ba79667dd00db0&amp;dn=Garrys+Mod+12+-+November+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"HGrailGuy","files":2,"time":1288867535,"description":"Garry's Mod 12 - November 2010 - HGrailGuy\n---------------------------------------------\nGarry's Mod is a physics sandbox. Unlike regular games there aren't any predefined aims or goals. We give you the tools and leave you to play. You spawn objects and weld them together to create your own contraptions - whether that's a car, a rocket, a catapult or something that doesn't have a name yet - that's up to you. \n---------------------------------------------\nHello! HGrailGuy here. I'm new,so take it easy on me. Today, I have Garry's Mod for you. This standalone build is the easiest to install and most frequently updated on the internet. And I have put it together into one torrent for your convenience. If you would like to support future updates to this torrent, or you just like it, please go to this link:sign up, and complete one offer. It's not required, but is highly appreciated. So let's get to installing:\n\n1. First open and install &quot;Garrys Mod Final [DiGiTALZONE] 2010 Edition.exe&quot;\n2. Go into the &quot;Updates&quot; folder and install ALL of the updates in order.\n3. Lastly, Go into the &quot;Game Packs&quot; folder and install all of them in any order you want.\n\nThat's it! Now just start up the icon on your desktop. If you are having problems, post a questions here:If you would like to see if their are any new updates, check here:This torrent includes updates 1-6, but I didn't have time to include 7 or 8 (which both were put out last week of the making of this torrent), so check back their often! And remember, if you liked this torrent, sign up and complete and offer here:\n\nAnd, if you really like the game, buy it!\n\nCredits:\nDigitalZone-Amazing Gmod standalone\nVALVe-Source Engine and the great game content\nGarry-Amazing Sandbox game","torrent":{"xt":"urn:btih:43a18ec868975fecca6ac98f40ba79667dd00db0","amp;dn":"Garrys+Mod+12+-+November+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43a18ec868975fecca6ac98f40ba79667dd00db0","infoHashBuffer":{"type":"Buffer","data":[67,161,142,200,104,151,95,236,202,106,201,143,64,186,121,102,125,208,13,176]},"announce":[],"urlList":[]}}