{"title":"Awaken the Giant Within BOOK","uid":4476864,"size":1487425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43b8554e3f82d7845a39c5fcfdb09a6e9cc6003e&amp;dn=Awaken+the+Giant+Within+BOOK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"blumppin12","files":2,"time":1225388190,"description":"Awaken the Giant Within&quot; - How to Take Immediate Control of Your Mental, Emotional, Physical and Financial Destiny! was written by Anthony Robbins back in 1992. It is 544 pages of the man&amp;#039;s motivational techniques and self help tips. Awaken the Giant Within covers a wide range of topics, from goal setting, to Neuro-linguistic programming (NLP), personal finance, and relationships. \n\nThe book comes across as fast paced and entertaining, just like he is on his many infomercials. It covers a lot of material, with much of it requiring you to make positive changes and work on yourself. So it is probably best skimmed, before going back to chapters that relate most to your life.\n\nRobbins uses a lot of techniques that are either influenced by or are taken from the pseudoscientific principles of Neuro-linguistic programming (NLP). But Awaken the Giant Within is more than a book derived from NLP, it is a manual for life. If one technique or chapter does not work for you, there are plenty more in the book that can. \n\nAnthony Robbins has copped plenty of criticisms for his infomercials, his personal life, and his high priced seminars, but Awaken the Giant Within is a self help classic. \n\nAwaken the Giant Within Book Quotes\n\n&quot;After making a true decision, even a tough one, most of us feel a tremendous amount of relief. We&amp;#039;ve finally gotten off the fence! And we all know how great it feels to have a clear, unquestionable objective.&quot; Tony Robbins\n&quot;The truth is that we can learn to condition our minds, bodies, and emotions to link pain or pleasure to whatever we choose. By changing what we link pain and pleasure to, we instantly change our behaviors.&quot; Tony Robbins\n&quot;The past doesn&amp;#039;t equal the future. All great leaders, all people who have achieved in any area of life, know the power of continuously pursuing their vision, even if all the details of how to achieve it aren&amp;#039;t yet available.&quot; Tony Robbins","torrent":{"xt":"urn:btih:43b8554e3f82d7845a39c5fcfdb09a6e9cc6003e","amp;dn":"Awaken+the+Giant+Within+BOOK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43b8554e3f82d7845a39c5fcfdb09a6e9cc6003e","infoHashBuffer":{"type":"Buffer","data":[67,184,85,78,63,130,215,132,90,57,197,252,253,176,154,110,156,198,0,62]},"announce":[],"urlList":[]}}