{"title":"Sony Sound Forge Audio Studio 10.0 Build 178 Portable","uid":7518375,"size":135835352,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:43f055784552732fc2f3dc4b93491c6650d5c2c4&amp;dn=Sony+Sound+Forge+Audio+Studio+10.0+Build+178+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1344542335,"description":"Sound Forge Audio Studio software is everything you need to edit and master professional-quality audio on your home computer. Record live instruments and vocals, edit and restore audio, apply studio-quality effects, and convert files with lightning speed. You can even create your own karaoke tracks with the Vocal Eraser tool. Best of all, Sound Forge Audio Studio software is easy to use. With a few basic commands such as cut, copy, and paste, you can produce high-fidelity audio on your PC.\n\nCapture your performance\nTo record live audio, simply plug a microphone or instrument into your computer's sound card and click Record. Easily capture instruments, vocals, keyboards, and more. You can also import audio from your own CDs and MP3s or use the Vinyl Recording and Restoration tool to record audio from LPs and cassettes.\n\nPowerful editing tools\nSimply drag and drop to expertly balance sound levels, trim unwanted sections, and synchronize audio with video. You can also use Sound Forge Audio Studio software to create your own music loops and samples to use with ACIDâ„¢ Music Studio software.\n\nCreate your own karaoke tracks\nSound Forge Audio Studio 10 software includes the Vocal Eraser plug-in. Easily remove vocals from most recordings or isolate vocals. You can also use this plug-in to extract vocals from songs for remixing. The Vocal Eraser plug-in contains presets for various recording and vocal types.\n\nExtensive video support\nSound Forge Audio Studio makes it easy to synchronize audio with video for video scoring. Import popular video formats including WindowsÂ® Media, QuickTimeÂ®, and more.\n\nCustomize audio with effects\nCustomize your audio with more than 30 built-in audio effects such as EQ, delay, chorus, and reverb, as well as the included 1,001 Sound Effects. DirectXÂ® and VST support expands the number of effects you can apply and increases your mastering flexibility.\n\n\nHome Page - http://www.sonycreativesoftware.com/soundforgesoftware","torrent":{"xt":"urn:btih:43f055784552732fc2f3dc4b93491c6650d5c2c4","amp;dn":"Sony+Sound+Forge+Audio+Studio+10.0+Build+178+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f055784552732fc2f3dc4b93491c6650d5c2c4","infoHashBuffer":{"type":"Buffer","data":[67,240,85,120,69,82,115,47,194,243,220,75,147,73,28,102,80,213,194,196]},"announce":[],"urlList":[]}}