{"title":"Hardtied--Spread Wide  Lily Lane  Matt Williams High","uid":15970872,"size":2403101984,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:43f67efab6178c4a7c2bef42951332a57426575f&amp;dn=Hardtied--Spread+Wide++Lily+Lane++Matt+Williams+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":4,"uploader":"merzedes","files":1,"time":1475777780,"description":"Spread Wide | Lily Lane | Matt Williams\r\n\r\nOctober 5, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nLegs Open and Ready For Business \r\n\r\nA sexy woman with her legs spread wide for all to see is one of life's greatest simple pleasures. Today, for your viewing pleasure, Lily Lane is going to spend just about her entire show with her legs tied wide open and a variety of vibrators rubbed up against her until she just about breaks. It may be a good day for our viewers, but it is almost certainly a better day for Lily, seeing what Matt Williams has in store for her. Right away he takes off her outfit and gets down to business. \r\n\r\nLily starts out sitting on the floor. Each of her ankles is tied up in rope connected to a metal hook on the ground so that her legs are spread as wide into a straddle as they can possibly go. Then Matt takes her by the hair and yanks her head back so that he can stuff a ball gag into her open mouth. He takes out the hitachi magic wand and starts vibrating her clit. It occurs to him, however, that he could perhaps make this even more fun, so he clips some nipple clamps onto her tits and ties them to the floor in front of her so she is bent over at the waist. Then he takes out the celebrator, a smaller and more precise vibrator, and goes back to pulling muffled moans out of her.\r\n\r\nAfter a few different positions with her legs spread and her pussy vibrated until she has cum herself numb, Lily is ready for some pain to go with her pleasure. Matt ties her neck rope to the ceiling and weights the other end of it with a large stone. This way, Lily is being choked no matter how high up on her tip toes she goes to try and fix it. Then Matt takes out the flogger and goes to work slapping her huge tits and her gorgeous ass. By the time he's done they've turned a bright shade of red almost as saturated as the ink in one of her tattoos. \r\n\r\nScreens \nhttp://www.hardtied.com/hogtied/bondage/trailer.php?y=2016&amp;p=10_05llane&amp;u=Hardtied-Lily-Lane-Spread-Wide\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:43f67efab6178c4a7c2bef42951332a57426575f","amp;dn":"Hardtied--Spread+Wide++Lily+Lane++Matt+Williams+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f67efab6178c4a7c2bef42951332a57426575f","infoHashBuffer":{"type":"Buffer","data":[67,246,126,250,182,23,140,74,124,43,239,66,149,19,50,165,116,38,87,95]},"announce":[],"urlList":[]}}