{"title":"Lounge Lizard VST v2 0 (Electric Piano H20 release   some preset","uid":3264932,"size":7513320,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:441ae2d9e07ab4f866bc9849d7c5bc4bee8c7bea&amp;dn=Lounge+Lizard+VST+v2+0+%28Electric+Piano+H20+release+++some+preset&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"suppapva","files":6,"time":1102979421,"description":"Legger opp denne geniale el-piano simulatoren for alle dere som vil ha litt soulful keyboards i musikken deres.\n\n\n\n       Â¦ Release:  Applied Acoustics Lounge Lizard EP-2 v2.0      Â¦\n       Â¦ Supplier  : TEAM SYNTHX                                                  Â¦\n       Â¦ Protection: SERIAL                                                           Â¦\n       Â¦ Date : 08-27-03                                                               Â¦\n       Â¦ Size: 2 x 4MB                                                                   Â¦\n       Â¦ Type: VSTi / DXi  \n\n       The Lounge  Lizard is  a software  electric piano  based on  the\n       classic  instruments   of  the   70Ã†(Rhodes,  Wurlitzer).   Each\n       component of these instruments has been modeled with  AAScutting\n       edge  physical  modeling  technology  to  provide  realistic and\n       lively  sounds.Physical modeling  uses the  laws of  physics to\n       reproduce the behavior of an object. In other words, the  Lounge\n       Lizard solves, in  real time, mathematical  equations describing\n       how its different components function. No sampling or wavetables\n       are used in the Lounge Lizard, the sound is simply calculated in\n       real time by the CPU  according to the values each  parameter is\n       receiving. The Lounge Lizard is more than a simple recreation of\n       vintage instruments,  its parameters  can be  tweaked to extreme\n       values not possible with the real instruments to get some  truly\n       amazing new sounds that still retain a warm acoustic quality.\n\n       Each part  of the  Lounge Lizard  can be  modified in real time.\n       These parts are the hammer, the fork, the pick up and a two band\n       EQ. In addition to those parts, weÃ†ve added some classic effects\n       that have been  long associated with  the electric piano,  these\n       effects are wah, phaser, tremolo and delay. \n\n       Over 50  presets are  included in  the Lounge  Lizard covering a\n       wide range  from bright  clean pianos  to very  nasty ones. Also\n       included are some more experimental sounds.\n       \n       www.applied-acoustics.com\n\n       New in v2.0\n\n       - Now includes key release model for even greater realism \n       - Choose between the Lounge Lizard's original pickup model \n         acclaimed for it's growl and bite, or a new secondary model \n         specifically designed for crystal clean tones \n       - All effects modulation and stereo delays sync to host tempo \n       - Support for MIDI program change for hands-free operation \n       - New browser interface makes finding presets quick and easy \n       - Optimized DSP engine for 3 times greater CPU performance \n       \n       \n       H2O NOTES :\n\n         During testing, the VSTi was found to be a little\n         unstable on some systems using SX/Orion as hosts\n\n Install Info:\n\n        Unzip , Unrar &amp;amp; run Setup.exe","torrent":{"xt":"urn:btih:441ae2d9e07ab4f866bc9849d7c5bc4bee8c7bea","amp;dn":"Lounge+Lizard+VST+v2+0+%28Electric+Piano+H20+release+++some+preset","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"441ae2d9e07ab4f866bc9849d7c5bc4bee8c7bea","infoHashBuffer":{"type":"Buffer","data":[68,26,226,217,224,122,180,248,102,188,152,73,215,197,188,75,238,140,123,234]},"announce":[],"urlList":[]}}