{"title":"Stuff India - October 2016 (gnv64)","uid":15908300,"size":32895611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:441e3e0f2fdd782dbb7f1d24b567b15c8135ab53&amp;dn=Stuff+India+-+October+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"gnv65","files":4,"time":1475072620,"description":"Stuff India - October 2016\r\nEnglish | 103 pages | True PDF | 31.3 mb\r\n\r\nSTUFF is the world's biggest gadget and technology lifestyle magazine with more than 25 editions globally. The Indian edition upholds these international values while showcasing the best gadgets and technology available in India. \r\nWe went beyond the norm by exploring virtual reality big time, all courtesy of the biggest baddest champions of VR headsets in the game right now - Oculus and HTC Vive. Hell, even Audi has given a serious nod to virtual reality and we bring you all the down-low on it from our wondrous drive in one. Stay updated on all the news regarding Apple’s jack-less iPhone7 launch plus a run down on the Samsung Galaxy Note 7. A war of smartphones is definitely in the offing. This month also sees us going gaga over Asus’s liquid-cooled gaming laptop (a first of sorts) and HP’s MacBook Air-challenger. All this and the usual convoy of tests follow.\r\n\r\nHOT STUFF\r\n10 The Hot Four\r\n? Apple iPhone 7\r\n? Acer Swift 7\r\n? Lenovo Yoga Book\r\n? Lenovo Moto Z\r\n18 Gigapixel Audi Virtual Cockpit Audi goes next-gen; gets all touchy-feely\r\n23 Geek on the road VR Ghost Train Derren Brown’s immersive Thorpe Park ride\r\n25 Apps Write poems and let others write over them\r\n31 Vital Stats Livpure Smartouch Purifying water just got smarter\r\n33 Icon MSI Backpack PC Bringing untethered VR a step closer\r\n36 Games Despite its name, Final Fantasy keeps going\r\n\r\nTESTS\r\n62 First test Samsung Galaxy Note 7 Full review of our plus-sized explosive star\r\n64 First test Asus ROG GX700 A liquid-cooled laptop for hot gaming action\r\n66 First test HP Spectre 13 The ultra-ultra-slim MacBook-chaser\r\n68 First test Oppo F1S This smartphone is more than just selfies\r\n69 Tested Samsung UA65KS9000K An LCD TV with 4K and lots of loveliness\r\n70 Tested Gionee S6s We go looking beyond the popular namesake\r\n71 Tested Audi A4 35TFSI The slimmer 2nd Gen is here and gunning\r\n74 Versus Homegrown hybrids Smartron t.book takes on Notion Ink Able\r\n77 Tested Asus Zenfone 3 The new Zenfone cometh and we play’th\r\n78 Tested Games No Man’s Sky\r\n \nhttp://s11.postimg.org/b7wuuk60j/Stuff_India_October_2016.jpg","torrent":{"xt":"urn:btih:441e3e0f2fdd782dbb7f1d24b567b15c8135ab53","amp;dn":"Stuff+India+-+October+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"441e3e0f2fdd782dbb7f1d24b567b15c8135ab53","infoHashBuffer":{"type":"Buffer","data":[68,30,62,15,47,221,120,45,187,127,29,36,181,103,177,92,129,53,171,83]},"announce":[],"urlList":[]}}