{"title":"True Crime - New York City (NTSC) PS2","uid":7731583,"size":1787120290,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:44910ee55b810df8bcd860b6979f0da18f6e9690&amp;dn=True+Crime+-+New+York+City+%28NTSC%29+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":3,"uploader":"Big_dude","files":-1,"time":1350353303,"description":"True Crime - New York City for the Ps2                      Rel. 11/16/2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action\nRating:        Mature\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nGame Description:\n\nMarcus Reed is a gangster turned cop who is out to clean the streets of New York. Marcus joins the Organized Crime Division of the NYPD with the intent to rid the city of crime and violence. Hoping to make a name for himself after his mentor is shot down, Marcus goes after the top crime syndicates of the city.\n\nBesides having to do this, Marcus is a street-level cop. He is responsible for anything from stopping street fights to stopping gang wars to defusing bombs! Not only this, he can frisk people on the street for contraband, can do trunk searches on cars, as well as issue tickets to speeders.\n\nBut if Marcus is gonna do all those things, hes gonna do it his way. Need some cash? Marcus isn't opposed to a bit of extortion from the local pharmacy. Need some a way to stabilize your career after that rampage last week? Plant some evidence on a guy and bring him in. No one will know. Pistols not cutting it for you? The gun stores sell police officers anything, from M4's to flamethrowers to RPGs.\n\nWith the city of New York at your fingertips, and nearly every building accessible to you, how will you rule? Will you be a shining beacon of morals, or a shady figure in the underworld of NY. The choice is up to you.\n\n\n\nGame Pics Included.\n\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t\t\t\t","torrent":{"xt":"urn:btih:44910ee55b810df8bcd860b6979f0da18f6e9690","amp;dn":"True+Crime+-+New+York+City+%28NTSC%29+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44910ee55b810df8bcd860b6979f0da18f6e9690","infoHashBuffer":{"type":"Buffer","data":[68,145,14,229,91,129,13,248,188,216,96,182,151,159,13,161,143,110,150,144]},"announce":[],"urlList":[]}}