{"title":"Homer - The Odyssey [Fagles Trans] Read by Ian McKellen","uid":8794380,"size":376203184,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:44c9a5981cf7e0e96904206c717d5af5a54b69f8&amp;dn=Homer+-+The+Odyssey+%5BFagles+Trans%5D+Read+by+Ian+McKellen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"rambam1776","files":-1,"time":1376034591,"description":" &lt;a href=&quot;http://www.barnesandnoble.com/w/odyssey-homer/1002198721?ean=9780140268867&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.barnesandnoble.com/w/odyssey-homer/1002198721?ean=9780140268867&lt;/a&gt;\n\nThanks to the OP on What\n\n64 kbps, Read by Sir Ian Mckellen, Unabridged\n\n\nThis new translation by award-winning translator Robert Fagles captures the energy of Homer's original in bold, contemporary idiom. This is an Odyssey to treasure for its sheer lyrical mastery. The great adventure story tells of Odysseus, a veteran of the Trojan War, who - through a landscape peopled with monsters, sea nymphs, evil enchantresses, and vengeful gods - makes his tortuous way home to his faithful wife, Penelope. Shipwrecked numerous times, faced with apparently insurmountable obstacles, offered the temptations of ease, comfort, and even immortality, Odysseus remains steadfast and determined. Themes of courage and perseverance, fidelity and fortitude are woven into the rich tapestry of danger, disaster, and ultimate triumph. Written by the blind poet, Homer, in the 8th century B.C., The Odyssey is the foundation for modern European literature. It is read by Ian McKellen, one of the most highly acclaimed actors in the English-speaking world.\n\nPublishers Weekly - Publisher's Weekly\nRobert Fagles's 1990 translation of The Iliad was highly praised; here, he moves to The Odyssey. As in the previous work, he adroitly mixes contemporary language with the driving rhythms of the original. The first line reads: &quot;Sing to me of the man, Muse, the man of twists and turns/ driven time and again off course once he had plundered/ the hallowed heights of Troy.&quot; Hellenic scholar Bernard Knox contributes extensive introductory commentary, providing both historical and literary perspective. \n\nFrom Barnes &amp; Noble\nThe greatest adventure story of all time, this epic work chronicles Odysseus's return from the Trojan War and the trials he endures on his journey home. Filled with magic, mystery, and an assortment of gods &amp; goddesses who meddle freely in the affairs of men.","torrent":{"xt":"urn:btih:44c9a5981cf7e0e96904206c717d5af5a54b69f8","amp;dn":"Homer+-+The+Odyssey+%5BFagles+Trans%5D+Read+by+Ian+McKellen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44c9a5981cf7e0e96904206c717d5af5a54b69f8","infoHashBuffer":{"type":"Buffer","data":[68,201,165,152,28,247,224,233,105,4,32,108,113,125,90,245,165,75,105,248]},"announce":[],"urlList":[]}}