{"title":"Karla McLaren, The Art of Empathy  2013 dovah","uid":9110990,"size":1402182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:453231f9f97e191136d22381d3b7c1d6fd38e4f5&amp;dn=Karla+McLaren%2C+The+Art+of+Empathy++2013+dovah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"dovah12","files":-1,"time":1382943607,"description":"The Art of Empathy:\nA Complete Guide to Life's Most Essential Skill\n\nAuthor : Karla McLaren\n\nisbn: 1622030613\nisbn13: 9781622030613\nformat: epub mobi\nPublished October 1st 2013 by Sounds True\n\n\nSome of us are natural-born empaths those with an exceptional gift for feeling and understanding the emotions, circumstances, and needs of others. But empathy, teaches Karla McLaren, is a universal skill that we can all learn to awaken and use wisely. With The Art of Empathy, she guides listeners step-by-step into the art of experiencing through the eyes and hearts of others and to connect with and support them most effectively. Drawing on insights spanning sociology, current brain research, and traditional healing wisdom, this acclaimed teacher shows us how to:\nDiscover and strengthen this natural social and emotional ability\nPrepare for empathy training by learning to identify and regulate our own emotions and boundaries\nMove into the felt experience of others with authenticity and respect\nUse our empathic skills to communicate with and benefit those around us\nImprove our intimate relationships, parenting efforts, and workplace issues\nExpand our empathy into our communities and even the natural world\nAs our social landscape and ways of connecting continue to shift and evolve rapidly, empathy may be the most essential skill for navigating our emotional and interpersonal lives. This practice-focused course provides the guidance we need to master this essential life skill\n================\n\nDovah","torrent":{"xt":"urn:btih:453231f9f97e191136d22381d3b7c1d6fd38e4f5","amp;dn":"Karla+McLaren%2C+The+Art+of+Empathy++2013+dovah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"453231f9f97e191136d22381d3b7c1d6fd38e4f5","infoHashBuffer":{"type":"Buffer","data":[69,50,49,249,249,126,25,17,54,210,35,129,211,183,193,214,253,56,228,245]},"announce":[],"urlList":[]}}