{"title":"Practical and Experimental Robotics","uid":9571841,"size":19073343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45c8dec39529990453725b8042ddf8554f68e152&amp;dn=Practical+and+Experimental+Robotics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"MucGar","files":-1,"time":1391641056,"description":"Practical and Experimental Robotics\n\n\n\nEnglish |  ISBN: 1420059092 | 464 pages | PDF | 18,2 MB\n\n\n\n\n\n\n\nTaking a completely hands-on approach, using cheap and easily available robotics kits, Practical and Experimental Robotics provides a detailed exploration of the construction, theory, and experiments for different types of robots. \n\nWith topics ranging from basic stamp microcontrollers to biped and propeller based robots, the text contains laboratory experiments, examples with solutions, and case studies. The authors begin with a review of the essential elements of electronics and mechanics. \n\nThey describe the basic mechanical construction and electrical control of the robot, then give at least one example of how to operate the robot using microcontrollers or software. The book includes a reference chapter on Basic Stamp Microcontollers with example code pieces and a chapter completely devoted to PC interfacing. Each chapter begins with the fundamentals, then moves on to advanced topics, thus building a foundation for learning from the ground up. Building a bridge between technicians who have hands-on experience and engineers with a deeper insight into the workings, the book covers a range of machines, from arm, wheel, and leg robots to flying robots and robotic submarines and boats. Unlike most books in this field, this one offers a complete set of topics from electronics, mechanics, and computer interface and programming, making it an independent source for knowledge and understanding of robotics.\n","torrent":{"xt":"urn:btih:45c8dec39529990453725b8042ddf8554f68e152","amp;dn":"Practical+and+Experimental+Robotics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45c8dec39529990453725b8042ddf8554f68e152","infoHashBuffer":{"type":"Buffer","data":[69,200,222,195,149,41,153,4,83,114,91,128,66,221,248,85,79,104,225,82]},"announce":[],"urlList":[]}}