{"title":"Law 101: Everything .. About American Law Jay Feinman Audiobook","uid":11693662,"size":473156671,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:45ed8fb3524282abd5a6586ef6d1cd2d47f017d8&amp;dn=Law+101%3A+Everything+..+About+American+Law+Jay+Feinman+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"Squiddy82","files":11,"time":1423626963,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nLaw 101: Everything You Need to Know About American Law\n\nWritten by: Jay M. Feinman\nNarrated by: Joe Barrett\nLength: 16 hrs and 24 mins\nUnabridged Audiobook\nRelease Date:12-17-13\n\nThe best-selling first edition of Law 101 provided a vividly written and indispensable portrait of our nation's legal system. Now, in this revised edition, Jay M. Feinman offers an updated survey of American law, spiced with new anecdotes and cases, and incorporating fresh material on topics ranging from the President's war powers, to intellectual property, standard form contracts, and eminent domain. Here is an exceptionally clear introduction to law, covering the main subjects found in the first year of law school, giving us a basic understanding of how it all works. Listeners are introduced to every aspect of the legal system, from constitutional law and the litigation process to tort law, contract law, property law, and criminal law. Feinman illuminates each discussion with many intriguing, outrageous, and infamous cases, from the scalding coffee case that cost McDonald's half a million dollars, to the sensational murder trial in Victorian London that led to the legal definition of insanity, to the epochal decision in Marbury v. Madison that gave the Supreme Court the power to declare state and federal laws unconstitutional. He broadens the listener's legal vocabulary, clarifying the meaning of everything from &quot;due process&quot; and &quot;equal protection&quot; in constitutional law, to the distinction between &quot;murder&quot; and &quot;manslaughter&quot; in criminal law. Perhaps most important, we learn that though the law is voluminous and complex, it is accessible to all. Everyone who wants a better grasp of current legal issues - from students contemplating law school, to journalists covering the legislature or the courts, to fans of Court TV - will find here a wonderful source of information: A complete, clear, and colorful map of the American legal system","torrent":{"xt":"urn:btih:45ed8fb3524282abd5a6586ef6d1cd2d47f017d8","amp;dn":"Law+101%3A+Everything+..+About+American+Law+Jay+Feinman+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45ed8fb3524282abd5a6586ef6d1cd2d47f017d8","infoHashBuffer":{"type":"Buffer","data":[69,237,143,179,82,66,130,171,213,166,88,110,246,209,205,45,71,240,23,216]},"announce":[],"urlList":[]}}