{"title":"Shadowrun_Returns-FLT","uid":8740765,"size":780092085,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:461d0a6cc750fdbbdbbe354f7bc643f2a3e0a6db&amp;dn=Shadowrun_Returns-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Mr.Stifmeister","files":18,"time":1374779977,"description":"\nANSiJEDACiD\n\nIn Their 26th Year Of Glory, FairLight Released #1106\n\nShadowrun Returns (c) Harebrained Holdings\n\n:   Supplied by: FAIRLIGHT            : : Release Date: 25/07/2013\nCracked by:  FAIRLIGHT              Game Type:    Strategy, RPG\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 1 DVD                        Protection: Steam\n\nSystem Requirements : (S)-1-phenylpropan-2-amine\n\nGame information\n=================\n\nMAN MEETS MAGIC &amp; MACHINE. The year is 2054. Magic  has  returned  to  the\nworld, awakening powerful creatures of myth and legend. Technology  merges\nwith flesh and consciousness. Elves, trolls, orks and dwarves  walk  among\nus,  while  ruthless  corporations  bleed  the  world  dry.  You   are   a\nshadowrunner - a mercenary living  on  the  fringes  of  society,  in  the\nshadows of massive corporate arcologies, surviving day-by-day on skill and\ninstinct alone. When the powerful or the desperate need a  job  done,  you\nget it done... by any means necessary\n\nIn the urban sprawl of the Seattle metroplex, the search for a  mysterious\nkiller sets you on a trail that leads from the darkest slums to the city's\nmost powerful megacorps. You will need to tread carefully, enlist the  aid\nof other runners, and master powerful forces of technology  and  magic  in\norder to emerge from the shadows of Seattle unscathed\n\nThe unique cyberpunk-meets-fantasy world of Shadowrun has  gained  a  huge\ncult following since its creation nearly 25 years ago. Now, creator Jordan\nWeisman returns to the world of Shadowrun, modernizing this  classic  game\nsetting as a single player, turn-based tactical RPG\n\nFeatures\n=========\n\nGripping Tactical Combat: When you're running the shadows, every\nturn matters. Choose your actions wisely - move to better cover,\ncharge into melee, or lob a fireball into a crowd of enemies.\nWith the variety of weapons and spells at your disposal,\nevery turn is filled with meaningful choices. A successful\nrun requires  commanding a team of runners with the right\nbalance of combat, tech, and magical abilities\nSkill-Based Character Progression: Choose a starting character\narchetype and build from there Street Samurai and Physical\nAdepts use advanced combat skills to dominate the battlefield,\nShamans and Mages summon powerful allies and cast deadly\nspells, while Riggers and Deckers provide critical technological\nsupport, projecting their consciousness directly into drones and\ncomputer systems. Shadowrun Returns' classless skill system\nallows you to grow your character in any direction you choose.\nWant to start summoning spirits as an ork Shaman and evolve into\na cybered-up weapon specialist? Do it\nEngaging 2D/3D Art Style: Shadowrun Returns mixes dynamic 3D\ncharacters and lighting with a vibrant, hand-painted environment.\nIllustrated character portraits bring every conversation to life.\nExplore a world filled with detail, from the slums of the Redmond\nBarrens to the extravagant offices of powerful corporations\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n\n-  QUALITY, TRADITION  AND PRIDE -\n\n","torrent":{"xt":"urn:btih:461d0a6cc750fdbbdbbe354f7bc643f2a3e0a6db","amp;dn":"Shadowrun_Returns-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461d0a6cc750fdbbdbbe354f7bc643f2a3e0a6db","infoHashBuffer":{"type":"Buffer","data":[70,29,10,108,199,80,253,187,219,190,53,79,123,198,67,242,163,224,166,219]},"announce":[],"urlList":[]}}