{"title":"Green Tea and Health: Antioxidant Properties, Consumption","uid":12275016,"size":6572344,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47bd57353eb938a513af5cbab3b20a448a2bd0dc&amp;dn=Green+Tea+and+Health%3A+Antioxidant+Properties%2C+Consumption&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"mdusanjay","files":1,"time":1440341120,"description":" Nicolas Powell, &quot;Green Tea and Health: Antioxidant Properties, Consumption and Role in Disease Prevention&quot;\n\n2015 | ISBN-10: 1634829042 | 173 pages | PDF | 6 MB\n\nGreen tea is a popular healthful beverage in many parts of the world and its medical properties have been extensively explored. Green tea originated in China and the chemistry of green tea is renowned by its presence of polyphenolic compounds, particularly catechins. This book reviews the antioxidant activities of green tea catechins, its consumption and the ways it prevents potential infections; the potential beneficial effects of green tea consumption on Diabetes mellitus and how it can be used to reduce severe brain damage as well as its use in treating obesity. Other chapters examine how catechins may assist in the suppression of heart transplant rejection; a review on the new molecular events responsible for positive effects of EGCG; a discussion on EGCG as the most abundant catechin green tea and its capability of inhibiting cell proliferation and inducing apoptosis in cancer cells; an evaluation and comparison of the phenolic composition and metal content of commercially available aromatized green tea infusions; and an investigation of the chromatographic behavior of catechins","torrent":{"xt":"urn:btih:47bd57353eb938a513af5cbab3b20a448a2bd0dc","amp;dn":"Green+Tea+and+Health%3A+Antioxidant+Properties%2C+Consumption","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47bd57353eb938a513af5cbab3b20a448a2bd0dc","infoHashBuffer":{"type":"Buffer","data":[71,189,87,53,62,185,56,165,19,175,92,186,179,178,10,68,138,43,208,220]},"announce":[],"urlList":[]}}