{"title":"Donny Hathaway - Discography 1970-1990 [FLAC]","uid":8269362,"size":2405042143,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4872e16397ca092fd0af10b3dcb54539fe1c007c&amp;dn=Donny+Hathaway+-+Discography+1970-1990+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"rudown78","files":131,"time":1363572283,"description":"Donny Hathaway - Discography 1970-1990 [FLAC]\n\n\nDonny Hathaway was one of the brightest new voices in soul music at the dawn of the '70s, possessed of a smooth, gospel-inflected romantic croon that was also at home on fiery protest material. Hathaway achieved his greatest commercial success as Roberta Flack's duet partner of choice, but sadly he's equally remembered for the tragic circumstances of his death -- an apparent suicide at age 33. Hathaway was born October 1, 1945, in Chicago, but moved to St. Louis when he was very young, and began singing in church with his grandmother at the scant age of three. He began playing piano at a young age, and by high school, he was impressive enough to win a full-ride fine arts scholarship to Howard University to study music in 1964. While in college, he performed with a cocktail jazz outfit called the Ric Powell Trio, and wound up leaving school after three years to pursue job opportunities he was already being offered in the record industry.\n\nHathaway first worked behind the scenes as a producer, arranger, songwriter, and session pianist/keyboardist. He supported the likes of Aretha Franklin, Jerry Butler, and the Staple Singers, among many others, and joined the Mayfield Singers, a studio backing group that supported Curtis Mayfield's Impressions. Hathaway soon became a house producer at Mayfield's Curtom label, and in 1969 cut his first single, a duet with June Conquest called &quot;I Thank You Baby.&quot; From there he signed with Atco as a solo artist, and released his debut single, the inner-city lament &quot;The Ghetto, Pt. 1,&quot; toward the end of the year. While it failed to reach the Top 20 on the R&amp;B charts, &quot;The Ghetto&quot; still ranks as a classic soul message track, and has been sampled by numerous hip-hop artists. &quot;The Ghetto&quot; set the stage for Hathaway's acclaimed debut LP, Everything Is Everything, which was released in early 1970. In 1971, he released his eponymous second album and recorded a duet with former Howard classmate Roberta Flack, covering Carole King's &quot;You've Got a Friend.&quot; It was a significant hit, reaching the Top Ten on the R&amp;B charts, and sparked a full album of duets, Roberta Flack &amp; Donny Hathaway, which was released in 1972. The soft, romantic ballad &quot;Where Is the Love?&quot; topped the R&amp;B charts, went Top Five on the pop side, and won a Grammy, and the accompanying album went gold.\n\nAlso in 1972, Hathaway branched out into soundtrack work, recording the theme song for the TV series Maude and scoring the film Come Back Charleston Blue. However, in the midst of his blossoming success, he was also battling severe bouts of depression, which occasionally required him to be hospitalized. His mood swings also affected his partnership with Flack, which began to crumble in 1973. Hathaway released one more album that year, the ambitious Extension of a Man, and then retreated from the spotlight; over the next few years, he performed only in small clubs. In 1977, Hathaway patched things up with Flack and temporarily left the hospital to record another duet, &quot;The Closer I Get to You,&quot; for her Blue Lights in the Basement album. The song was a smash, becoming the pair's second R&amp;B number one in 1978, and also climbing to number two on the pop charts. Sessions for a second album of duets were underway when, on January 13, 1979, Hathaway was found dead on the sidewalk below the 15th-floor window of his room in New York's Essex House. The glass had been neatly removed from the window, and there were no signs of struggle, leading investigators to rule Hathaway's death a suicide; his friends were mystified, considering that his career had just started to pick up again, and Flack was devastated. Roberta Flack Featuring Donny Hathaway was released in 1980, and both of the completed duets -- &quot;Back Together Again&quot; and &quot;You Are My Heaven&quot; -- became posthumous hits. In 1990, Hathaway's daughter Lalah launched a solo career.\n\n\nDiscography:\n\nEverything Is Everything (1970)\nDonny Hathaway (1971)\nLive (1972)\nExtension of a Man (1973)\nIn Performance (1980)\nA Donny Hathaway Collection (1990)\n\nBonus Albums:\n\nRoberta Flack &amp; Donny Hathaway (1972)\nRoberta Flack Featuring Donny Hathaway (1980)\n\n\nAlbum artwork is included as well. Enjoy!!!\n","torrent":{"xt":"urn:btih:4872e16397ca092fd0af10b3dcb54539fe1c007c","amp;dn":"Donny+Hathaway+-+Discography+1970-1990+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4872e16397ca092fd0af10b3dcb54539fe1c007c","infoHashBuffer":{"type":"Buffer","data":[72,114,225,99,151,202,9,47,208,175,16,179,220,181,69,57,254,28,0,124]},"announce":[],"urlList":[]}}