{"title":"Peter Pan La Gran Aventura.DVD-Rip.Xvid-Ac3.5.1.spanish.","uid":4333165,"size":2617585664,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:48c1e0ae834ab0bfa8265d08a8e79a7024e9f845&amp;dn=Peter+Pan+La+Gran+Aventura.DVD-Rip.Xvid-Ac3.5.1.spanish.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"nahla","files":1,"time":1218156399,"description":"DirecciÃƒÂ³n: P.J. Hogan.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2003.\nDuraciÃƒÂ³n: 113 min.\nInterpretaciÃƒÂ³n: Jason Isaacs (Mr. Darling/CapitÃƒÂ¡n Hook), Jeremy Sumpter (Peter Pan), Rachel Hurd-Wood (Wendy Darling), Ludivine Sagnier (Campanilla), Lynn Redgrave (TÃƒÂ­a Millicent), Richard Briers (Smee), Olivia Williams (Sra. Darling), Geoffrey Palmer (Sir Edward Quiller Couch), Harry Newell (John Darling), Freddie Popplewell (Michael Darling).\nGuiÃƒÂ³n: P.J. Hogan y Michael Goldenberg; basado en la historia original de J. M. Barrie.\nProducciÃƒÂ³n: Lucy Fisher, Douglas Wick y Patrick McCormick.\nMÃƒÂºsica: James Newton Howard.\nFotografÃƒÂ­a: Donald McAlpine.\nMontaje: Garth Craven, Michael Kahn y Paul Rubell.\nDiseÃƒÂ±o de producciÃƒÂ³n: Roger Ford.\nDirecciÃƒÂ³n artÃƒÂ­stica: Michelle McGahey.\nVestuario: Janet Patterson.\nEstreno en USA: 25 Diciembre 2003.\nEstreno en EspaÃƒÂ±a: 26 Marzo 2004.\n\nSINOPSIS\n\nUna helada noche de Londres, Wendy Darling (Rachel Hurd-Wood) fascina a sus hermanos pequeÃƒÂ±os con historias acerca de piratas, es-padachines y el CapitÃƒÂ¡n Garfio (Jason Isaacs), el legendario pirata que no le teme a nada mÃƒÂ¡s que al tic-tac del reloj. Pero el padre de los chicos ha decretado que es tiempo de que Wendy crezca y , por lo tanto, de que no les vuelva a contar mÃƒÂ¡s historias infantiles. Ella debe ser instruida por su estricta tÃƒÂ­a Millicent (Lynn Redgrave) para convertirse en una mujer y casarse. Lo que no saben los Darlings es que Peter Pan (Jeremy Sumpter) tambiÃƒÂ©n ama las historias de Wendy, y viaja grandes distancias para escucharlas. Su apariciÃƒÂ³n en el cuarto de los niÃƒÂ±os esa noche, acompaÃƒÂ±ado de la celosa hada Campanilla (Ludivine Sagnier), inicia una enorme aventura para Wendy y sus hermanos. SiguiÃƒÂ©ndolo por la ventana, los niÃƒÂ±os vuelan sobre los tejados de Londres iluminados por la luna, a travÃƒÂ©s de una galaxia de radiantes planetas y estrellas hacia el mÃƒÂ¡gico &amp;#039;PaÃƒÂ­s de nunca ja-mÃƒÂ¡s&amp;#039;, donde ellos empiezan una emocionante nueva vida, libre de las reglas de los adultos, junto a Peter y los &amp;#039;NiÃƒÂ±os perdidos&amp;#039;. Al en-frentarse con piratas depravados, sirenas malintencionadas, un monstruoso cocodrilo y, lo peor de todo, el vicioso gancho de metal del CapitÃƒÂ¡n Garfio, Wendy y sus hermanos descubren de quÃƒÂ© es-tÃƒÂ¡n hechos. Y la continua batalla entre Peter y Garfio desemboca en un emocionante clÃƒÂ­max en un mundo lleno de fantasÃƒÂ­a.","torrent":{"xt":"urn:btih:48c1e0ae834ab0bfa8265d08a8e79a7024e9f845","amp;dn":"Peter+Pan+La+Gran+Aventura.DVD-Rip.Xvid-Ac3.5.1.spanish.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48c1e0ae834ab0bfa8265d08a8e79a7024e9f845","infoHashBuffer":{"type":"Buffer","data":[72,193,224,174,131,74,176,191,168,38,93,8,168,231,154,112,36,233,248,69]},"announce":[],"urlList":[]}}