{"title":"[ExploitedCollegeGirls] Hilary (08.27.2015)","uid":12303348,"size":1096322742,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:48c2cc1e1e8c5bcb8e84b642f638f5486bc4ee3b&amp;dn=%5BExploitedCollegeGirls%5D+Hilary+%2808.27.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"chkm8te","files":1,"time":1440752077,"description":"[ExploitedCollegeGirls] Hilary (08.27.2015)\n\nShy first timer Hilary is back to give up her anal virginity on camera. Surely you remember her tight little athlete's body, bubble butt and tight pussy. Well this time the pussy plays second string and Jay pounds her ass for most of the update. After some nervousness and what Jay calls 'the anal training wheels' in intraoffice memos, she warms up to it and really ends up enjoying getting butt fucked.\nSince we got a nice in depth interview last time, Jay skips the small talk and gets right down to prepping Hilary's tight backdoor for an anal invasion. He starts off with a finger and plenty of lube and gradually graduates to various toys and vibes. She does her best to relax and before long her balloon knot is limber and ready for penis.\nAfter getting warmed up and warming up Jay's dong with another one of her great blowjobs, Hilary gets settled on the bed in a position that the poets of 2 Live Crew After immortalized in song: face down, ass up. Jay lubes up and despite some discomfort eventually manages to fill Hilary's incredibly tight booty. Don't mind her complaining, she's just getting used to a cock in a totally new place. Every Ex Co Gi shoot has a safeword and since we never once hear Hilary shout &quot;Hanna Montana!&quot; we know it's all good.\nAfter getting the package delivered to the backdoor, Jay tries a few different positions and eventually finds one that Hilary really likes. She cooperates like a champ and finally gets into it. As a reward, Jay flips her over and pumps her pussy for a bit before having her drop to her knees and catch a face glazing facial.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=6dxsyoyhnqqb21xffwvn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=6dxsyoyhnqqb21xffwvn.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=j7sfalz1hs0053zagm40.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=j7sfalz1hs0053zagm40.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:48c2cc1e1e8c5bcb8e84b642f638f5486bc4ee3b","amp;dn":"%5BExploitedCollegeGirls%5D+Hilary+%2808.27.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48c2cc1e1e8c5bcb8e84b642f638f5486bc4ee3b","infoHashBuffer":{"type":"Buffer","data":[72,194,204,30,30,140,91,203,142,132,182,66,246,56,245,72,107,196,238,59]},"announce":[],"urlList":[]}}