{"title":"Infinite skills - Learning Autodesk Inventor 2013","uid":10870687,"size":2373693270,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:494024a2437301d940762d41d77507aaf20efb4b&amp;dn=Infinite+skills+-+Learning+Autodesk+Inventor+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":4,"uploader":"NepsterJay","files":612,"time":1408927435,"description":"In this Autodesk Inventor 2013 training course, expert author and trainer Andrew Warren takes you through the ins and outs of this 3D mechanical and solid modeling design software. This tutorial requires no previous experience using Inventor and is built specifically wit the beginning Inventor user in mind.\n\nYou will start with the absolute basics of Inventor, beginning with the interface, concepts and best practices in the industry. Once you have solid foundation in the basics, you follow along step by step as the author takes you through sketching, creating a feature from those sketches, turning the features into parts, building an assembly from the parts and creating a presentation view of the assembly. The video tutorial finishes off with teaching you how to create drawings of your design.\n\nBy the completion of this computer based training course for Inventor 2013, you will have a solid grasp of how to use Inventor to build parts, assemblies and drawings on your own, bringing your own projects to life. Working files are included to let you follow through the tutorial every step of the way with the same source materials that the author uses in the lessons.","torrent":{"xt":"urn:btih:494024a2437301d940762d41d77507aaf20efb4b","amp;dn":"Infinite+skills+-+Learning+Autodesk+Inventor+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"494024a2437301d940762d41d77507aaf20efb4b","infoHashBuffer":{"type":"Buffer","data":[73,64,36,162,67,115,1,217,64,118,45,65,215,117,7,170,242,14,251,75]},"announce":[],"urlList":[]}}