{"title":"Spaceman (2016) (Epub) Gooner","uid":15956715,"size":61324753,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:494494bc3d90af4f1898842dbe9c12d1b159bc89&amp;dn=Spaceman+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":10,"uploader":"GoonerTPB","files":2,"time":1475626212,"description":"Spaceman - An Astronauts Unlikely Journey to Unlock the Secrets of the Universe (2016) (Epub) Goone\r\n\r\nPublisher: Crown Archetype (22 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 0451497279\r\nISBN-13: 978-0451497277\r\n\r\nMike Massimino's compelling memoir takes us on a brilliant journey where the nerdiest science meets the most thrilling adventure to reveal what 'the right stuff' truly is. Many children dream of becoming an astronaut when they grow up, but when NASA rejected him, he kept on trying. Even being told his poor eyesigh would mean he could never make it didn't stop him; he simply trained his eyes to be better. Finally, at the third time of asking, NASA accepted him.\r\n     \r\nSo began Massimino's 18-year career as an astronaut, and the extraordinary lengths he went to to get accepted was only the beginning. In this awe-inspiring memoir, he reveals the hard work, camaraderie and sheer guts involved in the life of an astronaut; he vividly describes what it is like to strap yourself into the Space Shuttle and blast off into space, or the sensation of walking in space, as he did when he embarked on an emergency repair of the Hubble telescope. He also talks movingly about the Columbia tragedy, and how it felt to step into the Space Shuttle again in the aftermath of that disaster.\r\n     \r\nMassimino was inspired by the film The Right Stuff, and this book is not only a tribute to those fellow astronauts he worked with, but also a stunning example of someone who had exactly those attributes himself","torrent":{"xt":"urn:btih:494494bc3d90af4f1898842dbe9c12d1b159bc89","amp;dn":"Spaceman+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"494494bc3d90af4f1898842dbe9c12d1b159bc89","infoHashBuffer":{"type":"Buffer","data":[73,68,148,188,61,144,175,79,24,152,132,45,190,156,18,209,177,89,188,137]},"announce":[],"urlList":[]}}