{"title":"Devour_The_Day-Time_And_Pressure-(Retail)-2013-HHI","uid":8882370,"size":59734916,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:496544db10505e1298ad7fe373e13f9cacdb71c0&amp;dn=Devour_The_Day-Time_And_Pressure-%28Retail%29-2013-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"raidy","files":14,"time":1378363347,"description":"Artist......: Devour the day\nAlbum.......: Time and pressure\nGrabber     : EAC (secure mode rip!)\nEncoder.....: LAME v3.90.3 --alt-preset standard\nRelease Date: May-07-2013\nRip Date....: Sep-04-2013\nRipped by...: [HHI] - Happy Hacker Industries - [HHI]\nGenre.......: Rock\nQuality     : VBRkbps / 44.1kHz / Joint-Stereo\nPlaytime    : 35:40 min\nCD Songs    : 11\nLabel.......: CD Baby\nReleaseNotes:\n\nIn 2012 Egypt Central was dissolved much to the surprise to their fans. Former Egypt Central drummer Blake Alison and bassist Joey Chicago wasted no time in getting back in the game announcing the formation of their new band Devour The Day. Devour The Day finds Blake Allison taking center stage as the guitarist and vocalist rather than behind the drum kit. Within a year the guys had their debut album Time &amp; Pressure written, recorded and out to hard rock fans. An impressive feat for two guys who have been through the fire of rock n roll and appear ready to make an impression bigger than before. \n\nTime &amp; Pressure wastes no time to rock the listener hard with opening track &quot;Respect&quot;. A fast pace high energy opening track with intense vocal delivery. Allison lays it down right from the get go letting people know he is very capable of singing and singing well. Blending melody and aggression with lyrics of frustration. &quot;Good Man&quot; follows with a catchy sound reminiscent of a classic rock tune. The song is currently getting heavy air play on hard rock formats throughout North America and Sirius XM radio channel Octane. &quot;Blackout&quot; is possibly the most contagious song on the entire album. With a catchy unique vocal delivery and sing along chorus you will find your singing for days. With a great lyrical attack relatable to anyone frustrated with others actions. &quot;You and Not Me&quot; is yet another catchy energy driven hard rock track. With a stand out chorus and melody line you can't help but bop your head back and forth. &quot;Move On&quot; changes things up slightly with a dance like beat, electronic sounds, and mix of melody and heaviness similar to that of modern day Linkin Park. Lyrical inspiring conveying to never give up no matter how many obstacles are in your way. &quot;Oath&quot; is a dynamic track with a great mixture of distorted guitars, piano, and emotional vocals. The track is possibly the most complete on the entire album. &quot;Crossroads&quot; winds things down with melodic piano and pop like dance beat. The album closes out with the stripped down track &quot;The Drifter&quot;. Allison's voice is put on display with himself and a acoustic guitar. Telling the sad story of a someone who's life is defined by no direction. Living off dreams and never settling down. The individual is incomplete and drifts from place to place inevitable defining their\nlife.\n\nTime &amp; Pressure is a very solid debut album. It's clear Allison and Chicago had a\ndifferent artistic vision then that of Egypt Central and had the music ready to pour out of them. Musically a pleasant blend of heavy and melodic rock. Catchy enough to find you singing along to almost every song but edging enough for avid hard rock fans. Lyrically driven by frustration, anger, disappointment but in the end finding hope and clarity. A truly inspirational piece anyone can find comfort and relation in. Though the door has closed on Egypt Central a gate has opened for Devour Day. Cryptic Rock  give this album 5 out of 5 stars.\n\n\nAlbum opinion is taken from sites such as cduniverse and allmusic.\nHHI has no opinion with regard to the quality of the Artist.\nWe hope you enjoy the music whatever it is!\n\n\nTrack Listing....:\n01.Respect                                              [02:50]\n02.Good man                                             [03:31]\n03.Blackout                                             [03:05]\n04.You and not me                                       [03:08]\n05.Move on                                              [03:04]\n06.Get out of my way                                    [03:15]\n07.Oath                                                 [03:33]\n08.Reckless                                             [02:49]\n09.Handshakes to fist fights                            [03:27]\n10.Crossroads                                           [03:22]\n11.The drifter                                          [03:36]\n________\n35:40 min\n56,10 MB\n\nGREETS\n\nEveryone that has supported us over the years.  You know who you are.","torrent":{"xt":"urn:btih:496544db10505e1298ad7fe373e13f9cacdb71c0","amp;dn":"Devour_The_Day-Time_And_Pressure-%28Retail%29-2013-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"496544db10505e1298ad7fe373e13f9cacdb71c0","infoHashBuffer":{"type":"Buffer","data":[73,101,68,219,16,80,94,18,152,173,127,227,115,225,63,156,172,219,113,192]},"announce":[],"urlList":[]}}