{"title":"Quantum Field Theory for the Gifted Amateur (gnv64)","uid":10734530,"size":16079971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:497b6733b7e5fb675b7b232cb1b3be803d8b39f1&amp;dn=Quantum+Field+Theory+for+the+Gifted+Amateur+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"gnv65","files":-1,"time":1407679098,"description":"Quantum Field Theory for the Gifted Amateur\nby Tom Lancaster and Stephen J. Blundell\nOxford University Press | June 2014 | ISBN-10: 019969933X | PDF | 512 pages | 15.3 mb\n\nQuantum field theory is arguably the most far-reaching and beautiful physical theory ever constructed, with aspects more stringently tested and verified to greater precision than any other theory in physics. Unfortunately, the subject has gained a notorious reputation for difficulty, with forbidding looking mathematics and a peculiar diagrammatic language described in an array of unforgiving, weighty textbooks aimed firmly at aspiring professionals. However, quantum field theory is too important, too beautiful, and too engaging to be restricted to the professionals. This book on quantum field theory is designed to be different. It is written by experimental physicists and aims to provide the interested amateur with a bridge from undergraduate physics to quantum field theory. The imagined reader is a gifted amateur, possessing a curious and adaptable mind, looking to be told an entertaining and intellectually stimulating story, but who will not feel patronised if a few mathematical niceties are spelled out in detail. Using numerous worked examples, diagrams, and careful physically motivated explanations, this book will smooth the path towards understanding the radically different and revolutionary view of the physical world that quantum field theory provides, and which all physicists should have the opportunity to experience.\n\nAbout the Author\nTom Lancaster, Lecturer in Physics, Department of Physics, University of Durham,Stephen J. Blundell, Professor of Physics, Department of Physics, University of Oxford. He was a Research Fellow in Physics at the University of Oxford, before becoming a Lecturer at the University of Durham in 2012.\nStephen J. Blundell is a Professor of Physics at the University of Oxford and a Fellow of Mansfield College, Oxford.\n\nCONTENTS\n0 Overture 1\nI The Universe as a set of harmonic oscillators 9\nII Writing down Lagrangians 49\nIII The need for quantum fields 71\nIV Propagators and perturbations 143\nV Interlude: wisdom from statistical physics 195\nVI Path integrals 209\nVII Topological ideas 259\nVIII Renormalization: taming the infinite 273\nIX Putting a spin on QFT 321\nX Some applications from the world of condensed matter 369\nXI Some applications from the world of particle physics 423\nA Further reading 467\nB Useful complex analysis 473\nIndex 480\n","torrent":{"xt":"urn:btih:497b6733b7e5fb675b7b232cb1b3be803d8b39f1","amp;dn":"Quantum+Field+Theory+for+the+Gifted+Amateur+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"497b6733b7e5fb675b7b232cb1b3be803d8b39f1","infoHashBuffer":{"type":"Buffer","data":[73,123,103,51,183,229,251,103,91,123,35,44,177,179,190,128,61,139,57,241]},"announce":[],"urlList":[]}}