{"title":"Lewis Carroll - Alice in Wonderland &amp; other works (9 books)","uid":9786026,"size":122673022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a2949503b4659bff934264fac785ceec637978a&amp;dn=Lewis+Carroll+-+Alice+in+Wonderland+%26amp%3B+other+works+%289+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":4,"uploader":"workerbee","files":-1,"time":1395161441,"description":"\nCharles Lutwidge Dodgson (1832-1898), better known by his pen name, LEWIS CARROLL, was an English writer, mathematician, logician, Anglican deacon and photographer.  His most famous writings are ALICE'S ADVENTURES IN WONDERLAND and its sequel THROUGH THE LOOKING-GLASS, as well as the poems &quot;The Hunting of the Snark&quot; and &quot;Jabberwocky&quot;, all examples of the genre of literary nonsense.  He is noted for his facility at word play, logic, and fantasy.\n\nThis collection is anchored by two outstanding contributions: Alexander Woollcott's edition of Carroll's COMPLETE WORKS and the &quot;Definitive Edition&quot; of Martin Gardner's ANNOTATED ALICE, which combines the notes of his original 1960 edition with the 1990 update, &quot;More Annotated Alice&quot;, as well as additional new discoveries and updates drawn from Gardner's encyclopedic knowledge of the texts.  It was Martin Gardner who first decoded the wordplay and mathematical riddles that lie embedded in the ALICE stories, and this marvellously entertaining edition continues to be highly sought after by families and scholars alike.\n\nAll the ALICE editions here feature John Tenniel's classic and beloved art.  Finally, a selection of Carroll's work in mathematics and logic is also included.\n\n\nThe books are a mix of PDF and ePUB formats as noted below:\n\n* ALICE'S ADVENTURES IN WONDERLAND &amp; THROUGH THE LOOKING-GLASS (Penguin Classics, 1998).  Edited with an Introduction and Notes by Hugh Haughton. -- ePUB\n\n* ALICE'S ADVENTURES IN WONDERLAND &amp; THROUGH THE LOOKING-GLASS (Signet Classics, 2000).  With an Introduction by Martin Gardner. -- ePUB\n\n* THE ANNOTATED ALICE: The Definitive Edition (Norton, 2000).  With an Introduction and Notes by Martin Gardner. -- PDF\n\n* THE COMPLETE ALICE IN WONDERLAND (Wonderland Imprints, 2010).  Edited with an Introduction by Kent David Kelly. -- ePUB\n\n* THE COMPLETE WORKS OF LEWIS CARROLL (Vintage, 1976).  With an Introduction by Alexander Woollcott and Illustrations by John Tenniel. -- PDF\n\n* THE GAME OF LOGIC (Macmillan, 1886). -- PDF\n\n* THE MATHEMATICAL RECREATIONS OF LEWIS CARROLL: Pillow Problems &amp; A Tangled Tale (Dover, 1958). -- PDF\n\n* SYMBOLIC LOGIC (Clarkson N. Potter, 1977).  Edited with Annotations and an Introduction by William Warren Bentley III.  [Please note: pp. 320-486 are missing.] -- PDF\n\n\nAlso included for your edification:\n\n* Martin Gardner, THE UNIVERSE IN A HANDKERCHIEF: Lewis Carroll's Mathematical Recreations, Games, Puzzles, and Word Plays (Copernicus, 1996). -- PDF\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n    &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n\n","torrent":{"xt":"urn:btih:4a2949503b4659bff934264fac785ceec637978a","amp;dn":"Lewis+Carroll+-+Alice+in+Wonderland+%26amp%3B+other+works+%289+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a2949503b4659bff934264fac785ceec637978a","infoHashBuffer":{"type":"Buffer","data":[74,41,73,80,59,70,89,191,249,52,38,79,172,120,92,238,198,55,151,138]},"announce":[],"urlList":[]}}