{"title":"16 GONG Albums","uid":3816108,"size":1374389477,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4a3e053711c794fd00037110e24f49390962ee82&amp;dn=16+GONG+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"odoman","files":161,"time":1190526741,"description":"Gong slowly came together in the late &amp;#039;60s when Australian guitarist Daevid Allen (ex-Soft Machine) began making music with his wife, singer Gilli Smyth, along with a shifting lineup of supporting musicians. Albums from this period include Magick Brother, Mystic Sister (1969) and the impromptu jam session Bananamoon (1971) featuring Robert Wyatt from the Soft Machine, Gary Wright from Spooky Tooth, and Maggie Bell. A steady lineup featuring Frenchman Didier Malherbe (sax and reeds), Christian Tritsch (bass), and Pip Pyle (drums) along with Allen (glissando guitar, vocals) and Gilli Smyth (space whisper vocals) was officially named Gong and released Camembert Electrique in late 1971, as well as providing the soundtrack to the film Continental Circus and music for the album Obsolete by French poet Dashiel Hedayat.\n\nCamembert Electrique contained the first signs of the band&amp;#039;s mythology of the peaceful Planet Gong populated by Radio Gnomes, Pothead Pixies, and Octave Doctors. These characters along with Zero the Hero are the focus of Gong&amp;#039;s next three albums, the Radio Gnome Trilogy, consisting of Flying Teapot (1973), Angel&amp;#039;s Egg (1974), and You (1975). On these albums, protagonist Zero the Hero is a space traveler from Earth who gets lost and finds the Planet Gong, is taught the ways of that world by the gnomes, pixies, and Octave Doctors and is sent back to Earth to spread the word about this mystical planet. The band themselves adopted nicknames -- Allen was Bert Camembert or the Dingo Virgin, Smyth was Shakti Yoni, Malherbe was Bloomdido Bad de Grasse, Tritsch was the Submarine Captain and Pyle the Heap. Over the course of the trilogy, Tritsch and Pyle left and were replaced by Mike Howlett (bass) and Pierre Moerlen (drums). New members Steve Hillage (guitar) and Tim Blake (synthesizers) joined.\n\nAfter You, Allen, Hillage, and Smyth left the group due to creative differences as well as fatigue. Guitarist Allen Holdsworth joined and the band drifted into virtuosic if unimaginative jazz fusion. Hillage and Allen each released several solo albums and Smyth formed Mothergong. Nevertheless the trilogy lineup has reunited for a few one-off concerts including a 1977 French concert documented on the excellent Gong Est Mort, Vive Gong album. Allen also reunited with Malherbe and Pyle as well as other musicians he had collaborated with over the years for 1992&amp;#039;s Shapeshifter album. Hillage also worked as the ambient-techno alias System 7. A number of Gong-related bands have existed over the years, including Mothergong, Gongzilla, Pierre Moerlin&amp;#039;s Gong, NY Gong, Planet Gong, and Gongmaison. During the new millennium Gong material continued to be released, including Live 2 Infinitea issued in fall 2000, as well as numerous reissues. I Am Your Egg appeared in 2006 from United States of Distribution.","torrent":{"xt":"urn:btih:4a3e053711c794fd00037110e24f49390962ee82","amp;dn":"16+GONG+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a3e053711c794fd00037110e24f49390962ee82","infoHashBuffer":{"type":"Buffer","data":[74,62,5,55,17,199,148,253,0,3,113,16,226,79,73,57,9,98,238,130]},"announce":[],"urlList":[]}}