{"title":"James Patterson -Private Games","uid":15589154,"size":277500721,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4a68d18745a8bca51d704694a8c0b7e7d2f55a94&amp;dn=James+Patterson+-Private+Games&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"twocows","files":10,"time":1471497399,"description":"Private Games\r\n\r\nby James Patterson\r\n\r\n \r\nPrivate, the world's most renowned investigation firm, has been commissioned to provide security for the 2012 Olympic Games in London. Its agents are the smartest, fastest, and most technologically advanced on earth, and 400 of them have been transferred to London to protect more than 10,000 competitors who represent more than 200 countries. The opening ceremony is hours away when Private investigator and single father of twins Peter Knight is called to the scene of a ruthless murder. A high-ranking member of the Games organizing committee has been killed. It's clear to Peter that this wasn't a crime of passion but one of precise calculation. Newspaper reporter Karen Pope receives a letter from a person who calls himself Cronus, claiming responsibility for the murder. He promises to restore the Olympics to their ancient glory and to destroy all those who have ruined the Games with lies, corruption, and greed. Immediately Karen hires Private to examine the letter, and she and Peter uncover a criminal genius who won't stop until he's completely obliterated the modern Games. &quot;America's #1 storyteller&quot; (Forbes) delivers an exhilarating, action-packed thriller that brings the splendor and emotion of the Olympics to a wildly powerful climax","torrent":{"xt":"urn:btih:4a68d18745a8bca51d704694a8c0b7e7d2f55a94","amp;dn":"James+Patterson+-Private+Games","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a68d18745a8bca51d704694a8c0b7e7d2f55a94","infoHashBuffer":{"type":"Buffer","data":[74,104,209,135,69,168,188,165,29,112,70,148,168,192,183,231,210,245,90,148]},"announce":[],"urlList":[]}}