{"title":"Jeanette Winterson - Novels &amp; other works (13 books)","uid":9430327,"size":23355852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4afd95a00f3cd909fcf99ad96c1d688a81193200&amp;dn=Jeanette+Winterson+-+Novels+%26amp%3B+other+works+%2813+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":4,"uploader":"workerbee","files":-1,"time":1388786190,"description":"\nJEANETTE WINTERSON (b. 1959) is an acclaimed British writer and journalist, and one of the most original and provocative voices to emerge during the 1980s.  She was made an officer of Order of the British Empire (OBE) in 2006 &quot;for services to literature&quot;.\n\nHer first novel, ORANGES ARE NOT THE ONLY FRUIT (1985), won the Whitbread Prize for a First Novel.  She won the 1987 John Llewellyn Rhys Prize for THE PASSION, a novel set in Napoleonic Europe.  SEXING THE CHERRY (1989), depicting an invented world set during the English Civil War featuring the fabulous 'Dog Woman' and the orphan she raises, won that year's E. M. Forster Award.\n\nWinterson's subsequent novels explore the boundaries of physicality and the imagination, gender polarities, and sexual identities, and have won several literary awards.  She is a two-time winner of the Lambda Literary Awards: WRITTEN ON THE BODY (1993) won in the category of Lesbian Fiction in 1994, and WHY BE HAPPY WHEN YOU COULD BE NORMAL? (2011) won in the category of Lesbian Memoir or Biography in 2013.  Her novella THE DAYLIGHT GATE (2012), based on the 1612 Pendle Witch Trials, was published on the 400th anniversary of the trials.\n\nIn WEIGHT (2005), Winterson brings the mythical figure of Atlas into the space age and sets him free at last.  In her retelling of the story of a god tricked into holding the world on his shoulders and his brief reprieve, she sets difficult questions about the nature of choice and coercion, how we choose our own destiny and at the same time can liberate ourselves from our seeming fate. \n\nHer 2011 memoir, WHY BE HAPPY WHEN YOU COULD BE NORMAL?, is the story of how a painful past, which Winterson thought she had written over and repainted, rose to haunt her later in life, sending her on a journey into madness and out again, in search of her biological mother.\n\n\nAll the following books are in EPUB format (THE PASSION is also in PDF):\n\n* ART &amp; LIES: A Piece for Three Voices and a Bawd (Knopf, 1995)\n\n* THE BATTLE OF THE SUN (Bloomsbury, 2009)\n\n* BOATING FOR BEGINNERS (Vintage, 1985)\n\n* THE DAYLIGHT GATE (Arrow, 2012)\n\n* GUT SYMMETRIES (Knopf, 1997)\n\n* ORANGES ARE NOT THE ONLY FRUIT (Knopf, 1985)\n\n* THE PASSION (Grove, 1987) -- PDF + EPUB\n\n* SEXING THE CHERRY (Grove, 1989)\n\n* THE STONE GODS (Knopf, 2007)\n\n* TANGLEWRECK (Bloomsbury, 2011)\n\n* WEIGHT: The Myth of Atlas and Heracles (Canongate, 2005)\n\n* WHY BE HAPPY WHEN YOU COULD BE NORMAL? (Grove, 2011)\n\n* WRITTEN ON THE BODY (Knopf, 1993)\n","torrent":{"xt":"urn:btih:4afd95a00f3cd909fcf99ad96c1d688a81193200","amp;dn":"Jeanette+Winterson+-+Novels+%26amp%3B+other+works+%2813+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4afd95a00f3cd909fcf99ad96c1d688a81193200","infoHashBuffer":{"type":"Buffer","data":[74,253,149,160,15,60,217,9,252,249,154,217,108,29,104,138,129,25,50,0]},"announce":[],"urlList":[]}}