{"title":"A Tundra Food Chain (gnv64)","uid":15826225,"size":24794194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b3c5eebd5a1aa8b4d8bffff979384da9308916f&amp;dn=A+Tundra+Food+Chain+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"gnv65","files":4,"time":1473847933,"description":"A Tundra Food Chain: A Who-Eats-What Adventure in the Arctic (Follow That Food Chain)\r\nby Rebecca Hogue Wojahn and Donald Wojahn\r\nLerner Classroom | 2009 | ISBN 978–0–8225–7500–9 | 68 Pages | PDF | 23.6 mb\r\n\r\nWelcome to the arctic tundra! As you hike along the frozen ground of this cold, dry region, the tundra may seem quiet and empty. But it is full of life, in the spring when migrating lemmings munch on spring flowers, and even in the winter, when fur-coated wolves, foxes, and hares dart and prowl through the snow. Summer and winter in the tundra, the hunt is on to find foodand to avoid becoming someone elses next meal. All living things are connected to one another in a food chain, from animal to animal, animal to plant, plant to insect, and insect to animal. What path will you take to follow the food chain through the tundra? Will you Zoom with a peregrine falcon as it aims for its prey? Chomp with a caribou grazing on grasses? Sneak up on a polar bear fishing for its dinner? Follow all three chains and many more on this who-eats-what adventure!\r\n\r\nAbout the Author \nhttps://s12.postimg.io/qturfkpot/Rebacca.jpg\r\nRebecca Hogue Wojahn holds degrees in education and library science and has worked as a teacher and school library media specialist. She currently is a librarian at the University of Wisconsin-Eau Claire, where she works closely with the education faculty and students and manages the K-12 collections. She frequently speaks on children's literature topics. Her writings for children have appeared in Highlights for Children, Faces, Appleseeds and Cobblestone magazines. Rebecca lives in Eau Claire, Wisconsin with her husband and two sons, one of whom, like Evan, has endured health problems and long hospital stays.\r\n\r\nCONTENTS\r\nwelcome to the Arctic tundra . . . 4\r\nchoose a tertiary consumer . . . 6\r\nA Tundra food web . . . 23\r\nshrubs, wildflowers and sedges . . . 40\r\nGlossary...60\r\nFurther Read ing and websites . . . 61\r\nSelected Bibliogra phy . . . 62\r\nINdex ...63\r\n \nhttps://s17.postimg.io/upc0yd9pr/A_Tundra_Food_Chain.jpg","torrent":{"xt":"urn:btih:4b3c5eebd5a1aa8b4d8bffff979384da9308916f","amp;dn":"A+Tundra+Food+Chain+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b3c5eebd5a1aa8b4d8bffff979384da9308916f","infoHashBuffer":{"type":"Buffer","data":[75,60,94,235,213,161,170,139,77,139,255,255,151,147,132,218,147,8,145,111]},"announce":[],"urlList":[]}}