{"title":"Experiment Eleven: Dark Secrets Behind a Wonder Drug","uid":16044700,"size":2912695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4baf68a1991a77339eef25bba7d1bcff1516b581&amp;dn=Experiment+Eleven%3A+Dark+Secrets+Behind+a+Wonder+Drug&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":3,"uploader":"marty14","files":1,"time":1476551402,"description":"Experiment Eleven: Dark Secrets Behind the Discovery of a Wonder Drug - Peter Pringle [epub]\r\n\r\nIn 1943, Albert Schatz, a young Rutgers College Ph.D. student, worked on a wartime project in microbiology professor Selman Waksman's lab, searching for an antibiotic to fight infections on the front lines and at home. In his eleventh experiment on a common bacterium found in farmyard soil, Schatz discovered streptomycin, the first effective cure for tuberculosis, one of the world's deadliest diseases. However, Waksman took credit for the discovery and secretly enriched himself with royalties from the streptomycin patent. In an unprecedented lawsuit, young Schatz sued Waksman, and was awarded the title of &quot;co-discoverer&quot; and a share of the royalties. But two years later, Professor Waksman alone was awarded the Nobel Prize. Schatz disappeared into academic obscurity.\r\n\r\nFor the first time, acclaimed author and journalist Peter Pringle unravels the intrigues behind one of the most important discoveries in the history of medicine. The streptomycin patent was a breakthrough for the drug companies, overturning patent limits on products of nature and paving the way for today's biotech world. As dozens more antibiotics were found, many from the same family as streptomycin, the drug companies created oligopolies and reaped big profits. Pringle uses firsthand accounts and archives in the United States and Europe to reveal the intensely human story behind the discovery that started a revolution in the treatment of infectious diseases and shaped the future of Big Pharma","torrent":{"xt":"urn:btih:4baf68a1991a77339eef25bba7d1bcff1516b581","amp;dn":"Experiment+Eleven%3A+Dark+Secrets+Behind+a+Wonder+Drug","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4baf68a1991a77339eef25bba7d1bcff1516b581","infoHashBuffer":{"type":"Buffer","data":[75,175,104,161,153,26,119,51,158,239,37,187,167,209,188,255,21,22,181,129]},"announce":[],"urlList":[]}}