{"title":"Metallurgy and Mechanics of Welding (ePUB,Retail) {32Skulls}","uid":11896792,"size":11264323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bc322e5069a42ab294cabc933de69d81d36089e&amp;dn=Metallurgy+and+Mechanics+of+Welding+%28ePUB%2CRetail%29+%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"32Skulls","files":1,"time":1431185344,"description":"This book offers a comprehensive overview on the subject of welding. The first part of the book provides a review of the various different welding processes in use, including both traditional and more recent high energy input welding techniques. It then goes on the deal with the entire set of thermal, metallurgical and mechanical phenomena in the heat affected zone (HAX) of bases metals and molten metals. Particular attention is paid to the problems of rupturing, as well as to fatigue and brittle fracturing. The second part of the book concentrates on the applications of welding for various materials and in various industrial fields: sheet steel for cars, mechanical system components, steel construction and fabrication, pressure vessels, and the welding of stainless steels and aluminum alloys. Finally, the evolution of standardization in welding is examined.\nWith contributions from authors who are experts in their particular fields, all those involved din both the theoretical study and the practical fields, all those involved in both the theoretical study and the practical application of welding techniques will find this book to be invaluable","torrent":{"xt":"urn:btih:4bc322e5069a42ab294cabc933de69d81d36089e","amp;dn":"Metallurgy+and+Mechanics+of+Welding+%28ePUB%2CRetail%29+%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bc322e5069a42ab294cabc933de69d81d36089e","infoHashBuffer":{"type":"Buffer","data":[75,195,34,229,6,154,66,171,41,76,171,201,51,222,105,216,29,54,8,158]},"announce":[],"urlList":[]}}