{"title":"Sun Kil Moon - Benji (Deluxe) (2014) [FLAC]","uid":9602218,"size":467422086,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c0efbbba84c88afb1a0388a20abb2d07bb6d2f7&amp;dn=Sun+Kil+Moon+-+Benji+%28Deluxe%29+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"politux","files":-1,"time":1392139804,"description":"\n  Sun Kil Moon - Benji (Deluxe) (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Singer/Songwriter, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n  \n  01 Carissa \n  02 I Can't Live Without My Mother's Love \n  03 Truck Driver\n  04 Dogs \n  05 Pray for Newtown \n  06 Jim Wise \n  07 I Love My Dad \n  08 I Watched the Film the Song Remains the Same \n  09 Richard Ramirez Died Today of Natural Causes \n  10 Micheline \n  11 Ben's My Friend \n\n  Disc 2 - Live\n\n  01 Micheline\n  02 Richard Ramirez \n  03 I Love My Dad \n  04 I Can't Live Without My Mother's Love \n  05 Truck Driver \n\n  If ever there was an album for Mark Kozelek's true cult of admirers, Benji is it. Despite the trademark intimacy in his songs, Kozelek has usually concealed himself behind them. Not here. These nakedly confessional songs are adorned by his voice, nylon-string guitar, and sundry instruments and voices. The record is haunted by the ghosts of his native Ohio. Named for a 1974 kids film he liked as a child, Benji is exceptionally wordy. Once Kozelek begins unspinning his life, he can't stop. Lines collide and mundane details combine with memories and shift quickly, making songs sometimes difficult to track. \n\n  In opener &quot;Carissa,&quot; he returns to Ohio for the funeral of a second cousin who perished at 35 in a freak accident involving an aerosol can. It's a eulogy, though he cannot come to grips with what happened. Will Oldham's backing vocal provides support for his bewilderment. &quot;Truck Driver&quot; spookily reflects on the life and death of an uncle (her grandfather) killed on his birthday in an eerily similar accident. On &quot;Dogs,&quot; Kozelek details his early sexual history with tenderness, embarrassment, and bravado. When referencing cultural incidents -- &quot;Pray for Newtown&quot; and &quot;Richard Ramirez Died Today of Natural Causes&quot; -- Kozelek turns them back on themselves to reflect him. The latter features a strident, monotone spoken delivery and relentless guitar playing. The serial killer is cyclically referenced, but the narrative ironically juxtaposes other culturally significant deaths -- James Gandolfini, Elvis -- as Kozelek walks through his old neighborhood, remembering its residents, bearing honorable and even generous witness to their lives -- and deaths. \n\n  A lyrical Rhodes piano introduces &quot;Jim Wise,&quot; a song about one of his father's friends who helped his wife commit suicide, then attempted to kill himself but failed. Awaiting a prison sentence, Kozelek and his father visit to bring him food from Panera. &quot;I Watched the Film The Song Remains the Same&quot; -- over ten minutes long -- languidly unfolds, disclosing his youthful experience being thrilled by the film, balanced by more personal experiences with mortality as a way of explaining that his well-known melancholy has been there since childhood. Two songs celebrate his parents, the delicate &quot;I Can't Live Without My Mother's Love&quot; and the semi-boogie of &quot;I Love My Dad&quot; (wherein he takes a humorous dig at Nels Cline). The lovely, tragic &quot;Micheline&quot; pays tribute to a girl who lived next door and to a childhood friend. It marks his grandmother's long illness and passing, and his shame in not being able to bear being near her during it. Kozelek, now middle-aged, is speaking into a mirror on Benji. It's so intimate, the listener is, by definition, a voyeur. His hardcore following will no doubt celebrate it abundantly. Given its willful indulgence, however, others may find it a tipping point in the other direction.","torrent":{"xt":"urn:btih:4c0efbbba84c88afb1a0388a20abb2d07bb6d2f7","amp;dn":"Sun+Kil+Moon+-+Benji+%28Deluxe%29+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c0efbbba84c88afb1a0388a20abb2d07bb6d2f7","infoHashBuffer":{"type":"Buffer","data":[76,14,251,187,168,76,136,175,177,160,56,138,32,171,178,208,123,182,210,247]},"announce":[],"urlList":[]}}