{"title":"Nostalgia de la Luz 2010 DVDRip Sonata Premiere","uid":14270067,"size":919706506,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4c77fbda146ce3d3ed0894e9000f1c80dbf66607&amp;dn=Nostalgia+de+la+Luz+2010+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":3,"uploader":"kleen2","files":5,"time":1460300665,"description":"For his new film master director Patricio Guzmán, famed for his political documentaries (THE BATTLE OF CHILE, THE PINOCHET CASE), travels 10,000 feet above sea level to the driest place on earth, the Atacama Desert, where atop the mountains astronomers from all over the world gather to observe the stars. The sky is so translucent that it allows them to see right to the boundaries of the universe. The Atacama is also a place where the harsh heat of the sun keeps human remains intact: those of Pre-Columbian mummies; 19th century explorers and miners; and the remains of political prisoners, &quot;disappeared&quot; by the Chilean army after the military coup of September, 1973 So while astronomers examine the most distant and oldest galaxies, at the foot of the mountains, women, surviving relatives of the disappeared whose bodies were dumped here, search, even after twenty-five years, for the remains of their loved ones, to reclaim their families' histories. Melding the celestial quest of the astronomers and the earthly one of the women, NOSTALGIA FOR THE LIGHT is a gorgeous, moving, and deeply personal odyssey.\r\n\r\n\r\nSubs srt: Portuguese / English / French / Italian","torrent":{"xt":"urn:btih:4c77fbda146ce3d3ed0894e9000f1c80dbf66607","amp;dn":"Nostalgia+de+la+Luz+2010+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c77fbda146ce3d3ed0894e9000f1c80dbf66607","infoHashBuffer":{"type":"Buffer","data":[76,119,251,218,20,108,227,211,237,8,148,233,0,15,28,128,219,246,102,7]},"announce":[],"urlList":[]}}