{"title":"Suddenly, Last Summer (1959) Elizabeth Taylor Eng","uid":5600465,"size":1810059987,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4c98595ecfcc733e70976b9bb0314b028fa5cb28&amp;dn=Suddenly%2C+Last+Summer+%281959%29+Elizabeth+Taylor+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"johnefp","files":3,"time":1275273456,"description":"In this lush, lurid adaptation of the 1957 Tennessee Williams one-act, Elizabeth Taylor and Katharine Hepburn play a seemingly insane, young New Orleans debutante and the wealthy aunt who wants to lobotomize her. Dr. John Cukrowicz (Montgomery Clift) is a gifted Chicago brain surgeon stymied by the primitive operating conditions at the New Orleans asylum where he works. Society matron Violet Venable (Hepburn) offers a solution in the form of a million-dollar grant -- as long as Cukrowicz will treat her niece, Catherine (Taylor). Catherine, it seems, has been institutionalized since the sudden death of her cousin, Violet's son, Sebastian, overseas the previous summer. As the young doctor tries to get to the bottom of what happened to Catherine, Violet's steely demeanor and devotion to Sebastian present a formidable barrier. Catherine herself doesn't offer much help, her recollections jumbled by medication and the trauma of Sebastian's demise. Under pressure to seal the deal and cut into Catherine's brain, Cukrowicz's principles (and attraction to the young woman) prevent him from proceeding until he uncovers what actually happened to Sebastian. In his memoirs, Gore Vidal claims to have written the screenplay for Suddenly, Last Summer  single-handedly, although Williams took half the credit. Vidal toned down the original play's allusions to pedophilia, cannibalism, and incest, but the film nonetheless provoked heated controversy. As for the cast, an unhappy Hepburn reportedly was threatened by the attention lavished on Taylor by director Joseph L. Mankiewicz, whom Hepburn had hired to produce The Philadelphia Story  two decades earlier. Mankiewicz, for his part, allegedly hated Clift, whose drinking and partial paralysis from an auto accident prevented him from working more than half a day at a time. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0053318/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0053318/&lt;/a&gt;\n\n\nSubs\n\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-5932&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-5932&lt;/a&gt;\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:49:35\nMovie complete : Yes\n\n[Video]\nResolution : 704x384 1.83:1\nCodec : DivX (4 / 5 / 6)\nFPS : 25,00\nBitRate : 2074 Kbps\nQuality Factor : 0,31 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n\n\n\nPlease seed at least as much as you D/L.\n=======================================\nThanks \n\nJohn\n\n\n\n","torrent":{"xt":"urn:btih:4c98595ecfcc733e70976b9bb0314b028fa5cb28","amp;dn":"Suddenly%2C+Last+Summer+%281959%29+Elizabeth+Taylor+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c98595ecfcc733e70976b9bb0314b028fa5cb28","infoHashBuffer":{"type":"Buffer","data":[76,152,89,94,207,204,115,62,112,151,107,155,176,49,75,2,143,165,203,40]},"announce":[],"urlList":[]}}