{"title":"Vivisector.Beast.Within.Repack-R.G.Mechanics","uid":10742739,"size":1235015451,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4d5eb77f7803a74a983d814841b2cd4dc9015d14&amp;dn=Vivisector.Beast.Within.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"Taker009","files":-1,"time":1407780649,"description":"Vivisector.Beast.Within.Repack-R.G.Mechanics\n\n\n82509b13ab951e1099b3.png\n\nRelease Info:\n\nYear: 2005\nGenre: Action (Shooter) / 3D / 1st Person\nDeveloper: Action Forms\nPublisher: Brigades\nPublication Type: RePack\nGame Language: Eng |Rus\nVoice Language: Eng |Rus\nCrack: enclosing\n\n071198d6b78d56bd302c.png\n\n\nSystem Requirements:\n\nOperating system: Windows XP, Windows Vista, Windows 7\nProcessor: Intel PentiumÂ® IV 1,8 GHz or equivalent AMD Athlon\nMemory: 512 MB\nVideo: 256 MB compatible with DirectX 9\nSound Card: Sound device compatible with DirectX 9.0\nFree hard drive space: 6 GB\n\nGame information:\n\n&quot;Vivisector: Beast Within&quot; - is a powerful blend of chilling\nhorror and hurricane 3D-action ', subordinate to the rigid\nlaws of the rapidly evolving plot. The game world is an isolated\nisland in the ocean, divided into a plurality of interconnected\nlevels. Your path will pass through tropical jungles, dense\nforests and snow-capped mountains. Forced his way through the\nenormous experimental units, you will feel in their own skin,\nwhich can make the human genius, directed in a false direction.\nYou come up with a miracle surviving soldiers, who were thrown\nto his death here. Surrounded by artificial beast-men, they\nindiscriminately fired in the direction of any rustle or movement.\nOnly among them you will feel what it means to be a real man among\nthese wild creatures - failed similarities of people.\n\nGame Features:\n\nSpeedy destruction. Killing a certain number of monsters\nin the shortest period of time. Experience is awarded for\neach enemy killed.\nMultiubiystvo. Simultaneous destruction of a certain number\nof monsters. Points are awarded for each of the killed enemies.\nThis is easiest to do with weapons, inflicting damage on a certain radius.\nFatalities. Application fatal injuries after the death of\nthe enemy. For each round, caught in a vulnerable place of\nthe enemy after his murder, the player gains experience.\nVivisection. Dismembered corpse monster using bladed weapons.\nCuriosity. Progress towards a roundabout, not direct ways.\nOne of the most readily available bonuses. Given when the\nmap of interesting places, buildings and other objects.\nFinding hidden locations. Seldom, but they player can find\nreally useful things, and get plenty of experience.\nAccuracy. If the accuracy of hitting the enemies will be\n50% or higher, the player will receive experience points\nin an amount directly proportional to the percentage of hits.\nResistance. Killing multiple enemies without getting damaged.\nArtistry. Execution of tricks particularly complex or unusual\nway. If a player manages to somehow unusual way to overcome\nan obstacle or get ammunition, weapons, hear the thunder of\napplause, shouts of &quot;Bravo&quot; and will appear: theatrical masks.\nDepending on the complexity of the\naction performed are assigned points.\n\nRepack Features:\n\nVivisector: Beast Within\nVersion of the game - v1.1\nDo not cut / recoded\nAbility to select a combination of text and voice\n","torrent":{"xt":"urn:btih:4d5eb77f7803a74a983d814841b2cd4dc9015d14","amp;dn":"Vivisector.Beast.Within.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d5eb77f7803a74a983d814841b2cd4dc9015d14","infoHashBuffer":{"type":"Buffer","data":[77,94,183,127,120,3,167,74,152,61,129,72,65,178,205,77,201,1,93,20]},"announce":[],"urlList":[]}}