{"title":"Nicki Doane Yoga Vinyasa - Core Strength Flow Series DVDrip","uid":8180229,"size":667213306,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4dced89b017094874e868ab6779f8f86a7a80cb8&amp;dn=Nicki+Doane+Yoga+Vinyasa+-+Core+Strength+Flow+Series+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"acer47x","files":3,"time":1361613314,"description":"Flow through a dynamic series with acclaimed yoga instructor Nicki Doane - choosing from a 20, 30 or 45 minute practice. The physical focus of this yoga lesson plan is a balanced approach to core strength, and the broader focus is finding a deep inner strength that supports everything we do. This practice balances traditional fitness notions of abdominal strength with awareness of developing a strong, steady breath and a quiet mind. Maya Yoga Vinyasa Fusion is the synthesis of Vinyasa style yoga with the heightened sense of awareness that comes from studying alignment principles. Filmed on the beautiful island of Maui, Nicki Doane - in collaboration with her husband, Eddie Modestini - takes you to the next level while offering the flexibility of time commitment to your practice. These programs are suitable for everyone, beginners to intermediate practitioners. Let Nicki's grounded approach to vinyasa yoga and the lush beauty of Maui inspire you in your daily practice.","torrent":{"xt":"urn:btih:4dced89b017094874e868ab6779f8f86a7a80cb8","amp;dn":"Nicki+Doane+Yoga+Vinyasa+-+Core+Strength+Flow+Series+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dced89b017094874e868ab6779f8f86a7a80cb8","infoHashBuffer":{"type":"Buffer","data":[77,206,216,155,1,112,148,135,78,134,138,182,119,159,143,134,167,168,12,184]},"announce":[],"urlList":[]}}