{"title":"Brian Greene - The Elegant Universe ","uid":6497960,"size":525856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e8788b48103cbb356120d43422cd0650a1942cb&amp;dn=Brian+Greene+-+The+Elegant+Universe+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"FatFreddy39","files":1,"time":1309145332,"description":"All books are in .mobi format\n\nIf you don't have a program that can convert or view .mobi you can download the free program calibre\n &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n\nPleese seed. \n\nOne of the more compelling scientific (cum-theological) questions in the Middle Ages was: &quot;How many angels can dance on the head of a pin?&quot; Today's version in cutting-edge science is, &quot;How many strings... ?&quot; As posited by s tring theory physics, strings are furiously vibrating loops of stuff. The concept of strings was devised to help scientists describe simultaneously both energy and matter. The frequency and resonance of strings' vibration, just like those of strings on an instrument, determine charge, spin and other familiar properties of energy?and eventually the structure of the universe: a true music of the spheres. There's a chance that strings are themselves made up of something still smaller. But scientists can prove their existence only on the blackboard and computer, because they are much too tiny?a hundred billion billion times smaller than the nucleus of an atom?to be observed experimentally. Brian Greene, professor of physics and mathematics at Cornell and Columbia universities, makes the terribly complex theory of strings accessible to all. He possesses a remarkable gift for using the everyday to illustrate what may be going on in dimensions beyond our feeble human perception. Just when we might be tempted to dismiss strings as grist for the publish-or-perish mill, Greene explains how they have demonstrated connections between mathematics and physics that have helped solve age-old conundrums in each field. This book will appeal to astronomy as well as math and physics fans because it probes the important insights string theory gives into hotly debated issues in cosmology. Later chapters require careful attention to Greene's explications, but the effort will prepare readers to follow the scientific advances likely to be made in the next millennium through application of string theory.","torrent":{"xt":"urn:btih:4e8788b48103cbb356120d43422cd0650a1942cb","amp;dn":"Brian+Greene+-+The+Elegant+Universe+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e8788b48103cbb356120d43422cd0650a1942cb","infoHashBuffer":{"type":"Buffer","data":[78,135,136,180,129,3,203,179,86,18,13,67,66,44,208,101,10,25,66,203]},"announce":[],"urlList":[]}}