{"title":"Grand Theft Auto V PS3 - DUPLEX","uid":8914770,"size":18752129154,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:4e94f63941b72f3943988a0f9724c19e91a26e9a&amp;dn=Grand+Theft+Auto+V+PS3+-+DUPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"dududus","files":23,"time":1379115613,"description":"Los Santos - the city of the sun, starlets and published in the circulation of stars. The once the envy of the Western world, it is now a haven of cheesy reality shows, suffocating in the grip of economic problems. In the center of the whole mess - a completely different trio of criminals, desperately trying to catch the tail of luck in the ongoing battle for a place in the sun. A former member of a street gang Franklin tries to tie to the past. A retired bank robber Michael discovers that an honest life is not as rosy as it seemed. Turned to violence crazy Trevor interrupted from one proprietor to another in the hope of winning the jackpot. Having exhausted the options, the three of them put their own lives on the line and commit a series of daring robberies in which - or pan, or missing. In Grand Theft Auto V fans are in for not just the huge and detailed world ever created by Rockstar Games, but also the opportunity to influence the lives and deeds of three main characters. This interweaving stories of several characters will make the game the most fun and exciting. All attributes of the famous series are fully present and Grand Theft Auto V - here and incredible attention to detail, and the trademark black humor and mockery of pop culture, and even a brand new, incredibly ambitious multiplayer mode.\n\n","torrent":{"xt":"urn:btih:4e94f63941b72f3943988a0f9724c19e91a26e9a","amp;dn":"Grand+Theft+Auto+V+PS3+-+DUPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e94f63941b72f3943988a0f9724c19e91a26e9a","infoHashBuffer":{"type":"Buffer","data":[78,148,246,57,65,183,47,57,67,152,138,15,151,36,193,158,145,162,110,154]},"announce":[],"urlList":[]}}