{"title":"Rocksmith 2014 800+ customs","uid":9465422,"size":5028571932,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4ef9d50cfb59978ef24778b640835f9df34ebc72&amp;dn=Rocksmith+2014+800%2B+customs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":7,"uploader":"ARMIGUER","files":-1,"time":1389452006,"description":"ALL CREDIT GOES TO SMITHYANVIL FORUMS MEMBERS FOR THESE CUSTOMS I DID NOT CREATE ANY OF THESE I AM JUST PACKAGING THEM TO MAKE THEM AVAILABLE TO EVERYONE IN ONE DOWNLOAD. \n\n\nNow that that's out of the way included in this package are all the currently released OFFICIAL DLC with there appID's changed to cherub rock. USE AT YOUR OWN RISK ON STEAM AND THIS IS NOT SUPPORTED BY ME OR SMITHYANVIL \n\n\nThis pack includes everything up until the latest Aerosmith DLC that was released this past Tuesday. Also included are a collection of over 800 custom dlc made by smithanvil members. \n\nAlso included is the Dll that is needed to run these customs. \n\nYOU MUST HAVE PURCHASED CHERUB ROCK BY THE SMASHING PUMPKINS FOR THESE CUSTOMS TO WORK. \n\nPlease keep in mind that a lot of these customs are made without dynamic difficulty added to them so for beginners use RIFF REPEATER on these to slow them down so you can learn them at your own pace. Many of them do have Dynamic Difficulty added to them but the ratio is probably 6 to 1 where maybe only 1 in every 6 or so customs have Dynamic Difficulty. \n\nI recommend everyone visit smithyanvil forums and register with them so that you may understand what a great community they have over there and how much they love this game/tool. You may also find many songs that I have not included in this package that you may like. Currently Smithanvil have over 2000 submitted customs on there site and members add more daily. Please visit them and thank them for there work and if you can contribute to the site in any way please do so. \n\nOnce again I did not create any of these customs, these customs are provided free of charge by smithyanvil members so if you don't want to download this package you may head over to their site and download the songs you like individually. \n\nInstall Instructions\n\n1. Unrar file\n2. Copy contents to your ROOT Rocksmith directory \nfor steam C:Program Files (x86)SteamSteamAppscommonRocksmith2014dlc\nfor Skidrow users it depends on where you installed it and the name of the folder so I will leave that up to you guys. \n\nEnjoy ","torrent":{"xt":"urn:btih:4ef9d50cfb59978ef24778b640835f9df34ebc72","amp;dn":"Rocksmith+2014+800%2B+customs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ef9d50cfb59978ef24778b640835f9df34ebc72","infoHashBuffer":{"type":"Buffer","data":[78,249,213,12,251,89,151,142,242,71,120,182,64,131,95,157,243,78,188,114]},"announce":[],"urlList":[]}}