{"title":"Core Java for the Impatient - 1st Edition (2015).epub Gooner","uid":14175148,"size":12581900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f71ac6153947e2bbcebbcd207ccd0b27973d6a0&amp;dn=Core+Java+for+the+Impatient+-+1st+Edition+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1459799537,"description":"Core Java for the Impatient - 1st Edition (2015).epub Gooner\r\n\r\nPublisher: Addison-Wesley Professional; 1 edition (February 12, 2015)\r\nLanguage: English\r\nISBN-10: 0321996321\r\nISBN-13: 978-0321996329\r\n\r\nThe release of Java SE 8 introduced significant enhancements that impact the Core Java technologies and APIs at the heart of the Java platform. Many old Java idioms are no longer required and new features like lambda expressions will increase programmer productivity, but navigating these changes can be challenging.\r\n \r\nCore Java® for the Impatient is a complete but concise guide to Java SE 8. Written by Cay Horstmann—the author of Java SE 8 for the Really Impatient and Core Java™, the classic, two-volume introduction to the Java language—this indispensable new tutorial offers a faster, easier pathway for learning the language and libraries. Given the size of the language and the scope of the new features introduced in Java SE 8, there’s plenty of material to cover, but it’s presented in small chunks organized for quick access and easy understanding.\r\n \r\nIf you’re an experienced programmer, Horstmann’s practical insights and sample code will help you quickly take advantage of lambda expressions (closures), streams, and other Java language and platform improvements. Horstmann covers everything developers need to know about modern Java, including \r\n\r\n* Crisp and effective coverage of lambda expressions, enabling you to express actions with a concise syntax\r\n\r\n* A thorough introduction to the new streams API, which makes working with data far more flexible and efficient\r\n\r\n* A treatment of concurrent programming that encourages you to design your programs in terms of cooperating tasks instead of low-level threads and locks\r\n\r\n* Up-to-date coverage of new libraries like Date and Time\r\n\r\n* Other new features that will be especially valuable for server-side or mobile programmers \r\n\r\nWhether you are just getting started with modern Java or are an experienced developer, this guide will be invaluable for anyone who wants to write tomorrow’s most robust, efficient, and secure Java code","torrent":{"xt":"urn:btih:4f71ac6153947e2bbcebbcd207ccd0b27973d6a0","amp;dn":"Core+Java+for+the+Impatient+-+1st+Edition+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f71ac6153947e2bbcebbcd207ccd0b27973d6a0","infoHashBuffer":{"type":"Buffer","data":[79,113,172,97,83,148,126,43,188,235,188,210,7,204,208,178,121,115,214,160]},"announce":[],"urlList":[]}}