{"title":"Bill Evans - 1962 - Empathy (HDTracks 96 24) FLAC","uid":11102192,"size":812648491,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ff50d6938df78d81452c9aff9a283ec30ac621f&amp;dn=Bill+Evans+-+1962+-+Empathy+%28HDTracks+96+24%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"eika256","files":-1,"time":1411682565,"description":"Bill Evans - 1962 - Empathy\nHDTracks, 96 bits, 24 KHz\n\nThis album came about through a fortuitous convergence of circumstances. Shelly Manne &amp; His Men were appearing at New York's Village Vanguard, sharing the bill with the Bill Evans Trio. Getting Riverside's permission to let the pianist participate, Creed Taylor set up a session at Rudy Van Gelder's studio with Evans and Manne sharing top billing. Manne's bass player, Monty Budwig, made up the trio. This was a busman's holiday for Evans, who was freed from the musical parameters he had set for his then-current trio. The result is that his playing seemed lighter, freer, and more relaxed than it had for a while. The album kicks off with a jaunty version of Irving Berlin's &quot;The Washington Twist&quot; from the unsuccessful Mr. President with Budwig sharing the honors with Evans as much as Manne. Manne spends most of his time driving Evans into more diminished and sharper playing than was usually Evans' wont. Another relatively unfamiliar Berlin work, &quot;Let's Go Back to the Waltz,&quot; gives full reign to Evans' lyricism. The longest tune on the set is an audacious, almost lampooned version of &quot;With a Song in My Heart&quot; with light chordal phrasing that pretty much characterized much of the tone coming from this session. Listening to these three, it's clear that everyone was having a good time and simply enjoying being relieved of their duties with their regular combos, even if for just one day. Empathy has been reissued by Verve as a CD that also includes another Evans' goody, A Simple Matter of Conviction. (AllMusic)\n\nTrack list:\n01-The Washington Twist\n02-Danny Boy\n03-Let's Go Back To The Waltz\n04-With A Song In My Heart\n05-Goodbye\n06-I Believe In You\n\nPersonnel:\nBill Evans - piano\nMonty Budwig - bass\nShelly Manne - drums\n\nEnjoy and share!","torrent":{"xt":"urn:btih:4ff50d6938df78d81452c9aff9a283ec30ac621f","amp;dn":"Bill+Evans+-+1962+-+Empathy+%28HDTracks+96+24%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff50d6938df78d81452c9aff9a283ec30ac621f","infoHashBuffer":{"type":"Buffer","data":[79,245,13,105,56,223,120,216,20,82,201,175,249,162,131,236,48,172,98,31]},"announce":[],"urlList":[]}}