{"title":"Robin Manuell - A Master Class in Hypnotic Storytelling","uid":10638671,"size":574119159,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:50da45b1b7e0ce9a0ce1ddb3df55432af9627526&amp;dn=Robin+Manuell+-+A+Master+Class+in+Hypnotic+Storytelling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"acer47x","files":20,"time":1406425787,"description":"Learn to tell a persuasive story, and to be honest, you have a bit of an unfair advantage. Not only can hold people spell bound with an irresistible story you made up on the fly, but you'll also be able to...\n\nGain instant rapport with anyone you meet\nOvercome resistance and eliminate any doubts or objections to your ideas and suggestions\nInstantly change beliefs and rapidly allow even the most stubborn of people to change their mind, and see the world a different way\nFree people from problems and limitations which had been holding them back\nUnleash in yourself and others more confidence, personal power and inner resources than people ever knew they had!\n\n\nIf you have ever wanted to...\n\nHypnotize an audience at will, capturing their hearts and minds as soon as you begin...\nAlways be the life of the party and have total strangers hanging off your every word, desperate to hear what you say next...\nLift people out of their problems and troubles, and inspire people to live life to the full with powerful, targeted hypnotic metaphors...\nBe able to instantly form a deep connection with people, and speak directly to their deepest desires and core emotional drives...\nEffortlessly move people's emotions like a conductor in an orchestra!\nGuide people through vividly powerful hypnotic experiences just with the power of your words...\n\n\n...Then Let Master Hypnotist Igor Ledochowski And I Take You By The Hand and Show You Exactly How It's Done... ","torrent":{"xt":"urn:btih:50da45b1b7e0ce9a0ce1ddb3df55432af9627526","amp;dn":"Robin+Manuell+-+A+Master+Class+in+Hypnotic+Storytelling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50da45b1b7e0ce9a0ce1ddb3df55432af9627526","infoHashBuffer":{"type":"Buffer","data":[80,218,69,177,183,224,206,154,12,225,221,179,223,85,67,42,249,98,117,38]},"announce":[],"urlList":[]}}