{"title":"X86 Assembly Language and C Fundamentals - PDF","uid":9695862,"size":3864144,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50e118d5926b3c1855dcf8f8493c9249cc6d5cd9&amp;dn=X86+Assembly+Language+and+C+Fundamentals+-+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393891614,"description":"Pages: 813 pages\nPublisher: CRC Press (28 February 2013)\nLanguage: English\nISBN-10: 1466568240\nISBN-13: 978-1466568242\nFormat: PDF\n\n\nThe predominant language used in embedded microprocessors, assembly language lets you write programs that are typically faster and more compact than programs written in a high-level language and provide greater control over the program applications. Focusing on the languages used in X86 microprocessors, X86 Assembly Language and C Fundamentals explains how to write programs in the X86 assembly language, the C programming language, and X86 assembly language modules embedded in a C program. A wealth of program design examples, including the complete code and outputs, help you grasp the concepts more easily. Where needed, the book also details the theory behind the design.\n\nLearn the X86 Microprocessor Architecture and Commonly Used Instructions\n\nAssembly language programming requires knowledge of number representations, as well as the architecture of the computer on which the language is being used. After covering the binary, octal, decimal, and hexadecimal number systems, the book presents the general architecture of the X86 microprocessor, individual addressing modes, stack operations, procedures, arrays, macros, and input/output operations. It highlights the most commonly used X86 assembly language instructions, including data transfer, branching and looping, logic, shift and rotate, and string instructions, as well as fixed-point, binary-coded decimal (BCD), and floating-point arithmetic instructions.\n\nGet a Solid Foundation in a Language Commonly Used in Digital Hardware\n\nWritten for students in computer science and electrical, computer, and software engineering, the book assumes a basic background in C programming, digital logic design, and computer architecture. Designed as a tutorial, this comprehensive and self-contained text offers a solid foundation in assembly language for anyone working with the design of digital hardware.","torrent":{"xt":"urn:btih:50e118d5926b3c1855dcf8f8493c9249cc6d5cd9","amp;dn":"X86+Assembly+Language+and+C+Fundamentals+-+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50e118d5926b3c1855dcf8f8493c9249cc6d5cd9","infoHashBuffer":{"type":"Buffer","data":[80,225,24,213,146,107,60,24,85,220,248,248,73,60,146,73,204,109,92,217]},"announce":[],"urlList":[]}}