{"title":"Brad Meltzer-The President's Shadow","uid":15725508,"size":336248152,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:50e9631af6603105ad0d3140ae1689dbc0f48872&amp;dn=Brad+Meltzer-The+President%27s+Shadow&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"twocows","files":13,"time":1472711346,"description":"The President's Shadow\r\nby Brad Meltzer\r\n\r\n    Scott Brick\r\n\r\n\r\n\r\nFollowing The Inner Circle and The Fifth Assassin, Brad Meltzer returns with the next novel in the #1 New York Times bestselling Culper Ring series.\r\n\r\nThere are stories no one knows. Hidden stories. I find those stories for a living.\r\n\r\nTo most, it looks like Beecher White has an ordinary job. A young staffer with the National Archives in Washington, DC, he's responsible for safekeeping the government's most important documents ... and, sometimes, its most closely held secrets.\r\n\r\nBut there are a powerful few who know his other role. Beecher is a member of the Culper Ring, a 200-year-old secret society founded by George Washington and charged with protecting the presidency.\r\n\r\nNow the current occupant of the White House needs the Culper Ring's help. The alarming discovery of the buried arm has the president's team in a rightful panic. Who buried the arm? How did they get past White House security? And most important: What's the message hidden in the arm's closed fist? Indeed, the puzzle inside has a clear intended recipient, and it isn't the president. It's Beecher himself.\r\n\r\nBeecher's investigation will take him back to one of our country's greatest secrets and point him toward the long, carefully hidden truth about the most shocking history of all: family history","torrent":{"xt":"urn:btih:50e9631af6603105ad0d3140ae1689dbc0f48872","amp;dn":"Brad+Meltzer-The+President%27s+Shadow","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50e9631af6603105ad0d3140ae1689dbc0f48872","infoHashBuffer":{"type":"Buffer","data":[80,233,99,26,246,96,49,5,173,13,49,64,174,22,137,219,192,244,136,114]},"announce":[],"urlList":[]}}