{"title":"Secret Societies of the Middle Ages: Assassins, the Templars ...","uid":15770701,"size":2745329,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:510a69165e1037f54bf5afd39f20580e53ed9875&amp;dn=Secret+Societies+of+the+Middle+Ages%3A+Assassins%2C+the+Templars+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"marty14","files":1,"time":1473200787,"description":"Secret Societies of the Middle Ages, The Assassins, the Templars and the Secret Tribunals of Westphalia - Thomas Keightley\r\n\r\nSecret Societies of the Middle Ages explores the foundations of modern secret societies, examining the history and known facts of three very different organizations.\r\n\r\n1. The Assassins of the Middle East-how they evolved from an Islamic religious sect into one of the most feared groups in all the world and how the very name of this ancient order became the word used for political killings of this nature.\r\n\r\n2. The Templars of Europe-from a pious group of protectors and dedicated crusaders to their bitter end persecuted as heretics, they introduced the concept of banking to the world while amassing a fortune of incalculable wealth.\r\n\r\n3. The Secret Tribunals of Westphalia-the feared and self-appointed judicial group who passed judgment and performed executions in a time of lawlessness in Germany. They enjoyed popular support, providing a rudimentary and vigilante law at a time when warlords ruled and the emperor was ineffective.\r\n\r\nThe echoes of these particular societies are still heard today-from presidential offices to battlegrounds in the Middle East. Secret Societies of the Middle Ages, originally published in 1846, was the first book to gather information on these secret orders. This foundational reference work, upon which many contemporary histories have relied, is now back in print with an introduction by James Wasserman, author of The Templars and the Assassins: The Militia of Heaven","torrent":{"xt":"urn:btih:510a69165e1037f54bf5afd39f20580e53ed9875","amp;dn":"Secret+Societies+of+the+Middle+Ages%3A+Assassins%2C+the+Templars+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"510a69165e1037f54bf5afd39f20580e53ed9875","infoHashBuffer":{"type":"Buffer","data":[81,10,105,22,94,16,55,245,75,245,175,211,159,32,88,14,83,237,152,117]},"announce":[],"urlList":[]}}