{"title":"Learning Python Network Programming (2015) Gooner","uid":12546689,"size":26350206,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51580dcfb3c07c52dd99cdea5cc3c4df8ca1bbba&amp;dn=Learning+Python+Network+Programming+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1444479869,"description":"Publisher: Packt Publishing - ebooks Account (June 30, 2015)\r\nLanguage: English\r\nISBN-10: 1784396001\r\nISBN-13: 978-1784396008\r\n\r\nUtilize Python 3 to get network applications up and running quickly and easily\r\n\r\nAbout This Book\r\n\r\nLeverage your Python programming skills to build powerful network applications\r\nExplore steps to interact with a wide range of network services\r\nDesign multithreaded and event-driven architectures for echo and chat servers\r\n\r\nWho This Book Is For\r\n\r\nIf you're a Python developer or a system administrator with Python experience and you're looking to take your first steps in network programming, then this book is for you. Basic knowledge of Python is assumed.\r\n\r\nWhat You Will Learn\r\n\r\nDevelop an understanding of network stacks and the power of encapsulation\r\nDesign high-performance network server applications\r\nImplement socket-based network applications using asynchronous models\r\nBuild client applications for major web APIs, including Amazon S3 and Twitter\r\nInteract with e-mail servers using SMTP, POP3, and IMAP protocols\r\nDeal with remote network servers using SSH, FTP, SNMP, SMB/CIFS, and LDAP protocols\r\nWork with IP addresses including Geo-IP lookups\r\nDownload objects from the Web and craft custom HTTP requests with urllib and the Requests library\r\n\r\nIn Detail\r\n\r\nNetwork programming has always been a demanding task. With full-featured and well documented libraries all the way up the stack, Python makes network programming the enjoyable experience it should be.\r\n\r\nStarting with a walkthrough of today's major networking protocols, with this book you'll learn how to employ Python for network programming, how to request and retrieve web resources, and how to extract data in major formats over the Web. You'll utilize Python for e-mailing using different protocols and you'll interact with remote systems and IP and DNS networking.\r\n\r\nAs the book progresses, socket programming will be covered, followed by how to design servers and the pros and cons of multithreaded and event-driven architectures. You'll develop practical client-side applications, including web API clients, e-mail clients, SSH, and FTP. These applications will also be implemented through existing web application frameworks","torrent":{"xt":"urn:btih:51580dcfb3c07c52dd99cdea5cc3c4df8ca1bbba","amp;dn":"Learning+Python+Network+Programming+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51580dcfb3c07c52dd99cdea5cc3c4df8ca1bbba","infoHashBuffer":{"type":"Buffer","data":[81,88,13,207,179,192,124,82,221,153,205,234,92,195,196,223,140,161,187,186]},"announce":[],"urlList":[]}}