{"title":"Learn Spanish with Michael Thomas","uid":3398967,"size":465725607,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:521bb08549006d545949d5ca7c7addd00f751497&amp;dn=Learn+Spanish+with+Michael+Thomas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"bitbuster","files":83,"time":1129767925,"description":"Book Description\n\nAnyone can learn a language with Michel Thomas--The World's Greatest Language Teacher.\n\nNo books. No writing. No drills. And nothing to memorize--ever! With his unique program, Michel Thomas has taught celebrities, corporate leaders, and schoolchildren--with immediate and amazing results. Now the Language Teacher to the Stars invites everyone to join his class!\n\nUsing Spanish with Michel Thomas, listeners learn in real time--fully understanding as they go along, turning words into short sentences, and then building them into longer, more complex sentences, until they are conversing in Spanish.\n\nMichel will have listeners formulating their own thoughts and sentences from the very beginning, even if they have never succeeded in learning a language before. Michel has used this very method to teach celebrities such as Mel Gibson, Woody Allen, Barbra Streisand, Warren Beatty, and Princess Grace of Monaco.\n\n\nFrom the Back Cover\n\nNo books. No writing. No drills. And nothing to memorize?ever! With his unique program, Michel Thomas has taught French, Italian, Spanish, and German to celebrities, corporate leaders, and school children?with immediate and amazing results. Now, the Language Teacher to the Stars invites you to join his class!\n\n    * So effortless, natural, and stimulating is Michel's system for learning, once you get started you won't want to stop. You will learn in real time?fully understanding as you go along, turning words into short sentences, and then building them into longer, more complex sentences, until you are conversing in a foreign language.\n    * Immediately, you will feel the excitement of understanding and expressing yourself in Spanish. Michel will have you formulating your own thoughts and sentences from the very beginning, even if you have never succeeded in learning a language before.\n    * This Deluxe Edition contains eight hours of instruction on 8 CDs. Starting as a beginner, you can progress to a level of language proficiency that will enable you to converse naturally and communicate comfortably in a wide variety of situations.\n\n      Michel has used this very method to teach celebrities such as Mel Gibson, Woody Allen, Barbra Streisand, Emma Thompson, Warren Beatty, and Princess Grace of Monaco.\n\n      At home or in the car?in any place and at any time?you can learn from a world-class language teacher and become one of Michel's star students today!\n\n      &quot;Michel Thomas has developed a truly revolutionary method of language instruction. All you have to do is follow his lead: no memorization, homework, or stress. I was amazed by my success using Michel's method.&quot; -- Warren Keegan, Professor of Business at Pace University in New York","torrent":{"xt":"urn:btih:521bb08549006d545949d5ca7c7addd00f751497","amp;dn":"Learn+Spanish+with+Michael+Thomas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"521bb08549006d545949d5ca7c7addd00f751497","infoHashBuffer":{"type":"Buffer","data":[82,27,176,133,73,0,109,84,89,73,213,202,124,122,221,208,15,117,20,151]},"announce":[],"urlList":[]}}