{"title":"The Exorcism of Emily Rose(2005)DVDRip.AC3(ENG)-DROCK","uid":6284986,"size":733016478,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:52aa492da575448af746e2656e89f3d3359ee52a&amp;dn=The+Exorcism+of+Emily+Rose%282005%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"drock232","files":-1,"time":1301580781,"description":"In this blend of psychological thriller and courtroom drama, Emily Rose (Jennifer Carpenter) is a 19-year-old college student who begins displaying bizarre and troubling behavior; as her actions become increasingly destructive and shocking, Emily begins speaking in strange tongues and destroying religious symbols that surround her. Emily's parents believe that their daughter has become possessed of the devil, and the Catholic Church agrees to authorize an exorcism of the young woman. As Father Moore (Tom Wilkinson) attempts to drive the demons from Emily's body, the girl dies in the midst of the taxing ceremonies, and Father Moore finds himself charged with negligent homicide. Attorney Erin Bruner (Laura Linney) is hired to represent Father Moore against prosecutor Ethan Thomas (Campbell Scott), who intends to prove there were concrete medical explanations for Emily's behaviors, including epilepsy and schizophrenia, all leading to a heated courtroom debate between the notions of faith and science. The Exorcism of Emily Rose was inspired by the real-life story of Anneliese Michel, a young woman from Germany who died in 1976 after priests in Wurzburg spent eight months attempting to exorcise demons from her body.\n\nRipped with Handbrake.\n\nLength: 2 Hours 2 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:52aa492da575448af746e2656e89f3d3359ee52a","amp;dn":"The+Exorcism+of+Emily+Rose%282005%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52aa492da575448af746e2656e89f3d3359ee52a","infoHashBuffer":{"type":"Buffer","data":[82,170,73,45,165,117,68,138,247,70,226,101,110,137,243,211,53,158,229,42]},"announce":[],"urlList":[]}}