{"title":"Betrayal at Little Gibraltar: The Battle to End World War I","uid":15744515,"size":22184500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52cde8b546bb12a4da4d0cb0531246d4ddb5c254&amp;dn=Betrayal+at+Little+Gibraltar%3A+The+Battle+to+End+World+War+I&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"marty14","files":1,"time":1472952344,"description":"Betrayal at Little Gibraltar: : A German Fortress, a Treacherous American General, and the Battle to End World War I by William Walker [epub]\r\n\r\nThe year is 1918. German engineers have fortified Montfaucon, a rocky butte in northern France, with bunkers, tunnels, trenches, and a top-secret observatory capable of directing artillery shells across the battlefield. Following a number of bloody, unsuccessful attacks, the French deem Montfaucon impregnable and dub it the Little Gibraltar of the Western Front. Capturing it is a key to success for AEF Commander-in-Chief John J. Pershing’s 1.2 million troops. But a betrayal of Americans by Americans results in a bloody debacle. Now William T. Walker tells the full story in his masterful Betrayal at Little Gibraltar.\r\n\r\nIn the assault on Montfaucon, American forces become bogged down, a delay that cost untold lives as the Germans defended their lofty positions without mercy. Years of archival research demonstrate that the actual cause of the delay was the disobedience of a senior American officer, Major General Robert E. Lee Bullard, who subverted orders to assist the US 79th Division. The result was unnecessary slaughter of American doughboys and preclusion of plans to end the war early. Although several officers learned of the circumstances, Pershing protected Bullard—an old friend and fellow West Point graduate—by covering up the story. The true account of the battle that cost 122,000 American casualties was almost lost to time.\r\n\r\nBetrayal at Little Gibraltar tells vivid human stories of the soldiers who fought to capture the giant fortress and push the American advance. Using unpublished first-person accounts—and featuring photographs, documents, and maps that place you in the action—Walker describes the horrors of World War I combat, the sacrifices of the doughboys, and the determined efforts of two participants to pierce the cover-up and to solve the mystery of Montfaucon. Like Stephen Ambrose and S.C. Gwynne, Walker writes compelling popular history","torrent":{"xt":"urn:btih:52cde8b546bb12a4da4d0cb0531246d4ddb5c254","amp;dn":"Betrayal+at+Little+Gibraltar%3A+The+Battle+to+End+World+War+I","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52cde8b546bb12a4da4d0cb0531246d4ddb5c254","infoHashBuffer":{"type":"Buffer","data":[82,205,232,181,70,187,18,164,218,77,12,176,83,18,70,212,221,181,194,84]},"announce":[],"urlList":[]}}