{"title":"Paul Johnson - A History of the Jews [1988][A]","uid":10502083,"size":10205441,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:530713020e6299c97067517b0b5e5f369580f0cb&amp;dn=Paul+Johnson+-+A+History+of+the+Jews+%5B1988%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"Anette14","files":-1,"time":1404717773,"description":"Description\nProduct Details\nBook Title: A History of the Jews\t\nBook Author: Paul Johnson (Author)\nPaperback: 656 pages\nPublisher: Harper Perennial; 1st US edition (September 14, 1988)\nLanguage: English\nISBN-10: 0060915331\nISBN-13: 978-0060915339\n\n===================================================================================\nBook Description\nPublication Date: 1988 | ISBN-10: 0060915331 | ISBN-13: 978-0060915339 | Edition: 1st U.S. ed\nA national bestseller, this brilliant 4000 year survey covers not only Jewish history but he impact of Jewish genius and imagination on the world. By the author of Modern Times: The World From the Twenties to the Eighties.\n\n&quot;The world tended to see the Jews as a race which ruled itself in antiquity and set down its records in the Bible; had then gone underground for many centuries; had emerged at last only to be slaughtered by the Nazis; and, finally had created a state of its own, controversial and beleaguered. But these were merely salient episodes. I wanted to link them together, to find and study the missing portions, assemble them into a whole, and make sense of it&quot; Paul Johnson in his Prologue\n\n===================================================================================\nEditorial Reviews\nReview\nPaul Johnson says that writing A History of the Jews was like writing a history of the world &quot;seen from the viewpoint of a learned and intelligent victim.&quot; Johnson's history begins with the Bible and ends with the establishment of the State of Israel. Throughout, Johnson's history is driven by a philosophical interest: &quot;The Jews,&quot; he writes, &quot;stand right at the centre of the perennial attempt to give human life the dignity of a purpose. Does their own history suggest that such attempts are worth making? Or does it reveal their essential futility?&quot; Johnson's history is lucid, thorough, and--as one would expect of almost any project with such a broad scope--a little wrong-headed. By the end of the book, readers will be grateful for Johnson's questioning of the Jews' confidence in their cosmic significance. However, readers may also be a little annoyed by his energetic inquiries as to whether this significance was man-made or providentially provided. Either way, it's a given: for a historian of Israel, this should adequately settle the question. Johnson's 600-page history is probably the best we've got by a living gentile--which is no small accomplishment at all. --Michael Joseph Gross\n\nFrom Publishers Weekly\nLess a seminal contribution than a distillation of a wide range of sources, this history of the Jews focuses on their four-millennia interplay with, and adaption to, other, often hostile, civilizationsa &quot;world history seen from the viewpoint of a learned and intelligent victim.&quot; Weaving biblical and archeological data, Johnson (Modern Times and A History of Christianity is particularly deft at placing the patriarchs and early Israelites (the Bronze Age through the destruction of the First Temple) in their historical context. His dense, somewhat arbitrary, capsule extols Judaic rational scholarshipwhich contributed to ethical monotheism and the 18th-century economic system, in turnand denigrates mystic kabbalah&quot;heresy of the most pernicious kind.&quot; Although Johnson, who seeks to acknowledge &quot;the magnitude of the debt Christianity owes to Judaism,&quot; traces &quot;an inherent conflict&quot; between the religion and the state of Israel through the various ages, the work is incontrovertibly sympathetic to Zionism. BOMC and QPBC featured alternates; author tour.\n\nFrom Library Journal\nFamous author-historian Johnson ( Modern Times, LJ 5/1/83; A History of Christianity, LJ 7/76) presents a provocative history of the Jewish people, religion, and culture from earliest times to the present. Astutely divided into seven sections, (Israelites, Judaism, Cathedocracy, Ghetto, Emancipation, Holocaust, and Zion), the work describes the complex interplay between Jewish and world history and shows how the course of Western civilization has been immensely influenced by this numerically small group. It's no mean feat to successfully compress 4000 years of history into 645 pages, but Johnson has more than met the challenge. Despite a few reservationsE. G. Johnson's theories regarding Jesus and the incipient Christian movement are debatablethis is an excellent, nonscholarly history for general readers. Highly recommended for public libraries. Robert A. Silver, Shaker Heights P.L., Ohio\n\n===================================================================================\nReviews\n&quot;A marvelous book . . . This is history: richly textured, provocative and wise.&quot; -- -- The Plain Dealer\n\n&quot;A tour de force...A remarkable achievement.&quot; -- -- Aruthur Hertzberg, The New York Times Book Review\n\n&quot;An absorbing, provocativem well-writen, often moving book, an insightful and impassioned blend of history and myth, story and interpretation.&quot; -- -- Merle Rubin, Christian Science Monitor\n\n&quot;An extraordinary amount of useful information.&quot; -- -- New York Review of Books\n\n===================================================================================\nAbout the Author\nPaul Johnson is a historian whose work ranges over the millennia and the whole gamut of human activities. He regularly writes book reviews for several UK magazines and newspapers, such as the Literary Review and The Spectator, and he lectures around the world. He lives in London, England.\n===================================================================================","torrent":{"xt":"urn:btih:530713020e6299c97067517b0b5e5f369580f0cb","amp;dn":"Paul+Johnson+-+A+History+of+the+Jews+%5B1988%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"530713020e6299c97067517b0b5e5f369580f0cb","infoHashBuffer":{"type":"Buffer","data":[83,7,19,2,14,98,153,201,112,103,81,123,11,94,95,54,149,128,240,203]},"announce":[],"urlList":[]}}