{"title":"Private Down Under by James Patterson (US ePub Retail)","uid":10886061,"size":648644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5311db2f5ca5b76491a42ac52208ae94138b0a53&amp;dn=Private+Down+Under+by+James+Patterson+%28US+ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"TxJag","files":3,"time":1409076161,"description":"**The world's most exclusive detective agency opens a new office - in Australia!\n\n**With the best detectives in the business, cutting edge technology and offices around the globe, there is no investigation company quite like Private. Now, at a glittering launch party overlooking the iconic Opera House, Private Sydney throws open its doors . . .\n\nCraig Gisto and his newly formed team have barely raised their glasses, however, when a young Asian man, blood-soaked and bullet-ridden, staggers into the party, and what looks like a botched kidnapping turns out to be a whole lot more.\n\nWithin days the agency's caseload is full. But it is a horrific murder in the wealthy Eastern Suburbs and the desperate search for a motive that stretches the team to the limit. Stacy Friel, friend of the Deputy Commissioner of NSW Police, isn't the killer's first victim - and as the bodies mount up she's clearly not the last . . .\n\nFull US Retail. ePub and Calibre Reader ready. Metadata is complete and up to date.\n\n[b]Note:[/b] Book #6 in the &quot;Private Universe&quot; even though its published after Private: LA in America","torrent":{"xt":"urn:btih:5311db2f5ca5b76491a42ac52208ae94138b0a53","amp;dn":"Private+Down+Under+by+James+Patterson+%28US+ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5311db2f5ca5b76491a42ac52208ae94138b0a53","infoHashBuffer":{"type":"Buffer","data":[83,17,219,47,92,165,183,100,145,164,42,197,34,8,174,148,19,139,10,83]},"announce":[],"urlList":[]}}