{"title":"The Jeffy Show","uid":3965093,"size":3903169766,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:532f4844929a9a2b24e25edf2af69c484c816f2c&amp;dn=The+Jeffy+Show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"pelon_pirate","files":11,"time":1199676712,"description":"Jeffy Finally Cracks Open The Vault?\nAnd Reveals To You 5+ Years Worth Of\n?In House? RSD Secrets, Hyper-Advanced Techniques, And His PERSONAL ?Master Formula? For Skyrocketing Your Success With Women To The EXTREME\nAre You Ready To ?Cut The Crap? And Propel Your Dating Life To A Carnival\nOf Sexual Abundance This Year And Every Year For The Rest Of Your Life??  Prepare Yourself.  Just One ?Hit? From Jeffy?s Repertoire Will WIPE The Floor With You\n\nFROM TYLER:\n\nHi there?\n\nTyler here (YES the ?real? Tyler, I don?t allow my name to be used on anything that I didn?t personally write), and I?ve got a quick question for you? :)\n\nHave you ever thought about what it would be like to just ?cut loose? and tap into that awesome ?unpredictable and out-of-control? side of your personality??\n\nYou know, that side you feel brewing beneath the surface and when you?ve seen it ?flicker? women have lit up with HARD attraction for you*instantly* (it?s so instinctive you?d might as well call it a ?stimulus-response?).\n\nBe honest with me here.\n\nI want to know?\n\n...have you ever felt a ?spark? of something more RAW inside yourself, a dimension of your personality that you KNOW is as legitimate (if not more) as every other, but for some reason society has taught you to suppress??\n\n?have you ever felt like you were ?holding something back? and that there might be a ?primal? element you were BORN WITH, which if you had the ability to ?tap into? would have women flocking towards you in droves??\n\n?have you ever had the desire to just rip the chains off and PUT YOUR FULL PERSONALITY out there and be the COMPLETE and ATTRACTIVE person that you know you?re meant to be??\n\nAlright well here?s the next big question then?\n\nWhat if these brief ?flashes? of pure glory were something that you managed to unleash consistently on a night-by-night basis??\n\nWhat you had FULL CONTROL over this, and it became an integral part of WHO YOU ARE??\n\nThink about what your game would look like.  The type of ridiculous success with women you?d be getting for yourself if you could just DO IT.\n\nWell, I happen to know a guy who?s tapped into this side of himself on an EXTREME level?\n\nThis is a guy who is so dangerously effective with women that walks into his favorite venues and the bouncers and staff will just chuckle and shake their heads because they KNOW the frenzy that?s about to ensue.\n\nAnd guess what?  YOU know this guy as well.  You?ve been reading about his adventures in the notorious RSD newsletter for the last five years.\n\nThe man we?re talking about here is Jeffy.  And he has something very important he wants to teach you.  An urgent ?correspondence? that he needs to get of his chest?","torrent":{"xt":"urn:btih:532f4844929a9a2b24e25edf2af69c484c816f2c","amp;dn":"The+Jeffy+Show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"532f4844929a9a2b24e25edf2af69c484c816f2c","infoHashBuffer":{"type":"Buffer","data":[83,47,72,68,146,154,154,43,36,226,94,223,42,246,156,72,76,129,111,44]},"announce":[],"urlList":[]}}