{"title":"Toni Morrison - Nobel Prize in Literature, 1993 (18 books)","uid":13927849,"size":29292853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:542bda7a4221c76f7152ba5aaa007322cc80d9fd&amp;dn=Toni+Morrison+-+Nobel+Prize+in+Literature%2C+1993+%2818+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"workerbee","files":43,"time":1458396652,"description":"TONI MORRISON (b. 1931) is an American novelist, editor, and Professor Emeritus at Princeton University.  She was awarded the 1993 Nobel Prize in Literature for &quot;novels characterized by visionary force and poetic import, giv[ing] life to an essential aspect of American reality.&quot;  In 1996, she received the National Book Foundation's Medal of Distinguished Contribution to American Letters, which is awarded to a writer &quot;who has enriched our literary heritage over a life of service, or a corpus of work.&quot;\n\nThe central theme of Morrison's novels is the black American experience; in an unjust society, her characters struggle to find themselves and their cultural identity. Her use of fantasy, her sinuous poetic style, and her rich interweaving of the mythic gave her stories great strength and texture.\n\nMorrison's first book, THE BLUEST EYE (1970), is a novel of initiation concerning a victimized adolescent black girl who is obsessed by white standards of beauty and longs to have blue eyes. Her second novel, SULA (1973) examines (among other issues) the dynamics of friendship and the expectations for conformity within the community. SONG OF SOLOMON (1977) is told by a male narrator in search of his identity; its publication brought Morrison to national attention. TAR BABY (1981), set on a Caribbean island, explores conflicts of race, class, and sex.\n\nThe critically acclaimed BELOVED (1987), which won a Pulitzer Prize for fiction, is based on the true story of a runaway slave who, at the point of recapture, kills her infant daughter in order to spare her a life of slavery. JAZZ (1992) is a story of violence and passion set in New York City's Harlem during the 1920s. Subsequent novels are PARADISE (1998), a richly detailed portrait of a black utopian community in Oklahoma, and LOVE (2003), an intricate family story that reveals the myriad facets of love and its ostensible opposite. A MERCY (2008) deals with slavery in 17th-century America. In the redemptive HOME (2012), a traumatized Korean War veteran encounters racism after returning home and later overcomes apathy to rescue his sister. GOD HELP THE CHILD (2015) chronicles the ramifications of child abuse and neglect through the tale of Bride, a black girl with dark skin who is born to light-skinned parents.\n\nA work of criticism, PLAYING IN THE DARK (1992), features brilliant discussions of the &quot;Africanist&quot; presence in the fiction of Poe, Melville, Cather, and Hemingway and leads to a dramatic reappraisal of the essential characteristics of the American literary tradition. REMEMBER (2004) chronicles the hardships of black students during the integration of the American public school system; aimed at children, it uses archival photographs juxtaposed with captions speculating on the thoughts of their subjects.\n\nThis torrent also includes a collection of interviews, beginning in 1974, and Morrison's acceptance speeches upon receiving the National Book Foundation Medal and the Nobel Prize. \n\n\nThe following books are in PDF and/or ePUB format as indicated:\n\n\n                                    == NOVELS ==\n\n* Beloved (Vintage, 2004) -- PDF + ePUB\n\n* The Bluest Eye (Vintage, 2007) -- PDF + ePUB\n\n* God Help the Child (Knopf, 2015) -- ePUB\n\n* Home (Knopf, 2012) -- ePUB\n\n* Jazz (Vintage, 2004) -- PDF + ePUB\n\n* Love (Knopf, 2003) -- ePUB\n\n* A Mercy (Knopf, 2008) -- PDF + ePUB\n\n* Paradise (Knopf, 1998) -- PDF + ePUB\n\n* Song of Solomon (Vintage, 2004) -- ePUB\n\n* Sula (Vintage, 2004) -- PDF + ePUB\n\n* Tar Baby (Vintage, 2004) -- ePUB\n\n\n                                == NON-FICTION ==\n\n* The Art of Fiction, no. 134 (Paris Review, Fall 1993).  Interview by Elissa Schappell, with additional material from Claudia Brodsky Lacour. -- PDF\n\n* Burn This Book: Pen Writers Speak Out on the Power of the Word [ed.] (HarperCollins, 2009) -- PDF + ePUB\n\n* Conversations with Toni Morrison (Mississippi UP, 1994).  Edited by Danille Taylor-Guthrie. -- PDF\n\n* The Dancing Mind: Speech upon Acceptance of the National Book Foundation Medal, 1996 (Knopf, 2003) -- ePUB\n\n* The Nobel Prize Lecture, 1993 (Knopf, 2007) -- ePUB\n\n* Playing in the Dark: Whiteness and the Literary Imagination (Vintage, 1993) -- ePUB\n\n* Remember: The Journey to School Integration (Houghton Mifflin, 2004) -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account): \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:542bda7a4221c76f7152ba5aaa007322cc80d9fd","amp;dn":"Toni+Morrison+-+Nobel+Prize+in+Literature%2C+1993+%2818+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"542bda7a4221c76f7152ba5aaa007322cc80d9fd","infoHashBuffer":{"type":"Buffer","data":[84,43,218,122,66,33,199,111,113,82,186,90,170,0,115,34,204,128,217,253]},"announce":[],"urlList":[]}}