{"title":"Thee Oh Sees - Drop (2014) [FLAC]","uid":10002856,"size":198922913,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5456c08a632b6bb8241acbef4eeabdd98689c52b&amp;dn=Thee+Oh+Sees+-+Drop+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"politux","files":-1,"time":1398006206,"description":"\n  Thee Oh Sees - Drop (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Psychedelic, Garage\n  Source: WEB \n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Penetrating Eye\n  02 Encrypted Bounce\n  03 Savage Victory\n  04 Put Some Reverb on My Brother\n  05 Drop\n  06 Camera (Queer Sound)\n  07 King's Nose\n  08 Transparent World\n  09 The Lens\n\n  For a band who've built a career out of letting their collective freak flag fly, Thee Oh Sees seem to be purposefully inching toward something resembling normality. 2013's Floating Coffin found them inquisitively poking at the frameworks of straight-up hard rock, and with 2014's Drop, Thee Oh Sees are similarly playing with pop songs. There's definitely a side portion of psychedelia folded into these tunes, as you might expect, but the oozing guitar freakouts and epic-scale noise battles that used to be a traditional feature on an Oh Sees album generally fail to materialize. Instead, Drop is a collection of songs running between two and four minutes (the relative epic &quot;Encrypted Bounce&quot; is the only number to break the five-minute barrier, though it's still a modest work compared to the 13-plus minutes of Warm Slime's title track), with many boasting cleaner arrangements than usual, along with actual hooks. &quot;Lens,&quot; with its modest string charts, could pass for a bit of Left Banke-style Baroque pop, and &quot;The King's Noise&quot; wears its fanciful faux-British pretensions on its sleeve, while the layers of synthesizers on &quot;Transparent World&quot; sound more like vintage prog rock than Thee Oh Sees' usual low-budget hallucinatory ramblings. Sure, there are plenty of fuzz and lysergic synth squeals to be found, but &quot;Penetrating Eye&quot; has an actual tune and a singalong &quot;la la la&quot; chorus to go along with them, and the title cut matches the savage fuzz of John Dwyer's guitar with a bouncy melody that's suitable for dancing. And in grand pop tradition, Drop wastes little time, spinning through its nine songs in 32 minutes, and leaving the listener wanting more. There's enough of Thee Oh Sees' personality in Drop that fans will readily recognize it, but if you've ever been turned off by their layers of skronk, or the acid-damaged travels into the sonic wilderness, Drop could well be the album where this band finally catches up with you.","torrent":{"xt":"urn:btih:5456c08a632b6bb8241acbef4eeabdd98689c52b","amp;dn":"Thee+Oh+Sees+-+Drop+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5456c08a632b6bb8241acbef4eeabdd98689c52b","infoHashBuffer":{"type":"Buffer","data":[84,86,192,138,99,43,107,184,36,26,203,239,78,234,189,217,134,137,197,43]},"announce":[],"urlList":[]}}