{"title":"The Romans - From Village to Empire (History Ebook).pdf","uid":9799801,"size":42339397,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:557918ae56aac60664226c4d3cfc1813dc58d9f5&amp;dn=The+Romans+-+From+Village+to+Empire+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"STBGD","files":-1,"time":1395361078,"description":"Mary T. Boatwright, Daniel J. Gargola, and Richard J. A. Talbert, &quot;The Romans: From Village to Empire&quot; \nOxford University Press | 2004 | ISBN: 0195118766 | 544 pages | PDF | 40,3 MB\n\nThe rise and fall of Rome as an ancient world power continues to fascinate, especially in a world where people often draw comparisons between the Roman Empire and the United States in the 21st century. In an elegantly written and beautifully crafted study, three recognized historians of ancient Rome provide a first-rate and definitive history of the city from its prehistory to its rise and fall as the ancient world's dominant power. Drawing on a wide range of primary sources, Boatwright and her coauthors recreate the bustling commerce of the earliest villages of Italy in the eighth century B.C., the rapidly shifting political fortunes of leaders in the move from monarchy through republic to empire and the compelling personalities of poets and emperors. Since much of Roman history is the history of its leaders, the authors devote a good deal of attention to the lives and works of men ranging from the Gracchus twins (Tiberius and Gaius) to Pompey, Caesar and Nero. History comes alive in the many illustrations accompanying the text. In addition, each chapter features boxed excerpts from primary sources that illumine particular historical events. A time line, a glossary of important Roman terms and a selected reading list of primary sources increase the value of this magnificent volume, which anyone interested in the history of Rome will return to over and over.","torrent":{"xt":"urn:btih:557918ae56aac60664226c4d3cfc1813dc58d9f5","amp;dn":"The+Romans+-+From+Village+to+Empire+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"557918ae56aac60664226c4d3cfc1813dc58d9f5","infoHashBuffer":{"type":"Buffer","data":[85,121,24,174,86,170,198,6,100,34,108,77,60,252,24,19,220,88,217,245]},"announce":[],"urlList":[]}}