{"title":"Eminem Presents: The Re-Up [2006]","uid":8614359,"size":109034110,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:559b40b76f412ba035fa89f73cd1c52c84cc1e07&amp;dn=Eminem+Presents%3A+The+Re-Up+%5B2006%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"jonah9100","files":-1,"time":1372215113,"description":"Eminem's last album before he overdosed. Decent album. mp3 format. \nTRACKLIST: \n\n1.\t&quot;Shady Narcotics (Intro)&quot; (Produced by Eminem)\tM. Mathers, L. Resto, S. King\tEminem\t0:56\n2.\t&quot;We're Back&quot; (Produced by Eminem, Luis Resto)\tM. Mathers, L. Resto, O. Trice, S. Benton, A. Rogers, R. Johnson\tEminem, Obie Trice, Stat Quo, Bobby Creekwater, Cashis\t3:50\n3.\t&quot;Pistol Pistol (Remix)&quot; (Produced by Eminem)\tV. Carlisle, D. Holton, R. Johnson, M. Mathers, O. Moore, D.Porter, O.Trice\tObie Trice\t2:27\n4.\t&quot;Murder&quot; (Produced by Eminem, Luis Resto)\tM. Mathers, L. Resto, R. A. Johnson, R. Johnson, V. Carlisle\tBizarre, Kuniva of D12\t2:10\n5.\t&quot;Everything is Shady&quot; (Produced by Rikanatti)\tR. Johnson, R. Parham\tCashis\t4:23\n6.\t&quot;The Re-Up&quot; (Produced by Eminem)\tM. Mathers, L. Resto, C. Jackson, A. Young, M. Elizondo\tEminem, 50 Cent\t2:57\n7.\t&quot;You Don't Know&quot; (Produced by Eminem, Luis Resto)\tM. Mathers, C. Jackson, C. Lloyd, R. Johnson, L. Resto\tEminem, 50 Cent, Cashis, Lloyd Banks (Background vocals by Tony Yayo)\t4:17\n8.\t&quot;Jimmy Crack Corn&quot; (Produced by Eminem, Luis Resto)\tM. Mathers, L. Resto, C. Jackson\tEminem and 50 Cent\t3:54\n9.\t&quot;Trapped&quot; (Produced by Eminem)\tM. Mathers, D. Holton\tProof of D12\t0:58\n10.\t&quot;Whatever You Want&quot; (Produced by Witt and Pep)\tD. Porter, O. Moore, D. Moore, B. Johnson, D. Campbell\tSwifty McVay, Mr. Porter of D12\t2:48\n11.\t&quot;Talkin' All That&quot; (Produced by Rikanatti)\tR. Johnson, R. Parham\tCashis\t4:05\n12.\t&quot;By My Side&quot; (Produced By Focus...)\tS. Benton, B. Edwards, Jr.\tStat Quo\t4:08\n13.\t&quot;We Ride for Shady&quot; (Produced by The Alchemist)\tA. Maman, O. Trice, R. Johnson, B. Health, E. Peters, R. Hunter\tObie Trice and Cashis\t3:09\n14.\t&quot;There He Is&quot; (Produced by The Alchemist)\tA. Maman, A. Rogers, F. Bungusto\tBobby Creekwater\t4:27\n15.\t&quot;Tryin' Ta Win&quot; (Produced by The Alchemist)\tA. Maman, S. Benton\tStat Quo\t3:52\n16.\t&quot;Smack That (Remix)&quot; (Produced by Akon)\tM. Mathers, A. Thiam, M. Strange, L. Resto, S. Benton, A. Rogers\tAkon feat. Stat Quo and Bobby Creekwater\t5:14\n17.\t&quot;Public Enemy #1&quot; (Produced by Eminem)\tM. Mathers, L. Resto\tEminem\t1:58\n18.\t&quot;Get Low&quot; (Produced by Dr. Dre, Dawaun Parker)\tS. Benton, A. Young, D. Parker, M. Elizondo, T. Moore\tStat Quo\t3:20\n19.\t&quot;Ski Mask Way (Eminem Remix)&quot; (Produced by Disco D, Eminem, Luis Resto)\tC. Jackson, M. Mathers, L. Resto, D. Shayman, B. Sigler, R. Tyson, S.King\t50 Cent\t3:03\n20.\t&quot;Shake That (Remix)&quot; (Produced by Eminem, Luis Resto)\tM. Mathers, L. Resto, S. King, N. Hale, O. Trice, A. Rogers\tEminem, Nate Dogg, Obie Trice and Bobby Creekwater\t2:59\n21.\t&quot;Cry Now (Shady Remix)&quot; (Produced by Witt and Pep)\tO. Trice, D. Moore, B. Johnson, J. Scott, D. Robey, C. Louis, D. Campbell, S. Benton, R. Johnson, V. Carlisle, A. Rogers\tObie Trice, Kuniva, Bobby Creekwater, Cashis and Stat Quo\t5:09\n22.\t&quot;No Apologies&quot; (Produced By Eminem, Luis Resto)\tM. Mathers, L. Resto\tEminem\t4:19","torrent":{"xt":"urn:btih:559b40b76f412ba035fa89f73cd1c52c84cc1e07","amp;dn":"Eminem+Presents%3A+The+Re-Up+%5B2006%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"559b40b76f412ba035fa89f73cd1c52c84cc1e07","infoHashBuffer":{"type":"Buffer","data":[85,155,64,183,111,65,43,160,53,250,137,247,60,209,197,44,132,204,30,7]},"announce":[],"urlList":[]}}