{"title":"TapouT XT2 - Extreme Reinvented - x264 - MP4 - DVDrip","uid":8718239,"size":9838311042,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:561c44f823af3422957d09c54b1988c9d9916d54&amp;dn=TapouT+XT2+-+Extreme+Reinvented+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":2,"uploader":"MrTVGuy","files":-1,"time":1374368570,"description":"TapouT XT2: Extreme Reinvented x264 MP4 DVDrip\n\nHere it is, the long awaited workout that will get you in the best shape of your life.\n\nIt comes with the following workouts:\n\n1. 8 PACK ABS\nWhen a 6-pack just isn't enough! Want 8 pack-abs that will make you look like you just walked out of a magazine ad? Then pop in this DVD and get ready for all new XT extreme core moves that will rip your abs to shreds.\n\n2. BUNS AND GUNS 2\nThey are the Hollywood muscles- the booty and the guns. They need to look good. They need to look GREAT! And this is how you do it. Will you?\n\n3. CROSS CORE COMBAT 2\nForget sit-ups and crunches. That's for your old high school gym class. This sequel to the original hit Cross Core Combat for the XT1 series will literally reinvent the way you go about training your entire core. You will be stronger, faster, more athletic, and oh yeah, you'll look freakin' amazing naked.\n\n4. DRENCH XT\nIt's like showering with your workout clothes on. Think about 'off-the-hook', 'turbo-charged', and 'high octane'...and then, think again. Drench XT takes any other cardio workout, jumps on it, stomps on it, tears it to pieces, and then does it all over again. Wanna push play? Go ahead. We dare you!\n\n5. FIGHT NIGHT XT\nIf you liked Muay Thai in the original XT series, then get ready for Fight Night! You will throw down and &quot;get it on&quot; with some of the top pro MMA fighters in the world. This one is as authentic as it gets! Real MMA punches, kicks, flying knees, elbows and more. Fight Night will hone your fighting skills, boost your cardio and shred your body head to toe.\n\n6. HURL XT\nThe mother of all XT2 workouts...This one will have you cryin' for mommy. Like Mike says at the top of this workout, &quot;grab your jump rope, grab your XT Ball...and grab a bucket&quot;. Hurl XT is as extreme as it gets. Hurl XT is truly Extreme Reinvented.\n\n7. LEG EXTREME\nHave you ever heard your legs scream before? That's the feeling of results! Leg Extreme is designed to give you the performance of an elite athlete, and the look of someone with lean, chiseled legs! So get ready for the burn!\n\n8. RECOVERY AND MOBILITY\nWhen you train hard, you need to recover, stretch and work on your mobility. The pros do it and so should you. If you have never done a professional stretch and mobility workout before, this one is going to be eye opening and hip opening. Plus- it is critical to your success and completion of XT2... so don't skip it!\n\n9. SPRAWL AND BRAWL 2\nBack by popular demand! Sprawl and Brawl 2 is a non-stop barrage of cardio and resistance combined with total body movements that keeps your muscles guessing and your blood pumping. Plus enough sprawls, punches, kicks and flying knees to satisfy and exhaust any MMA fan.\n\n10. TOTAL BODY XT\nThe name says it all and this one gets it all. Chest, shoulders, legs, back, bi's, tri's and of course, the core. Total Body XT is a rigorous pace of fat blasting, body chiseling XT2 signature moves that will leave you covered in sweat and absolutely shredded!\n\nPLUS TWO BONUS WORKOUTS:\n\n11. FLEX XT\n12. ROUND 5\n\nIf you have not done TapouT XT, you should complete that workout before even attempting this one. TapouT XT can be downloaded at the following link:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7396720/Tapout_XT_Home_Fitness&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7396720/Tapout_XT_Home_Fitness&lt;/a&gt;\n\nDocuments included:\nTapouT XT Workout Schedule\nTapout XT2 Workout Schedule\nTapout XT &amp; XT2 Hybrid Workout Schedule\nTapouT XT 10 Day Slim Down\nTapout XT Fitness Guide\nTapouT XT Food Plan\nTapouT XT2 Nutrition Guide\n\nEQUIPMENT NEEDED:\nResistance Band\nJump Rope\nXT Training Ball (Medicine Ball with Handles)\n\nPlease enjoy and Seed. My upload is limited to 256K so be patient and everyone will get it.\n","torrent":{"xt":"urn:btih:561c44f823af3422957d09c54b1988c9d9916d54","amp;dn":"TapouT+XT2+-+Extreme+Reinvented+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561c44f823af3422957d09c54b1988c9d9916d54","infoHashBuffer":{"type":"Buffer","data":[86,28,68,248,35,175,52,34,149,125,9,197,75,25,136,201,217,145,109,84]},"announce":[],"urlList":[]}}