{"title":"ePSXe for Android v2.0.1","uid":13646191,"size":4768769,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:5669b5bc4d7902dbd870e4773c12c3e58e10d4a1&amp;dn=ePSXe+for+Android+v2.0.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":".BONE.","files":2,"time":1456166621,"description":"ePSXe for Android v2.0.1\r\nRequirements: 2.2+\r\nOverview: ePSXe for Android is a Playstation emulator (PSX and PSOne).\r\n\r\nIt is a port of the famous ePSXe for PC. ePSXe provides very high compatibility (&gt;99%), good speed, and accurate sound. It is designed for smartphones and tablets, (for 1-4 players) including a fun 2 players option with split screen mode. It includes virtual touchscreen pad support, hardware buttons mapping (Xperia Play, phones with keyboard or gamepad, external gamepads bluetooth or USB such as WiiMote, Sixaxis, Xbox 360, Moga, Ipega) and analog sticks. ePSXe supports OpenGL HD enhanced graphics thanks to the Peopsxgl Plugin, cheat codes as well as savestates and memcards compatibility with the PC version. ePSXe includes native support for ARM and Intel Atom X86. More info: http://epsxe.com/android/ \r\nIMPORTANT: ePSXe doesn't include games, Games must be provided by user.\r\n\r\nWHAT'S NEW\r\n\r\nV2.0.1\r\n* Fix ECM\r\nePSXe for Android 2.0.0:\r\nAdded simple shaders support. In this version you can select the shader to use, it can be NONE, FXAA, CRT-Hyllian, xBR-LV2-3D, CRT-lottes or other custom shader (Thanks to Hyllian and Lottes). It is possible from the shader selection screen to download a pack of shaders or you can add your own shaders\r\nAdded support for 2D-Filters: 2xSAI and xBRZx2/4 (thanks to Zenju). When enabling xBRZ filter, x2/x4 resolution will be disabled, because the filter does not work with internal scaling\r\nAdded support for Sub-pixel preccision to hardware renderers\r\nFixed garbage on borders in some games in hardware renderers\r\nFixed vibration on player 1\r\nFixed the game The Hive\r\nFixed PBP support on Nexus Player in android 6.0\r\nFixed some crashes while scanning games\r\nAdded more gamepads profiles: Mad Catz, Xiomi\r\nFixed ECM indexing block size when using MDF files\r\n\r\nThis app has no advertisements","torrent":{"xt":"urn:btih:5669b5bc4d7902dbd870e4773c12c3e58e10d4a1","amp;dn":"ePSXe+for+Android+v2.0.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5669b5bc4d7902dbd870e4773c12c3e58e10d4a1","infoHashBuffer":{"type":"Buffer","data":[86,105,181,188,77,121,2,219,216,112,228,119,60,18,195,229,142,16,212,161]},"announce":[],"urlList":[]}}