{"title":"Ani DiFranco - Discography (1988-2008) [FLAC]","uid":8815367,"size":6904075533,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:56acf9173e5b1dc303886fa575b6c0819f59db74&amp;dn=Ani+DiFranco+-+Discography+%281988-2008%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"politux","files":-1,"time":1376525137,"description":"\n  Ani DiFranco - Discography (1988-2008) [FLAC]\n\n  Genre: Pop/Rock, Folk\n  Styles: Singer/Songwriter, Alternative Folk\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  Carnegie Hall 4.6.01\n  Dilate\n  Educated Guess\n  Evolve\n  Hamburg, Germany 10.18.07\n  Knuckle Down\n  Like I Said - Songs 1990-91\n  Little Plastic Castle\n  Not a Pretty Girl\n  Not So Soft\n  Out of Range\n  Red Letter Year\n  Reprieve \n  Revelling: Reckoning (2CD)\n  So Much Shouting So Much Laughter\n  To the Teeth\n  Up Up Up Up Up Up\n\n  A folkie in punk's clothing, Ani DiFranco battled successfully against the Goliath of corporate rock to emerge as one of the most influential and inspirational cult heroines of the 1990s. A resolute follower of D.I.Y. ethos, DiFranco released her records through her own indie label, Righteous Babe, slowly but steadily building a devout grassroots following on the strength of a relentless tour schedule. An ardent feminist and an open bisexual, her songs tackled issues like rape, abortion, and sexism with insight and compassion, the music's empowering attitude and anger tempered by the poignant candor of singer/songwriter confessionalism.\n\n  DiFranco was born in Buffalo, NY, on September 23, 1970. She began her career at the age of nine, when her guitar teacher helped her land her first gig -- performing a set of Beatles covers -- at an area coffeehouse. Befriended by the likes of Suzanne Vega and Michelle Shocked, she later gave up music to study ballet, but at the age of 14 returned to the guitar and began composing her first songs. A year later, alienated from her crumbling family structure, she left home, living with friends while making the rounds of the Buffalo folk club circuit.\n\n  DiFranco had written over 100 original songs by the age of 19, and after briefly studying art, she relocated to New York City to further her musical aspirations; besieged by requests from fans for tapes of her performances, she recorded a demo and pressed 500 copies of a self-titled cassette to sell at shows. The tape -- a Spartan acoustic folk collection of intensely personal essays on failed relationships and gender inequities -- quickly sold out, and in 1990 DiFranco founded Righteous Babe to better distribute her recordings, which were slowly spreading across the country on the strength of a substantial word-of-mouth following.\nIn 1991, after issuing the assured Not So Soft, DiFranco hit the road alone, touring the nation in her Volkswagen and playing gigs wherever she could find them. Her cult blossomed, and her distinct image -- shaved head, tattoos, and body piercings -- soon became the de rigueur look for her fans as well. As albums like 1992's Imperfectly and 1993's Puddle Dive expanded her musical ambitions as well as her following, DiFranco became the subject of considerable major-label interest, yet she steadfastly rejected all offers as Righteous Babe grew to become a highly viable business venture.\n  \n  DiFranco continued playing over 200 dates a year, and soon even the mainstream media took notice of her cottage-industry music; after 1994's masterful Out of Range, she exploded with the following year's Not a Pretty Girl, which garnered notice from outlets ranging from CNN to The New York Times. A sprawling, eclectic work detailing a heated love affair with a man (much to the chagrin of her lesbian followers), 1996's Dilate even debuted in the Top 100 of the Billboard charts, a stunning achievement for an independent release. The live set Living in Clip followed in 1997.","torrent":{"xt":"urn:btih:56acf9173e5b1dc303886fa575b6c0819f59db74","amp;dn":"Ani+DiFranco+-+Discography+%281988-2008%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56acf9173e5b1dc303886fa575b6c0819f59db74","infoHashBuffer":{"type":"Buffer","data":[86,172,249,23,62,91,29,195,3,136,111,165,117,182,192,129,159,89,219,116]},"announce":[],"urlList":[]}}