{"title":"The L Word - Season 5 (gremster)","uid":4225745,"size":4377479045,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5784d2f2d074fa3bd2f56ab59bee59f049fa69a0&amp;dn=The+L+Word+-+Season+5+%28gremster%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":4,"uploader":"gremster","files":13,"time":1212814567,"description":"Season 5, Episode 1: LGB Tease\nOriginal Air Date: 6 January 2008\nShane aborts her plans to move in with Paige to help raise her son, and later suffers the consequences. Meanwhile, Jenny returns from a Mexican vacation with a billionaire movie financier in tow to launch an all-out war against Tina to take back her rights to the movie production &amp;#039;Lez Girls&amp;#039;. Phyllis has sudden doubts about the exclusivity of her romance with Joyce during her coming out party that Kit throws at the Planet. There, Alice and Shane attempt to set Tina up on a date. Helena gets tossed into jail for ripping off Catherine&amp;#039;s ill-gotten cash, and with nobody to help her, she faces a grim life behind bars. Bette&amp;#039;s welcome-home gesture to Jodi backfires.\n\n\nSeason 5, Episode 2: Look Out, Here They Come!\nOriginal Air Date: 13 January 2008\nTina&amp;#039;s obvious, lingering affection for Bette affects her dating prospects. With Shane lay ed off from her job while WAX is being repaired from the mysterious fire, Jenny lands her a last-minute gig of styling hair for the wedding of Jenny&amp;#039;s boss&amp;#039;s daughter which results in a hilarious series of erotic encounters as Shane scores with all the bridesmaids. Meanwhile, Tasha returns to town and reveals to Alice her reason that she&amp;#039;s being being investigated for &quot;homosexual conduct&quot;. Meanwhile, Kit and Max spot a young girl, named Adele, who&amp;#039;s obsessed with Jenny&amp;#039;s work and hook her up with her dream job of being Jenny&amp;#039;s new personal assistant. In prison, Helena is rescued by her cell mate, Dusty, from a severe beating from the other inmates.\n\n\nSeason 5, Episode 3: Lady of the Lake\nOriginal Air Date: 20 January 2008\nShane decides to temporarily swear off sex and reaps the health benefits with new energy and focus at taking aerobics classes and having Jenny, Alice and others tag along with her. Tina&amp;#039;s dating woes finally improve. Jodi brings Bette to meet and hang out with her fellow deaf friends, but Bette still has a hard time letting go of control. Max ponders a mutual same-sex attraction to Jodi&amp;#039;s interpreter. Tasha faces new allegations by her commanding officer. Meanwhile, The Planet is burglarized and Kit is attacked after hours. Jenny struggles to quash her growing feelings for her personal assistant, Adele, who is strangely attracted to the vicious Jenny&amp;#039;s demands. Helena finally gets comfortable in prison with her cell mate Dusty, but things are about to change when her angry mother, Peggy, finally turns up.\n\n\nSeason 5, Episode 4: Let&amp;#039;s Get This Party Started\nOriginal Air Date: 27 January 2008\nBette&amp;#039;s jealousy over Tina&amp;#039;s new girlfriend is the probable cause of a surprising moment. Meanwhile, Jenny takes over casting for &amp;#039;Lez Girls&amp;#039; where she is courted for the lead in her movie by the latest ambitious actress, Nikki Stevens, to play Jenny&amp;#039;s character. Also, the gang attends the opening of a new lesbian club, called SheBar, located just down the street which is competing with The Planet and operated by a shady couple named Dawn and Cindi.\n\n\nSeason 5, Episode 5: Lookin&amp;#039; at You, Kid\nOriginal Air Date: 3 February 2008\nJenny throws a party to introduce her friends to the actresses playing them in &quot;Lez Girls,&quot; which provokes both delight and distress. Meanwhile, Bette and Tina try to deal with what is obviously a rekindled spark. Alice angrily outs a closeted gay sports star after he utters a homophobic slur, which sparks a media firestorm.\n\n\nSeason 5, Episode 6: Lights! Camera! Action!\nOriginal Air Date: 10 February 2008\nThe production of &quot;Lez Girls&quot; finally begins with Jenny, now fully taken over as director and screenwriter, deals with all the usual headaches of filmmaking, including directing the recalcitrant star, Nikki Stevens, playing Jenny&amp;#039;s own character (Jessie) in the movie. Adele scans Vancouver for location shots while Jenny treats her to a shopping spree and full makeover. Meanwhile, Bette and Tina struggle with their rekindled romance. The bad and shady owners of SheBar, Dawn and Cindi, take their war against the gang to the next level in their attempts to close down The Planet for good. Tasha moves out of Alice&amp;#039;s apartment, while Phyllis struggles more with her divorce and her teenage daughter, Molly&amp;#039;s, resentment towards her.\n\n\nSeason 5, Episode 7: Lesbians Gone Wild\nOriginal Air Date: 17 February 2008\nAs filming on &amp;#039;Lez Girls&amp;#039; grows more chaotic and drawn-out, the manic and nasty Jenny grows more crazy and dealing with Niki, who continues slacking off, and both of them end up in the ring of a oil-wrestling match at SheBar. Meanwhile, Tasha learns that an tough-minded military prosecutor, Colonol Gillian Davis, is taking her case to prosecute her for homosexual conduct. Alice, guest hosting a new TV talk show, inadvertently outs Niki while trying to stay on the good side of the audience. Elsewhere, Bette is stuck looking after Phyllis&amp;#039; uptight daughter, Molly, who has a way with words, both harsh and casual, with Shane now working as the hairstylist for &amp;#039;Lez Girls.&amp;#039; Also, Jodi has a lunch date with her ex-lover Amy, while Kit continues to seek revenge against Dawn and Cindi for the closing down of the Planet.\n\n\nSeason 5, Episode 8: Lay Down the Law\nOriginal Air Date: 24 February 2008\nAlice finds herself in a serious bind when she&amp;#039;s called by Colonel Davis to testify on behalf of the U.S. Army against Tasha. Alice must decide whether to tell the truth about her romance with Tasha, or lie and risk facing charges of perjury. Meanwhile, Jenny continues her romance with Niki just as Niki&amp;#039;s managers push into full-force damage control after photos of Niki&amp;#039;s oil wrestling stint are posted on every tabloid magazine and Internet site. When one of Niki&amp;#039;s movies opens, Tina and the producers ban Jenny from attending as Niki&amp;#039;s date, and force a (male) actor to accompany Niki to the premier. Jenny asks Adele to sneak her into the theater, but the growingly crazy Adele instead locks Jenny out, and even impersonates Jenny to some of the attendees. Across town, Bette and Tina&amp;#039;s anguish over hiding their secret tryst begins to emotionally get to both of them as Jodi continue to slowly drift away from Bette, while Tina invites the &amp;#039;Lez Girls&amp;#039; cinematographer over for dinner at Bette&amp;#039;s house. Elsewhere, Molly continues to resent Phyllis&amp;#039; action concerning her divorce, and Shane tries to get Molly to see her mother in a more positive light.\n\n\nSeason 5, Episode 9: Liquid Heat\nOriginal Air Date: 2 March 2008\nKit and the owners of SheBar, Dawn and Cindi, arrange a sit down of talks to try to end their ugly conflict over business and &quot;lesbo rights&quot;. But it becomes clear that Dawn is not only slightly insane, but very domineering, and her impossible demands for full rights of the street becomes known. Meanwhile, Shane has an &quot;encounter&quot; with Molly who continues to maintain that she is straight and not interested in Shane&amp;#039;s pick-up lines. Elsewhere, Jenny fires a &quot;prissy&quot; male actor from the set after he makes a move onto Niki.\n\n\nSeason 5, Episode 10: Lifecycle\nOriginal Air Date: 9 March 2008\nThe girls attend the Subaru Pink Ride, a Los Angeles charity bicycle event, to support breast cancer research as well to remember Dana Fairbanks. Meanwhile, Tina is furious for Niki blowing her cover about her relationship with Jenny to the press, but the crafty and psychotic Adele assures Tina the two won&amp;#039;t be seen together publicly. Meeting old friends prompts Tasha to ponder her long-term plans in life over her stance with the Army. Molly&amp;#039;s continuing interest with Shane leads her to follow her on the bicycle marathon and eventually succeeding in hooking up with her. During a campfire stop of the bicycle ride, Bette and Tina are forced to reveal their secret newfound romance to their appalled friends, leaving Jodi completely wrecked.\n\n\nSeason 5, Episode 11: Lunar Cycle\nOriginal Air Date: 16 March 2008\nAfter the revelation at the Pink Ride, Jodi vows to fight for Bette. But a talk between Bette and Jodi comes to nothing because Bette confirms to love simultaneously Tina and Jodi. The twisted Adele finally goes over the deep end when, after weeks of planning, she makes her move to take over Jenny&amp;#039;s career and movie rights to &amp;#039;Lez Girls&amp;#039;, by stealing Jenny and Niki&amp;#039;s sex tape made during the bicycle marathon camp out and shows it to the producers, stating that she will send copies of it to various TV networks if she doesn&amp;#039;t get ALL the movie rights. When Dawn and Cindi buy 51% of the rights of The Planet, Kit reaches her peak and plans to murder Dawn with her newly bought gun, but is interrupted by Bette who asks her to pick up Angie. Kit then disposes of the gun in a trash can. Tina, with problems of her own on the Jenny-Adele case, constantly calls Bette to check if she has broken up with Jodi. Tasha and Alice look for a place to move in but troubles arouse when splitting the rent of it. Alice is invited to a party hosted by a New Zealand lesbian fashion designer, named Clea Mason, whom she meets on the TV cable program &amp;#039;The Look&amp;#039;.\n\n\nSeason 5, Episode 12: Loyal and True\nOriginal Air Date: 23 March 2008\nShane and Molly share a passionate morning before meeting Molly&amp;#039;s mother, Phyllis, and Joyce for breakfast. Phyllis asks if Molly is taking the internship during the following summer that they once talked about, Molly replies that she will spend the summer surfing with Shane, who was unaware of the internship. Shane is later confronted by Phyllis who says that Shane is not worthy of Molly&amp;#039;s being and must break up with her. Helena Peabody returns to Los Angeles to visit her dying mother in the hospital and is gifted by her family&amp;#039;s wealth once again. Once hearing of Kit&amp;#039;s loss of The Planet while she was away, Helena brings a mighty tempting proposition to SheBar co-owner Cindi: the chance of escaping Dawn&amp;#039;s claws by selling the ownership documents of the bar, which Cindi gladly accepts. Meanwhile, Alice almost kisses Clea Mason, but doesn&amp;#039;t end up falling in temptation despite her continuing problems with Tasha. Elsewhere, Bette gives a speech supporting Jodi at her new art exhibition, but later Jodi attacks Bette by humiliating her in front of everyone. Filming on &amp;#039;Lez Girls&amp;#039; finally wraps up as everyone arrives in all the glitz and glamor to the film&amp;#039;s celebration wrap party, where Bette reunites with Tina at last. The deranged Adele tries to ban Jenny and her friends from attending and continues to pass off the work as her own (as well as continuing to impersonate Jenny). But Jenny, with Tina&amp;#039;s help, pushes her way into the party anyway and sets the record straight by giving a powerful speech demolishing Adele&amp;#039;s character, but also says how thankful she is for the rest of her friends&amp;#039; loyalty and trust, ironically in that same moment, Shane betrays Jenny by seducing Nikki where Jenny walks in on them. Looking towards Shane, Jenny (more angry and cynical then ever) vows revenge...\n","torrent":{"xt":"urn:btih:5784d2f2d074fa3bd2f56ab59bee59f049fa69a0","amp;dn":"The+L+Word+-+Season+5+%28gremster%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5784d2f2d074fa3bd2f56ab59bee59f049fa69a0","infoHashBuffer":{"type":"Buffer","data":[87,132,210,242,208,116,250,59,210,245,106,181,155,238,89,240,73,250,105,160]},"announce":[],"urlList":[]}}