{"title":"The Crash of 2016 - Thom Hartmann - Audiobook MP3","uid":11196693,"size":275634750,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5834dee3608bd29455d42cb46b6c5f6a1190261a&amp;dn=The+Crash+of+2016+-+Thom+Hartmann+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1413101521,"description":"Accompanying material can be downloaded here: &lt;a href=&quot;\nhttp://nullrefer.com/?download.audible.com/product_related_docs/BK_HACH_001437.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nullrefer.com/?download.audible.com/product_related_docs/BK_HACH_001437.pdf&lt;/a&gt;\n\n\n\nMP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Crash of 2016: The Plot to Destroy America - and What We Can Do to Stop It\n\nWritten by: Thom Hartmann\nNarrated by: Dan Woren\nLength: 9 hrs and 35 mins\nUnabridged Audiobook\nRelease Date:11-12-13\n\nThe United States is more vulnerable today than ever before - including during the Great Depression and the Civil War - because the pillars of democracy that once supported a booming middle class have been corrupted, and without them, America teeters on the verge of the next Great Crash.\n\nThe United States is in the midst of an economic implosion that could make the Great Depression look like child's play. In The Crash of 2016, Thom Hartmann argues that the facade of our once-great United States will soon disintegrate to reveal the rotting core where corporate and billionaire power and greed have replaced democratic infrastructure and governance. Our once-enlightened political and economic systems have been manipulated to ensure the success of only a fraction of the population at the expense of the rest of us.\n\nThe result is a &quot;for the rich, by the rich&quot; scheme leading to policies that only benefit the highest bidders. Hartmann outlines the destructive forces - planted by Lewis Powell in 1971 and come to fruition with the &quot;Reagan Revolution&quot; - that have looted our nation over the past decade, and how their actions fit into a cycle of American history that lets such forces rise to power every four generations.\n\nHowever, a backlash is now palpable against the &quot;economic royalists&quot; - a term coined by FDR to describe those hoarding power and wealth - including the banksters, oligarchs, and politicians who have plunged our nation into economic chaos and social instability.\n\nAlthough we are in the midst of what could become the most catastrophic economic crash in American history, a way forward is emerging, just as it did in the previous great crashes of the 1760s, 1856, and 1929. The choices we make now will redefine American culture. Before us stands a genuine opportunity to embrace the moral motive over the profit motive - and to rebuild the American economic model that once yielded great success. \n\n\n\nAccompanying material can be downloaded here: &lt;a href=&quot;\nhttp://nullrefer.com/?download.audible.com/product_related_docs/BK_HACH_001437.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nullrefer.com/?download.audible.com/product_related_docs/BK_HACH_001437.pdf&lt;/a&gt;","torrent":{"xt":"urn:btih:5834dee3608bd29455d42cb46b6c5f6a1190261a","amp;dn":"The+Crash+of+2016+-+Thom+Hartmann+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5834dee3608bd29455d42cb46b6c5f6a1190261a","infoHashBuffer":{"type":"Buffer","data":[88,52,222,227,96,139,210,148,85,212,44,180,107,108,95,106,17,144,38,26]},"announce":[],"urlList":[]}}