{"title":"Eazy-E - Its On (187um Killa)","uid":3585856,"size":53945715,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5862d9ee7381fb4b92d3b9529edd86f8db4946a6&amp;dn=Eazy-E+-+Its+On+%28187um+Killa%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"billt02","files":10,"time":1167350650,"description":"Released a year after his previous EP (5150 Home 4 tha Sick) and a long five years since his one and only album to date (Eazy-Duz-It), It&amp;#039;s On (Dr. Dre) 187um Killa was both a stopgap release for Eazy-E and a response to the runaway success of The Chronic. Eazy had been lambasted on that Dr. Dre album (and especially in the &quot;Dre Day&quot; video), so it&amp;#039;s no surprise that he returns the favor here on &quot;Real Muthaphuckkin G&amp;#039;s&quot; and &quot;It&amp;#039;s On,&quot; dissing not only Dre but also Snoop Dogg. This ugly, mudslinging conflict aside, Eazy truly shines on these eight songs. Granted, eight songs isn&amp;#039;t a lot of music, especially since one of the eight is only a minute-long intro and another is yet another remake of &quot;Boyz-in-the Hood&quot; (and too because Eazy had been so AWOL in previous years -- five years and still no follow-up album to Eazy-Duz-It!?!). On the little bit of music that is here, however, Eazy proves that he&amp;#039;s still one of the best gangsta rappers out there in the early &amp;#039;90s. Sure, he&amp;#039;s not an especially gifted MC, and he&amp;#039;s not nearly as witty or perversely humorous as he had been previously on Eazy-Duz-It, either, but he has such a singular style and such attitude, he stands out amid the innumerable other gangstas out there at the time. And to elaborate upon his attitude, Eazy seems downright bitter here. The success of Dr. Dre and Ice Cube outside of N.W.A, not to mention the dissolution of that group, seems to have really upset him. So in a way, It&amp;#039;s On feels cathartic, as if Eazy were venting all his frustrations. It results in a sharp group of songs: there are the Dre disses, of course, but also the murder fantasy of &quot;Any Last Werdz,&quot; the f*ck-the-world nihilism of &quot;Still a Nigga,&quot; the sexist porno-dance of &quot;Gimmie That Nutt,&quot; and the smoke-out of &quot;Down 2 tha Last Roach.&quot; In other words, pretty much what you&amp;#039;d expect from Eazy. Yet there&amp;#039;s an underlying current of irony here that makes It&amp;#039;s On all the more poignant in retrospect. For one, Eazy may be dissing Dre to the extreme here, but pretty much all of the production work is straight from the Chronic playbook -- textbook G-funk, to the point it seems almost parodic. And secondly, the heedless promotion of sexism here is downright haunting in the aftermath of Eazy&amp;#039;s subsequent death from AIDS complications little more than a year later. So while on the surface It&amp;#039;s On may seem like a simple stopgap EP, it&amp;#039;s so much more, shedding light on what came of Eazy following his 15 minutes of fame with Eazy-Duz-It. In a word, tragic -- a tragic downfall that makes Eazy out to be not a martyr, which is how his legacy has often been painted, but instead makes him out to be a casualty of his own professed ideology. Again, tragic.","torrent":{"xt":"urn:btih:5862d9ee7381fb4b92d3b9529edd86f8db4946a6","amp;dn":"Eazy-E+-+Its+On+%28187um+Killa%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5862d9ee7381fb4b92d3b9529edd86f8db4946a6","infoHashBuffer":{"type":"Buffer","data":[88,98,217,238,115,129,251,75,146,211,185,82,158,221,134,248,219,73,70,166]},"announce":[],"urlList":[]}}