{"title":"The Norman Conquest: 1066   (Unabridged)","uid":11794626,"size":785195014,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5883ff777d55dd0298bacab5c84fcf4c532791e8&amp;dn=The+Norman+Conquest%3A+1066+++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"davieboy1966","files":39,"time":1428082909,"description":"Audio Books : History : MP3/128Kbps : English\n\n\nMarc Morris - The Norman Conquest\n\nThe Battle of Hastings and the Fall of Anglo-Saxon England\nWritten by: Marc Morris\nNarrated by: Frazer Douglas\nLength: 18 hrs and 9 mins\nUnabridged Audiobook\n\nA riveting and authoritative history of the single most important event in English history: The Norman Conquest.\n\nAn upstart French duke who sets out to conquer the most powerful and unified kingdom in Christendom. An invasion force on a scale not seen since the days of the Romans. One of the bloodiest and most decisive battles ever fought.\n\nThis new history explains why the Norman Conquest was the most significant cultural and military episode in English history. Assessing the original evidence at every turn, Marc Morris goes beyond the familiar outline to explain why England was at once so powerful and yet so vulnerable to William the Conqueror's attack; why the Normans, in some respects less sophisticated, possessed the military cutting edge; how William's hopes of a united Anglo-Norman realm unraveled, dashed by English rebellions, Viking invasions, and the insatiable demands of his fellow conquerors.\n\nThis is a tale of powerful drama, repression, and seismic social change: the Battle of Hastings itself; the sudden introduction of castles and the massive rebuilding of every major church; the total destruction of an ancient ruling class. Language, law, architecture, and even attitudes toward life itself were altered forever by the coming of the Normans. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5883ff777d55dd0298bacab5c84fcf4c532791e8","amp;dn":"The+Norman+Conquest%3A+1066+++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5883ff777d55dd0298bacab5c84fcf4c532791e8","infoHashBuffer":{"type":"Buffer","data":[88,131,255,119,125,85,221,2,152,186,202,181,200,79,207,76,83,39,145,232]},"announce":[],"urlList":[]}}