{"title":"Immunology &amp; Serology in Laboratory Medicine, 5E [PDF] [Stor","uid":11261790,"size":34965221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5916d5f1ed3a58f145591cd7e5475a39d58cb306&amp;dn=Immunology+%26amp%3B+Serology+in+Laboratory+Medicine%2C+5E+%5BPDF%5D+%5BStor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"0xmovva","files":2,"time":1413978024,"description":"TITLE/EDITION Immunology &amp; Serology in Laboratory Medicine, 5e (IMMUNOLOGY &amp; SEROLOGY IN LABORATORY MEDICINE ( TURGEON))\nAuthor: Mary Louise Turgeon\nSeries: IMMUNOLOGY &amp; SEROLOGY IN LABORATORY MEDICINE ( TURGEON)\nHardcover: 584 pages\nPublisher: Mosby; 5 edition (March 1, 2013)\nLanguage: English\nISBN-10: 0323085180\nISBN-13: 978-0323085182\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nThe 5th edition of this classic text sets the standard for comprehensive coverage of immunology. Building from a solid foundation of knowledge and skills, trusted author Mary Louise Turgeon takes you from basic immunologic mechanisms and serologic concepts to the theory behind the procedures you'll perform in the lab. Immunology &amp; Serology in Laboratory Medicine, Fifth Edition is the go-to resource for everything from mastering automated techniques to understanding immunoassay instrumentation and disorders of infectious and immunologic origin. Packed with learning objectives, review questions, step-by-step procedures, and case studies, this text is your key to succeeding in today's modern laboratory environment.\n\nFull-color, six-page insert of photomicrographs provide a better picture of what you'll see in the laboratory.\nLearning objectives at the beginning of each chapter offer a measurable outcome you can achieve by completing the material.\nChapter highlights at the end of each chapter provide a summary of the most important information covered in each chapter.\nReview questions at the end of each chapter are tied to learning objectives further enhance your understanding.\nCase studies challenge you to apply your knowledge and help strengthen your critical thinking skills.\nGlossary at the end of the book provides quick access to key terms and definitions.\nNEW! Expanded chapter on Vaccines as the importance of vaccines continues to become more evident.\nNEW! Updated chapter on Molecular Techniques incorporates the newest technology specific to immunology.\nNEW! Key terms at the beginning of each chapter help you learn the important vocabulary in immunology.\nNEW! Case studies with added multiple-choice questions in addition to critical thinking questions will help you apply your knowledge and develop critical-thinking skills","torrent":{"xt":"urn:btih:5916d5f1ed3a58f145591cd7e5475a39d58cb306","amp;dn":"Immunology+%26amp%3B+Serology+in+Laboratory+Medicine%2C+5E+%5BPDF%5D+%5BStor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5916d5f1ed3a58f145591cd7e5475a39d58cb306","infoHashBuffer":{"type":"Buffer","data":[89,22,213,241,237,58,88,241,69,89,28,215,229,71,90,57,213,140,179,6]},"announce":[],"urlList":[]}}