{"title":"Tim and Eric Awesome Show, Great Job - (Complete Season 4)","uid":4844332,"size":1078847865,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:59caf3b429049bbae5a97d0f87cdc5a17da4ccaa&amp;dn=Tim+and+Eric+Awesome+Show%2C+Great+Job+-+%28Complete+Season+4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"djTeka","files":-1,"time":1239581217,"description":"Tim and Eric Awesome Show, Great Job : Season 4 : 2009 : COMPLETE\n\n\n:    dd   jjj TTTTTTT        kk             :\n     dd         TTT     eee  kk  kk   aa aa \n dddddd   jjj   TTT   ee   e kkkkk   aa aaa \ndd   dd   jjj   TTT   eeeee  kk kk  aa  aaa \n dddddd   jjj   TTT    eeeee kk  kk  aaa aa \n:       jjjj                                :\n\n\nAww, it's over til next (maybe last) season...\n\nBUT IT WAS A GOOD ONE, WASN'T IT?\n\nHere all they are for season four!\n---------------------------------------------------------\n\nGuest stars include John C. Reilly, Alan Thicke, Zach Galifianakis, Frank Stallone, Tommy Wiseau, Peter Stormare, Fred Willard, Jonah Hill, Sydnee Steele, Michael Ian Black, Will Forte, Josh Groban, Scott Thompson, Larry Miller, David Wain, Fred Armisen, A.D. Miles, Flight of the Conchords and The Lonely Island.\n\n===========================\n[KEY]\n(Title,Airdate,Episode #,Production code)\nDescription (don't read if you want to be surprised, but of course)\n[/KEY]\n===========================\n\n(Stolen from Wikipedia, but &quot;Thanks Cinco!&quot;)\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Snow&quot;\tFebruary 8, 2009\t31\t401\nCinco D-Pants for diarrhea. When a blizzard snows in Tim and Eric, they reminisce over hot chocolate and urine with David Liebe Hart and Richard Dunn. Cinco Napples. More acting lessons with Tairy Greene. (Alan Thicke and Zach Galifianakis guest star.)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Balls&quot;\tFebruary 15, 2009\t32\t402\nEric has a third testicle implanted in his body for more pizazz. Problems arise for Eric and Tim investigates. The Cinco Urinal Shower is introduced. We see previews for a show called Whoopsie Daisy, wherein &quot;Whoopsie Goldberg&quot; has a camera following her around to document the blunders that occur in her life. Frank Stallone guest stars and sings a song to his daughter about turning her bedroom into a computer room.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Universe&quot;\tFebruary 22, 2009\t33\t403\nDr. Jimes Tooper and Dr. H. Donna Gust examine and discuss the mysteries of the universe. Gettin It Dunn with David Liebe Hart. Pierre launches a food poisoning PSA. The Zillions crew. Discount Prices vs. Premium Prices.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Road Trip&quot;\tMarch 1, 2009\t34\t404\nTim and Eric head down to Florida for a road trip to have a house party and enjoy Eric's parents loving warmth. Peter Stormare guest stars as a salesman promoting the Cinco Boy Synthetic Son. Scenes are shown from the Channel 5 TV movie &quot;Back to Squall&quot; starring Jonah Hill, James Quall, and David Liebe Hart.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Tommy&quot;\tMarch 9, 2009\t35\t405\nTim and Eric hire Tommy Wiseau to direct a &quot;Pig Man&quot; sketch for them. Features clips from The Room. Cinco introduces the Mancierge service, guest starring Fred Willard.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Origins&quot;\tMarch 16, 2009\t36\t406\nTim and Eric's origins, Make my Bub-Bubs Bounce, The Cinco Mouth Decorator, Dr Steve Brule with a tip on eggs.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Presidents&quot; (or AWESOME)\tMarch 24, 2009\t37\t407\nBen Hur hosts The Ben Hur Show Awesome. Tim and Eric both want to be President during a press conference. Includes a Kid Break about bloody nipples, and Channel 5 Presents The Human Body with Dr. Steve Brule. Michael Ian Black guest stars for Focus on Comedy with guests Tim and Eric. Jim Boonie, this is an episode for you.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Hair&quot;\tMarch 29, 2009\t38\t408\nCinco introduces the C-Bund. Tim graduates from barber school. Song Legends Karaoke presents Jim Furns' song, &quot;Live With my Dad.&quot; J.J. Pepper's Videography ad guest stars Will Forte.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Brothers Cinco&quot;\tApril 5, 2009\t39\t409\nA short film featuring the brothers Cinco; Mark (Tim) &amp; Terry (Eric). During CincoCon, Terry is officially charged with the murder of his wife Lynn. The company rolls out their &quot;E-Trial&quot; software, which takes the place of an actual trial. Music by Karen O.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n&quot;Tennis&quot;\tApril 12, 2009\t40\t410\nTim and Eric engage in a high stakes game of tennis, while Richard Dunn presides. Meanwhile, Glen Tennis sits down with Grum to discuss the release of their latest film. Fred Armisen, A.D. Miles, Flight of the Conchords, The Lonely Island and Bob Odenkirk guest star.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nUL by djTeka\n\n","torrent":{"xt":"urn:btih:59caf3b429049bbae5a97d0f87cdc5a17da4ccaa","amp;dn":"Tim+and+Eric+Awesome+Show%2C+Great+Job+-+%28Complete+Season+4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59caf3b429049bbae5a97d0f87cdc5a17da4ccaa","infoHashBuffer":{"type":"Buffer","data":[89,202,243,180,41,4,155,186,229,169,125,15,135,205,197,161,125,164,204,170]},"announce":[],"urlList":[]}}