{"title":"2014 Artist's &amp; Graphic Designer's Market [Epub] [StormRG]","uid":10287498,"size":3949523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59ec2f797784edc3d1622ee196939ee199517857&amp;dn=2014+Artist%27s+%26amp%3B+Graphic+Designer%27s+Market+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"krystine","files":-1,"time":1401809471,"description":"2014 Artist's &amp; Graphic Designer's Market (Artists and Graphic Designers Market)\nAuthor: Mary Burzlaff Bostic\nPublished: 2013\nPublisher: North Light Books\nISBN: 9781440329432\nFormat: Retail Epub\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\n\nBuild a Successful Art Career!\n2014 Artist's &amp; Graphic Designer's Market is the must-have reference guide for any artist who wants to establish or expand a career in fine art, illustration or graphic design. Thousands of successful artists have relied on us to help develop their careers and navigate the changing business landscape. The 2014 Artist's &amp; Graphic Designer's Market introduces a whole host of new features and guarantees the most up-to-date, individually verified market contacts possible.\n\nExpand your art business with these resources:\n\nA FREE 1-year subscription to ArtistsMarketOnline.com, where you can find industry contacts, track your submissions, get the latest art and design news and much more. (PLEASE NOTE: Free subscriptions are NOT included with the e-book edition of this title)\nComplete, up-to-date contact information for more than 1,700 art market resources, including galleries, magazines, book publishers, greeting card companies, ad agencies, syndicates, art fairs and more.\nArticles on the business of freelancing--from basic copyright information to tips on promoting your work.\nInformation on grants, residencies, organizations, publications and websites that offer support and direction for visual artists of all types.\nNEW! Informative articles on social media and e-mail marketing, getting the most from LinkedIn, and building better websites.\nNEW! Special features on insurance for artists, pricing artwork, printing giclees, sustainability practices, packaging design, and studio sales.\nNEW! Inspiring and informative interviews with successful professionals including publisher and legal expert Tad Crawford and artist Nancy Reyner.\nCheck out ArtistsMarketOnline.com and ArtistsNetwork.com for more helpful resources.","torrent":{"xt":"urn:btih:59ec2f797784edc3d1622ee196939ee199517857","amp;dn":"2014+Artist%27s+%26amp%3B+Graphic+Designer%27s+Market+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59ec2f797784edc3d1622ee196939ee199517857","infoHashBuffer":{"type":"Buffer","data":[89,236,47,121,119,132,237,195,209,98,46,225,150,147,158,225,153,81,120,87]},"announce":[],"urlList":[]}}