{"title":"The Faceless - Planetary Duality (2008) [mp3@320kbps]","uid":4490926,"size":76073224,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:59ffe1587cb74668898163adfd5bb40948709bfc&amp;dn=The+Faceless+-+Planetary+Duality+%282008%29+%5Bmp3%40320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Nshael","files":-1,"time":1225982658,"description":"Artist: The Faceless\nAlbum: Planetary Duality\nGenre: Metal | Death Metal | Progressive\nCountry: Los Angeles, United States\nInfo: Mp3, 320, Joint Stereo\nLabel: Sumerian Records \nSize: 65.41 MB\n\nTracklist:\n\no1. Prison Borno2. The Ancient Covenant\no3. Shape Shifters\no4. Coldly Calculated Design\no5. XenoXhrist\no6. Sons Of Belial\no7. Legions Of The Serpent\no8. Planetary Duality I (Hideous Revelation)\no9. Planetary Duality II (A Prophecies Fruition)\n\nInfo:\n   The Faceless is a technical death metal band from Los Angeles who have astonished their live audiences with dizzying guitar work, lightning fast drumming and unmatched brutality. Formed by guitarist Michael Keene and bassist Brandon Giffin, the band quickly found the perfect mix of dedicated musicians to complete the line up.\n   Drummer Brett Batdorf, having played a brief stint with Himsa and long time drummer of the acclaimed Los Angeles death metal band Tchildres, complimented the group perfectly and was added to the line up soon after. The combination of blistering guitar work, complex and fast-paced rhythms, offset by haunting keyboards and brutal vocals from singer Jeff Ventimiglia, set The Faceless in a class with the metal legends who have come before to change metal forever. The Faceless have developed a large following. Their live performance combined with the online success of 3 songs recorded and produced by guitarist Michael Keene established them as a force to be reckoned with. The band has already become a buzz in the metal scene drawing up to 300 kids at local shows. \n   In the past year The Faceless have been lucky enough to share the stage with such talented acts as: Cephalic Carnage, Vital Remains, Impaled, Through the Eyes of the Dead, Animosity, Ed Gein, The Number 12 Looks Like You, Into The Moat, Reflux, On Broken Wings, From A Second Story Window, Ion Dissonance, Crematorium, Phobia, Light This City, Neuraxis, Job For A Cowboy, Intronaut, Anal blast, All Shall Perish, Winter Solstice, Radiation 4, The Red Death, Embrace The End, Psyopus, Deadsoil, and Glass Casket.\n\nLine-up:\nDemon Carcass - Vocals\nMichael Keene - Guitars\nSteve Jones - Guitars\nBrandon Giffin - Bass\nLyle Cooper - Drums","torrent":{"xt":"urn:btih:59ffe1587cb74668898163adfd5bb40948709bfc","amp;dn":"The+Faceless+-+Planetary+Duality+%282008%29+%5Bmp3%40320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59ffe1587cb74668898163adfd5bb40948709bfc","infoHashBuffer":{"type":"Buffer","data":[89,255,225,88,124,183,70,104,137,129,99,173,253,91,180,9,72,112,155,252]},"announce":[],"urlList":[]}}