{"title":"Neuroanatomy and Neuroscience at a Glance, 4E [PDF] [StormRG]","uid":10424091,"size":53339437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a0fb99a192f455ac2bf1abdcd6dfcaa9d8f7193&amp;dn=Neuroanatomy+and+Neuroscience+at+a+Glance%2C+4E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"0xmovva","files":2,"time":1403678702,"description":"Author: Roger A. Barker , Francesca Cicchetti\nPaperback: 160 pages\nPublisher: Wiley-Blackwell; 4 edition (May 29, 2012)\nLanguage: English\nISBN-10: 0470657685\nISBN-13: 978-0470657683\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nNeuroanatomy and Neuroscience at a Glance provides a user-friendly introduction to the anatomy, biochemistry, physiology and pharmacology of the human nervous system within one, succinct, highly-illustrated volume.\nThe double page spreads begin by summarising the anatomical structure and function of the different components of the central nervous system, followed by a section on applied neurobiology which outlines how to approach the patient with neurological and psychiatric problems and provides an overview of treatment and management options.\n\nKey features of this fourth edition include: \n\n* A manageable overview of the structure and function of the central nervous system\n* Full guidance on how to approach the patient with neurological problems and the investigations used in the most common scenarios\n* Cases highlighting the clinical relevance of the basic neuroscience\n* New chapters on the major neurotransmitters of the CNS and their functions, the enteric nervous system and stroke\n\nNeuroanatomy and Neuroscience at a Glance is the ideal companion for anyone about to start a basic neuroanatomy or neuroscience course, or can be used as a refresher for those in clinical training.","torrent":{"xt":"urn:btih:5a0fb99a192f455ac2bf1abdcd6dfcaa9d8f7193","amp;dn":"Neuroanatomy+and+Neuroscience+at+a+Glance%2C+4E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a0fb99a192f455ac2bf1abdcd6dfcaa9d8f7193","infoHashBuffer":{"type":"Buffer","data":[90,15,185,154,25,47,69,90,194,191,26,189,205,109,252,170,157,143,113,147]},"announce":[],"urlList":[]}}