{"title":"Digimon World (u) [PSX]","uid":3394521,"size":238297748,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:5a11d7c57fc077e0dab6cbc6dd47d79f0a1c329c&amp;dn=Digimon+World+%28u%29+%5BPSX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"Frezzno","files":1,"time":1128928433,"description":"Digimon World PSX\n\nZip packed\nCDs: 1\nImage type: bin,cue\nLanguage: US\nGame description:\nhttp://www.psxa2z.com/gpgs/BT0277.html\n\nMy description:\nI have played all four games of this series and I find this one to be the best. Nice GFX, reasonable SFX and outstanding gameplay which you will not find in other games. It's easy, so rediculously easy that you think you can manage it. That's why you'll spend weeks, or in my case, months to prove it. You play as a boy sucked into a digital world. In order to return to the real world you'll need to figure out why good digimons turns bad. To your help you will have, guess what, a digimon. It's a kind of a pet, and in this case, digital pets. Like every pet you'll need to take care of it. You need to feed it and by that you need to take it to the loo... In time! Do not make random dumps because it will stay there on that exact spot forever, unless... But that's nasty! You need to have affection for it, love it. Otherwise you will have trouble in battle. The battle system is originally innovative, you yell different command at it and depending on it's mood it will obay. I yell at it for real and guess what, it obays. There are plenty of stuff you can do with your digimon other then exploring Digimon World. If you find a rod you can go fishing, but I usually hang out at the training camp. As time goes by your digimon will grow and eventually get old and die. If you raised it well it might have digivolved into something great before that. In my case digivolving is rare. When a digimon dies its spirit will pass on to the new one which you'll get automatically. And that digimon will get a tiny bit better.\n\nWell, that's my description of this fantastic game. I hope you'll enjoy it, and if you do, don't forget to return to the real world from time to time. \n\nPCSXBOX configurations:\nBios yes\nFrameskip on\nFramelimit on\n\nThe intro FMV will have some stuttering sound but the game will run perfect.\n\n\nOther games that I have and all works on the Xbox. Make request here if you want.\n\nAlundra ( http://thepiratebay.se/details.php?id=3389495 )\nAlundra 2\nBrigandine US ( http://thepiratebay.se/details.php?id=3388482 )\nBrigandine Grand Edition Jap\nBubble Bobble 2\nBust a Groove 1 and 2\nChrono Cross ( http://thepiratebay.se/details.php?id=3388893 )\nDiablo\nFinal Fantasy VII\nLegand of Dragoon ( http://thepiratebay.se/details.php?id=3392365 )\nLegend of Mana\nLunar 2 Eternal Blue Complete\nR-Type Delta\nSalamander DX\nStar Ocean the 2nd Story (Doesn't work on the pcsxbox, hangs on the first battle, sorry.)\nTop Shop\n\n/Frezzno\n\n\n- PSX - PCSXBOX - PSXBOX ----------------------------------------------\nPlaying PSX games on xbox is not only cool, it's also fun and pleasent.\nSometimes it's even better than playing on a real Playstation. That is\nif you got the game to actually work, which seems to be a difficult\ntask. Because of that few will choose to play PSX on the Xbox and a\ngame will be hard to find, as it already is. The Xbox community is big\nand by introducing the PSX there a dying race might rise again, or at\nleast not be forgotten. And others, both old and new, will have a\nchance to enjoy what once ruled the earth. Please help this community\nby uploading more games and include this entire tag to your description\nalong with details of Pcsxbox configuration for the game. By having\nthis tag a game will be easy to find and surely work on the Xbox when\nmaking a search on PCSXBOX or exclusively PSXBOX. While making a simple\nsearch on PSX others can enjoy it on other systems as well.\n\n/Thanks for sharing.\n-----------------------------------------------------------------------","torrent":{"xt":"urn:btih:5a11d7c57fc077e0dab6cbc6dd47d79f0a1c329c","amp;dn":"Digimon+World+%28u%29+%5BPSX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a11d7c57fc077e0dab6cbc6dd47d79f0a1c329c","infoHashBuffer":{"type":"Buffer","data":[90,17,215,197,127,192,119,224,218,182,203,198,221,71,215,159,10,28,50,156]},"announce":[],"urlList":[]}}