{"title":"Russian Phrases For Dummies - Andrew Kaufman","uid":11676727,"size":7217531,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ab2f8353324cd9726f5290c15dc338c0f798c6f&amp;dn=Russian+Phrases+For+Dummies+-+Andrew+Kaufman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1422902631,"description":"Traveling in a foreign country such as Russia suddenly becomes a lot more exciting when you can engage in elegant small talk with the locals. Russian Phrases For Dummies is your handy guide to everyday words and phrases you can start using immediately to make your visit more rewarding and a whole lot easier. This user-friendly phrasebook will jump-start your comprehension and have you speaking basic Russian in no time. Its quick-and-easy approach gives you language fundamentals up front, the Words to Know section helps you find the right word fast, and the easy-to-use pronunciation key helps other people understand what you're trying to say. You'll learn how to: Get directions, shop, and eat out Talk numbers, dates, and time Chat about family and work Discuss sports and the weather Deal with problems and emergencies Pronounce familiar English words and phrases in Russian and English Beware of words that sound to English but don't mean the same thing Read signs that use the Russian alphabet Follow the conventions of Russian pronunciation Use basic Russian grammar correctly Keep ten commonly used Russian phrases on the tip of your tongue Use basic telephone vocabulary and send letters, emails, and faxes Don't have time to study the language before you get to Russia? No worries. Just flip through Russian Phrases For Dummies, find the section that fits your needs, and start talking!","torrent":{"xt":"urn:btih:5ab2f8353324cd9726f5290c15dc338c0f798c6f","amp;dn":"Russian+Phrases+For+Dummies+-+Andrew+Kaufman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ab2f8353324cd9726f5290c15dc338c0f798c6f","infoHashBuffer":{"type":"Buffer","data":[90,178,248,53,51,36,205,151,38,245,41,12,21,220,51,140,15,121,140,111]},"announce":[],"urlList":[]}}