{"title":"Peep Show - UK Comedy - Complete Series 1-7 - MP4 PLARSUGO","uid":6485604,"size":4974018760,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5add350b1dab483459010fdcb34f6a428c10adb0&amp;dn=Peep+Show+-+UK+Comedy+-+Complete+Series+1-7+-+MP4+PLARSUGO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":8,"uploader":"Plarsugo","files":-1,"time":1308695940,"description":"Peep Show - Complete Series 1 to 7 !\n\n\nOnly 4.63GB MP4 format!\n\nClassic UK Channel 4 Comedy.\n\nIMDB Rating 9.3/10 (as of June 2011).\n\n\nFrom Wikipedia:\n\nPeep Show is a BAFTA award-winning British sitcom starring David Mitchell and Robert Webb. The programme is written by Jesse Armstrong and Sam Bain, with additional material by Mitchell and Webb themselves, amongst others. It has been broadcast on Channel 4 since 2003. The show's seventh series (broadcast late 2010) makes it the longest-running sitcom in Channel 4 history. Stylistically, the show uses point of view shots with the thoughts of main characters Mark and Jeremy audible as voiceovers.\nPeep Show follows the lives of two men in their late twenties and early thirties, Mark Corrigan (Mitchell), employed as a loan manager, and Jeremy Usbourne (Webb), an unemployed musician. The pair met at the fictional Dartmouth University, and now share a flat in Croydon, South London. Mark is a loan manager at the fictional JLB Credit, and is financially secure, but awkward and socially inept, with a pessimistic and critical attitude. Jeremy, having recently split up with his girlfriend Big Suze, now lives in Mark's spare room. He usually has a much more optimistic and energetic outlook on the world than Mark, yet his self-proclaimed talent as a musician is yet to be recognised, and he is not as popular or attractive as he would like to think himself, although he is the more successful with the opposite sex of the two.\n\nMore info @:\n\nWikipedia: http://en.wikipedia.org/wiki/Peep_Show_(TV_series)\n\nIMDB: http://www.imdb.com/title/tt0387764/\n\nChannel 4: http://www.channel4.com/programmes/peep-show\n\n\nFormat:\nMP4\n480 x 272\n128kbps Stereo\n\n\n\n\n\nNOTES:\n\nIf you're looking for HD content, then please look elsewhere...\n\nAll my torrents will be in MP4 format (at lower resolutions), for the sake of keeping file sizes small.\n\nPerfectly watchable, and most suited to those with mobile devices capable of playing MP4 (ipod, mobiles etc.).\n\nThis will play on PC / Mac also. Codec may be required under Windows.\n\nIf you have problems playing ANY video format then I recommend the free K-Lite Codec Pack from: \n &lt;a href=&quot;\nhttp://www.codecguide.com/download_kl.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.codecguide.com/download_kl.htm&lt;/a&gt;\n\n\n\nI know it's clichÃƒÂ© to say it, but please seed, or at the very least upload as much as you download. Cheers.","torrent":{"xt":"urn:btih:5add350b1dab483459010fdcb34f6a428c10adb0","amp;dn":"Peep+Show+-+UK+Comedy+-+Complete+Series+1-7+-+MP4+PLARSUGO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5add350b1dab483459010fdcb34f6a428c10adb0","infoHashBuffer":{"type":"Buffer","data":[90,221,53,11,29,171,72,52,89,1,15,220,179,79,106,66,140,16,173,176]},"announce":[],"urlList":[]}}