{"title":"Into The Woods 1991 Live on Broadway Bernadette Peters","uid":4121115,"size":1466868604,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5ae502a6a1af47671600840acb7918153a1b4b6b&amp;dn=Into+The+Woods+1991+Live+on+Broadway+Bernadette+Peters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"rambam1776","files":22,"time":1207556625,"description":"Yet another in my series of LIVE ON BROADWAY rips. The play is 156 minutes, so I ripped this one to 1.4 gig to ensure quality and continuity. The DVD has no special features or subtitles, so no point to uploading the DVDR A quick search of the database shows another copy of this available, but it is an old VHS rip, so this should be in higher quality.\n\n\nINTO THE WOODS is Sondheim?s vicious rip on fairy tales and Disney sappiness. Besides some killer music, it has some of the best one liners ever staged ? Just wait for ?Who you gonna tell??  Bernadette Peters outvamps the vampiest vamp who ever vamped in her role as the wicked witch, and Joanna Gleason?s baker?s wife won a well deserved Tony award. This play depends a great deal on subtle physical comedy and timing, as well as facial expressions, so watch closely or some great humor will pass you by. The soundtrack is also available in torrented form, just run a search. The description below is from Amazon.\n\n &lt;a href=&quot;\nhttp://imdb.com/title/tt0099851/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0099851/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Into-Woods-Bernadette-Peters/dp/B00001PE59/ref=pd_bbs_sr_1?ie=UTF8&amp;s=dvd&amp;qid=1207547677&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Into-Woods-Bernadette-Peters/dp/B00001PE59/ref=pd_bbs_sr_1?ie=UTF8&amp;s=dvd&amp;qid=1207547677&amp;sr=8-1&lt;/a&gt;\n\n\nAmazon.com essential video\nFractured fairy tales of a darker hue provide the remarkable context for Into the Woods, which deconstructs the Brothers Grimm by way of Rod Serling. While the faces and names are familiar, Cinderella, Rapunzel, Little Red Riding Hood, and company inhabit a sylvan neighborhood in which witches and bakers are next-door neighbors, handsome princes from once-parallel fables are competitive (and equally vain) brothers, and all the stories intersect through unexpected new plot twists. \n\nStephen Sondheim&amp;#039;s Tony-winning score favors intricate ensemble numbers that present the characters&amp;#039; divergent, then overlapping fears and desires. And it&amp;#039;s the latter category that provides a primary thread to James Lapine&amp;#039;s ingenious puzzle of a book, which coheres around the inevitability--and treachery--of our innermost wishes. That theme is given farcical energy in the first act, which offers enough comic invention, tart dialogue, and witty music for a satisfying evening of theater as is. \n\nInstead, Sondheim and Lapine offer a bold, darker second act that takes a look at what happens after &quot;happily ever after,&quot; elevating the work beyond inspired parody toward allegorical gravity. By the final scenes, with the one-two punch of the score&amp;#039;s two most enduring songs, &quot;No One Is Alone&quot; and &quot;Children Will Listen,&quot; what began as a clever diversion has touched deeper nerves and primed some tear ducts. This video production by the original Broadway cast gets its marquee shimmer from Bernadette Peters&amp;#039;s wonderful witch, but the standout (and Tony winner as Best Actress) is Joanna Gleason, who gives the Baker&amp;#039;s Wife a mixture of warmth, pragmatism, and sudden, poignantly romantic radiance. \n\nThe DVD version is comparatively no-frills, given its American Playhouse origins, but multiformat digital audio renders the musical performances in immaculate detail. --Sam Sutherland \n\nProduct Description\nA baker and his wife journey into the woods in search of a cow, a red cape, a pair of golden slippers and some magic beans to lift a curse that has kept them childless. Tony Award winners Bernadette Peters, Joanna Gleason and the rest of the original Broadway cast weave their magic spell over you in Stephen Sondheim&amp;#039;s masterpiece, directed by James Lapine, a seamless fusion of fairy tale characters and what happens after &quot;happily ever after. &quot;With oft-recorded songs such as &quot;Children Will Listen&quot; and &quot;No One is Alone,&quot; &quot;Into the Woods&quot; is a music lover&amp;#039;s delight from start to finish--and will forever cement Stephen Sondheim&amp;#039;s unparalleled position as the giant of the American musical theater. \n\n","torrent":{"xt":"urn:btih:5ae502a6a1af47671600840acb7918153a1b4b6b","amp;dn":"Into+The+Woods+1991+Live+on+Broadway+Bernadette+Peters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ae502a6a1af47671600840acb7918153a1b4b6b","infoHashBuffer":{"type":"Buffer","data":[90,229,2,166,161,175,71,103,22,0,132,10,203,121,24,21,58,27,75,107]},"announce":[],"urlList":[]}}