{"title":"7 Computer Skills You Must Have - Shaku Atre.pdf","uid":15400547,"size":935103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bd205e9faad2598a1abae5dacc14a1f09abd998&amp;dn=7+Computer+Skills+You+Must+Have+-+Shaku+Atre.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"papasokratis","files":1,"time":1469450892,"description":"Shaku Atre is an accomplished entrepreneur and a passionate advocate for helping women around the world develop skills to gain financial independence. Using her own money to finance micro-lending ventures, she has helped a number of young women to become successful entrepreneurs in the US and in India. She is a computer technologist who has worked with IBM, the FBI, AT&amp;T, and many other prestigious organizations worldwide, and was a partner at Price Waterhouse Coopers.\r\n\r\nEquipped with a relentless drive to learn new skills, Atre achieved her goal of financial independence years ago. Now she wants to share her experience and expertise with other women. She and her associates have started a website, www.WorldWomanWarrior.com, dedicated to helping women to gain skills to make more money, founded on the premise that a person who doesn't know how to use computer technology in today's world is almost considered illiterate.\r\n\r\nIn order to acquire lucrative jobs today, women have to learn science, technology, engineering, and mathematics, as well as medicine-also known as STEM skills. Our mission is to help women to take calculated risks so that they will have money to invest. To become financially independent, your money has to make more money","torrent":{"xt":"urn:btih:5bd205e9faad2598a1abae5dacc14a1f09abd998","amp;dn":"7+Computer+Skills+You+Must+Have+-+Shaku+Atre.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bd205e9faad2598a1abae5dacc14a1f09abd998","infoHashBuffer":{"type":"Buffer","data":[91,210,5,233,250,173,37,152,161,171,174,93,172,193,74,31,9,171,217,152]},"announce":[],"urlList":[]}}