{"title":"Moriarty_Liane-The_Last_Anniversary.epub","uid":9226078,"size":499491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bf3787324f3a8931280d7f088a54a6165b6025a&amp;dn=Moriarty_Liane-The_Last_Anniversary.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"420weedman","files":1,"time":1385009388,"description":"Sophie Honeywell always wondered if Thomas Gordon was the one she let get away. He was the perfect boyfriend, but on the day he was to propose, she broke his heart. A year later he married his travel agent, while Sophie has been mortifyingly single ever since. Now Thomas is back in her life because Sophie has unexpectedly inherited his aunt Connie's house on Scribbly Gum Island -- home of the famously unsolved MunroBabymystery.\n\nSophie moves onto the island and begins a new life as part of an unconventional family where it seems everyone has a secret. Grace, a beautiful young mother, is feverishly planning a shocking escape from her perfect life. Margie, a frumpy housewife, has made a pact with a stranger, while dreamy Aunt Rose wonders if maybe it's about time she started making her own decisions.\n\nAs Sophie's life becomes increasingly complicated, she discovers that sometimes you have to stop waiting around -- and come up with your own fairy-tale ending.\n\nAs she so adroitly did in her smashing debut novel, Three Wishes, the incomparable Liane Moriarty once again combines sharp wit, lovable and eccentric characters, and a page-turning story for an unforgettable Last Anniversary.","torrent":{"xt":"urn:btih:5bf3787324f3a8931280d7f088a54a6165b6025a","amp;dn":"Moriarty_Liane-The_Last_Anniversary.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bf3787324f3a8931280d7f088a54a6165b6025a","infoHashBuffer":{"type":"Buffer","data":[91,243,120,115,36,243,168,147,18,128,215,240,136,165,74,97,101,182,2,90]},"announce":[],"urlList":[]}}