{"title":"Harry Potter PDF eBooks 1-7","uid":7041521,"size":20334422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c0648aad4b93a0d3a675eeebcf4b83815492a5d&amp;dn=Harry+Potter+PDF+eBooks+1-7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"simbooks","files":-1,"time":1329564835,"description":"HARRY POTTER SERIES by J.K. Rowling PDF EBOOK SET\n\nFIND MORE BOOKS AT:\n\n  h t t p : / / s i m b o o k s . c o m u l e . c o m  \n\nWhat you will download:\n\n  1. Book 1 - The Philosopher's Stone PDF eBook\n  2. Book 2 - The Chamber of Secrets PDF eBook\n  3. Book 3 - The Prisioner of Azkaban PDF eBook\n  4. Book 4 - The Goblet of Fire PDF eBook\n  5. Book 5 - The Order of the Phoenix PDF eBook\n  6. Book 6 - The Half Blood Prince PDF eBook\n  7. Book 7 - The Deathly Hallows PDF eBook\n\n\n\nHarry Potter and the Philosopher's Stone \n     by J.K. Rowling \n\nCategory : Fantasy &amp; Magical Realism \nSeries : Harry Potter Series - Book I \nPublication : 30 June, 1997 \nSynopsis: Harry Potter is an ordinary boy who lives in a cupboard under the stairs at his Aunt Petunia and Uncle Vernon's house, which he thinks is normal for someone like him who's parents have been killed in a 'car crash'. He is bullied by them and his fat, spoilt cousin Dudley, and lives a very unremarkable life with only the odd hiccup (like his hair growing back overnight!) to cause him much to think about. That is until an owl turns up with a letter addressed to Harry and all hell breaks loose! He is literally rescued by a world where nothing is as it seems and magic lessons are the order of the day. Read and find out how Harry discovers his true heritage at Hogwarts School of Wizardry and Witchcraft, the reason behind his parents mysterious death, who is out to kill him, and how he uncovers the most amazing secret of all time, the fabled Philosopher's Stone! All this and muggles too. Now, what are they?\n\nHarry Potter and the Chamber of Secrets \n     by J.K. Rowling \n\nCategory : Fantasy &amp; Magical Realism\nSeries : Harry Potter Series - Book II \nPublication : 2 July, 1998 \nSynopsis: Harry Potter is a wizard. He is in his second year at Hogwarts School of Witchcraft and Wizardry. Little does he know that this year will be just as eventful as the last ...even getting there is an adventure in itself! The three firm friends, Harry, Ron and Hermione, are soon immersed in the daily round of Potions, Herbology, Charms, Defence Against the Dark Arts, and Quidditch. But then horrible and mysterious things begin to happen. Harry keeps hearing strange voices, sinister and dark messages appear on the wall, and then Ron's sister Ginny disappears...\n\nHarry Potter and the Prisinor of Azkaban \n     by J.K. Rowling \n\nCategory : Fantasy &amp; Magical Realism\nSeries : Harry Potter Series - Book III\nPublication : 8 July, 1999 \nSynopsis: Rose Hathaway knows it is forbidden to love another guardian. Her best friend Lissa - the last Dragomir princess - must always come first. Unfortunately, when it comes to gorgeous Dimitri Belikov, some rules are meant to be broken... But since making her first Strigoi kills, Rose hasn't been feeling right. Something dark has begun to grow in her mind, and ghostly shadows warn of a terrible evil drawing nearer to the Academy's iron gates. And now that Lissa and Rose's sworn enemy, Victor Dashkov, is on trial for his freedom, tensions in the Moroi world are higher than ever. Lying to Lissa about Dimitri is one thing, but suddenly there's way more than friendship at stake. The immortal undead are on the prowl, and they want vengeance for the lives that Rose has stolen. In a heart-stopping battle to rival her worst nightmares, Rose will have to choose between life, love, and the two people who matter most... But will her choice mean that only one can survive?\n\nHarry Potter and the Goblet of Fire \n     by J.K. Rowling \n\nCategory : Fantasy &amp; Magical Realism\nSeries : Harry Potter Series - Book IV \nPublication : 8 July, 2000 \nSynopsis: The summer holidays are dragging on and Harry Potter can't wait for the start of the school year. It is his fourth year at Hogwarts School of Witchcraft and Wizardry and there are spells to be learnt and (unluckily) Potions and Divination lessons to be attended. But Harry can't know that the atmosphere is darkening around him, and his worst enemy is preparing a fate that it seems will be inescapable...\n\nHarry Potter and the Order of the Phoenix \n     by J.K. Rowling \n\nCategory : Fantasy &amp; Magical Realism\nSeries : Harry Potter Series - Book V \nPublication : 21 June, 2003 \nSynopsis: Dumbledore lowered his hands and surveyed Harry through his half-moon glasses. 'It is time,' he said, 'for me to tell you what I should have told you five years ago, Harry. Please sit down. I am going to tell you everything.' Harry Potter is due to start his fifth year at Hogwarts School of Witchcraft and Wizadry. He is desperate to get back to school and find out why his friends Ron and Hermione have been so secretive all summer. However, what Harry is about to discover in his new year at Hogwarts will turn his whole world upside down ...But before he even gets to school, Harry has an unexpected and frightening encounter with two Dementors, has to face a court hearing at the Ministry of Magic and has been escorted on a night-time broomstick ride to the secret headquarters of a mysterious group called 'The Order of the Phoenix'. And that is just the start. A gripping and electrifying novel, full of suspense, secrets, and - of course - magic.\n\nHarry Potter and the Half Blood Prince \n     by J.K. Rowling \n\nCategory : Fantasy &amp; Magical Realism\nSeries : Harry Potter Series - Book VI\nPublication : 16 July, 2005 \nSynopsis: 'In a brief statement on Friday night, Minister for Magic Cornelius Fudge confirmed that He Who Must Not Be Named has returned to this country and is once more active. It is with great regret that I must confirm that the wizard styling himself Lord - well, you know who I mean - is alive and among us again, said Fudge.' These dramatic words appeared in the final pages of Harry Potter and the Order of the Phoenix. In the midst of this battle of good and evil, Harry Potter and the Half-Blood Prince takes up the story of Harry Potter's sixth year at Hogwarts School of Witchcraft and Wizardry, with Voldemort's power and followers increasing day by day...\n\nHarry Potter and the Deathly Hallows \n     by J.K. Rowling \n\nCategory : Fantasy &amp; Magical Realism\nSeries : Harry Potter Series - Book VII\nPublication : 21 July, 2007 \nSynopsis: 'His hand closed automatically around the fake Horcrux, but in spite of everything, in spite of the dark and twisting path he saw stretching ahead for himself, in spite of the final meeting with Voldemort he knew must come, whether in a month, in a year, or in ten, he felt his heart lift at the thought that there was still one last golden day of peace left to enjoy with Ron and Hermione.' With these words Harry Potter and the Half-Blood Prince draws to a close. And here, in this seventh and final book, Harry discovers what fate truly has in store for him as he inexorably makes his way to that final meeting with Voldemort. In this thrilling climax to the phenomenally bestselling series, J.K. Rowling will reveal all to her eagerly waiting readers.\n\n\n\nPlease seed and if you like the torrent, please comment.","torrent":{"xt":"urn:btih:5c0648aad4b93a0d3a675eeebcf4b83815492a5d","amp;dn":"Harry+Potter+PDF+eBooks+1-7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c0648aad4b93a0d3a675eeebcf4b83815492a5d","infoHashBuffer":{"type":"Buffer","data":[92,6,72,170,212,185,58,13,58,103,94,238,188,244,184,56,21,73,42,93]},"announce":[],"urlList":[]}}