{"title":"AC/DC - Back In Black [1980][2003][320 KBPS][Japan Remaster]","uid":8030071,"size":151189635,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c2f6a47344d49bc5c11a10753efa9c482860948&amp;dn=AC%2FDC+-+Back+In+Black+%5B1980%5D%5B2003%5D%5B320+KBPS%5D%5BJapan+Remaster%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"LameDuck69","files":18,"time":1358390690,"description":"AC/DC - Back In Black [1980][2003][Japan Remaster]\n\n\n\n\n\n01. Hells Bells  \n02. Shoot To Thrill  \n03. What Do You Do For Money Honey  \n04. Givin The Dog A Bone  \n05. Let Me Put My Love Into You  \n06. Back In Black  \n07. You Shook Me All Night Long  \n08. Have A Drink On Me  \n09. Shake A Leg  \n10. Rock And Roll Ain't Noise Pollution  \n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nAC/DC are an Australian hard rock band, formed in 1973 by brothers Malcolm and Angus Young, who have remained constant members. Commonly classified as hard rock or blues rock, they are also considered pioneers of heavy metal and are sometimes classified as such, though they have always classified their music as simply &quot;rock and roll&quot;. To date they are one of the highest-grossing bands of all time.\n\n-----------------------------------------------------------------------------------\n\nBack in Black is an album by Australian hard rock band AC/DC. It is the seventh Australian and sixth internationally released studio album by the band.\n\nReleased on 25 July 1980, Back in Black was the first AC/DC album recorded without former lead singer Bon Scott, who died on 19 February 1980 at the age of 33, and was dedicated to him. The band considered disbanding following Scott's death, but they ultimately decided to continue, with encouragement from Scott's parents, and shortly thereafter hired Brian Johnson as their new lead singer and lyricist. Producer Robert John &quot;Mutt&quot; Lange, who had previously worked with AC/DC on Highway to Hell, was again brought in to produce. The album was recorded at Compass Point Studios in Nassau, Bahamas, and Electric Lady Studios in New York, where the album was also mixed.\n\nBack In Black was originally mastered by Bob Ludwig at Masterdisk, NY. The album was remastered and re-released in 1994, then again as part of the Bonfire box set in 1997, and as part of the AC/DC Remasters series in 2003 by George Marino. In addition, a Dualdisc version was released in 2004, featuring the album in enhanced LPCM Stereo format and the video documentary The Story of Back in Black.\n\nAs of June 2011 the album has sold an estimated 50 million copies worldwide, making it tied for second highest-selling album of all time, the highest-selling album by a band (together with Pink Floyd's Dark Side of the Moon), the best-selling hard rock album of all-time, and the best-selling album ever released by an Australian musical act. On 13 December 2007, the RIAA certified it 22Ã— Multi Platinum, recognizing sales of 22 million in the United States, making it the sixth-highest selling album in the US (fourth-highest at the time).\n\n\n\n\n\n","torrent":{"xt":"urn:btih:5c2f6a47344d49bc5c11a10753efa9c482860948","amp;dn":"AC%2FDC+-+Back+In+Black+%5B1980%5D%5B2003%5D%5B320+KBPS%5D%5BJapan+Remaster%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c2f6a47344d49bc5c11a10753efa9c482860948","infoHashBuffer":{"type":"Buffer","data":[92,47,106,71,52,77,73,188,92,17,161,7,83,239,169,196,130,134,9,72]},"announce":[],"urlList":[]}}