{"title":"Wes Montgomery - Complete Riverside Recordings (12 CD)","uid":5715495,"size":1156582943,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5c5dabdbe574c8c9788c440453dc2656340ce860&amp;dn=Wes+Montgomery+-+Complete+Riverside+Recordings+%2812+CD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"Muuzmaster","files":159,"time":1280076250,"description":"(from allmusic.com)\n\nWes Montgomery recorded exclusively for the Riverside label during the four years covered by this massive 12-CD box set and, although his later albums for Verve and particularly the pop/jazz A&amp;M dates sold many more copies, it is from his Riverside dates that his legacy was primarily formed. Virtually unknown at the time of his debut on Riverside, Montgomery soon became a major influence whose style is still copied decades later. The guitarist is heard in quite a few different settings here: in trios with organist Melvin Rhynbe and a quartet with pianist Tommy Flanagan; as a sideman on different sessions with Nat Adderley, Harold Land, and Cannonball Adderley; performing with his brothers, Buddy  and Monk; holding his own with pianist George Shearing, vibraphonist Milt Jackson, and tenor great Johnny Griffin; and (for an album ironically titled Fusion) playing with strings for the first time. All in all, there is a tremendous amount of rewarding performances included in this essential set, most of which show why Wes Montgomery is still considered one of the all-time great jazz guitarists. \n\n-----------------------------------------------------------\n___________________________________________________________\n\n\n A while ago I found here a torrent featuring a compilation of this Wes Mongomery 12 CD set. It is a fantastic compilation which fits nicely in a single CD (you can find it in the following link).\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4174824/Jazz_-_Wes_Montgomery_59-63_on_Riverside_%5B75_alphabetic%5D&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4174824/Jazz_-_Wes_Montgomery_59-63_on_Riverside_%5B75_alphabetic%5D&lt;/a&gt;\n\n I liked it so much that I wanted to have the complete 12 CD set, so I searched for it in other torrent sites and found this torrent. I'm indexing it so people can find it here in piratebay too.\n \n I dindt create it, nor encoded the files; Its mp3 and the quality is quite good.","torrent":{"xt":"urn:btih:5c5dabdbe574c8c9788c440453dc2656340ce860","amp;dn":"Wes+Montgomery+-+Complete+Riverside+Recordings+%2812+CD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c5dabdbe574c8c9788c440453dc2656340ce860","infoHashBuffer":{"type":"Buffer","data":[92,93,171,219,229,116,200,201,120,140,68,4,83,220,38,86,52,12,232,96]},"announce":[],"urlList":[]}}