{"title":"Link2SD+ 3.5.2 Patched (move apps to sdcard)","uid":10724762,"size":3308856,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:5ceeb66e1a4e44377e9d39135ae62877b32f438a&amp;dn=Link2SD%2B+3.5.2+Patched+%28move+apps+to+sdcard%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"m1t0s1s","files":2,"time":1407547161,"description":"The is the version with all features unlocked! It can move large games to the sd card on kitkat 4.4 devices. You must use Aparted (or an sd card reader and boot to Gnu Parted live cd to move partitions around)\n\n\n\n\nDevice: No Device Only Android :P\nOS: Android 4.1     \nLink2SD Plus v3.5.2 Patched\nRequirements: 2.0 and up\nOverview: Link2SD is an application manager that makes it easy for Android 2.0+ users to move applications to the SD card. It enables you to manage your apps and storage easily.\n\nLink2SD is an application manager that makes it easy for Android 2.0+ users to move applications to the SD card, to clean all cache files of the apps. It enables you to manage your apps and storage easily.\n\nIt also provides native app to SD (app2sd) features on Android 2.2 and higher. It can move any non-protected user apps to SD card (force move), with batch moving capability.\nThat feature uses Android's standard SD-card installation feature and does not require a second partition.\n\nCache cleaner function clears all your cache and free up space with a single tap. Also cache cleaner widget displays total cache size and enables &quot;one tap cache cleaning&quot; without opening the app.\n\nFeatures:\n- App manager\n- Create and remove link for apk, dex and lib files of the app.\n- Plus version also links private data files of the apps\n- Automatically link newly installed apps (optional)\n- Move any user apps to SD even though the app does not support moving to SD (a.k.a. &quot;force move&quot;, for Android 2.2 and higher)\n- Shows the apps that support moving to SD with native apps2sd\n- Set the default install location of the apps; auto, internal, or external\n- Batch link, unlink, reinstall, uninstall, &quot;move to SD&quot;, &quot;move to phone&quot; functions\n- Notify when movable apps installed\n- Uninstall system applications (bloatware removal)\n- Freeze and un-freeze system and users applications\n- Convert system apps into user apps\n- Convert user apps into system apps\n- Integrate &quot;Updated&quot; system apps into system (ROM)\n- Clear data and cache of the application\n- Clear all apps cache at once (1-tap cache cleaner without being root)\n- Exclusion list for &quot;Clear all app cache&quot; function\n- Clear cache widget (1-tap cache cleaner without being root)\n- Notify if total cache size exceeds specified size\n- Reboot manager includes power off, normal reboot, quick (hot) reboot, reboot recovery, reboot bootloader / download mode\n- Reboot widget to boot with one click\n- List applications, show detailed size information and link status\n- Wide variety of options to sort and filter apps\n- Search applications by name\n- Display available space information of internal storage, SD card and SD card 2nd partition\n- Share the link of an app\n- Support 40+ languages\n\nPlus features:\n- Links internal data directories of the apps to SD card\n- Links dex files of the system apps to SD card\n- Auto clear cache service\n- Removes ads from Link2SD\n\nWhat you need for linking apps:\n- root permission.\n- a second partition on your SD card.\n\nYou should have two partitions on SD card and both should be primary.\nThe first FAT partition is your standard SD card storage. The second partition is used for application files and can be ext2, ext3, ext4, f2fs or FAT.\n\nYou need to use a non-FAT file system (ext2, ext3, ext4 or f2fs) on your second partition in order to link app's private data files. Because the FAT file system (FAT16, FAT32 or exFAT) does not support UNIX file ownership or permissions and will cause a security breakdown of app's private files.\nLink2SD Plus can move app's private data files if you have a non-FAT partition\n\nLink2SD does not create the second partition, you need to create it yourself. You can use any partition manager such as Minitool, Paragon, Easeus etc. for this.\n\nWhen you connect your phone to PC as mass storage, Android unmounts the first FAT partition but the second partition remains mounted. Therefore linked applications are not affected and can be run without problems.\n\nLink2SD is free (ad supported) application.\n\nDISCLAIMER: It is made available for use at your own risk with no warranty of any kind.\n\nWhat's New\n3.5.2\n- fixed the bug that causes linked apps disappear on reboot when internal data is linked on some KitKat devices **\n** if you have this issue run &quot;Recreate mount scripts&quot; and reboot\n\nThis app has NO advertisements\n","torrent":{"xt":"urn:btih:5ceeb66e1a4e44377e9d39135ae62877b32f438a","amp;dn":"Link2SD%2B+3.5.2+Patched+%28move+apps+to+sdcard%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ceeb66e1a4e44377e9d39135ae62877b32f438a","infoHashBuffer":{"type":"Buffer","data":[92,238,182,110,26,78,68,55,126,157,57,19,90,230,40,119,179,47,67,138]},"announce":[],"urlList":[]}}