{"title":"Ma Cousine Est Une Putain (Marc Dorcel) 2016","uid":15847537,"size":867837361,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5d7e02d5d44a4d7e819876881d5152c65dabd12c&amp;dn=Ma+Cousine+Est+Une+Putain+%28Marc+Dorcel%29+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":6,"uploader":"EndYou","files":1,"time":1474121402,"description":"... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57dd3235d4329.html  \nhttp://imgpremium.com/img-57dd323941e94.html \r\n\r\nStella Cox, Lexie Candy, Mea Melone, Ryan Ryder, Juan Lucho, Pascal White, Luke Hardy, Potro de Bilbao, Marc Rose, Dirty Dan.\r\n\r\nEn arrivant a Londres pour y passer des vacances en famille, la jeune Elise ne s’attendait certainement pas a ce que ces quelques jours se transforment en veritable semaine du plaisir. Milo, son jeune cousin Anglais s’etant fait tromper et larguer par sa copine, Elise fera tout ce qu’elle pourra pour lui remonter le moral et lui redonner confiance en ses capacites a seduire les femmes. Pour cela, la jolie Francaise devra donner de sa personne et seduire aussi bien les hommes que les femmes qu’elle rencontrera. Franco, le bel Hispanique viril sur lequel sa tante a jete son devolu sera sa premiere « victime consentante ». Pour changer les idees de son cousin, Elise profitera d’une sortie dans Londres pour l’emmener dans un strip club dans lequel elle usera de tous ses charmes pour seduire l’une des danseuses. Elise montrera alors toute l’etendue de ses talents de seductrice en se lancant dans un duo lesbien torride sous les yeux de Milo. Un peu plus tard dans la journee, Elise fera la rencontre du nouveau copain de Stella, l’ex de Milo, venu recuperer les affaires de jeune femme. Apres qu’Elise l’ait bien excite en s’exhibant devant lui l’homme n’aura d’autre choix que de la prendre sur la table du salon. Pendant ce temps, Milo retombera par hasard dans les bras de son ex. L’ayant surprise nue dans sa salle de bain, il la sodomisera sans menagement avant de finalement reussir a se debarrasser d’elle pour de bon. Milo ayant enfin repris confiance en lui, Elise pourra desormais se concentrer sur son propre plaisir et finira ses vacances en beaute au cours d’un gang bang improvise avec les trois collegues de son cousin. Plaisirs lesbiens, fellations, sodomies et gang bang, Elise ne laissera passer aucune opportunite de prendre du plaisir tout en permettant a Milo de se debarrasser des « parasites » qui lui gachaient la vie.\r\n\r\nMPEG4 Video (H264) 960x536","torrent":{"xt":"urn:btih:5d7e02d5d44a4d7e819876881d5152c65dabd12c","amp;dn":"Ma+Cousine+Est+Une+Putain+%28Marc+Dorcel%29+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d7e02d5d44a4d7e819876881d5152c65dabd12c","infoHashBuffer":{"type":"Buffer","data":[93,126,2,213,212,74,77,126,129,152,118,136,29,81,82,198,93,171,209,44]},"announce":[],"urlList":[]}}