{"title":"TAKING-WOODSTOCK.2009.DVDrip[vice]","uid":5199205,"size":584287541,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e06fce3ae82526c03b6ad984d8cca197bcd7d32&amp;dn=TAKING-WOODSTOCK.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"vicerock","files":-1,"time":1260070556,"description":"TAKING WOODSTOCK DVDrip\n\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 02:00:34\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nDemetri Martin\nImelda Staunton\nHenry Goodman\nLiev Schreiber\nJonathan Groff\nEmile Hirsch\nPaul Dano\n\nPlot\n\nSet in 1969, the film follows the true story of Elliot Tiber, an aspiring Greenwich Village interior designer whose parents own the small dilapidated El Monaco Motel in White Lake, in the town of Bethel, New York. The hippie theater troupe The Earthlight Players rents the barn, but can hardly pay any rent. They sometimes run around naked outside, but are then chased back into the barn by Elliot's mother. Due to supposed financial trouble the motel may have to be closed, but Elliot assists in trying to avoid that.\n\nElliot plans to hold a small musical festival, and has, for one dollar, obtained a permit from the town of Bethel. When he hears that the organizers of the Woodstock Festival face opposition against the originally planned location, he offers his permit and the motel accommodations. Max Yasgur provides his nearby farm land; first they agree on a fee of $ 5,000, but after realizing how many people will come Yasgur demands $75,000, which the organizers reluctantly accept. Elliot comes to agreement about the fee for the motel more smoothly. Initial objections by his mother quickly disappear when she sees the cash paid in advance. A veteran transvestite is hired as security guard.\n\nElliot and Yasgur encounter a little bit of expected opposition. The local diner refuses to serve Elliot anymore, inspectors target the hotel (and only his) for building code violations, and some local boys paint a swastika and hate words on the hotel. However, these things are quickly squelched, and Yasgur doesn't care because he's gotten more politeness from everybody that came then he ever got from the locals who oppose it.\n\nThe Tiber family works hard and makes much money. Elliot and the viewer do not see the musical performances; on his way to them Elliot makes an LSD-trip with a couple, in their Volkswagen Bus.\n\nWhen back Elliot suggests to his mother that they have now money to hire a worker, so that he can leave, but his greedy mother prefers Elliot's free services. However, it turns out that Elliot's mother secretly (without even her husband knowing) saved $ 97,000, so that even before the festival they were financially fine. Elliot hates it that his mother pretended financial trouble and requested him to help out. With his father's blessing he leaves to live his own life.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1127896/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1127896/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:5e06fce3ae82526c03b6ad984d8cca197bcd7d32","amp;dn":"TAKING-WOODSTOCK.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e06fce3ae82526c03b6ad984d8cca197bcd7d32","infoHashBuffer":{"type":"Buffer","data":[94,6,252,227,174,130,82,108,3,182,173,152,77,140,202,25,123,205,125,50]},"announce":[],"urlList":[]}}