{"title":"Girlfriends 4 Ever + DLC 1&amp;2 [1.8] Delux Edition","uid":15854997,"size":2482962432,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:5e8d26c8ad174f24d2e0831aa255feeefec2d5cc&amp;dn=Girlfriends+4+Ever+%2B+DLC+1%26amp%3B2+%5B1.8%5D+Delux+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":7,"uploader":"MoobieTB","files":1,"time":1474235997,"description":"Tara and Sayako had met just recently, instantly clicked and became girlfriends. But then Tara discovered Sayako's little... or should we say huge 15 inch secret. Tara was in shock and awe as she gazed upon the biggest, most luscious and vascular cock she'd ever seen. She couldn't stop herself and on a whim, she let her curiosity take over and gave Sayako a blow job; a blow job so insanely intense, passionate and mind blowingly orgasmic it went down in Sayako's list of sexual experiences as the most epic ever.\r\nDespite all of this Tara blew off the friendship, in her mind she was conflicted over even contemplating a relationship with a girl... especially a girl with a huge cock, plus the fact she has a boyfriend. But that night stirred something deep inside her, she became restless, she kept thinking about their night together, Sayako's delicious features and most of all her long, hard throbbing cock. She invited herself to a party that she knew Sayako would attend and as soon as she laid eyes on her, she knew she wanted more. She took Sayako by the hand and lead her to a place where they were alone...\r\n\r\nFEATURES:\r\nfixed issue with 'Sayako Self Love' scene not looping properly\r\nfixed issue with extras scene not playing correct length for movie maker\r\nmoved new DLC1 and DLC2 sex scene angles to their corresponding 'fun stuff' sections, so playing the DLCs start with their intros\r\nfixed sequencing issue of amazon and anal scenes\r\nfixed issue with cum shot scene not playing in 'movie maker'\r\nG4E DLC1\r\nvideo edit DLC1 cum shot scene\r\nminor video and sound edit to all transitions\r\nadjusted audio levels for intro and cum shot scenes\r\nchanged POV cum shot scenes to enable tracking and correct audio sequencing\r\nchanged voice over for autofellatio grind and autofellatio grind fast scenes\r\nadded rimming/ double hand job scene\r\nadded auto felatio piledriver scene\r\nadded sayako solo auto felatio scene\r\nadded sayako huge cock scene\r\nadded credits\r\nadded mp4 version\r\nG4E DLC2\r\nvideo edit DLC2 cum shot scene\r\nminor video edit and voice over amendments to all transitions\r\nfixed 'Tara sitting BJ' scene\r\nfixed some DLC2 sex scenes not looping properly\r\nadjusted audio levels for intro and cum shot scenes\r\nremoved 'DLC choice' screen from DLC2 play mode\r\nremoved 'DLC choice' screen from 'movie maker'\r\nadded sayako solo auto felatio no balls scene\r\nadded more angles sayako huge cock scene\r\nadded credits\r\nadded mp4 version","torrent":{"xt":"urn:btih:5e8d26c8ad174f24d2e0831aa255feeefec2d5cc","amp;dn":"Girlfriends+4+Ever+%2B+DLC+1%26amp%3B2+%5B1.8%5D+Delux+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e8d26c8ad174f24d2e0831aa255feeefec2d5cc","infoHashBuffer":{"type":"Buffer","data":[94,141,38,200,173,23,79,36,210,224,131,26,162,85,254,238,254,194,213,204]},"announce":[],"urlList":[]}}