{"title":"Wolverine &amp; The X-Men v1 01-42 + Ex (2011-2014|Dgtl|Zone-E)","uid":9670333,"size":1785619326,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5eadac7b917eddc0622f7d9814a547f0b1fb88e6&amp;dn=Wolverine+%26amp%3B+The+X-Men+v1+01-42+%2B+Ex+%282011-2014%7CDgtl%7CZone-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1393445958,"description":"Formed in the wake of X-Men: Schsim, Wolverine's rebuilt school for mutants quickly becomes it's own unique entity - complete with an unusual unruly student body, Toad reduced to school Janitor, Krakoa as the campus &quot;mascot&quot; and constant attacks from the outside world (and inside forces as well). The new Jean Grey School For The Gifted swiftly comes under threat of a reborn and much younger Helffire Club, commanded by Kade Kilgore. The staff and attendees become used to dealing with the strange and absurd - some of the best and most gentle souls are reduced to primal rage, while others desert for a much more frightening academic experience with Mystique and Sabertooth as headmasters. There is the return of the original X-Men from back in the past, the tension of Battle of the Atom and the division with ever-more radical Cyclops, an encounter with Logan's brother Dog that involves a field trip gone horribly wrong. There are attempts to infiltrate the school, and more importantly struggles to even survive it. Yet through it all, Aaron and his cohorts keep the action and drama flowing and we come to carwe about these kids as much as the adults in charge - yes, even Quentin Quire! After a great detour with Cyclops and Wolverine that hints at a possible reconciliation, Jason Aaron's remarkable run on this title concludes with the graduation of some students, and for others - not so much.\n\nThis torrent contains every issue of the first volume, including the Annual, all in Digital form thanks to Zone-Empire. I must also credit nemesis43 for making some of this stuff available much easier in the first place. I have also added the Alpha and Omega mini (and noted on the folder that it takes place after W&amp;TXM 003). That limited series is also DIgital, courtesy of G85-Empire. Some of the files I forgot to label uniformly, so my mistake on that. Thanks to all the original scanners and uploaders for their awesome work - please seed and enjoy! :-)","torrent":{"xt":"urn:btih:5eadac7b917eddc0622f7d9814a547f0b1fb88e6","amp;dn":"Wolverine+%26amp%3B+The+X-Men+v1+01-42+%2B+Ex+%282011-2014%7CDgtl%7CZone-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eadac7b917eddc0622f7d9814a547f0b1fb88e6","infoHashBuffer":{"type":"Buffer","data":[94,173,172,123,145,126,221,192,98,47,125,152,20,165,71,240,177,251,136,230]},"announce":[],"urlList":[]}}