{"title":"Blue October - Discography (1998-2013) [FLAC]","uid":8862291,"size":5143744597,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5f1adaceb13ede6786a7d1fee8decab2ba3f7bff&amp;dn=Blue+October+-+Discography+%281998-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":18,"uploader":"politux","files":-1,"time":1377806940,"description":"\n  Blue October - Discography (1998-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Post-Grunge, New Wave, Synth Pop\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1998 The Answers\n  2000 Consent To Treatment\n  2003 History for Sale\n  2004 Argue With A Tree (Live)\n  2006 Foiled\n  2006 Foiled (UK Special Edition)\n  2007 Foiled For The Last Time (Live)\n  2008 Dirt Room (Single)\n  2009 Approaching Normal\n  2011 Any Man in America\n  2013 Sway\n\n  The Texas quintet Blue October formed during the post-grunge boom of the mid-'90s when vocalist/guitarist Justin Furstenfeld began penning angst-ridden rock songs with the help of his brother, drummer Jeremy Furstenfeld, and violinist Ryan Delahoussaye. Bassist Matt Noveskey and lead guitarist Brant Coulter completed the band's initial lineup, and Blue October released an independent debut album, The Answers, in 1998. The band's emotive brand of post-grunge led to the sale of 5,000 copies in their native Houston alone. Two years later, Blue October made their major-label debut on Universal with Consent to Treatment.\n\n  By the time Blue October began prepping for their third album, 2003's History for Sale, guitarist Coulter had left the group and CB Hudson (guitar/vocals) had been added. The band itself had also left Universal for Brando Records. The album's first single, &quot;Calling You,&quot; became a Top 40 hit thanks to its inclusion on the American Wedding soundtrack, and Universal re-signed the band in the wake of such newfound success. The live CD/DVD package Argue with a Tree was released in February 2005, following 18 months of touring. Noveskey briefly left the band shortly thereafter, but returned in time to record Blue October's first studio album in three years, Foiled, which was issued in April 2006 and went platinum one year later.\n\n  Before the band went on tour with Yellowcard in September 2007, Universal/Motown released Foiled for the Last Time, a two-disc set consisting of a full version of Foiled, 14 newly recorded songs performed live, and several alternative remixes. Recording sessions for another studio album, Approaching Normal, commenced in mid-2008 with producer Steve Lillywhite, and the finished product appeared early the following year. Two albums appeared in 2011, Ugly Side: An Acoustic Evening with Blue October (recorded live in Austin, Dallas, and Houston) and Any Man in America. The the group's seventh studio album, Sway, followed in 2013.","torrent":{"xt":"urn:btih:5f1adaceb13ede6786a7d1fee8decab2ba3f7bff","amp;dn":"Blue+October+-+Discography+%281998-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1adaceb13ede6786a7d1fee8decab2ba3f7bff","infoHashBuffer":{"type":"Buffer","data":[95,26,218,206,177,62,222,103,134,167,209,254,232,222,202,178,186,63,123,255]},"announce":[],"urlList":[]}}