{"title":"Smith Micro Anime Studio Pro 9.5 (Preactivated) [ChingLiu]","uid":9013824,"size":217364807,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:602618fca7ae1bab7c2b6199104ea01d5d320489&amp;dn=Smith+Micro+Anime+Studio+Pro+9.5+%28Preactivated%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1381158164,"description":"New Features in Anime StudioÂ® Pro 9.5\n\nSmart Bones\nEnhancement to Smart Bones now allows the ability to control Switch layers, Layer order, Layer visibility, Follow path, Flip layer horizontally/vertically, Stroke exposure, Shape effect positioning, Shape effect parameters (like gradient colors), 3D thickness of vector shapes that have been converted to 3D and even more smart bones controls.\n\nDepth Shifting\nWhen moving an object forward and back in Z, Depth Shifting is an option to preserve its apparent size. Anime Studio Pro 9.5 does this by automatically applying the proper amount of scale. This can be used to arrange landscapes, for example placing mountains far away without forcing them to become tiny.\n\nMedia foundation\nThe 64-bit Windows version of Anime Studio Pro 9.5 will now use Media Foundation. It is no longer necessary to install QuickTime to import popular audio and video formats like MP3, AAC, MP4, and QuickTime. When exporting animations on Windows 7 and higher, the application can create movies using the Windows Media Foundation media library. When exporting animations on Windows XP and higher, the application can create movies using the DirectShow media library.\n\nBone-Rigging System\nEnhancement to bones now allows you to add labels and assign colors to bones. The keyframes for colored bones show up in the timeline in special colored channels to match.\n\nNested Layer Controls\nBones can now control the children of their children. If you have a group inside a bone layer and then vector layers inside that group, the bone layer can manipulate the artwork in those vector layers if nested layer control is turned on. This allows for more powerful rigging options, while simultaneously simplifying and allow more organization in the layer hierarchy.\n\nFlexi-Binding\nFlexi-Binding allows you to isolate the influence of a set of bones from the rest of the skeleton. For example, only the right arm bones should affect the artwork for the right arm. This lessens (or eliminates) the need to separate artwork on frame zero, and then put it back together again with the Offset Bone tool. This is a great new feature for images and vectors.\n\nStyles Improvement\nImprovements to Styles now allow you to see real-time changes to shape's fill color, stroke color, brush settings, etc. on the canvas so you can see exactly what effect your changes will have.\n\nUpdate to Eye Dropper\nThe updated and improved Eyedropper has options to just select fill color or stroke color, or copy a color to the clipboard.\n\nEnhancements to Switch Layers\nImprovements to switch layer behavior will allow them to work better for frame-by-frame animation. \n\nSwitch Layer Keyframes Match Layer Colors\nIf the children of a switch layer have layer colors assigned, then when those children are active, the corresponding keys in the timeline will have the same color. This makes it easier to see what switch layer is active at what time with a quick glance.\n\nEasy Control Over Switch Layers\nTo change a switch layerÂ¡Â¯s active child, you can now simply Alt+Cmd+right click on it in the workspace. No need to select it in the Layers palette.\n\nImprovements to Brush Spacing\nBrushes sometimes tended to bunch up, especially around pointy corners. The brush spacing is now much more even, including when the curviness of a shape is animated over time.\n\nGraying Inactive Layers\nThis can clear up the visual clutter on the screen when you want to mostly concentrate on a single object.\n\nLayer Shading Enhancement\nLayer shading now has an option to invert the shading, so instead of making a layer look shaded, it now can also look like it has a rim highlight.\n\nMasking Indicator on Layer and Group\nThis makes it easy to see when masking is in effect, as well as what contribution each layer has to a mask.\n\nFollow Path Layer Indicator\nLayers that follow a path get an indicator on top of their icon in the Layers palette.\n\nFreehand Tool Improvements\nYou can now control the amount of tapering at the beginning and end of a stroke.\n\nSpherical Panorama Script\nConvert a spherical panorama image into a 3D sphere that can be viewed from any angle with the camera tools.\n\nFisheye Script\nTurn a fisheye image into a curved, wide-angle surface that can be panned around with the camera tools.\n\nTiling Script\nAllows the user to create repeating texture patterns to fill the workspace (they can be animated as well).\n\nPoser Import\nSupport for Poser 10 and Poser Pro 2014\n\nIncludes many other enhancements not listed here\n\nSystem Requirements\n\n* Windows XP, Vista, 7 or 8 (64-bit OS required for 64-bit installation) \n* 1 GHz Intel Pentium or above \n* 512 MB RAM minimum \n* 1.25 GB (Universal) or 650 MB (32-bit) free hard disk space minimum \n* 16 bit color display or above; 1024x768 resolution minimum \n* CD-ROM (physical version only) \n* Internet connection for Content Paradise \n* WindowsÂ® Internet ExplorerÂ® 8 or newer \n* PoserÂ® 7 or later needed to import Poser scenes\n\nLanguage : English, German, Spanish\n\nHomepage :  &lt;a href=&quot;\nhttp://anime.smithmicro.com/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://anime.smithmicro.com/index.html&lt;/a&gt;","torrent":{"xt":"urn:btih:602618fca7ae1bab7c2b6199104ea01d5d320489","amp;dn":"Smith+Micro+Anime+Studio+Pro+9.5+%28Preactivated%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"602618fca7ae1bab7c2b6199104ea01d5d320489","infoHashBuffer":{"type":"Buffer","data":[96,38,24,252,167,174,27,171,124,43,97,153,16,78,160,29,93,50,4,137]},"announce":[],"urlList":[]}}