{"title":"Udemy - All about Node.js  From the Ground Up and More","uid":11925747,"size":1134976995,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:608eb8faccce6db211b2e549b47b346c5027dd4b&amp;dn=Udemy+-+All+about+Node.js++From+the+Ground+Up+and+More&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"NepsterJay","files":66,"time":1431705123,"description":"About this Course\n\nNodeJS is a platform that allows developers to write server side high performance and networked applications. And that too using good old Javascript. But wait ! Isn't Javascript meant to be used for forms and stuff on web pages ?\n\nWell that was 10 years ago. The world has gone from 'Oops! You've not filled up the form properly !' days to today's modern web apps and social media sites that rely heavily on Javascript. Google Apps, Facebook, Twitter, Google Plus and LinkedIn, being handful examples of this movement. And to think that this quantum leap would not have been possible without Javascript is not an overstatement. Today, when you socialize with your friends on Facebook, or use your Gmail inbox, you're running thousands of lines of code written in Javascript, in your browser.\n\nWith NodeJS, you can take this knowledge back on the server, where usually you would expect to see the likes of PHP, Ruby, ASP.NET etc. But that's only a small portion of the reason why NodeJS is so cool. The fact that you can write full blown networked applications (think chat servers, collaborative tools, real-time data visualization apps) with just a few lines of code is more than reason enough to not only look at NodeJS, but deep dive into it !\n\nBut I know PHP ? Why should I learn NodeJS ? Well, for starters, learning something new never hurts. But most importantly, learning NodeJS is great because :\n\nNode allows you to write highly scalable networked apps deployed on the cloud !\nYou're working at a different level of application design per se with Node and that means that you're not writing an app that sits on top of a stack, you design the stack from the server up. And while that may sound daunting, it really is not and you'll see why.\nYou code in the same language, both on the server and on the front end ! We're all polyglots (we use multiple programming languages and syntax in most of our projects), but managing code in the same language on the back-end and the front-end never hurts and in-fact can be a huge time saver when debugging.\nNodeJS is used by the likes of LinkedIn, Yahoo and Microsoft to name a few. Its pretty new and consequently you gain advantage from the exponentially growing community of NodeJS &amp; Javascript developers and that's great fun, really!\nIf you've been coding in Javascript, you can leverage your existing knowledge and skills and take it to a whole new level!\n\nThe Real Problem\n\nSo, NodeJS sounds pretty interesting so far, but what really hit me in the face when I was learning all about Node was the fact that, with any new platform, framework or technology, you need to take baby steps, all the way through, to making real world examples, if you have to get to the grips of it. And that leads us to why you're here.\n\nIn this course, we'll go from absolute scratch, all the way up to building and deploying full blown NodeJS app on the Cloud !\n\n\nProject Oriented Learning\n\nWith NodeJS, we will build two full blown apps. We will go all the from concept creation, UI/UX design to coding and deploying our app on the cloud.\n\nA. ChatCAT - One of the fun things that you can do with NodeJS is build realtime apps that allow a high number of concurrent users to interact with each other. Examples of this kind include Chat Servers, Gaming Servers, Collaborative Tools etc. We will build a multi-room chat server that allows users to login via Facebook, Create Chatrooms of their choice and Chat in realtime. We will not only create this app, but also deploy it on Heroku and Digital Ocean !\n\nYou will learn all about using Websockets, Structuring your App in an efficient manner, creating and using development &amp; production configurations, Authentication using Facebook, Setting up an App on Facebook, Managing Sessions, Querying &amp; Using a Hosted MongoDB Database, Using Heroku &amp; Digital Ocean's Cloud Services and lots more...\n\nB. PhotoGRID - The second complete app that we will build in this course is a Photo Gallery app which lets users upload images into a gallery with the ability to vote up the images that they like. This NodeJS app lets users upload files, which are then resized to thumbnails on the server and stored in an Amazon S3 Bucket for optimal delivery to the front end interface. The entire app runs on an Amazon EC2 Cloud Server which we will create from scratch and configure for use.\n\nYou will learn about managing file uploads using NodeJS &amp; AJAX, Resizing Images on the Server, Accessing &amp; Storing files in an S3 Bucket, Querying &amp; Using a Hosted MongoDB Database, Using Amazon's Elastic IP Service &amp; Cloudfront distribution, ensuring your NodeJS app runs automatically even if the server is restarted and lots more...\n\nIn the projects above, we leave no stone unturned in terms of execution. This is a complete hands-on course that is not just limited to NodeJS but to the ecosystem that needs attention when a NodeJS app is built and deployed. My intent is hand hold you all the way from writing your first app to deploying production level apps on the cloud.\n\nAnd I'm always available to personally help you out, should you get stuck.\n\nBONUS :: Here's the best thing about this course. The curriculum that you see gets you up and running with NodeJS &amp; Cloud Deployment. However, there is so much more that you can do with NodeJS, which is why I will keep adding new lectures and sections to this course on an ongoing basis. There is so much more that you will get with full lifetime access to lectures and all updates !!\n\nSo, join in the fun !\n\n\nWhat are the requirements?\n\nWorking knowledge of HTML, CSS and Javascript\nBasic Working knowledge of an image editing application such as Adobe Photoshop would also help, but is not necessarily needed.\n\nWhat am I going to get from this course?\n\nOver 64 lectures and 7.5 hours of content!\nBuild High Performance and Scalable Apps using NodeJS\nUse NodeJS Streams to write a Web Server\nUse the Node Package Manager (NPM) for managing dependencies\nUse the Express 4 Framework for building NodeJS Apps\nUse the Hogan Templating Language\nUnderstand MongoDB as a NoSQL Database\nCreate &amp; Use MongoDB Databases using services like MongoLab\nCreate Realtime Apps that use Web Sockets\nUpload &amp; Resize Images using NodeJS\nIntegrate Authentication using Social Media Sites like Facebook\nStructure the NodeJS app into modules\nCreate and Deploy EC2 Cloud Server Instances on Amazon Web Services\nCreate and Use Amazon's S3 Storage Service with NodeJS\nUse Amazon's Cloudfront Service\nUsing Amazon's Elastic IP\nConfigure Security Groups, Ports &amp; Forwarding on Amazon EC2\nDeploy a NodeJS app on the EC2 Instance\nDeploy a NodeJS app on Heroku\nDeploy a NodeJS app on Digital Ocean\nInstall &amp; Deploy NGINX as a Reverse Proxy Server for NodeJS Apps\nConfigure NGINX as a Load Balancer\n\n\nWhat is the target audience?\n\nWeb Designers &amp; Front End Developers who wish to extend their knowledge of Javascript for building high performance network applications.\nSoftware Developers who want to build high performance network applications.\nAbsolute beginners with basic knowledge of HTML, CSS and Javascript, wanting to upgrade to professional Web Development and Building Web Apps.\nPHP, ASP.net, Perl, Java &amp; Ruby coders wanting to leap onto the Node.Js bandwagon.\nAnyone who wishes to get hands-on training with setting up an Amazon EC2 Instance with a host of other services like Cloudfront, Elastic IP and S3\nAnyone who wishes to get hands-on training with deploying a NodeJS app on the cloud\nComputer Engineering students\nTech Entrepreneurs who want to get their hands down and dirty with Web Coding &amp; App Development.\nAnyone who wishes to stay on the forefront of technology!","torrent":{"xt":"urn:btih:608eb8faccce6db211b2e549b47b346c5027dd4b","amp;dn":"Udemy+-+All+about+Node.js++From+the+Ground+Up+and+More","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"608eb8faccce6db211b2e549b47b346c5027dd4b","infoHashBuffer":{"type":"Buffer","data":[96,142,184,250,204,206,109,178,17,178,229,73,180,123,52,108,80,39,221,75]},"announce":[],"urlList":[]}}