{"title":"Front Mission 5 [NTSC-J] (English Patched), Ps2","uid":5498283,"size":1965169104,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:60a281138810c388043e71a39bcb7e2484caa369&amp;dn=Front+Mission+5+%5BNTSC-J%5D+%28English+Patched%29%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"Big_dude","files":-1,"time":1271396642,"description":"Front Mission 5 - Scars of War for the Ps2                          Rel. 12/29/2005\n\n\nFormat:        DVD5 NTSC-J (Eng. Patched)\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        RPG, Turn-Based\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes: This is Front Mission 5 pre-patched with the latest english Beta \n               (Final) patch from The guys at frontmission.info. The beginning \n               fmv isn't translated but I left a translated version video and\n               link in the download. Pretty much everything is in english or with \n               english subtitles. It took them 2 years of hard work to accomplish \n               This. Now you can enjoy this already patched and ready to burn.\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nFront Mission 5 - Scars of the War is the fifth in Square's successful Front Mission strategy/rpg series. It brings the player back to a gritty futuristic world in which conflicts are waged between 5 world powers: the U.S.N., O.C.U., E.C., O.A.C., and the Republic of Zaftra. Such conflicts are waged with the wanzer, Front Mission-speak for mecha.\n\nGameplay-wise, the game is a true return to Front Mission 2 roots while incorporating the best features from Front Mission 1, 3, and 4. The player takes part in turn-based missions, which pit their group of wanzers against enemy forces. Old features that have returned include the ability to upgrade parts and mission branching. New features to Front Mission 5 include friendly fire and the ability to recruit new pilots.\n\nUnlike the previous games which were fairly standalone, Front Mission 5 covers the time period from 2070 to 2121. In effect, it goes through conflicts seen in the previous games as the years pass by. Through the eyes of U.S.N. soldier/officer Walter Feng, the player experiences his story as he deals with the aforementioned conflicts. With the passing of time, he becomes witness to hidden truths and accounts. Eventually, Feng is drawn to the on-going war on terrorism and begins to search for the truth.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:60a281138810c388043e71a39bcb7e2484caa369","amp;dn":"Front+Mission+5+%5BNTSC-J%5D+%28English+Patched%29%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60a281138810c388043e71a39bcb7e2484caa369","infoHashBuffer":{"type":"Buffer","data":[96,162,129,19,136,16,195,136,4,62,113,163,155,203,126,36,132,202,163,105]},"announce":[],"urlList":[]}}