{"title":"Encyclopedia of the Human Brain - 1st Ed (4 Vol Set) Gooner","uid":12200336,"size":88077207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:613f1442f7b0e186f15690e61caf4f251e04ceaa&amp;dn=Encyclopedia+of+the+Human+Brain+-+1st+Ed+%284+Vol+Set%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1438815550,"description":"\n\n[b]Publisher: Academic Press; 1 edition (July 10, 2002)\nLanguage: English\nISBN-10: 0122272102\nISBN-13: 978-0122272103\n\nIn the past decade, enormous strides have been made in understanding the human brain. The advent of sophisticated new imaging techniques (e.g. PET, MRI, MEG, etc.) and new behavioral testing procedures have revolutionized our understanding of the brain, and we now know more about the anatomy, functions, and development of this organ than ever before. However, much of this knowledge is scattered across scientific journals and books in a diverse group of specialties: psychology, neuroscience, medicine, etc. The Encyclopedia of the Human Brain places all information in a single source and contains clearly written summaries on what is known of the human brain.\n\nCovering anatomy, physiology, neuropsychology, clinical neurology, neuropharmacology, evolutionary biology, genetics, and behavioral science, this four-volume encyclopedia contains over 200 peer reviewed signed articles from experts around the world. The Encyclopedia articles range in size from 5-30 printed pages each, and contain a definition paragraph, glossary, outline, and suggested readings, in addition to the body of the article. Lavishly illustrated, the Encyclopedia includes over 1000 figures, many in full color. Managing both breadth and depth, the Encyclopedia is a must-have reference work for life science libraries and researchers investigating the human brain.[/b][/center]","torrent":{"xt":"urn:btih:613f1442f7b0e186f15690e61caf4f251e04ceaa","amp;dn":"Encyclopedia+of+the+Human+Brain+-+1st+Ed+%284+Vol+Set%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"613f1442f7b0e186f15690e61caf4f251e04ceaa","infoHashBuffer":{"type":"Buffer","data":[97,63,20,66,247,176,225,134,241,86,144,230,28,175,79,37,30,4,206,170]},"announce":[],"urlList":[]}}