{"title":"Spices: A Global History by Fred Czarra","uid":15445643,"size":9496969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:619f556c6ea0a87b677f6c1e318d50a6b10a3d15&amp;dn=Spices%3A+A+Global+History+by+Fred+Czarra&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Replicant70","files":1,"time":1469879521,"description":"In Spices Fred Czarra explores a wide range of spice fact, fable and legend: from giant birds building cinnamon nests, to the trade routes of the ancient world, to the early modern encounters between the English, Portugese and Dutch that resulted in the first global war. In this history of spices he shows that the spice trade opened up the first era of globalization, where people and spices mixed in cross-cultural exchanges: and that this involved the enslavement of many to work on spice plantations, and even led to the first global war.\r\n\r\nFocusing on the five premier spices – black pepper, cinnamon, nutmeg, cloves and the chilli pepper – and including the stories of many others, Czarra’s entertaining account tracks spices’ influence as they travelled around the world. Chillies, for example, migrated west from the Americas with the aid of European sailors; spreading rapidly into the Philippines and thence to India, China, Korea and Japan, the new spice was incorporated quickly into local cuisines. From India, the chilli was taken through Central Asia and Turkey to Hungary, where it became the national spice in the form of paprika.\r\nPacked with colourful illustrations and incidents from history, Spices is a zesty, readable portrait of this essential aspect of culinary history.\r\n\r\nSpices: A Global History by Fred Czarra\r\nEnglish | 2009 | 123 Pages | ePUB | 9.10 MB","torrent":{"xt":"urn:btih:619f556c6ea0a87b677f6c1e318d50a6b10a3d15","amp;dn":"Spices%3A+A+Global+History+by+Fred+Czarra","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"619f556c6ea0a87b677f6c1e318d50a6b10a3d15","infoHashBuffer":{"type":"Buffer","data":[97,159,85,108,110,160,168,123,103,127,108,30,49,141,80,166,177,10,61,21]},"announce":[],"urlList":[]}}