{"title":"Kampfgruppe Peiper: The Race for the Meuse","uid":15848248,"size":12916529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61cf08ac7110c7e411cde0f0c97bed8158d7a97f&amp;dn=Kampfgruppe+Peiper%3A+The+Race+for+the+Meuse&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"marty14","files":1,"time":1474131117,"description":"Kampfgruppe Peiper: The Race for the Meuse - David Cooke, Wayne Evans [epub]\r\n\r\nOn 16 December 1944 Hitler's last great offensive commenced, pushing through the difficult terrain of the Ardennes in Belgium. Its objectives were the Meuse bridges and, beyond them, Antwerp. Hitler's aim was to cut off the northern British and American armies and force them to surrender or retreat. \r\n\r\nAt the forefront of the German assault was Kampfgruppe Peiper of the SS Leibstandarte Adolf Hitler Division. It was the most powerful force in the German order of battle. Traveling along roads hardly suitable for cars, let alone Tiger tanks, the kampfgruppe had to cross numerous streams and rivers to reach its objectives. It was delayed by a handful of American combat engineers who blew up bridges, then it was brought to a halt by American reinforcements. As the tide turned, the kampfgruppe fought for its life, holding out for several days in a desperate rearguard action against increasing odds. \r\n\r\nDavid Cooke and Wayne Evans use contemporary accounts and a wealth of maps and illustrations to tell the story of Kampfgruppe Peiper in unprecedented detail","torrent":{"xt":"urn:btih:61cf08ac7110c7e411cde0f0c97bed8158d7a97f","amp;dn":"Kampfgruppe+Peiper%3A+The+Race+for+the+Meuse","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61cf08ac7110c7e411cde0f0c97bed8158d7a97f","infoHashBuffer":{"type":"Buffer","data":[97,207,8,172,113,16,199,228,17,205,224,240,201,123,237,129,88,215,169,127]},"announce":[],"urlList":[]}}