{"title":"WM.Capture.v3.1.HAPPY.NEW.YEAR-TE","uid":4618697,"size":7314280,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6263142cbc7288db88cc77990ffd47e603246cde&amp;dn=WM.Capture.v3.1.HAPPY.NEW.YEAR-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Murlok","files":-1,"time":1230940453,"description":"WM Capture is the only PC video recording program ever made that captures video from any online source with perfect quality - if you can watch it you can save it. It records video from ANY Web site, regardless of format. It even records DVD's playing on your PC. And because it does not circumvent or hack DRM (Digital Rights Management) or any copy protection technology, it's 100% legal world-wide.\n\nAmazingly Perfect Picture Quality\n\nUnlike other screen video capture programs which render choppy videos, WM Capture uses a unique high speed capture technology to create a near perfect reproduction of what you see on screen, playable as a Windows Media Video file. Or, you can use our proprietary MPEG-2 codec for even more outstanding picture quality.\n\nOther screen capture programs cannot process video data fast enough to make acceptable videos. WM Capture's special design uses the most advanced high-speed video processing technology, and the results are amazing. Even the toughest video types like full motion sports play back perfectly.\n\nSee for Yourself! The videos below were captured from a popular TV show's online episode player, and a Video-on-demand (VOD) subscription service as WMV (Windows Media Video) files. We think you'll agree they look great. Just click them to play.\n\n\nSuper-Easy to Use\n\nIt's easy to capture videos by marking an area to record. Just click Get Window, and then move your mouse over the region you'd like to record, and it's highlighted automatically. You can also mark a recording region manually to clip or extend the capture area.\n\nOnce you have a rectangle marked, just click the Record button, and play a video to capture it. It's that simple! \n\nEnjoy","torrent":{"xt":"urn:btih:6263142cbc7288db88cc77990ffd47e603246cde","amp;dn":"WM.Capture.v3.1.HAPPY.NEW.YEAR-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6263142cbc7288db88cc77990ffd47e603246cde","infoHashBuffer":{"type":"Buffer","data":[98,99,20,44,188,114,136,219,136,204,119,153,15,253,71,230,3,36,108,222]},"announce":[],"urlList":[]}}