{"title":"The Holy Mountain (2007) 720p BrRip x264 - CLOWNSEC (PhreakyFlix","uid":9150384,"size":3132606614,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:62e8a103c66f79e8862d8e813cb2118b952f0533&amp;dn=The+Holy+Mountain+%282007%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"clownsec","files":-1,"time":1383681878,"description":"The Holy Mountain (2007) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\nAlejandro Jodorowsky stars as The Alchemist in Holy Mountain--apt self-casting in this psychedelic masterpiece about Jesus searching for enlightenment. Fusing together many of his previously investigated themes, Holy Mountain catalogues a religious icon's surreal journey through magical realms that both mirror reality and verge on the psychotic Financed entirely by John Lennon and Yoko Ono, Holy Mountain is a more associative, more abstract, and better version of El Topo, which also features a protagonist searching for his soul. In Holy Mountain, Jesus encounters seven magicians who represent each planet, who then converge under the tutelage of The Alchemist to prepare for their life-threatening climb up a sacred hill. Completely original in its blend of Mexican magical surrealism and peace-inducing, humorous commentary on Latin American colonialism and the idiocy of war, Holy Mountain is one of the most outlandish examples of avant-garde filmmaking. Wonderfully colorful sets, zany characters in costumes straight out of the subconscious, and an inspired soundtrack, reinforce this absurdist statement about death and rebirth. Though Jodorowsky purportedly deprived himself of sleep to study Zen as research for the film, this is no flowery hippie movie. Carcasses, skinned animals, and even a scene showing frogs and toads dressed as Aztecs and Conquistators who fight until the bloody death, will make a viewer's skin crawl. After being mesmerized by such a powerful vision, the ending, in which Jodorowsky reminds us that &quot;reality awaits,&quot; is the most bizarre part. --Trinie Dalton\n\nBROUGHT TO YOU BY * CLOWNSEC * HONK *","torrent":{"xt":"urn:btih:62e8a103c66f79e8862d8e813cb2118b952f0533","amp;dn":"The+Holy+Mountain+%282007%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62e8a103c66f79e8862d8e813cb2118b952f0533","infoHashBuffer":{"type":"Buffer","data":[98,232,161,3,198,111,121,232,134,45,142,129,60,178,17,139,149,47,5,51]},"announce":[],"urlList":[]}}