{"title":"System Shock 2 GOG","uid":11741251,"size":739566496,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6303bde415c218e910118a567542737b44b3f8bc&amp;dn=System+Shock+2+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"pacolovac","files":79,"time":1425834976,"description":"About the game:\n================\n\nTriOptimum wishes you a safe journey aboard the Von Braun, the first craft in the history of mankind capable of faster-than-light travel. TriOptimum Corporation: we give you the stars!\n\nThe second--and best!--game in the series stands all on its own as a masterpiece of gaming history. The starship Von Braun took a giant leap for mankind as it made its first interstellar journey. The mission was going as planned until a lone distress call from the Tau Ceti V sector was picked up. An away team was sent on a rescue mission, but once it arrived at its destination, there was no sign of any humans and the source of the signal remained unclear. They didn't realize something crucial, though: they brought something back with them when they returned. Now, you--a member of the ship's security team--awake from cryostasis to the sounds of screams of pain and horror as everything falls apart. The state-of-the-art spaceship becomes a deathtrap, and the only hope you have is the contemptuous whisper of a voice guiding you through the dark corridors, leading you towards the ominous secrets that lurk in the shadows.\nA game like this is a masterpiece; you must experience it firsthand. System Shockâ„¢ 2 arguably offers the most intense storytelling in the history of computer games. It perfectly splices Sci-Fi with survival horror, FPS gameplay with character stats, upgrades, and inventory system of the role-playing genre, fast paced action with chilling terror. \n\n-&quot;10 out of 10&quot; - Computer Games Magazine\n-&quot;An advanced, progressive spin on first-person gaming&quot; - Edge Online\n-&quot;One of the 100 best games of all time&quot; - Empire Online\n-&quot;95%&quot; - PC Gamer\n-&quot;Greatest Games of all Times&quot; list - Gamespot\n-&quot;Top 50 Greatest Games of All Time&quot; list - Gamespy\n\n\nFeatures:\n===========\n\nÂ¤ Choose from 3 specialized branches of the military to utilize unique skills, weaponry, and paranormal psionic powers. \nÂ¤ Upgrade and enhance your skills to improve hacking, weapon proficiency, and psionic abilities. \nÂ¤ Discover cryptic audio logs, encounter ghostly apparitions and conduct research to give you the advantage in combat and unlock exotic weapons and items. \nÂ¤ Play with up to three friends in multiplayer co-op (co-op works in Windows only)\n\n\nVersion: \n==========\n\nv2.42 or GOG setup v2.1.1.20 - current official \nand patch 2.43 for GOG PC verison from August 21, 2014 - submitted to GOG team, but not yet officially released\n\n\nVersion changes:\n==================\n\nPatch 2.43 (for PC):\n- updated to NewDark 2.43 \n- included one folder to load mods, to mirror the steam version \n\nInstructions:1. It's a GOG version, just launch setup 2.1.0.19 and install\n2. Patch with official update 2.1.1.20 - launch and install\n\n3. Update to 2.43 (hopefully soon official update) - extract to your SS2 folder with compression software (like 7-Zip - link below) overwrite if necessary.\n(will reset your cam_ext.cfg settings, so you might want to back that file up before patching). this is an update for those running an unmodified version of the GOG build - do not apply if you have used ss2tool.\nEnjoy &amp; Seed\n\n\nSystem requirements:\n======================\n\nMinimum:\n1 GHz P III class cpu\n64mb DX9 graphics card with a fully DX9 support\n512 GB RAM \nWin 2000\nDirectX 9\n2GB hard disk space\n\nRecommended (for full HD resolution, eyecandy enabled):\n2 GHz modern CPU\n512mb DX10+ graphics card with 128bit (or more) memory bus \n2GB RAM\nWin 7 or newer OS\n\n\nTips and Links:\n=================\n\nTweak your settings by editing &quot;cam_ext.cfg&quot; in your installation directory: enable enhancements for modern systems, \nnot just AA, AF, HUD scaling, FOV, limit fps, 32-bit color, but many hardcore ones as well for modern systems!\n\nGOG Modding Guide http://www.gog.com/news/mod_spotlight_system_shock_2\n\nNever modded System Shock 2? Newbie modding guide! https://www.systemshock.org/index.php?topic=4447.0\n\nGame info at System Shock 2 Wiki http://www.gogwiki.com/wiki/System_Shock_2\n\nFix your System Shock 2 errors at System Shock 2 PCGW\n\n\nIf you enjoyed the game then share with others by seeding! Or better yet \nsupport game development and BUY IT!\n\nGame co-developed by\nIrrational Games and Looking Glass Studios\nPublished by EA then for GOG and Steam published by Night Dive Studios","torrent":{"xt":"urn:btih:6303bde415c218e910118a567542737b44b3f8bc","amp;dn":"System+Shock+2+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6303bde415c218e910118a567542737b44b3f8bc","infoHashBuffer":{"type":"Buffer","data":[99,3,189,228,21,194,24,233,16,17,138,86,117,66,115,123,68,179,248,188]},"announce":[],"urlList":[]}}