{"title":"The World Is Flat by Thomas L. Friedman - Traitor [ePub]","uid":9551566,"size":535518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6336d39bae006a10cad26b1e53bceb481bbd070f&amp;dn=The+World+Is+Flat+by+Thomas+L.+Friedman+-+Traitor+%5BePub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Xetron","files":1,"time":1391275814,"description":"Book Description\nRelease date: April 5, 2005\nWhen scholars write the history of the world twenty years from now, and they come to the chapter &quot;Y2K to March 2004,&quot; what will they say was the most crucial development? The attacks on the World Trade Center on 9/11 and the Iraq war? Or the convergence of technology and events that allowed India, China, and so many other countries to become part of the global supply chain for services and manufacturing, creating an explosion of wealth in the middle classes of the world's two biggest nations, giving them a huge new stake in the success of globalization? And with this &quot;flattening&quot; of the globe, which requires us to run faster in order to stay in place, has the world gotten too small and too fast for human beings and their political systems to adjust in a stable manner?\n\nIn this brilliant new book, the award-winning New York Times columnist Thomas Friedman demystifies the brave new world for readers, allowing them to make sense of the often bewildering global scene unfolding before their eyes. With his inimitable ability to translate complex foreign policy and economic issues, Friedman explains how the flattening of the world happened at the dawn of the twenty-first century; what it means to countries, companies, communities, and individuals; and how governments and societies can, and must, adapt. The World Is Flat is the timely and essential update on globalization, its successes and discontents, powerfully illuminated by one of our most respected journalists.","torrent":{"xt":"urn:btih:6336d39bae006a10cad26b1e53bceb481bbd070f","amp;dn":"The+World+Is+Flat+by+Thomas+L.+Friedman+-+Traitor+%5BePub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6336d39bae006a10cad26b1e53bceb481bbd070f","infoHashBuffer":{"type":"Buffer","data":[99,54,211,155,174,0,106,16,202,210,107,30,83,188,235,72,27,189,7,15]},"announce":[],"urlList":[]}}