{"title":"My Screen Recorder Pro 2.3","uid":3596214,"size":9872707,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64f6f0af0f2a063302f0668fe2de86596b614f3e&amp;dn=My+Screen+Recorder+Pro+2.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"saimonn","files":1,"time":1168817134,"description":" &lt;a href=&quot;http://www.deskshare.com/msrpro.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.deskshare.com/msrpro.aspx&lt;/a&gt;\n\n\nProfessional Screen Recording Software that captures your desktop activity and makes AVI, WMV and Flash presentations.\n\n\n \tMy Screen Recorder Pro is a screen recording software that lets you record your desktop screen activity for later playback. Any application that runs on your Windows PC can be recorded including applications with video and audio. You can create presentations from the screen recordings by adding your own audio narration. You can demonstrate how to use a web site or explain a product concept.\t \n \t \n \tMy Screen Recorder Pro provides the ability to output your screen recordings to AVI, Flash or Windows Media (WMV) format. Screen recordings, done in AVI, are compressed using standard compressors which make distribution simple. Both WMV and Flash make very small recording files, making them perfect for distribution from a web site. You can even make WMV files that are designed to be played from a streaming server and presented to large audiences over the Internet.\t \n \t \n \tYou can create self playing executables from your screen recordings. The self playing executables have been tested to playback on all Windows operating systems, making them excellent for demo distribution on CD or DVD. The executable includes a media player specifically designed for playing screen recordings. The generated executable has many playback options and allows you to combine multiple screen recordings into one package.\t \n \t \n \tNow you can easily make tutorials and presentations by recording your desktop activity. My Screen Recorder Pro is easy to use and provides high quality playback with many distribution options.","torrent":{"xt":"urn:btih:64f6f0af0f2a063302f0668fe2de86596b614f3e","amp;dn":"My+Screen+Recorder+Pro+2.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f6f0af0f2a063302f0668fe2de86596b614f3e","infoHashBuffer":{"type":"Buffer","data":[100,246,240,175,15,42,6,51,2,240,102,143,226,222,134,89,107,97,79,62]},"announce":[],"urlList":[]}}