{"title":"Gothic Architecture (Braziller Art Ebook).pdf","uid":12305627,"size":14251633,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:652bd1e7e5e255df4eab321f02c0b7c21e42a609&amp;dn=Gothic+Architecture+%28Braziller+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"STBGD","files":1,"time":1440792744,"description":"Braziller | 1961 | Pdf | Eng | 125p | ISBN10: 0807601578 | 13.5 MB\n\nPresented here is a concise analysis of Gothic architecture, a style that dominated the architecture of Western Europe for nearly four hundred years. Originating in the twelfth century in the Ile-de-France, Gothic architecture rapidly reached its full expression in an ever-increasing emphasis upon height and spaciousness, upon light and texture, and upon the integration of the physical needs of the church with its iconographic and symbolic program. The Gothic cathedral embodied the pervasive medieval principle of a God that exists and gives significance to all things. In its design, space, light, and structure were manipulated to create an impact of visionary proportions, whereby man might realize his relationship to the infinite and the eternal. With the growth of trade and industry, improved means of communication, the rise of intellectual centers, and the expansion and consolidation of the State, the Gothic style quickly spread to the far corners of the Western world. Although the influences of the French building schemes are easily discernible in the developments which occurred in other areas of Europe, in each country there emerged a particular expression which reflected its own unique traditions","torrent":{"xt":"urn:btih:652bd1e7e5e255df4eab321f02c0b7c21e42a609","amp;dn":"Gothic+Architecture+%28Braziller+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"652bd1e7e5e255df4eab321f02c0b7c21e42a609","infoHashBuffer":{"type":"Buffer","data":[101,43,209,231,229,226,85,223,78,171,50,31,2,192,183,194,30,66,166,9]},"announce":[],"urlList":[]}}