{"title":"Derren Brown eBook Collection + RARE Volumes","uid":4848296,"size":41796779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6626317eeafce3d7eb9a654128401225b316b6ed&amp;dn=Derren+Brown+eBook+Collection+%2B+RARE+Volumes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Mr.Clockwork","files":5,"time":1239774504,"description":"-&quot;Tricks of The Mind&quot;\n\n     Published by Channel 4 Books on 9th November 2006, Ã‚Â£18.99\n\n     Best known for his TV show Tricks of the Mind and one-off 'specials' including his infamous Russian Roulette stunt, the much talked about Seance and most recently The Heist, in which he persuaded law-abiding citizens to participate in what they believed to be a genuine armed robbery, Brown now unveils, for the first time, the secrets which lie behind the magician's craft.\n\n     By lifting the lid on the deepest darkest secrets of magic, Brown explores the limits of what can be achieved by the human mind...\n\n    &quot;Magic isn't about fakes and switches and dropping coins into your lap. It's about entering into a relationship with a person whereby you can lead him, economically and deftly, to experience an event as magical&quot;\n\n                                                 -Derren Brown\n\n   Told with humour and honesty, TRICKS OF THE MIND reveals:\n\n    1. the techniques of several mystifying magic tricks\n    2. Brown's personal views on religion and atheism.\n    3. the mix of honesty and trickery that magic demands\n    4. what goes into his ground-breaking television work\n    5. the truth behind practices such as the Ouija Board\n    6. the paranormal industry, exposes a few charlatans and looks at why some of us feel the need to believe in it in the first place...\n    7. memory techniques, hypnosis and Neurolinguistic Programming\n    8. how to read clues and spot lies in people's behaviour\n\n    With autobiographical stories from Brown's own experiences, TRICKS OF THE MIND is a mind-expanding book and an insight into the &quot;devil-bearded mind-fiddler&quot; (Zoo) himself.\n\n-&quot;Pure Effect&quot;\n\nDerren Brown, the most radical and original new thinker in the world of mentalism, will take you from excellent close-up magic to the most powerful mind-reading you have ever seen. With flamboyant wit, Derren explains the secrets and techniques that he uses to amaze the experts, drawing from hypnotic skills and breathtaking psychological artistry. This is brand new mindreading without compromise; no use of billets, envelopes or nailwriters will be found within these pages. This is a book for the serious thinker who would normally disregard 99% of a magic book's contents.\n\nand other RARE volumes by Derren Brown\n\n\nPlease SEED","torrent":{"xt":"urn:btih:6626317eeafce3d7eb9a654128401225b316b6ed","amp;dn":"Derren+Brown+eBook+Collection+%2B+RARE+Volumes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6626317eeafce3d7eb9a654128401225b316b6ed","infoHashBuffer":{"type":"Buffer","data":[102,38,49,126,234,252,227,215,235,154,101,65,40,64,18,37,179,22,182,237]},"announce":[],"urlList":[]}}