{"title":"Ableton Live 9 Suite 9.0.2 (Win 32 bit-io) [ChingLiu]","uid":8346936,"size":725872095,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:66b0dfb69ddc1781448cc118f51d8f9f93dad50d&amp;dn=Ableton+Live+9+Suite+9.0.2+%28Win+32+bit-io%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"Ching_Liu","files":-1,"time":1365234802,"description":"9.0.2 Release Notes \n\nImprovements and feature changes:\n- The &quot;Group to Drum Rack&quot; option is available again in the context menu of all instrument devices, provided that the device is not yet grouped into a rack and is not a drum rack device itself.\n- Improved browser performance when clicking on the &quot;Drums&quot; label.\n- Improved browser performance when clicking on labels while Search is active.\n- Improved browser performance when hot-swapping presets in the browser's &quot;Places&quot; section.\n- When Search is activated, the selection color in the browser's content pane is now in line with the color scheme of the browser's sidebar and the frame around the search field.\n- Changed the factory default for dropping samples on a Drum Rack. It now activates the &quot;Retrigger&quot; mode in Simpler by default.\n- Removed the gray shade which would cover the Arrangement View's scrub area when the global Back-to-Arrangement button was on, because the controls underneath (e.g. the loop brace, locators, etc.) would look inactive although being active.\n- Simplified message boxes at startup when using the Trial version offline.\n- Updated several lessons, info texts and translations.\n\nBugfixes:\n- MIDI Mapping for Song Tempo Fine Tune would not work correctly.\n- When recording automation into a clip, the automation would not latch during the first iteration, but jump back to the last value. \n- Clip automation for VST and AU plug-in parameters could get lost after importing a track from the browser into a new Live set.\n- When recording clips from Session into Arrangement View, the recorded clip could have an incorrect loop length if the Arrangement's loop was enabled.\n- MIDI would not be recorded into Session clips when launching a scene after shift-clicking the Session Record Button.\n- Under certain conditions, Time Signature Changes would not be recorded correctly into the Arrangement.\n- Under certain conditions, the white background that indicates the active clip region would not be shown for unwarped audio clips in the Arrangement View.\n- The numbers in the Arrangement View's beat time ruler could disappear when zooming in.\n- When duplicating MIDI notes in a clip, the duplicated notes would sometimes scroll out of view.\n- The browser's content pane could scroll to a wrong position when enabling hot-swap, so that the selected preset would be out of view.\n- The velocity setting in Simpler and Sampler wasn't correctly restored from 'Slice-To-New-MIDI-Track' presets.\n- The file manager would sometimes not replace missing samples even though matching candidates were found.\n- (64-bit Windows) Exporting video at 48 kHz would not work.\n- (64-bit Mac) The video window could go black after toggling full-screen mode on and off.\n- (64-bit Mac) The content in the video window would sometimes not resize correctly when jumping in the playback position.\n- Max for Live: the API would return a list instead a list of symbols in certain cases, e.g. when querying a track's input / output routing targets, it would return &quot;Sends&quot; &quot;Only&quot;, instead of &quot;Sends Only&quot;.\n- Live could crash when trying to preview a multi-selection of files in the browser via Shift+Enter.\n- Live could crash during authorization when successively clicking the &quot;Authorize with Ableton.com&quot; button.\n- Fixed a crash which could occur when importing certain Live sets by dragging them to the scene drop area.\n- Feature-limited versions (e.g. Live Intro or Lite) could crash when opening certain context menus.\n\nSystem requirements\n\n- Windows XP (64 bit), Windows Vista (64 bit), Windows 7 (64 bit) or Windows 8 (32 bit)\n- Multicore processor\n- 2 GB RAM\n-1024x768 display\n-3GB free disk space\n\nLanguages : English, French, German, Italian, Japanese, Spanish\n\nHomepage :  &lt;a href=&quot;\nhttps://www.ableton.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.ableton.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:66b0dfb69ddc1781448cc118f51d8f9f93dad50d","amp;dn":"Ableton+Live+9+Suite+9.0.2+%28Win+32+bit-io%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66b0dfb69ddc1781448cc118f51d8f9f93dad50d","infoHashBuffer":{"type":"Buffer","data":[102,176,223,182,157,220,23,129,68,140,193,24,245,29,143,159,147,218,213,13]},"announce":[],"urlList":[]}}