{"title":"My.Kitchen.Rules.s06e01.WS.HDTV.x264.BF1.mkv","uid":11676230,"size":922134618,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:66becfa0e1ca9cfe531ce3056c82f92b8ae05364&amp;dn=My.Kitchen.Rules.s06e01.WS.HDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"bigfish5","files":1,"time":1422886870,"description":"My Kitchen Rules Australia Series 6 Episode 1\n\nManu Feildel and Pete Evans return to host and judge the ultimate home-cooking battle! But this time around, a twist that will change the rules and raise the stakes! QLD's Jac and Shaz are cooking the first meal for the series. Will these mums from the country be able to wow their competitors and our judges? Or will the pressure take its toll?\n\n Jac and Shaz Queensland\nWe just have fun together. We complement each other well. \nJac and Shaz might be from the smallest town of all the contestants, but they have some of the biggest personalities.\n&quot;You'll often hear Shaz before you see her,&quot; says cousin Jac, who owns the local fashion boutique.\nAdds court house employee Shaz: &quot;I don't think we're typical mumsy mums you know. We like to party. We're the party mums.&quot;\nBetween them they've left six kids, two husbands, two dogs, a cat, a pig and a goldfish at home in the mining town of Mt Isa to travel the country and be wined and dined.\nDespite the isolation of their home town, Jac, 42 and Shaz, 43, have been creative in getting around any disadvantages they might have compared to the bigger city folk.\nThey have just two fine dining restaurants in town, so a lot of their inspiration comes from cooking shows, including My Kitchen Rules.\n&quot;We love the show,&quot; admits Jac. &quot;If I'm watching the show I often want to try the recipes the next night. I'll think, 'Let's give that a go.'&quot;\nWith their shopping limited to the supermarkets, Shaz says they steer clear of super exotic ingredients.\n&quot;What it means is we've learnt not to go down that super fancy modern or crazy path. There's no point, you're not going to get that stuff.&quot;\nBut that doesn't mean they don't cross a lot of cultures in the kitchen, with everything from Italian to Lebanese, Indian and Thai on the menu at their homes.\n&quot;We'll cook anything really; we're pretty eclectic,&quot; says Shaz.\nDespite their close friendship, they admit most of their time in the kitchen is spent alone at home and they have little experience cooking together.\n&quot;If we were having a sleepover we'd cook stuff when we were kids,&quot; explains Shaz. &quot;But as family women we're in our own homes cooking and bringing food to gatherings. Our families know we're good cooks. If there's something on and everyone takes a plate they know Jac and Shaz's food is going to stand out.&quot;\nBut they already instinctively know who will do what when they team up for their instant restaurant.\n&quot;I'm bossy,&quot; admits Shaz. &quot;I'm the boss, but that doesn't make me the head chef. It just makes me bossy.&quot;\n&quot;I don't mind, I need directions sometimes,&quot; says Jac. &quot;We just have fun together and I love how Shaz does all the talking because I'm not a great talker. We complement each other well.&quot;\nThey believe their first two courses will be best, with neither really having a sweet tooth. Although Shaz does dabble in desserts because &quot;they look pretty&quot;","torrent":{"xt":"urn:btih:66becfa0e1ca9cfe531ce3056c82f92b8ae05364","amp;dn":"My.Kitchen.Rules.s06e01.WS.HDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66becfa0e1ca9cfe531ce3056c82f92b8ae05364","infoHashBuffer":{"type":"Buffer","data":[102,190,207,160,225,202,156,254,83,28,227,5,108,130,249,43,138,224,83,100]},"announce":[],"urlList":[]}}