{"title":"Sons of Wichita - Daniel Schulman - Audible Audiobook MP3 64k","uid":10198234,"size":354647827,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:67c44f7984c9fa0e12184acd79130b31826def49&amp;dn=Sons+of+Wichita+-+Daniel+Schulman+-+Audible+Audiobook+MP3+64k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1400724691,"description":"MP3 CBR 64k Joint Stereo.\nThis will work best with dedicated audiobook reader apps.\n\nSons of Wichita: How the Koch Brothers Became America's Most Powerful and Private Dynasty\n\nWritten by: Daniel Schulman\nNarrated by: Allen O'Reilly\nLength: 12 hrs and 18 mins\nFormat: Unabridged\nRelease Date:05-20-14\nProgram Type: Audiobook\n\nLike the Rockefellers and the Kennedys, the Kochs are one of the most influential dynasties of the modern age, but they have never been the subject of a major biography... until now.\n\nNot long after the death of his father, Charles Koch, then in his early 30s, discovered a letter the family patriarch had written to his sons. &quot;You will receive what now seems to be a large sum of money,&quot; Fred Koch cautioned. &quot;It may either be a blessing or a curse.&quot;\n\nFred's legacy would become a blessing and a curse to his four sons - Frederick, Charles, and fraternal twins David and Bill - who in the ensuing decades fought bitterly over their birthright, the oil and cattle-ranching empire their father left behind in 1967. Against a backdrop of scorched-earth legal skirmishes, Charles and David built Koch Industries into one of the largest private corporations in the world - bigger than Boeing and Disney - and they rose to become two of the wealthiest men on the planet.\n\nInfluenced by the sentiments of their father, who was present at the birth of the John Birch Society, Charles and David have spent decades trying to remake the American political landscape and mainline their libertarian views into the national bloodstream. They now control a machine that is a center of gravity within the Republican Party. To their supporters, they are liberating America from the scourge of Big Government. To their detractors, they are political &quot;contract killers&quot;, as David Axelrod, President Barack Obama's chief strategist, put it during the 2012 campaign.\n\nBill, meanwhile, built a multi-billion dollar energy empire all his own, and earned notoriety as an America's Cup-winning yachtsman, a flamboyant playboy, and as a litigious collector of fine wine and Western memorabilia. Frederick lived an intensely private life as an arts patron, refurbishing a series of historic homes and estates.\n\nSons of Wichita traces the complicated lives and legacies of these four tycoons, as well as their business, social, and political ambitions. No matter where you fall on the ideological spectrum, the Kochs are one of the most influential dynasties of our era, but so little is publicly known about this family, their origins, how they make their money, and how they live their lives. Based on hundreds of interviews with friends, relatives, business associates, and many others, Sons of Wichita is the first major biography about this wealthy and powerful family - warts and all.","torrent":{"xt":"urn:btih:67c44f7984c9fa0e12184acd79130b31826def49","amp;dn":"Sons+of+Wichita+-+Daniel+Schulman+-+Audible+Audiobook+MP3+64k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67c44f7984c9fa0e12184acd79130b31826def49","infoHashBuffer":{"type":"Buffer","data":[103,196,79,121,132,201,250,14,18,24,74,205,121,19,11,49,130,109,239,73]},"announce":[],"urlList":[]}}