{"title":"The Burn with Jeff Ross (season 1 and 2) (HDTV)","uid":9008416,"size":1519932076,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:681c4fdd2943a1a0a8b527866a02ce2a219d7ac0&amp;dn=The+Burn+with+Jeff+Ross+%28season+1+and+2%29+%28HDTV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"eterna111","files":-1,"time":1381080436,"description":"The Burn with Jeff Ross is a comedy panel show hosted by comedian Jeff Ross on Comedy Central. The program features Ross roasting a wide variety of targets, along with guest appearances by fellow comedians who make up a panel of roasters. \n\n\nThese are the scene HDTV rips of season 1 and 2, broadcast 2012/2013:\nThe.Burn.S01E01.HDTV.x264-KILLERS.mp4\nThe.Burn.S01E02.HDTV.x264-KILLERS.mp4\nThe.Burn.S01E03.HDTV.x264-KILLERS.mp4\nThe.Burn.S01E04.HDTV.x264-KILLERS.mp4\nThe.Burn.S01E05.HDTV.x264-MiNDTHEGAP.mp4\nThe.Burn.S01E06.HDTV.x264-MiNDTHEGAP.mp4\nThe.Burn.S02E01.HDTV.x264-YesTV.mp4\nThe.Burn.S02E02.HDTV.x264-YesTV.mp4\nThe.Burn.S02E03.HDTV.x264-YesTV.mp4\nThe.Burn.S02E04.HDTV.x264-YesTV.mp4\nThe.Burn.S02E05.HDTV.x264-YesTV.mp4\nThe.Burn.S02E06.READNFO.HDTV.x264-YesTV.mp4\n\n\nThe show is broken down into many segments. Examples of these segments include celebrity visits, public roasting, and panelist roasting. The first season contained an additional segment, known as &quot;speed roasting&quot;, in which members of the audience volunteered to be roasted. As of the second season, the &quot;speed roasting&quot; segment is available only via the internet.\n\nThe show usually features several segments such as:\n---\n&quot;Friendly Fire&quot;: Ross meets up with a celebrity friend of his, usually doing roasts of each other\n&quot;Rapid Fire&quot;: Ross makes a quick succession of jokes about a certain topic/celebrity (season 1 only)\n&quot;Public Enemy&quot;: Ross, sometimes riding a Segway scooter, goes around to roast regular people out on the street, sometimes following a certain theme, such a meter maids and pornstars\n&quot;Panel&quot;: three guest comedians discuss the recent news and pop culture happenings\n&quot;Too Soon?&quot;: the last segment of every episode, Ross does a roast/eulogy for somebody that had recently died, whether a celebrity or someone anonymous who died in a humorous or idiotic way\n\n\nGuests include:\n---\nSarah Silverman, Amy Schumer, Ralphie May, J. B. Smoove, John Stamos, Gilbert Gottfried, Marc Maron, Russell Peters, Jimmy Kimmel, Mary Lynn Rajskub, Jim Norton, Bobby Lee, Nicole Elizabeth &quot;Snooki&quot; Polizzi, Natasha Leggero, Anthony Jeselnik, Todd Glass, Johnny Knoxville, Hannibal Buress, Rachael Harris, T. J. Miller, Arianny Celeste, Miguel Torres\tChelsea Peretti, Amy Schumer, Brody Stevens, Bobby Lee, Anthony Jeselnik, Lisa Lampanelli, Whoopi Goldberg, Elisabeth Hasselbeck, Joy Behar, Natasha Leggero, Judah Friedlander, Dave Attell, Bob Saget, Margaret Cho, James Adomian, Brian Posehn, Patrick Warburton, Tom Arnold, Common, Larry David, J. B. Smoove, Gene Simmons, Andy Dick, Seann William Scott, Aisha Tyler, T. J. Miller, Michael Ian Black, Sherrod Small, Adam Carolla, Rob Corddry, Nikki Glaser, Al Madrigal","torrent":{"xt":"urn:btih:681c4fdd2943a1a0a8b527866a02ce2a219d7ac0","amp;dn":"The+Burn+with+Jeff+Ross+%28season+1+and+2%29+%28HDTV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"681c4fdd2943a1a0a8b527866a02ce2a219d7ac0","infoHashBuffer":{"type":"Buffer","data":[104,28,79,221,41,67,161,160,168,181,39,134,106,2,206,42,33,157,122,192]},"announce":[],"urlList":[]}}