{"title":"PassMark BurnInTest Pro 7.0 Portable (registred)","uid":7946916,"size":10676237,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:682b31f2a4d81c2ba2dfd981d2019da80f7ec2b9&amp;dn=PassMark+BurnInTest+Pro+7.0+Portable+%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1356159218,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnassasary regestry changes,\nThis makes a portable version a better version.\n\nPassMark BurnInTest is a software tool that simultaneously for all computer hardware for durability, reliability and durability checks. The software part of a Kampvytr including CPU, hard drives, RAM, CD-ROM, the burner CD, DVD and sound cards, 2D graphics, 3D graphics, network connections, printers, and video graphics cards tested a. If you have special hardware that BurnInTest does not check it, you can manually put in the application for review.The format is ASCII and HTML. - tests that are scheduled to expire automatically at the selected time or after a period of testing to be stopped.\nAbility to save results to a file on disk copy. \n- The &quot;notes&quot; and &quot;Machine ID&quot; verify data storage - Support for copying the results to other applications such as Word through a variety of image formats, such as BMP / GIF / EMF. - Counters that count the total number of operations performed. - simple and innovative user interface. - the ability to run from a USB flash drive or a CD under Windows - Display summary information from your system type, CPU, speed, and serial number. - check temperature components and display it in the user interface. - Check UPS and battery (plus Batterymon software). - HP testing using RAW files, or standard B &amp; W or color. - Run files MP3, MIDI, Wave to test a sound card. - Test 20 hard and floppy disks simultaneously. - Test 20 optical drive simultaneously. - test the CD / DVD / Blu-Ray. - shutdown, reboot and test. - test video card memory . - test run video. - Support HDD SMART parameters.","torrent":{"xt":"urn:btih:682b31f2a4d81c2ba2dfd981d2019da80f7ec2b9","amp;dn":"PassMark+BurnInTest+Pro+7.0+Portable+%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"682b31f2a4d81c2ba2dfd981d2019da80f7ec2b9","infoHashBuffer":{"type":"Buffer","data":[104,43,49,242,164,216,28,43,162,223,217,129,210,1,157,168,15,126,194,185]},"announce":[],"urlList":[]}}