{"title":"Origins - Neil deGrasse Tyson - Audiobook - Unabridged mp3","uid":16009842,"size":252467198,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:686089ecf0af0b6d147813a59ed14b066f8c0cdd&amp;dn=Origins+-+Neil+deGrasse+Tyson+-+Audiobook+-+Unabridged+mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"OddioVizyule","files":10,"time":1476222584,"description":"Origins - Fourteen Billion Years of Cosmic Evolution [Unabridged mp3]\r\n\r\nBy Neil DeGrasse Tyson and Donald Goldsmith\r\n\r\nRead by Kevin Kenerly\r\n\r\nA thrilling and accessible tour of the cosmos.\r\n\r\nOur true origins are not just human, or even terrestrial, but in fact cosmic. Drawing on scientific breakthroughs and the current cross-pollination among geology, biology, astrophysics, and cosmology, Origins explains the soul-stirring leaps in our understanding of the cosmos. From the first image of a galaxy birth to Spirit rover's exploration of Mars, to the discovery of water on one of Jupiter's moons, coauthors Neil deGrasse Tyson and Donald Goldsmith conduct a galvanizing tour of the cosmos with clarity and exuberance. \r\n\r\nNeil deGrasse Tyson is an American astrophysicist, author, and science communicator. He is currently the Frederick P. Rose Director of the Hayden Planetarium at the Rose Center for Earth and Space and a research associate in the department of astrophysics at the American Museum of Natural History. From 2006 to 2011, he hosted the educational science television show NOVA ScienceNow on PBS and has been a frequent guest on The Daily Show, The Colbert Report, Real Time with Bill Maher,and Jeopardy. In March 2014, he became host of the television series Cosmos: A Spacetime Odyssey, an update of Carl Sagan's Cosmos: A Personal Voyage. Tyson has written several nonfiction books including Death by Black Hole, which was a New York Times bestseller","torrent":{"xt":"urn:btih:686089ecf0af0b6d147813a59ed14b066f8c0cdd","amp;dn":"Origins+-+Neil+deGrasse+Tyson+-+Audiobook+-+Unabridged+mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"686089ecf0af0b6d147813a59ed14b066f8c0cdd","infoHashBuffer":{"type":"Buffer","data":[104,96,137,236,240,175,11,109,20,120,19,165,158,209,75,6,111,140,12,221]},"announce":[],"urlList":[]}}