{"title":"Mightier Than the Sword - Jeffrey Archer.epub","uid":11733867,"size":561900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6880a5acf51c3f8c905b92f7985b4c9a2f6fa4b3&amp;dn=Mightier+Than+the+Sword+-+Jeffrey+Archer.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"DavidTenn","files":1,"time":1425485881,"description":"EPub\n\nThe fifth novel in the epic Clifton Chronicles series\n\nMightier than the Sword opens with an IRA bomb exploding during the MV Buckingham's maiden voyage across the Atlantic - but how many passengers lose their lives?\n\nWhen Harry Clifton visits his publisher in New York, he learns that he has been elected as the new president of English PEN, and immediately launches a campaign for the release of a fellow author, Anatoly Babakov, who's imprisoned in Siberia. Babakov's crime? Writing a book called Uncle Joe, a devastating insight into what it was like to work for Stalin. So determined is Harry to see Babakov released and the book published, that he puts his own life in danger.\n\nHis wife Emma, chairman of Barrington Shipping, is facing the repercussions of the IRA attack on the Buckingham. Some board members feel she should resign, and Lady Virginia Fenwick will stop at nothing to cause Emma's downfall.\n\nSir Giles Barrington is now a minister of the Crown, and looks set for even higher office, until an official trip to Berlin does not end as a diplomatic success. Once again, Giles's political career is thrown off balance by none other than his old adversary, Major Alex Fisher, who once again stands against him at the election. But who wins this time?\n\nIn London, Harry and Emma's son, Sebastian, is quickly making a name for himself at Farthing's Bank in London, and has proposed to the beautiful young American, Samantha. But the despicable Adrian Sloane, a man interested only in his own advancement and the ruin of Sebastian, will stop at nothing to remove his rival.\n\nJeffrey Archer's compelling Clifton Chronicles continue in this spellbinding story with all the trademark twists and turns that have made him one of the world's most popular authors","torrent":{"xt":"urn:btih:6880a5acf51c3f8c905b92f7985b4c9a2f6fa4b3","amp;dn":"Mightier+Than+the+Sword+-+Jeffrey+Archer.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6880a5acf51c3f8c905b92f7985b4c9a2f6fa4b3","infoHashBuffer":{"type":"Buffer","data":[104,128,165,172,245,28,63,140,144,91,146,247,152,91,76,154,47,111,164,179]},"announce":[],"urlList":[]}}