{"title":"The Mammoth Book of British Kings and Queens (History Ebook).pdf","uid":11792496,"size":133152739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:689ce4e1d6659f2ef0cdfff9c39f666ff66a9303&amp;dn=The+Mammoth+Book+of+British+Kings+and+Queens+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"STBGD","files":1,"time":1428007358,"description":"The Mammoth Book of British Kings &amp; Queens\nCarroll &amp; Graf | 1999 | ISBN: 0786706929 | English | 844 pages | PDF | 130 MB\n\nIn one compendious volume, The Mammoth Book of Kings &amp; Queens offers the first royal biographical A-Z, its pages lavish in details on all the rulers of kingdoms within the British Isles, together with their wives or consorts, pretenders, usurpers, and regents. Monarchs from Queen Boadicea of the early Britons to Elizabeth II fill these pages, including various tribal and Saxon rulers prior to 1066, the semi-legendary figures of the Dark Ages, and all those who helped to forge the kingdom of Great Britain. Author Mike Ashley presents in chronological order all the kings and queens of Britain as well as other powerful nobles and dignitaries; he includes, too, genealogies showing the family descent of all the leading royal families as a further bonus. His resulting superb and authoritative one-volume reference is now available in an affordably priced Trade Paper edition. &quot;A unique Domesday Book of the British monarchy. A reference work without peers&quot; - Peter Berresford Ellis &quot;Everything its title promises. The pages are filled with maps, charts, time lines, and everything anyone might ever want to know about the royals from ancient times to the present.&quot; - Publishers Weekly &quot;Written in a lively style and covering more than 2,000 years and 1,000 monarchs (more than any previous compilation)&quot;","torrent":{"xt":"urn:btih:689ce4e1d6659f2ef0cdfff9c39f666ff66a9303","amp;dn":"The+Mammoth+Book+of+British+Kings+and+Queens+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"689ce4e1d6659f2ef0cdfff9c39f666ff66a9303","infoHashBuffer":{"type":"Buffer","data":[104,156,228,225,214,101,159,46,240,205,255,249,195,159,102,111,246,106,147,3]},"announce":[],"urlList":[]}}