{"title":"Windows 7 Ultimate USB Stick Edition [full &amp; portable &amp; pirated]","uid":6069868,"size":1248354991,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:68e8d3297706d887a52401dd8b4f072d197f55d0&amp;dn=Windows+7+Ultimate+USB+Stick+Edition+%5Bfull+%26+portable+%26+pirated%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"some0neX","files":1,"time":1293568417,"description":"Have you ever wanted to run a real version of windows 7 from a usb stick on any computer no matter the location, with all your favorite games, applications and files? Now it's possible!\n\nThis is not bartpe/winpe/livecd or anything similar! This is the first real and full version of Windows 7 Ultimate which can be run on any computer from a usb/thumb drive ever created!\n\n###################################################################################\n\nInstallation is easy as 1. 2. 3. (extract the file with winrar/7zip first!):\nRequirements: 8GB or bigger high speed (at least 15 MB/s - otherwise Windows WILL be slow) usb drive\n1. Make a backup of your thumb drive, it will be formatted during the installation.\n   Start &quot;install or backup&quot;, press the small folder icon and select &quot;7 usb edition by iMortaluz&quot;\n2. Choose the drive letter of your drive (you can find it in my computer)\n3. Press write and wait. That's it, enjoy carrying a full copy of Win 7 Ultimate in your pocket!\n\nYou can back up or restore your new ultimate portable Windows 7 at any time using the &quot;install or backup&quot; tool.\nNote: You will have to enable USB boot in the bios - [press F8, F9, F12 or ctrl + s during start up depending on your \nhardware, google is your friend!] Bare in mind that USB sticks are slower than disks and that performance may suffer.\n\n[Optional:] If your drive is bigger than 8GB you may want to increase the size of the virtual system drive of your \nnew Windows in order to gain more disk space:\n1) browse to your usb drive and move the 7USBEditionByiMortaluz.vhd somewhere else (e.g. desktop)\n2) start VHDResizer.exe and select this file\n3) press &quot;save as&quot; and browse to you usb drive again. Call the file 7USBEditionByiMortaluz [It won't work if you call it something else!] and press save\n4) Choose the size depending on the size of your usb drive and press resize. Get yourself a cup of coffee, it's going to take long time.\n5) When you boot your new portable windows for the first time - press start menu, type partition and hit enter. Right click 7USBEditionByiMortaluz and choose &quot;extend volume&quot;. Keep pressing next.\n\n##################################################################################Ã‚Â \n \nAdditional info:\nThis is a fully functional and cracked copy of Windows 7 Ultimate x86. I don't recommend updating it with Windows Update,\nas this can make the crack no longer work, do it at your own risk.\n\nIncluded software:\nDriver Genius Professional - quickly find the drivers you need\nChrome Plus [with adblock]- because Internet Explorer sucks...\nSteam - now you can carry all your favorite games with you - everywhere!\nEverest Ultimate - Get advanced information about your hardware\n7zip - a free WinRAR replacement\nuTorrent - never stop downloading and seeding!\n\nIncluded tools:\nWin7logon changer - change your logon background\nUltimate Win7 Tweaker\nProceXP - advanced task manager\nPassRenew - change passwords, add/delete users on any computer that you start your new portable Windows on!\nWingate - start programs without logging on, log on without password (can be used for recovery (or evil) purposes)\nGodMode - useful Windows 7 easter egg\n\nApplied tweaks:\nSome services (error reporting, windows defender, etc.) have been disabled in order to give you the maximum performace\nWindows Activation is completely removed! (problem, Micro$oft?!)\nTerminal Server Patch applied, Windows 7 USB Edition supports unlimited remote desktop connections!\n\n###################################################################################\n\nTags: Windows 7 USB Edition, installing windows 7 on usb drive, install windows 7 on usb stick, \n\nCreated by iMortaluz. Uploaded and repacked by Some0neX \nCopyright - Right To Copy - Share this as many times as you can!\nIf you need help or have any questions - leave at comment at iMortaluzes official site http://ub3r.1337.cx","torrent":{"xt":"urn:btih:68e8d3297706d887a52401dd8b4f072d197f55d0","amp;dn":"Windows+7+Ultimate+USB+Stick+Edition+%5Bfull+%26+portable+%26+pirated%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68e8d3297706d887a52401dd8b4f072d197f55d0","infoHashBuffer":{"type":"Buffer","data":[104,232,211,41,119,6,216,135,165,36,1,221,139,79,7,45,25,127,85,208]},"announce":[],"urlList":[]}}