{"title":"Desmond Morris - The Naked Ape. A Zoologists Study of the Human ","uid":10392471,"size":19101699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69064ad31646b989844193a0b748979097b187e3&amp;dn=Desmond+Morris+-+The+Naked+Ape.+A+Zoologists+Study+of+the+Human+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Anette14","files":-1,"time":1403211297,"description":"Description\nProduct Details\nBook Title: The Naked Ape: A Zoologist's Study of the Human Animal\t\nBook Author: Desmond Morris\nPaperback: 256 pages\nPublisher: Delta (April 13, 1999)\nLanguage: English\nISBN-10: 0385334303\nISBN-13: 978-0385334303\n\n===================================================================================\nBook Description\nRelease date: April 13, 1999 | ISBN-10: 0385334303 | ISBN-13: 978-0385334303\n&quot;A startling view of man, stripped of the facade we try so hard to hide behind.&quot; In view of man's awesome creativity and resourcefulness, we may be inclined to regard him as descended from the angels, yet, in his brilliant study, Desmond Morris reminds us that man is relative to the apes--is in fact, the greatest primate of all. With knowledge gleaned from primate ethnology, zoologist Morris examines sex, child-rearing, exploratory habits, fighting, feeding, and much more to establish our surprising bonds to the animal kingdom and add substance to the discussion that has provoked controversy and debate the world over. Natural History Magazine praised The Naked Ape as &quot;stimulating . . . thought-provoking . . . [Morris] has introduced some novel and challenging ideas and speculations.&quot; &quot;He minces no words,&quot; said Harper's. &quot;He lets off nothing in our basic relation to the animal kingdom to which we belong. . . He is always specific, startling, but logical.&quot;\n\n===================================================================================\nReview\nHere is the Naked Ape at his most primal - in love, at work, at war. Meet man as he really is: relative to the apes, stripped of his veneer as we see him courting, making love, sleeping, socialising, grooming, playing. Zoologist Desmond Morris's classic takes its place alongside Darwin's Origin of the Species, presenting man not as a fallen angel, but as a risen ape, remarkable in his resilience, energy and imagination, yet an animal nonetheless, in danger of forgetting his origins. With its penetrating insights on man's beginnings, sex life, habits and our astonishing bonds to the animal kingdom, The Naked Ape is a landmark, at once provocative, compelling and timeless.\n\n===================================================================================\nAbout the Author\nDesmond Morris was born in Wiltshire in 1928. He became curator of mammals at London Zoo in 1959, a post he held for eight years. He was already the author of some fifty scientific papers and seven books before completing The Naked Ape in 1967, which was to sell over 10 million copies throughout the world and be translated into almost every known language. He has made many television programs and films on human and animal behavior. He is also an accomplished artist.\n===================================================================================","torrent":{"xt":"urn:btih:69064ad31646b989844193a0b748979097b187e3","amp;dn":"Desmond+Morris+-+The+Naked+Ape.+A+Zoologists+Study+of+the+Human+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69064ad31646b989844193a0b748979097b187e3","infoHashBuffer":{"type":"Buffer","data":[105,6,74,211,22,70,185,137,132,65,147,160,183,72,151,144,151,177,135,227]},"announce":[],"urlList":[]}}