{"title":"The Gnostic Gospels by Elaine Pagels [EPUB] [MOBI] [PDF]","uid":9991706,"size":3976771,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:691a2e254085b99e48507711894349807a857eb7&amp;dn=The+Gnostic+Gospels+by+Elaine+Pagels+%5BEPUB%5D+%5BMOBI%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1397856786,"description":"Title: The Gnostic Gospels\nAuthor: Elaine Pagels\nCategory: Non-Fiction\nPaperback: 182 pages\nPublisher: Random House, 1979; Vintage; Reissue edition (September 19, 1989)\nLanguage: English\nISBN-10: 0679724532\nISBN-13: 978-0679724537\n\nAbout the author, from Amazon - &quot;After receiving her doctorate from Harvard University in 1970, Elaine Pagels taught at Barnard College, Columbia University, where she chaired the department of religion. She is now the Harrington Spear Paine Professor of Religion at Princeton University. Professor Pagels is the author of several books on religious subjects and was awarded a MacArthur Fellowship in 1981. She lives and teaches in Princeton, New Jersey.&quot;\n\nMore information on the author can be found here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Elaine_Pagels&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Elaine_Pagels&lt;/a&gt;\n\nIn The Gnostic Gospels, eminent scholar and Professor Elaine Pagels takes makes a strong examination of the cache of texts that were found in Nag Hammadi, Egypt in 1945 - purported to be the famed exclusions from the Bible, dating back to the Second Council of Nicaea in 787. You can read more about that here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Second_Council_of_Nicaea&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Second_Council_of_Nicaea&lt;/a&gt;\n\nPagels takes a studious approach to the material, looking at sources, motives, history of the gospels (which include the Gospel of Thomas and the Gospel of Mary Magdelene) and possible reasons for exclusion - all with a easily readable style that isn't too difficult for the layman to follow and with complete authority of her subject matter. She approaches it all with a purely academic point of view, so non-theists and Christians alike will find something of interest or points of discussion within the book. It was a best seller and won both the National Book Award in one-year category Religion/Inspiration and the National Book Critics Circle Award.\n\nAn Excerpt can be found here: &lt;a href=&quot;\nhttp://gnosis.org/naghamm/Pagels-Gnostic-Gospels.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://gnosis.org/naghamm/Pagels-Gnostic-Gospels.html&lt;/a&gt; \n\nPromotional info - &quot;Selected by the Modern Library as one of the 100 best nonfiction books of all time\n\nA provocative study of the gnostic gospels and the world of early Christianity as revealed through the Nag Hammadi texts.&quot;\n\nReview:\n&quot;Gnosticism's Christian form grew to prominence in the 2nd century A.D. Ultimately denounced as heretical by the early church, Gnosticism proposed a revealed knowledge of God (&quot;gnosis&quot; meaning &quot;knowledge&quot; in Greek), held as a secret tradition of the apostles. In The Gnostic Gospels, author Elaine Pagels suggests that Christianity could have developed quite differently if Gnostic texts had become part of the Christian canon. Without a doubt: Gnosticism celebrates God as both Mother and Father, shows a very human Jesus's relationship to Mary Magdalene, suggests the Resurrection is better understood symbolically, and speaks to self-knowledge as the route to union with God. Pagels argues that Christian orthodoxy grew out of the political considerations of the day, serving to legitimize and consolidate early church leadership. Her contrast of that developing orthodoxy with Gnostic teachings presents an intriguing trajectory on a world faith as it &quot;might have become.&quot; The Gnostic Gospels provides engaging reading for those seeking a broader perspective on the early development of Christianity.&quot; -F. Hall\n\nSample from the New York Times Book Review:\n&quot;The first major and eminently readable book on gnosticism benefiting from the discovery in 1945 of a collection of Gnostic Christian texts at Nag Hammadi in Egypt.&quot;\n\nThis torrent contains the EPUB and MOBI versions of the first edition, as well as a PDF copy of the second edition (with, I believe, some additional material). The front cover is also included.\n\nPlease seed, and enjoy. :-)","torrent":{"xt":"urn:btih:691a2e254085b99e48507711894349807a857eb7","amp;dn":"The+Gnostic+Gospels+by+Elaine+Pagels+%5BEPUB%5D+%5BMOBI%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"691a2e254085b99e48507711894349807a857eb7","infoHashBuffer":{"type":"Buffer","data":[105,26,46,37,64,133,185,158,72,80,119,17,137,67,73,128,122,133,126,183]},"announce":[],"urlList":[]}}