{"title":"CineSamples - Cinebrass PRO [KONTAKT]","uid":9218371,"size":21475987939,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6949cf373742223376723ce67e0aac62a84a17ba&amp;dn=CineSamples+-+Cinebrass+PRO+%5BKONTAKT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":9,"uploader":"NewSky006","files":-1,"time":1384898165,"description":"Torrent Info:\n==============\n\nThis is not my own torrent! But I added some extra trackers.\n\n\nTorrent Contents:\n==================\n\nKontakt Library\n\n\nInstallation:\n==============\n\nAdd the root folder of this torrent as a library to (cracked) Kontakt.\n\n\nProduct Info:\n==============\n\nCineBrass PRO is the expansion to the popular CineBrass Core library. CineBrass PRO is comprised of entirely new orchestral brass sample content, using the first-call Los Angeles musicians at the SONY Scoring Stage, mixed by Dennis Sands.Our CineBrass core library, released in June 2011, covers the essentials of the orchestral brass section, and functions as a solid foundation in our composing templates. But what about all the other things brass can do? We asked you, the film music community, what you wanted to see in an expansion. The result is CineBrass PRO.\n\nCineBrass is revolutionary in its power and simplicity for recreating the sound of the orchestral brass section. The library was designed by composers, for composers, with direct feedback from the film music community during its development. The result is a brass library that is easy to use, composer-friendly, with unparalleled recording quality. CineBrass does not require you to purchase any sampling software, and is licensed to work with the free Kontakt Player. All you need is a sequencer like Logic, Cubase, Digital Performer, LIVE, Cakewalk, or even Apple GarageBand and youÎ“Ã‡Ã–ll be up and running. You can also use CineBrass with your favorite notation software such as Sibelius or Finale.","torrent":{"xt":"urn:btih:6949cf373742223376723ce67e0aac62a84a17ba","amp;dn":"CineSamples+-+Cinebrass+PRO+%5BKONTAKT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6949cf373742223376723ce67e0aac62a84a17ba","infoHashBuffer":{"type":"Buffer","data":[105,73,207,55,55,66,34,51,118,114,60,230,126,10,172,98,168,74,23,186]},"announce":[],"urlList":[]}}