{"title":"A_Perfect_Circle-Mer_De_Noms-(Retail)-2000-HHI","uid":6060652,"size":74108484,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6a2352922ac3d909c9106f2175780f6bc5fd9fb8&amp;dn=A_Perfect_Circle-Mer_De_Noms-%28Retail%29-2000-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"raidy","files":15,"time":1293062706,"description":" Artist......: A perfect circle \n Album.......: Mer de noms \n Grabber : EAC \n Encoder : LAME v3.90.3 \n Release Date: May-23-2000 \n Rip Date....: Feb-28-2004 \n Genre.......: Alternrock \n Quality : VBRkbps / 44.1kHz / Joint-Stereo \n Playtime : 44:34 min \n Ripper : Happy Hacker Industries \n Supplier : HHI \n CD Songs : 12 \n Label.......: Virgin \n Album Info..: \n \n A Perfect Circle is one of those bands that nobody realized was needed until it \n happened. A grand claim, perhaps, but there's little question that the addicting \n combination of Keenan's aching voice and Howerdel's accomplished songs and production skills made for one of 2000's best splashes in whatever was left of &quot;modern rock.&quot; That the band had in its initial pre-debut album tours performed an audacious, entertaining medley of Ozzy Osbourne's &quot;Diary of a Madman&quot; and the Cure's &quot;Lovesong&quot; -- regularly matching one's words with the other's music and vice versa -- indicates where Mer de Noms ended up. Howerdel's earlier work with Billy Corgan makes perfect sense as a result, since the Pumpkins regularly fused the extreme theatricality of metal and goth just so, but Howerdel's work is no clone. His guitar work operates on setting the mood rather than driving everything before it, balancing sheer power with a textured approach that's quite beautiful. Nine Inch Nails-inspired touches crop up in the distorted percussion of many songs, such as &quot;Rose,&quot; but for all the derivations everything becomes its own smart fusion, with Keenan's vocals the killer touch. His abilities in delivering on-the-edge emotional collapse had long been clear thanks to Tool -- here, with a slightly different musical bed to carry things, he often holds back from complete explosiveness, but it's still clearly him, just about to crack. His astonishing call-and-response exchange on the single &quot;Judith&quot; makes another high point in his career. The choice of who else to make up the band was a smart one -- Lenchantin's violin and string arrangements add even further to the air of dark, moody mystery, while Josh Freese's abilities on drums once again come to the fore. Alan Moulder adds in some fine help on mixing, polishing the glowering sheen of\n Mer de Noms to a hard, sharp edge. \n \n  \n Track Listing....: \n 01.The hollow [02:59] \n 02.Magdalena [04:06] \n 03.Rose [03:26] \n 04.Judith [04:07] \n 05.Orestes [04:48] \n 06.3 libras [03:40] \n 07.Sleeping beauty [04:11] \n 08.Thomas [03:29] \n 09.RenholdÃŽÂ´r [02:25] \n 10.Thinking of you [04:35] \n 11.BreÃ‚Â±a [04:25] \n 12.Over [02:23] \n ____ \n \n 44:34 min \n 70,7 MB ","torrent":{"xt":"urn:btih:6a2352922ac3d909c9106f2175780f6bc5fd9fb8","amp;dn":"A_Perfect_Circle-Mer_De_Noms-%28Retail%29-2000-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a2352922ac3d909c9106f2175780f6bc5fd9fb8","infoHashBuffer":{"type":"Buffer","data":[106,35,82,146,42,195,217,9,201,16,111,33,117,120,15,107,197,253,159,184]},"announce":[],"urlList":[]}}