{"title":"Armour - Materials, Theory and Design (2015).pdf Gooner","uid":12293938,"size":34323066,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a2b899aed8d3f14aa9fb65e6ba6c2f408221fdc&amp;dn=Armour+-+Materials%2C+Theory+and+Design+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1440596632,"description":"\n\n[b]Publisher: CRC Press (July 29, 2015)\nLanguage: English\nISBN-10: 1482238292\nISBN-13: 978-1482238297\n\nHighlights Recent Advances in Materials/Armour Technology\n\nAs long as conflict exists in the world, protection technologies will always be in demand. Armour: Materials, Theory, and Design describes the existing and emerging protection technologies that are currently driving the latest advances in armour systems. This book explains the theory, applications, and material science aspects of modern armour design as they are used in relation to vehicles, ships, personnel, and buildings, and explores the science and technology used to provide protection against blasts and ballistic attacks. It covers materials technologies used in protection; addresses the system effects of adding blast-wave shaping to vehicles, as well as the effect on the human body; and outlines ballistic testing techniques.\n\nTakes a Look at How Armour Works\nThe book discusses ceramics for armour applications; transparent armour; and metals for armour applications (including aluminium alloys, magnesium alloys, titanium alloys and steels); as well as composite armour systems; explosive reactive armour systems with reference to defensive aid suites for vehicles; and wound ballistics. In addition, the author lists more than 100 references for advanced study and further reading.\n\nArmour: Materials, Theory, and Design introduces a variety of armour technologies, outlines modern threats and dangers applicable to protection technology, and aids readers in implementing protective structures that can be used in battle, conflict, military zones, and other related environments.[/b][/center]","torrent":{"xt":"urn:btih:6a2b899aed8d3f14aa9fb65e6ba6c2f408221fdc","amp;dn":"Armour+-+Materials%2C+Theory+and+Design+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a2b899aed8d3f14aa9fb65e6ba6c2f408221fdc","infoHashBuffer":{"type":"Buffer","data":[106,43,137,154,237,141,63,20,170,159,182,94,107,166,194,244,8,34,31,220]},"announce":[],"urlList":[]}}