{"title":"Steven Pinker - The Stuff of Thought. Language as a Window into ","uid":10529313,"size":57412053,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6abc18f1928ac77c0fafb9c0ab17d5693ca90762&amp;dn=Steven+Pinker+-+The+Stuff+of+Thought.+Language+as+a+Window+into+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"Anette14","files":-1,"time":1405087273,"description":"Description\nProduct Details\nBook Title: The Stuff of Thought: Language as a Window into Human Nature\t\nBook Author: Steven Pinker (Author)\nPaperback: 512 pages\nPublisher: Penguin Books; Reprint edition (August 26, 2008)\nLanguage: English\nISBN-10: 0143114247\nISBN-13: 978-0143114246\n\n===================================================================================\nBook Description\nPublication Date: August 26, 2008\nThis New York Times bestseller is an exciting and fearless investigation of language\nBestselling author Steven Pinker possesses that rare combination of scientific aptitude and verbal eloquence that enables him to provide lucid explanations of deep and powerful ideas. His previous books?including the Pulitzer Prize finalist The Blank Slate?have catapulted him into the limelight as one of today?s most important popular science writers. In The Stuff of Thought, Pinker presents a fascinating look at how our words explain our nature. Considering scientific questions with examples from everyday life, The Stuff of Thought is a brilliantly crafted and highly readable work that will appeal to fans of everything from The Selfish Gene and Blink to Eats, Shoots &amp; Leaves.\n\n===================================================================================\nEditorial Reviews\nFrom Publishers Weekly\nBestselling Harvard psychology professor Pinker (The Blank Slate) investigates what the words we use tell us about the way we think. Language, he concludes, reflects our brain structure, which itself is innate. Similarly, the way we talk about things is rooted in, but not identical to, physical reality: human beings take the analogue flow of sensation the world presents to them and package their experience into objects and events. Examining how we do this, the author summarizes and rejects such linguistic theories as extreme nativism and radical pragmatism as he tosses around terms like content-locative and semantic reconstrual that may seem daunting to general readers. But Pinker, a masterful popularizer, illuminates this specialized material with homely illustrations. The difference between drinking from a glass of beer and drinking a glass of beer, for example, shows that the mind has the power to frame a single situation in very different ways. Separate chapters explore concepts of causality, naming, swearing and politeness as the tools with which we organize the flow of raw information. Metaphor in particular, he asserts, helps us entertain new ideas and new ways of managing our affairs. His vivid prose and down-to-earth attitude will once again attract an enthusiastic audience outside academia. (Sept.)\n\nFrom Bookmarks Magazine\nBy examining our words, we can learn a lot about who we are. So argues Harvard academic and popular science writer Steven Pinker in The Stuff of Thought, a logical extension of his previous books. Pinker once again caters to a popular (though scientifically literate) audience, using accessible examples from jokes, Shakespeare, pop songs, and films to understand the science. One fascinating chapter explores the value of metaphors; another covers swearing (did you know that &quot;gee whiz&quot; is derived from &quot;Jesus&quot;?). A few critics tired of the myriad examples and pointed out a lack of unifying threads; others wanted more concrete answers; a couple challenged Pinker's entire thesis that language is an accurate guide to our mind. According to them, it is as if Pinker was determined to combine his broad-based, popular science acumen with his in-depth linguistics expertise &quot;the perfect storm&quot; of his work. But if this book is not food for thought, then no other book of its kind is.\n\nFrom Booklist\nExperimental psychologist and cognitive scientist Pinker is fascinated by the symbiosis between language and thought. In this stimulating volume, a continuation of the discussion found in The Language Instinct (1994), he argues for the &quot;real-world importance&quot; of &quot;the relation of language to our inner and outer worlds.&quot; Anchoring his discussion of why semantics matter to 9/11 and other momentous public events, Pinker teases apart the gap between the literal meanings of words and their elaborate connotations, which leads to fresh explanations of humor, the importance of metaphors, and the significance of swearing. Some of the most mind-expanding chapters involve the subtlest, most taken-for-granted aspects of mind, namely our sense of time, space, and causality. Drawing on philosophy, evolutionary psychology, physics, neurology, anthropology, and jokes, Pinker presents a convincing theory of conceptual semantics, itemizing the &quot;fundamental ideas&quot; that form the &quot;language of thought.&quot; From politics to poetry, children's wonderful malapropisms to slang, Pinker's fluency in the nuances of words and syntax serves as proof of his faith in language as &quot;a window into human nature.&quot; Seaman, Donna\n\n===================================================================================\nReviews\n&quot;Astonishingly readable.&quot; Daily Telegraph\n\n&quot;Perceptive, amusing and intelligent.&quot; Times\n\n&quot;No one writes about language as clearly as Steven Pinker, and this is his best book yet.&quot; Financial Times\n\n&quot;Immensely readable and stimulating. Pinker is a master at making complex ideas palatable.&quot; Independent\n\n&quot;Awesome ... Pinker writes lucidly and elegantly, and leavens the text with scores of perfectly judged anecdotes, jokes, cartoons and illustrations.&quot; Daily Mail\n\n===================================================================================\nAbout the Author\nSteven Pinker is the Harvard College Professor of Psychology at Harvard University. A two-time Pulitzer Prize finalist and the winner of many awards for his research, teaching, and books, he has been named one of Time's 100 Most Influential People in the World Today and Foreign Policy's 100 Global Thinkers.\n\n===================================================================================\nFrom The Washington Post\nReviewed by Jonah Lehrer\nLanguage comes so naturally to us that it's easy to believe there's some sort of intrinsic logic connecting the thing and its name, the signifier and the signified. In one of Plato's dialogues, a character named Cratylus argues that &quot;a power more than human gave things their first names.&quot;\nBut Cratylus was wrong. Human language is an emanation of the human mind. A thing doesn't care what we call it. Words and their rules don't tell us about the world; they tell us about ourselves.\nThat's the simple premise behind Steven Pinker's latest work of popular science. According to the Harvard psychologist, people are &quot;verbivores, a species that lives on words.&quot; If you want to understand how the brain works, how it thinks about space and causation and time, how it processes emotions and engages in social interactions, then you need to plunge &quot;down the rabbit hole&quot; of language. The quirks of our sentences are merely a portal to the mind.\nIn The Stuff of Thought, Pinker pitches himself as the broker of a scientific compromise between &quot;linguistic determinism&quot; and &quot;extreme nativism.&quot; The linguistic determinists argue that language is a prison for thought. The words we know define our knowledge of the world. Because Eskimos have more nouns for snow, they are able to perceive distinctions in snow that English speakers cannot. While Pinker deftly discredits extreme versions of this hypothesis, he admits that &quot;boring versions&quot; of linguistic determinism are probably accurate. It shouldn't be too surprising that our choice of words can frame events, or that our vocabulary reflects the kinds of things we encounter in our daily life. (Why do Eskimos have so many words for snow? Because they are always surrounded by snow.) The language we learn as children might not determine our thoughts, but it certainly influences them.\nExtreme nativism, on the other hand, argues that all of our mental concepts -- the 50,000 or so words in the typical vocabulary -- are innate. We are born knowing about carburetors and doorknobs and iPods. This bizarre theory, most closely identified with the philosopher Jerry Fodor, begins with the assumption that the meaning of words cannot be dissected into more basic parts. A doorknob is a doorknob is a doorknob. It only takes Pinker a few pages to prove the obvious, which is that each word is not an indivisible unit. The mind isn't a blank slate, but it isn't an overstuffed filing cabinet either.\nSo what is Pinker's solution? He advocates the middle ground of &quot;conceptual semantics,&quot; in which the meaning of our words depends on an underlying framework of basic cognitive concepts. (As Pinker admits, he owes a big debt to Kant.) The tenses of verbs, for example, are shaped by our innate sense of time. Nouns are constrained by our intuitive notions about matter, so that we naturally parcel things into two different categories, objects and substances (pebbles versus applesauce, for example, or, as Pinker puts it, &quot;hunks and goo&quot;). Each material category comes with a slightly different set of grammatical rules. By looking at language from the perspective of our thoughts, Pinker demonstrates that many seemingly arbitrary aspects of speech, like that hunk and goo distinction, aren't arbitrary at all: They are byproducts of our evolved mental machinery.\nPinker tries hard to make this tour of linguistic theory as readable as possible. He uses the f-word to explore the topic of transitive and intransitive verbs. He clarifies indirect speech by examining a scene from &quot;Tootsie,&quot; and Lenny Bruce makes so many appearances that he should be granted a posthumous linguistic degree. But profanity from Lenny Bruce can't always compensate for the cryptic vocabulary and long list of competing 'isms. Sometimes, the payoff can be disappointing. After a long chapter on curse words -- this book deserves an &quot;explicit content&quot; warning -- Pinker ends with the banal conclusion that swearing is &quot;connected with negative emotion.&quot; I don't need conceptual semantics to tell me that.\nThe Stuff of Thought concludes with an optimistic gloss on the power of language to lead us out of the Platonic cave, so that we can &quot;transcend our cognitive and emotional limitations.&quot; It's a nice try at a happy ending, but I don't buy it. The Stuff of Thought, after all, is really about the limits of language, the way our prose and poetry are bound by innate constraints we can't even comprehend. Flaubert was right: &quot;Language is a cracked kettle on which we beat out tunes for bears to dance to, while all the time we long to move the stars to pity.&quot;\n===================================================================================","torrent":{"xt":"urn:btih:6abc18f1928ac77c0fafb9c0ab17d5693ca90762","amp;dn":"Steven+Pinker+-+The+Stuff+of+Thought.+Language+as+a+Window+into+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6abc18f1928ac77c0fafb9c0ab17d5693ca90762","infoHashBuffer":{"type":"Buffer","data":[106,188,24,241,146,138,199,124,15,175,185,192,171,23,213,105,60,169,7,98]},"announce":[],"urlList":[]}}