{"title":"Parenthood - Complete Season 3","uid":8526355,"size":6526003833,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6b2dfaaf1bfca23236836e239b21923d0b54a049&amp;dn=Parenthood+-+Complete+Season+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":8,"uploader":"maansle","files":20,"time":1370038854,"description":"&quot;Parenthood&quot; \n\nA family tree with Zeek (Craig T. Nelson) and Camille Braverman (Bonnie Bedelia) serving as the patriarch and matriarch. After forty-six years of marriage, they've managed to keep their foundation intact by burying their problems underneath the surface for the sake of their now-adult children. Adam (Peter Krause) is the first-born and the ripest apple the tree has to offer. He runs a shoe company, has a supportive wife, two children (boy and girl) and a beautiful home to share with them. He's a dog short of &quot;The American Dream&quot;. Sarah (Lauren Graham), is the unstable daughter returning home at thirty-eight years of age with her rebellious daughter and sensitive son to live with Zeek and Camille. Crosby (Dax Shepard), is a happy-go-lucky bachelor living in the now, on a docked boat. He has no idea that his frivolous life is about to change tremendously. Then there is Julia (Erika Christensen). She is the bread-winning shot-calling lawyer, whose husband mans the stay-at-home-dad duties. Each family will face their own challenges, but how they propose to deal with them is what will keep them together or tear them apart. ","torrent":{"xt":"urn:btih:6b2dfaaf1bfca23236836e239b21923d0b54a049","amp;dn":"Parenthood+-+Complete+Season+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b2dfaaf1bfca23236836e239b21923d0b54a049","infoHashBuffer":{"type":"Buffer","data":[107,45,250,175,27,252,162,50,54,131,110,35,155,33,146,61,11,84,160,73]},"announce":[],"urlList":[]}}