{"title":"Caravaggio (Art Painting Ebook).pdf","uid":9217557,"size":53064105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b522308853035faab46027cf4aada4ebbbedeeb&amp;dn=Caravaggio+%28Art+Painting+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"STBGD","files":-1,"time":1384884122,"description":"Felix Witting, M.L. Patrizi, &quot;Caravaggio (Temporis Collection)&quot;\nISBN: 1844845540 | 2008 | PDF | 256 pages | 51 MB\n\nIt took a mid-twentieth century art show in Milan to rediscover this Italian artist, emblematic of the Baroque period, who lived during the second half of the 16th and first half of the 17th centuries.Michelangelo Merisi was born to a family of modest means in 1571 near Milan. At the age of thirteen, he became an apprentice of the painter Simone Peterzano, who taught him artistic techniques and the use of colours. But he was atracted by Rome, with its fast pace of life and its loose morals. In 1597, he became the protg to a noble cardinal who assisted him in securing important orders, such as The Martyrdom of St. Matthew, but he turned many of the offers down because of the vulgarity of the subject. Rejecting mannerism in favour of realism, this artist of the Counter- Reformation restored to the saints their humanity. Paradoxically, this mystical painter gives the saints a sensuality which goes beyond veneration and opens the door to an ambiguous eroticism.Caravaggio also experienced the taste of dishonour and prison. After the murder of Tomasi, he was condemned to exile. He died on the 18th of July 1610 as he had lived unexpectedly, like a character in a novel, far away from his beloved Rome, on the eve of his pardon by Pope Paul V.His work remains tremendous both his themes and his techniques became an inspiration for Rubens, Velzquez, and Rembrandt, inspiring especially the technique of chiaroscuro, of which he was one of the precursors.With the help of numerous colour reproductions, this book retraces the life of Caravaggio and analyses his work while illustrating the scope of his influence on the greatest artists.","torrent":{"xt":"urn:btih:6b522308853035faab46027cf4aada4ebbbedeeb","amp;dn":"Caravaggio+%28Art+Painting+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b522308853035faab46027cf4aada4ebbbedeeb","infoHashBuffer":{"type":"Buffer","data":[107,82,35,8,133,48,53,250,171,70,2,124,244,170,218,78,187,190,222,235]},"announce":[],"urlList":[]}}