{"title":"T.G.British.Bake.Off-S07E08.-.Extra.Slice-S03E08--w.subs-540p","uid":16039782,"size":1094654032,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6bb5a8d97f24d268d5b5458c6d47e9c40c427680&amp;dn=T.G.British.Bake.Off-S07E08.-.Extra.Slice-S03E08--w.subs-540p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":12,"uploader":"uggauga","files":4,"time":1476497083,"description":"\nThe Great British Bake Off - S07E08\r\n&amp;\r\nThe Great British Bake Off: An Extra Slice - S03E08\r\n\r\nBBC (2016)\r\n  \nhttp://www.bbc.co.uk/programmes/b07r2pr0  \nhttp://www.bbc.co.uk/programmes/b07r1ff2\r\n\r\n_______________________________________\r\n\r\n960x540 resolution - MP4 files\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - Enjoy !!\r\n_______________________________________\r\n\r\n\r\nTudor Week\r\nThe Great British Bake Off, Series 7 Episode 8 of 11\r\nThis week we are stepping back in time for a Bake Off first - Tudor Week. Mary and Paul have set three new challenges that embrace a time when Henry VIII reigned and a time of flamboyant banquets and impressive centre pieces that were Tudor showstoppers.\r\nThe signature is a Tudor classic - pies. Although a few hundred years ago their pies would have been filled with feathered birds, our bakers will attempt to make a rather more edible version for modern taste of a savoury stuffed pie.\r\nIn the technical challenge, the bakers face a rather unusual Tudor biscuit that has them all tied up in knots.\r\nMel pops into Hampton Court to uncover how one sweet delicacy nearly enticed Queen Elizabeth I to marry.\r\nAnd the final challenge is to construct a showstopper that is a spectacle of marzipan, fit to grace the tables of a wealthy Tudor banquet.\r\nWhich of the five bakers will make it into the semi-final, and who will be leaving the tent?\r\n\r\nEpisode 8\r\nThe Great British Bake Off: An Extra Slice, Series 3\r\nIt is the quarter-finals in the Bake Off tent and just five bakers remain. Jo Brand hosts An Extra Slice and is joined by three celebrity Bake Off fans to dissect this week's events in the tent - Deborah Meaden from Dragon's Den, chef Michael Caines and comedian Miles Jupp.\r\nIt is Tudor week in the tent and there is unseen footage from the BBC One show and an interview with the latest baker to leave. The panel taste bakes brought in by the studio audience and look at viewer photos of their bakes from home - the delicacies and the calamities.\r\nWhat will the panel think about the classic Tudor signature bake, a savoury stuffed pie? Which baker's traditional biscuit stood out in the technical? And whose showstopper was deemed fit for a king?\r\nAn Extra Slice - when just one helping of Bake Off just isn't enough","torrent":{"xt":"urn:btih:6bb5a8d97f24d268d5b5458c6d47e9c40c427680","amp;dn":"T.G.British.Bake.Off-S07E08.-.Extra.Slice-S03E08--w.subs-540p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bb5a8d97f24d268d5b5458c6d47e9c40c427680","infoHashBuffer":{"type":"Buffer","data":[107,181,168,217,127,36,210,104,213,181,69,140,109,71,233,196,12,66,118,128]},"announce":[],"urlList":[]}}