{"title":"Under the Dome: A Novel by Stephen King (ePub Retail)","uid":8606261,"size":2530243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c56d8c80d6263d17ead3e52e2bdd786bdb4837e&amp;dn=Under+the+Dome%3A+A+Novel+by+Stephen+King+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"TxJag","files":3,"time":1372023283,"description":"On an entirely normal, beautiful fall day in Chester's Mill, Maine, the town is inexplicably and suddenly sealed off from the rest of the world by an invisible force field. Planes crash into it and fall from the sky in flaming wreckage, a gardener's hand is severed as &quot;the dome&quot; comes down on it, people running errands in the neighboring town are divided from their families, and cars explode on impact. No one can fathom what this barrier is, where it came from, and when -- or if -- it will go away.\n\nDale Barbara, Iraq vet and now a short-order cook, finds himself teamed with a few intrepid citizens -- town newspaper owner Julia Shumway, a physician's assistant at the hospital, a select-woman, and three brave kids. Against them stands Big Jim Rennie, a politician who will stop at nothing -- even murder -- to hold the reins of power, and his son, who is keeping a horrible secret in a dark pantry. But their main adversary is the Dome itself. Because time isn't just short. It's running out.\n\nFull Retail. ePub and Calibre reader ready. Metadata is complete and up to date.","torrent":{"xt":"urn:btih:6c56d8c80d6263d17ead3e52e2bdd786bdb4837e","amp;dn":"Under+the+Dome%3A+A+Novel+by+Stephen+King+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c56d8c80d6263d17ead3e52e2bdd786bdb4837e","infoHashBuffer":{"type":"Buffer","data":[108,86,216,200,13,98,99,209,126,173,62,82,226,189,215,134,189,180,131,126]},"announce":[],"urlList":[]}}