{"title":"Bach - St Matthew Passion 3CD","uid":5671138,"size":384446840,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ce8639f689edba737aabf13f66a52c85198a9e3&amp;dn=Bach+-+St+Matthew+Passion+3CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"muzik62","files":-1,"time":1278352674,"description":"J S Bach - Passion of St Matthew\n\n3 Cd\n\nConducter john Elliot Gardiner\nThe English Baroque Soloists\n\nmp3 lame cbr 320 kbit/s\n\n\n\n\n\nMore than a decade after its release, this recording remains a benchmark for this sublime work. It may have been joined by the recent Herreweghe as a prime recomendation, but it certainly has not been bettered. Despite what some listeners say on this site, it's far from being only a superficial account. True, it's much faster than Klemperer's classic version, but why should we consider slow as the same as profound? I can think of only one instance of a tempo faster than appropriate here, in &quot;Ich will dir mein Herze schenken&quot;, which is anyway lovingly sung by Barbara Bonney. In every other aria, Gardiner's tempos just sound right. Listen, for instance, to how he takes &quot;So ist mein Jesus nun Gefangen&quot; moderately (Herreweghe, BrÃƒÂ¼ggen and Suzuki are noticeably faster) and then releases a furious &quot;Sind Blitze, sind donner&quot; and read the texts. Or notice how the tender and deeply felt singing of Michael Chance in &quot;Erbarme dich&quot;, coupled with the gracious violin solo of Elizabeth Wilcock, is exceptionally attuned to the bitter weeping of the lyrics.\n\nGardiner's version is, that's sure, a very dramatic account of the work. Here some may prefer a more contemplative approach, and they would be well served by Suzuki's recent recording. But Gardiner's delivery of the narrative is much more gripping, with an exceptional Evangelist in the voice of Anthony Rolfe-Johnson and some of the most impressive crowd's scenes ever, enhanced by the superb singing of the Monteverdi Choir. Herreweghe's excelent new recording, which is also intensely dramatic (more so in the arias, actually), can't compare to Gardiner's in such moments as when the crowd shouts for the freedom of &quot;Barrabam&quot; and soon after demands Jesus's crucifixion.\n\nGardiner's recording also benefits from a uniformly good team of soloists (Anne Sofie von Otter gives a performance of &quot;KÃƒÂ¶nnen TrÃƒÂ¤nen&quot; that deserves to be a reference and the Jesus of Andreas Schmidt is outstanding) and the exquisite playing of the English Baroque Soloists. Recent recordings, especially Herreweghe's, tend to smooth the sound with a more legato playing, and certainly many people will prefer this approach, which makes the period instruments sound closer to modern ones. But the clear articulation employed by Gardiner is still a joy to hear, and his ability to draw the most beautiful blend from his players remains unsurpassed.\n\nmore info in 2 pdf-files + 1 pdf-file with text in English and German\n\nmuzik62","torrent":{"xt":"urn:btih:6ce8639f689edba737aabf13f66a52c85198a9e3","amp;dn":"Bach+-+St+Matthew+Passion+3CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ce8639f689edba737aabf13f66a52c85198a9e3","infoHashBuffer":{"type":"Buffer","data":[108,232,99,159,104,158,219,167,55,170,191,19,246,106,82,200,81,152,169,227]},"announce":[],"urlList":[]}}