{"title":"Foxcatcher - Mark Schultz - Audiobook MP3","uid":11497828,"size":217231690,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6d671985ac1eef16331684796b1f8802d49e5887&amp;dn=Foxcatcher+-+Mark+Schultz+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1416269088,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nFoxcatcher: The True Story of My Brother's Murder, John du Pont's Madness, and the Quest for Olympic Gold\n\nWritten by: Mark Schultz, David Thomas\nNarrated by: Stephen Mendel\nLength: 7 hrs and 31 mins\nUnabridged Audiobook\nRelease Date:11-18-14\n\nThe riveting true story - soon to be the subject of a high-profile film - of Olympic wrestling gold medal-winning brothers Mark Schultz and Dave Schultz and their fatal relationship with the eccentric John du Pont, heir to the du Pont dynasty.\n\nOn January 26, 1996, Dave Schultz, Olympic gold medal winner and wrestling golden boy, was shot three times by du Pont family heir John E. du Pont at the famed Foxcatcher Farms estate in Pennsylvania. Following the murder, there was a tense standoff when du Pont barricaded himself in his home for two days before he was finally captured.\n\nFoxcatcher is gold medal winner Mark Schultz's memoir, revealing what made him and his brother champion and what brought them to Foxcatcher Farms. It's a vivid portrait of the complex relationship he and his brother had with du Pont, a man whose catastrophic break from reality led to tragedy. No one knows the inside story of what went on behind the scenes at Foxcatcher Farms - and inside John du Pont's head - better than Mark Schultz.\n\nThe incredible true story of these championship-winning brothers and the wealthiest convicted murderer of all time will be making headlines this fall, and Mark's memoir will reveal the true inside story","torrent":{"xt":"urn:btih:6d671985ac1eef16331684796b1f8802d49e5887","amp;dn":"Foxcatcher+-+Mark+Schultz+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d671985ac1eef16331684796b1f8802d49e5887","infoHashBuffer":{"type":"Buffer","data":[109,103,25,133,172,30,239,22,51,22,132,121,107,31,136,2,212,158,88,135]},"announce":[],"urlList":[]}}