{"title":"Black Sun: Aryan Cults, Esoteric Nazism and ...","uid":15854520,"size":2986829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d7d6397d2a68a3d2198598c13372cfebf238477&amp;dn=Black+Sun%3A+Aryan+Cults%2C+Esoteric+Nazism+and+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"marty14","files":1,"time":1474224843,"description":"Black Sun: Aryan Cults, Esoteric Nazism and the Politics of Identity - Nicholas Goodrick-Clarke [epub]\r\n\r\nMore than half a century after the defeat of Nazism and fascism, the far right is again challenging the liberal order of Western democracies. Radical movements are feeding on anxiety about economic globalization, affirmative action, and third-world immigration, flashpoint issues to many traditional groups in multicultural societies. A curious mixture of Aristocratic paganism, anti-Semitic demonology, Eastern philosophies and the occult is influencing populist antigovernment sentiment and helping to exploit the widespread fear that invisible elites are shaping world events.\r\n\r\nBlack Sun examines the new neofascist ideology, showing how hate groups, militias and conspiracy cults attempt to gain influence. Based on interviews and extensive research into underground groups, Black Sun documents the new Nazi and fascist sects that have sprung up from the 1970s through the 1990s and examines the mentality and motivation of these far-right extremists. The result is a detailed, grounded portrait of the mythical and devotional aspects of Hitler cults among Aryan mystics, racist skinheads and Nazi satanists, Heavy Metal music fans, and in occult literature.\r\n\r\nNicholas Goodrick-Clarke offers a unique perspective on far right neo-Nazism viewing it as a new form of Western religious heresy. He paints a frightening picture of a religion with its own relics, rituals, prophecies and an international sectarian following that could, under the proper conditions, gain political power and attempt to realize its dangerous millenarian fantasies","torrent":{"xt":"urn:btih:6d7d6397d2a68a3d2198598c13372cfebf238477","amp;dn":"Black+Sun%3A+Aryan+Cults%2C+Esoteric+Nazism+and+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d7d6397d2a68a3d2198598c13372cfebf238477","infoHashBuffer":{"type":"Buffer","data":[109,125,99,151,210,166,138,61,33,152,89,140,19,55,44,254,191,35,132,119]},"announce":[],"urlList":[]}}