{"title":"[EPUB] See Me - Nicholas Sparks","uid":14859023,"size":1940172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6dcef48ec38e6e2f3ac71840f7411fc4761f3710&amp;dn=%5BEPUB%5D+See+Me+-+Nicholas+Sparks&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"kingking11","files":2,"time":1465506648,"description":"Colin Hancock is giving his second chance his best shot. With a history of violence and bad decisions behind him and the threat of prison dogging his every step, he’s determined to walk a straight line. To Colin, that means applying himself single-mindedly toward his teaching degree and avoiding everything that proved destructive in his earlier life. Reminding himself daily of his hard-earned lessons, the last thing he is looking for is a serious relationship.\r\nMaria Sanchez, the hardworking daughter of Mexican immigrants, is the picture of conventional success. With a degree from Duke Law School and a job at a prestigious firm in Wilmington, she is a dark-haired beauty with a seemingly flawless professional track record. And yet Maria has a traumatic history of her own, one that compelled her to return to her hometown and left her questioning so much of what she once believed.\r\nA chance encounter on a rain-swept road will alter the course of both Colin and Maria’s lives, challenging deeply held assumptions about each other and ultimately, themselves. As love unexpectedly takes hold between them, they dare to envision what a future together could possibly look like . . . until menacing reminders of events in Maria’s past begin to surface","torrent":{"xt":"urn:btih:6dcef48ec38e6e2f3ac71840f7411fc4761f3710","amp;dn":"%5BEPUB%5D+See+Me+-+Nicholas+Sparks","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dcef48ec38e6e2f3ac71840f7411fc4761f3710","infoHashBuffer":{"type":"Buffer","data":[109,206,244,142,195,142,110,47,58,199,24,64,247,65,31,196,118,31,55,16]},"announce":[],"urlList":[]}}