{"title":"Windows 8 Professional RETAIL [32bit+64bit] w/ 3 Activators [WOR","uid":7799245,"size":6214341819,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e4133380651fa78c5c9705e8107c7ee510fa2a5&amp;dn=Windows+8+Professional+RETAIL+%5B32bit%2B64bit%5D+w%2F+3+Activators+%5BWOR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"CoryTheGreat","files":6,"time":1352237078,"description":"Windows 8 is the current release of the Windows operating system, produced by Microsoft for use on personal computers, including home and business desktops, laptops, tablets, and home theater PCs. Development of Windows 8 started before the release of its predecessor in 2009. Its existence was first announced at CES 2011, and followed by the release of three pre-release versions from September 2011 to May 2012. The operating system was released to manufacturing on August 1, 2012, and was released for general availability on October 26, 2012.[3]\n\nWindows 8 introduces significant changes to the operating system's platform, primarily focused towards improving its user experience on mobile devices such as tablets to rival other mobile operating systems (such as Android and iOS),[4] taking advantage of new and emerging technologies (such as USB 3.0, UEFI firmware, near field communications, cloud computing, and the low-power ARM architecture), new security features (such as malware filtering, built-in antivirus software, and support for secure boot, a controversial UEFI feature which requires operating systems to be digitally signed to prevent malware from infecting the boot process), along with other changes and performance improvements.\n\nWindows 8 also introduces a new shell and user interface based on Microsoft's &quot;Metro&quot; design language, featuring a new Start screen with a grid of dynamically updating tiles to represent applications, a new app platform with an emphasis on touchscreen input, the new Windows Store to obtain and purchase applications for the system, and the ability to synchronize programs and settings between multiple devices.\n\n-------------------------------------------------------------------------------\n\n-------------------------------------------------------------------------------\n\nMinimum hardware requirements for Windows 8\nArchitecture\tIA-32 (32-bit)\tx86-64 (64-bit)\nProcessor\t1 GHz (with PAE, NX and SSE2 support)[81]\nMemory (RAM)\t1 GB\t2 GB\nGraphics Card\tDirectX 9 graphics device with WDDM 1.0 or higher driver\nStorage\t16 GB\t20 GB\n\n-------------------------------------------------------------------------------\n\n-------------------------------------------------------------------------------\n\nInstallation:\n\n1. Start the setup.exe\n\n2. Use this key to get the setup started:                                              \n   -NG4HW-VH26C-733KW-K6F98-J8CK4\n\n3. Let it install\n\n4. Run one of the activators provided.\n   (3 were supplied in case the servers are down)\n\n5. Seed the FUCK out of this... Don't be a douche.","torrent":{"xt":"urn:btih:6e4133380651fa78c5c9705e8107c7ee510fa2a5","amp;dn":"Windows+8+Professional+RETAIL+%5B32bit%2B64bit%5D+w%2F+3+Activators+%5BWOR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e4133380651fa78c5c9705e8107c7ee510fa2a5","infoHashBuffer":{"type":"Buffer","data":[110,65,51,56,6,81,250,120,197,201,112,94,129,7,199,238,81,15,162,165]},"announce":[],"urlList":[]}}