{"title":"The_Sims_3_University_Life-FLT","uid":8223930,"size":5138280467,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6e6042059c722fa37c8c44e8d6e257146cc26962&amp;dn=The_Sims_3_University_Life-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Mr.Stifmeister","files":-1,"time":1362543755,"description":"\n                                                               ANSi JED\n\n\n            In Their 26th Year Of Glory, FairLight Released #1074\n\n              The Sims 3 - University Life (c) Electronic Nerds\n\n:   Supplied by: FAIRLIGHT            : : Release Date: 06/03/2013           :\n    Cracked by:  FAIRLIGHT                Game Type:    Sims\n    Packaged by: FAIRLIGHT                Image Format: ISO\n               -----\n    DISCS: 1 DVD                          Protection: Disc-Checks\n\n    System Requirements : Grandma's PC\n\n\n Game information:\n =================\n\n Are your Sims ready for the time of their lives? Heading off to college  in\n The Sims  3  University  Life  opens  up  new  opportunities,  from  social\n connections to career growth. From class activities  to  major  -  specific\n objects, your Sim will find new ways to learn! And  university  isn't  just\n about hitting the books. Join a protest, flirt at a bonfire party - there's\n a lot to explore outside of lectures at the student union.\n\n\n Features:\n =========\n\n * Achieve Academic Excellence. Learning is more fun than ever with new\n   major-specific objects. Your Sims can broadcast their own radio show\n   as a Communications student or bone up on anatomy using the skeleton\n   as a Science and Medicine major. Your Sims can also learn through\n   class activities, lectures at the student union, and joining in\n   social activities.\n * Get Ready to Party!  Text books and study groups are a big part of\n   college, but sometimes Sims just need to party! From hosting\n   bonfires by the lake to doing juice keg stands at a dorm\n   party, there are lots of ways to have a great time and\n   let loose.\n * Make Connections and Network. Grow your social networking skill\n   through texting, blogging and streaming video. This builds your\n   affiliation with the three social groups on campus - the Nerds,\n   the Rebels and the Jocks. Building your cred with these groups\n   offers unique advantages, from earning dream jobs to a\n   coveted extra trait.\n * Actions Matter.  Just like in real life, your Sims' decisions are\n   deeply interconnected. For example, a Fine Arts student benefits\n   from the Avant Garde trait, and develops their Street Art skill\n   and cred with the Rebels by tagging and spray painting. Just\n   don't let your Sims get caught by the cops!\n * Reap Benefits After University Too!  Help your Sims reach the top\n   job in your career path more easily with faster promotions and a\n   higher entry-level job for university grads. If your Sim becomes\n   a legend with their social group, they may even land a dream job\n   as an art appraiser, sports agent, or video game developer!\n * Explore the Campus and Town.  From striking out at the bowling\n   alley to flirting with the barista at the Roasted Toasted\n   Beans to browsing comic books at Keith s Komics, there's\n   a whole new town and campus full of places to explore.\n\n\n Installation Information:\n =========================\n\n * Burn or mount\n * Install using our keygen ( requires the Sims 3 main game installed )\n * Copy the cracked content from the Fairlight folder\n   to your 'The Sims 3' installation\n * Play the game\n\n\n NOTE: As usual, block the game exe in your firewall.\n\n                                                             /TEAM FAiRLIGHT\n\n\n                    +-+  QUALITY, TRADITION  AND PRIDE +-+\n","torrent":{"xt":"urn:btih:6e6042059c722fa37c8c44e8d6e257146cc26962","amp;dn":"The_Sims_3_University_Life-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e6042059c722fa37c8c44e8d6e257146cc26962","infoHashBuffer":{"type":"Buffer","data":[110,96,66,5,156,114,47,163,124,140,68,232,214,226,87,20,108,194,105,98]},"announce":[],"urlList":[]}}