{"title":"Tank Girl Ultimate Mega Collection","uid":11327499,"size":1997829149,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6f219396e49fc7fd5c801703fcde98d114643865&amp;dn=Tank+Girl+Ultimate+Mega+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":5,"uploader":"emidius","files":68,"time":1414639704,"description":"Tank Girl Ultimate Mega Collection\n\n01. Tank Girl - Volume 1 (01-04) Complete\n02. Tank Girl - Volume 2 (01-04) Complete\n03. Tank Girl - The Movie\n04. Tank Girl - The Odyssey (01-04) Complete\n05. Tank Girl - Apocalypse (01-04) Complete\n06. Tank Girl - The Gifting (01-04) Complete\n07. Tank Girl - Visions of Booga (01-04) Complete\n08. Tank Girl - Dark Nuggets\n09. Tank Girl - Skidmarks (01-04) Complete\n10. Tank Girl - Dirty Helmets\n11. Tank Girl - Hairy Heroes\n12. Tank Girl - The Royal Escape (01-04) Complete\n13. Tank Girl - Bad Wind Rising (01-04) Complete\n14. Tank Girl - Carioca (01-06) Complete\n15. Tank Girl - Classic (01-14) Complete\n16. Tank Girl - Solid State Tank Girl (01-04) Complete\n17. Tank Girl - Everybody Loves (01-04) Complete\n18. Tank Girl - Graphic Novel (Penguin, 1991).cbz\n\n(Description) ---This is most of the entire collection. I am missing the following and any help finding them would be greatly appreciated!---\n\n**********\nMissing Needed Issues:\nTank Girl Book 3 rounds up a final 9 episodes, including some featuring Booga as the star. Some colour, some black and white.\nTank Girl: Armadillo and a Bushel of Other Stories (Novel, Fiction, text by Alan Martin, cover art by Jamie Hewlett) released by Titan Books in March 2008.\n&quot;The Cream of Tank Girl&quot; a retrospective art book, was released by Titan Books in October 2008.\n&quot;We Hate Tank Girl&quot; trade paperback (Collects the Tank Girl One-Shots: Dark Nuggets, Dirty Helmets, and Hairy Heroes) was released February 2011.\n&quot;The Hole Of Tank Girl&quot; A hardcover, large-format book with slipcase, collecting the first three Hewlett &amp; Martin books (with extra archive material), was released by Titan Books on September 18, 2012.\n**********\n\n\nTank Girl - By Hewlett &amp; Martin. Released in 1990 by Penguin Books, collected the first 18 episodes from Deadline Magazine.\n\nTank Girl 2 - By Hewlett &amp; Martin. Released in 1993 by Penguin Books, collected 20 episodes of the Tank Girl story.\n\nTank Girl 3 by Hewlett &amp; Martin was published by Penguin in 1996. It collected the final stories from Deadline Magazine.\n\nTank Girl 1, Tank Girl 2, and Tank Girl 3 were subsequently reprinted by Titan Books and the stories were rearranged into correct chronological order for the recent Tank Girl Remastered series, again by Titan Books.\n\nWhen the Tank Girl movie was being made, a deal was struck with DC's imprint Vertigo Comics to release three Tank Girl mini-series. The first two were released throughout June 1995 - February 1996. The third mini-series was never created.\n\nTank Girl: The Odyssey was a four issue mini-series published by Vertigo Comics June 1995 - October 1995. Titan Books collected this mini-series in July 2003, with a 'Remastered' trade released in November 2009.\n\nTank Girl: Apocalypse was a four issue mini-series published by Vertigo Comics in November 1995 - February 1996. Titan Books collected this mini-series in October 2003, with a 'Remastered' trade released in February 2010.\n\nIn 2007, Tank Girl returned with new mini-series and one-shots.\n\nTank Girl: The Gifting - a four issue mini-series by Wood, Dayglo &amp; Martin, published by IDW from May 2007 - August 2007. These four issues were collected in trade paperback format in November 2007.\n\nTank Girl: Visions of Booga - a four issue mini-series Dayglo &amp; Martin, published by IDW from May 2008 - August 2008. These four issues were collected in trade paperback format in November 2008.\n\nTank Girl: Skidmarks - a four issue mini-series by Dayglo &amp; Martin, published by Titan Comics from November 2009 - February 2010.\n\nTank Girl: Dark Nuggets - a one-shot issue by Dayglo &amp; Martin, published by Image Comics in January 2010. It was the first of a series of three Tank Girl one-shots published by Image Comics.\n\nTank Girl: Dirty Helmets - the second Dayglo &amp; Martin one-shot published by Image Comics. It was released in April 2010.\n\nTank Girl: The Royal Escape - a four issue mini-series by Dayglo &amp; Martin, published by IDW from March 2010 - June 2010. A trade paperback collection was released in September 2010, with a UK edition to follow.\n\nTank Girl: Hairy Heroes - the third one-shot published by Image Comics, in August 2010.\n\nTank Girl: Bad Wind Rising - a four issue mini-series by Dayglo &amp; Martin. The first issue was released by Titan Comics in November 2010.\n\nTank Girl: Carioca - a three (double episode) part mini-series drawn by Mick McMahon and written by Alan Martin. The first issue was released by Titan Comics in October 2011.\n\nEverybody Loves Tank Girl - a three-issue mini-series drawn by Jim Mahfood and written by Alan Martin. The first issue was released in July 2012.\n\nSolid State Tank Girl - a four-issue mini-series drawn by Warwick Johnson-Cadwell and written by Alan Martin. First issue from Titan Comics May 2013","torrent":{"xt":"urn:btih:6f219396e49fc7fd5c801703fcde98d114643865","amp;dn":"Tank+Girl+Ultimate+Mega+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f219396e49fc7fd5c801703fcde98d114643865","infoHashBuffer":{"type":"Buffer","data":[111,33,147,150,228,159,199,253,92,128,23,3,252,222,152,209,20,100,56,101]},"announce":[],"urlList":[]}}