{"title":"Diabetes Care, A Practical Manual, 2E Oxford [PDF][StormRG]","uid":11849986,"size":39924748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f2eac29871ec849c8a0f986e19301d68d370434&amp;dn=Diabetes+Care%2C+A+Practical+Manual%2C+2E+Oxford+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"0xmovva","files":2,"time":1430063408,"description":"TITLE/EDITION Diabetes Care: A Practical Manual (Oxford Care Manuals)\nBy: Rowan Hillson.\nSeries: Oxford Care Manuals\nPaperback: 512 pages\nPublisher: Oxford University Press; 2 edition (April 12, 2015)\nLanguage: English\nISBN-10: 0198705638\nISBN-13: 978-0198705635\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nDiabetes is common, chronic, complicated, and costly both to the patient and to the state. It causes distress, disability, and premature death. Most diabetes complications can be prevented or reduced. Diabetes Care Second Edition is a concise and easy-to-read reference source for all aspects of care in the management and understanding of diabetes.\n\nThis pocketbook provides a step-by-step guide to diabetes care for doctors, nurses, and other health care professionals working in primary, community, and secondary care, particularly general practitioners, practice nurses, diabetes specialist nurses, junior hospital doctors, ward nurses, and pharmacists. The author draws on practical experience taking a common-sense approach to the assessment, education, monitoring, and treatment of diabetes across all age groups and ethnic backgrounds. There are detailed sections on helping patients manage their diabetes in everyday life, extensive advice on the monitoring and adjustment of glucose levels, and discussion on the preventing and coping with emergencies. Focus is primarily on the prevention, detection, and treatment of diabetic tissue damage, including heart disease.\n\nThe new edition of Diabetes Care - a Practical Manual provides up-to-date guidance on managing diabetic emergencies including hypoglycaemia and diabetic ketoacidosis, and new advice about diabetes care in A&amp;E and the hospital setting. There is also an expanded section on using data and audit to review and improve care","torrent":{"xt":"urn:btih:6f2eac29871ec849c8a0f986e19301d68d370434","amp;dn":"Diabetes+Care%2C+A+Practical+Manual%2C+2E+Oxford+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f2eac29871ec849c8a0f986e19301d68d370434","infoHashBuffer":{"type":"Buffer","data":[111,46,172,41,135,30,200,73,200,160,249,134,225,147,1,214,141,55,4,52]},"announce":[],"urlList":[]}}