{"title":"Portal Pack (Portal 1 &amp; 2)","uid":7034726,"size":8995515764,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6f3af33b0d2e07c3bdae536df9542337522deac5&amp;dn=Portal+Pack+%28Portal+1+%26amp%3B+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":5,"uploader":"AyrA.ch","files":7,"time":1329339397,"description":"Portal Pack (Portal 1+2)\n========================\nThis Torrent Contains Portal 1 + 2 for Windows\nplease read carefully before downloading\n\nAbout Portal\n------------\nThe following Description applies to both Versions of Portal but was taken from Portal 1:\nIn Portal, the player controls the protagonist, Chell, from a first-person perspective as she is challenged to navigate through a series of rooms using the Aperture Science Handheld Portal Device, or portal gun. The portal gun can create two distinct portal ends, orange and blue. The portals create a visual and physical connection between two different locations in three-dimensional space. Neither end is specifically an entrance or exit; all objects that travel through one portal will exit through the other. An important aspect of the game's physics is momentum redirection. As moving objects pass through portals, they come through the exit portal at the same direction as the exit portal is facing and with the same speed with which they passed through the entrance portal. For example, a common maneuver is to jump down to a portal on the floor and emerge through a wall, flying over a gap or another obstacle. This allows the player to launch objects or Chell herself over great distances, both vertically and horizontally, referred to as 'flinging' by Valve. As GLaDOS puts it, &quot;In layman's terms: speedy thing goes in, speedy thing comes out&quot;. If portal ends are not on parallel planes, the character passing through is reoriented to be upright with respect to gravity after leaving a portal end.\nChell and all other objects in the game that can fit into the portal ends will pass through the portal. However, a portal shot cannot pass through an open portal; it will simply fail or create a new portal in an offset position. If a portal of the same color as an existing one is created, the previous portal is destroyed. Moving objects, glass, special wall surfaces, liquids, or areas that are too small will not accommodate portals. Chell is sometimes provided with cubes that she can pick up and use to climb on or to hold down large buttons that open doors or activate mechanisms. Particle fields known as emancipation grills exist at the end of all and within some test chambers that, when passed through, close any open portals and disintegrate any object carried through. The fields also block attempts to fire portals through them.\nAlthough Chell is equipped with mechanized heel springs to prevent damage from falling,[13] she can be killed by various other hazards in the test chambers, such as turret guns, bouncing balls of energy, and toxic liquid. She can also be killed by objects falling through portals, and by a series of crushers that appear in certain levels. Unlike most action games, there is no visible amount of health; Chell dies if she is dealt a certain amount of damage in a short time period, but returns to full health fairly quickly. Some obstacles, such as the energy balls and crushing pistons, will deal this necessary amount of damage with a single blow, thus causing instant death.\n\nNo matter if you play Portal 1 or 2 first, the Game makes more sense if played in order and it makes more fun, because the Graphics and story line in Portal 2 are better than in Portal 1.\n\nInformations\n------------\nSize: 8.37 GB\nOS: Windows XP or newer (Tested with 32 and 64 bit)\nForm: Installer\nPortal 1 Dialogue: English\nPortal 1 Menu and Subtitles: German\nPortal 2 Dialogue: German, English, French, Russian\nPortal 2 Menu and Subtitles: German, English, French, Russian\n\nInstallation\n------------\nPortal 1 and 2 are packed in seperate installers.\nJust install and Launch. The Game is pre-cracked.\nThe Game was tested on Windows XP 32 Bit and Windows 7 64 Bit.","torrent":{"xt":"urn:btih:6f3af33b0d2e07c3bdae536df9542337522deac5","amp;dn":"Portal+Pack+%28Portal+1+%26amp%3B+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3af33b0d2e07c3bdae536df9542337522deac5","infoHashBuffer":{"type":"Buffer","data":[111,58,243,59,13,46,7,195,189,174,83,109,249,84,35,55,82,45,234,197]},"announce":[],"urlList":[]}}