{"title":"Buddhism - One Teacher, Many Traditions (gnv64)","uid":11881508,"size":25253472,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f3e15324703705fced9f86fc63e055cc0e5ef1f&amp;dn=Buddhism+-+One+Teacher%2C+Many+Traditions+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"gnv65","files":5,"time":1430715885,"description":"Buddhism: One Teacher, Many Traditions\nby His Holiness the Dalai Lama and Thubten Chodron\nWisdom Publications | November 2014 | ISBN-10: 1614291276 | ePUB/converted PDF | 9.44/14.4 mb\n\nExplore the common ground underlying the diverse expressions of the Buddha's teachings with two of Tibetan Buddhism's bestselling authors.\n\nBuddhism is practiced by hundreds of millions of people worldwide, from Tibetan caves to Tokyo temples to redwood retreats. To an outside viewer, it might be hard to see what they all have in common. In Buddhism, His Holiness the Dalai Lama and American Buddhist nun Thubten Chodron map out with clarity the convergences and the divergences between the two major strains of Buddhism--the Mahayana traditions of Central and East Asia and the Theravada traditions of South and Southeast Asia. Especially deep consideration is given to the foundational Indian traditions and their respective treatment of such central tenets as\n- the four noble truths\n- the practice of meditation\n- the meaning of nirvana\n- enlightenment.\nThe authors seek harmony and greater understanding among Buddhist traditions worldwide, illuminating the rich benefits of respectful dialogue and the many ways that Buddhists of all stripes share a common heritage and common goals.\n\nAbout the Authors\nThe Dalai Lama is the spiritual leader of the Tibetan people. A beacon of inspiration for both Buddhists and non-Buddhists, he has persistently reached out across religious lines and to political leaders and scientists in dialogues advancing peace and understanding. For sixty years, he was the political leader of the Tibetan people, and in 1989 he was awarded the Nobel Peace Prize for his efforts to secure a peaceful resolution to the Chinese occupation of his homeland.\nVenerable Thubten Chodron, born 1950, has been a Buddhist nun since 1977. A native of Los Angeles and a graduate of UCLA, she is the founder and abbess of Sravasti Abbey in eastern Washington State. She is a popular speaker for her practical explanations of how to apply Buddhist teachings in daily life, and she is the author of several bestselling books, including Buddhism for Beginners. She lives in Newport, WA.\n\nCONTENTS\nForeword by Bhante Gunaratana\nPrologue by His Holiness the Dalai Lama\nPreface by Venerable Thubten Chodron\nAbbreviations\n1. ORIGIN AND SPREAD OF THE BUDDHA'S DOCTRINE\n2. REFUGE IN THE THREE JEWELS\n3. SIXTEEN ArrRIBUTES OF THE FOUR TRUTHS\n4. THE HIGHER TRAINING IN ETHICAL CONDUCT\n5. THE HIGHER TRAINING IN CONCENTRATION\n6. THE HIGHER TRAINING IN WISDOM: THIRTY-SEVEN AIDS TO AWAKENING\n7. SELFLESSNESS AND EMPTINESS\n8. DEPENDENT ARISING\n9. UNITING SERENITY AND INSIGHT\n10, PROGRESSING ON THE PATH\n11. THE FOUR IMMEASURABlES\n12. BODHICITTA\n13. BODHISATTVA TRAINING INTHE PERFECTIONS\n14. THE POSSIBILITY OF AWAKENING AND BUDDHA NATURE\n15. TANTRA\n16. CONCLUSION\nNotes\nIndex\n &lt;a href=&quot;\nhttp://s9.postimg.org/oozi4dqy7/Buddhism_One_Teacher_Many_Traditions.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s9.postimg.org/oozi4dqy7/Buddhism_One_Teacher_Many_Traditions.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:6f3e15324703705fced9f86fc63e055cc0e5ef1f","amp;dn":"Buddhism+-+One+Teacher%2C+Many+Traditions+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3e15324703705fced9f86fc63e055cc0e5ef1f","infoHashBuffer":{"type":"Buffer","data":[111,62,21,50,71,3,112,95,206,217,248,111,198,62,5,92,192,229,239,31]},"announce":[],"urlList":[]}}