{"title":"Braquo Season 1","uid":9836145,"size":6262802012,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6f5ca3702035bee87ec53d0544033cd376d3ceda&amp;dn=Braquo+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":6,"uploader":"mtcp56","files":16,"time":1395915705,"description":"New HD upload of Season 1 of acclaimed cop drama Braquo.  MP4 video tagged and sequenced for iTunes, with episode info and cover art.  All subtitles are soft coded to with Subler (and re-timed) and are available in the torrent as individual SRT files.  \n\n\nDESCRIPTION FROM AMAZON: \n\nA dark realistic cop series from world-famous filmmaker and former police office Olivier Marchal. Braquo (slang for Heist) follows a squad of Paris cops who exist in the blurred boundaries at the very edge of the law, often using violence and intimidation to get the job done. \n\nThe lives of these officers change radically when their squad leader, falsely accused of corruption, commits suicide. Determined to clear his name they start an investigation of their own, only to find that the police department itself stands in their way. Driven by adrenaline and a thirst for justice, they must turn their backs on the laws they re sworn to enforce if they are to uncover the truth. \n\nFacing constant danger from all sides - and with the two most likely outcomes being imprisonment or death the stakes couldn t be higher, but that merely serves to crank up the tension in this acclaimed series.\n","torrent":{"xt":"urn:btih:6f5ca3702035bee87ec53d0544033cd376d3ceda","amp;dn":"Braquo+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f5ca3702035bee87ec53d0544033cd376d3ceda","infoHashBuffer":{"type":"Buffer","data":[111,92,163,112,32,53,190,232,126,197,61,5,68,3,60,211,118,211,206,218]},"announce":[],"urlList":[]}}