{"title":"PetiteHDPorn - Gia Paige, Kirsten Lee (Bathing Beauties) NEW 07","uid":15777047,"size":339786501,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6f693df56fd37fd3d91ef618d8f54cb5d8320d5a&amp;dn=PetiteHDPorn+-+Gia+Paige%2C+Kirsten+Lee+%28Bathing+Beauties%29+NEW+07+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"xxxlavalxxx","files":2,"time":1473244966,"description":"College is fun when you and your roommate can get each other off! Kirsten Lee and Gia Paige enjoy a lusty lesbian session in the shower complete with masturbating each other's soft bare pussies and dropping to their knees to eat each other out. Their makeout session is awesome, but neither Kirsten nor Gia feels totally fulfilled. Hand in hand, they leave the shower and join Preston Parker in the bedroom for some real fun.Kicking things off with a double blowjob, the two horny coeds lick and suck Preston to total hardness. Then Kirsten is the first to climb aboard for a stiffie ride while Gia rubs her clit to help her get closer to getting off. Then Gia gets on her knees to let Preston take her from behind. That puts her face in the perfect position to eat Kirsten out for all of their pleasure.The fuck fest continues with Preston doing whatever it takes to get his two fillies off. When he has seen to their pleasure, they are quick to return the favor. They get on their knees to resume their double blowjob, working him to the very brink of cumming and then using their hands to send him over so that he can cover both of their faces in a fountain of jizz.\r\nCategories: Small Boobs Puffy Nipples Shaved Pussy Short Girls Brunette Blonde Long hair Wet Hardcore Lesbian Petite Girl-Girl-Boy Blowjob Facial Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=99403989665516495160.jpg\r\n \nhttp://imgdone.com/viewer.php?file=05699912085901855358.jpg","torrent":{"xt":"urn:btih:6f693df56fd37fd3d91ef618d8f54cb5d8320d5a","amp;dn":"PetiteHDPorn+-+Gia+Paige%2C+Kirsten+Lee+%28Bathing+Beauties%29+NEW+07+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f693df56fd37fd3d91ef618d8f54cb5d8320d5a","infoHashBuffer":{"type":"Buffer","data":[111,105,61,245,111,211,127,211,217,30,246,24,216,245,76,181,216,50,13,90]},"announce":[],"urlList":[]}}