{"title":"Traffic - John Barleycorn Must Die [320k MP3]","uid":8536907,"size":144279035,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6f88d7ca90aead564267d9a51e24cfe4100c43c0&amp;dn=Traffic+-+John+Barleycorn+Must+Die+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"smbdownload","files":-1,"time":1370285134,"description":"John Barleycorn Must Die is the fourth album by the English rock band Traffic, released in 1970, on Island Records in the United Kingdom, and United Artists in the United States, catalogue UAS 5504. It peaked at number 5 on the Billboard 200, their highest charting album in the US, and has been certified a gold record by the RIAA. In addition, the single &quot;Empty Pages&quot; spent eight weeks on the Billboard Hot 100, peaking at number 74. The album was marginally less successful in the UK, reaching number 11 on the UK Albums Chart.\n\nIn late 1968, Traffic disbanded, guitarist Dave Mason having left the group for the second time prior to the completion of the Traffic album. In 1969, Steve Winwood joined the supergroup Blind Faith, while drummer/lyricist Jim Capaldi and woodwinds player Chris Wood turned to session work. Wood and Winwood also joined Blind Faith's drummer Ginger Baker in his post-Blind Faith group Ginger Baker's Air Force for their first album. \n\nIn the beginning of 1970, after the demise of Blind Faith, the band having lasted barely six months, Winwood returned to the studio ostensibly to make his first solo album, originally to be titled Mad Shadows. He recorded two tracks with producer Guy Stevens, &quot;Stranger to Himself&quot; and &quot;Every Mother's Son&quot;, but yearned for like-minded musicians to accompany. Inviting Wood and Capaldi to join him, Winwood's solo album became the reunion of Traffic, and a re-launch of the band's career. \n\nAs did most of their albums, it featured influences from jazz and blues, but the version of the traditional English folk tune &quot;John Barleycorn&quot; also showed the musicians attending to the same strains of folk baroque and electric folk as contemporary British bands Pentangle and Fairport Convention.\n\nTrack Listing [320k MP3] [2008 Japanese SHM-CD]\n\n&quot;Glad&quot; (Winwood) 6:59\n&quot;Freedom Rider&quot; (Capaldi/Winwood) 5:30\n&quot;Empty Pages&quot; (Capaldi/Winwood) 4:34\n&quot;I Just Want You to Know&quot; (Capaldi/Winwood) 1:30  \n&quot;Stranger to Himself&quot; (Capaldi/Winwood) 3:57\n&quot;John Barleycorn&quot; (Traditional/Winwood) 6:27\n&quot;Every Mother's Son&quot; (Capaldi/Winwood) 7:08\n&quot;Sittin' Here Thinkin' of My Love&quot; (Capaldi/Winwood) 3:33\n&quot;Backstage and Introduction (live)&quot; (Capaldi/Winwood) 1:50\n&quot;Who Knows What Tomorrow May Bring (live)&quot; (Capaldi/Winwood/Wood) 6:56\n&quot;Glad (live)&quot; (Winwood) 11:29 ","torrent":{"xt":"urn:btih:6f88d7ca90aead564267d9a51e24cfe4100c43c0","amp;dn":"Traffic+-+John+Barleycorn+Must+Die+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f88d7ca90aead564267d9a51e24cfe4100c43c0","infoHashBuffer":{"type":"Buffer","data":[111,136,215,202,144,174,173,86,66,103,217,165,30,36,207,228,16,12,67,192]},"announce":[],"urlList":[]}}