{"title":"Tom Cochrane &amp; Red Rider - Trapeze (Greatest Hits)[FLAC] Kitlope","uid":4786049,"size":952629009,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6fed905356b843b3718517059172216c68110d1b&amp;dn=Tom+Cochrane+%26+Red+Rider+-+Trapeze+%28Greatest+Hits%29%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":4,"uploader":"Kitlope","files":37,"time":1237556327,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 6FED905356B843B3718517059172216C68110D1B\nFile Size: 908.49 Mb\nYear: 2002\nLabel: Capitol/Universal/EMI\nCatalog #: 7 24354 17542 8\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\n\nTom Cochrane, OC (born May 14, 1953) is a Canadian singer-songwriter and musician, best known for his hit songs &quot;Life Is a Highway&quot;, &quot;Lunatic Fringe&quot;, &quot;White Hot&quot;, &quot;Boy Inside the Man&quot;, &quot;Big League&quot; and &quot;I Wish You Well&quot;. Cochrane fronted the Canadian rock band Red Rider and has won seven Juno Awards. He is a member of the Canadian Music Hall of Fame, an Officer of the Order of Canada, an Honorary Colonel in the Canadian Air Force and has an Honorary Doctorate from Brandon University.\n\n\n\n\nBiography\n\n\n\n\nEarly life\n\n\nCochrane was born in Lynn Lake, Manitoba, to Violet and Tuck Cochrane, a bush pilot. The family relocated to Acton, Ontario, when Tom was four years old and later to Etobicoke, Ontario. He purchased his first guitar at age 11 by selling a toy train set. Cochrane attended Martingrove Collegiate Institute in the late 1960s. In the early 1970s, he was performing in coffee houses across Canada. He eventually made his way to Los Angeles where he found a job writing theme music for My Pleasure Is My Business, a Xaviera Hollander movie. Unable to find steady income from music, Cochrane returned to Toronto, where he drove a taxi cab and later took a job on a Caribbean cruise liner to help pay the bills.\n\n\n\n\nRed Rider\n\n\nAfter meeting at the famous El Mocambo Tavern in Toronto, Cochrane joined the Canadian Rock Band Red Rider in 1978 and served as their lead singer and main songwriter for more than 10 years. Red Rider included Ken Greer, Jeff Jones, Peter Boynton and Rob Baker. Bruce Allen managed the band from their debut until 1985. Cochrane recorded 6 studio albums with Red Rider plus a live album, a best of album and a box set. In 2002, Cochrane reunited with his former Red Rider bandmates Greer and Jones and continues to perform with them today. A complete listing of Red Rider's recordings is included below.\n\n\n\n\n\nSolo Career\n\n\nAlready a household name in Canada from his time with Red Rider, Cochrane launched his solo career in 1991 with the release of the song &quot;Life is a Highway&quot;. The single became a global success and was followed by the release of his &quot;Mad Mad World&quot; album, which would reach the 6 million mark in worldwide sales. The albums &quot;Ragged Ass Road&quot;, &quot;Songs of a Circling Spirit&quot;, &quot;X-Ray Sierra&quot; and &quot;No Stranger&quot; followed. Cochrane's massive body of music and energetic live shows have established him as one of Canada's most-treasured artists.\n\n\n\n\nToday\n\n\nAn avid golfer, pilot and hockey buff, Cochrane lives in Oakville, Ontario and spends summers at his cottage/studio on the shores of Georgian Bay in Northern Ontario and winters part time at his home outside of Austin, Texas. Tom and his wife, Kathleene have two daughters, Cody and Evanne. Cochrane continues to tour and perform in Canada where he remains one of the country's most popular live acts.\n\n\n\n\n\nHonours \n\n\nCanadian Music Hall of Fame Induction: Cochrane was inducted into the Canadian Music Hall of Fame in 2003 for outstanding contribution to the greater recognition of Canadian music. The ceremony took place April 5, 2003 at Casino du Lac-Meamy in Gatineau, Quebec. The following night, Cochrane was honoured for his induction in a speech by Jeff Healey at the Juno Awards at the Corel Centre (now Scotiabank Place in Ottawa). Cochrane closed the show by performing a medley of his hits and was joined onstage by host Shania Twain for the final song, &quot;Life Is A Highway&quot;.\n\nOrder of Canada: In April of 2008, Cochrane received the highest honour for a Canadian Citizen when he was invested as an Officer of the Order of Canada. Cochrane was honoured for a lifetime of charity work, his contribution to the arts and for being unabashedly Canadian.\n\nHonorary Colonel: In November of 2007, Cochrane was formally invested as an Honorary Colonel (HCol) by the Canadian Air Force's 409 &quot;Nighthawks&quot; Tactical Fighter Squadron. As part of his investiture weekend, Cochrane experienced his second flight in a CF-18.\n\nHonorary Doctorate: In May of 2005, Cochrane received an Honorary Doctorate from Brandon University in Brandon, Manitoba. In addition, musician James Ehnes, journalist Henry Champ and actress Shirley Douglas received Honorary Doctorates from the University at the Spring Convocation held May 28, 2005.\n\nCanadian Music Industry Humanitarian Award: In March of 2005, Cochrane received the Humanitarian Award at the Canadian Music Industry Assoication's (CMIA) gala dinner in Toronto during the annual Canadian Music Week Festival.\n\n\n\n\nCharity\n\n\nCochrane has been a longtime supporter of World Vision and has traveled to Africa several times. He has also served as the Honorary Chairman of the SuperWalk for Parkinsons and has been a proud supporter of WSPA, War Child, Amnesty International, and the Make Poverty History campaign.\n\nCanada For Asia: On January 13, 2005, Cochrane and his wife, Kathleene spearheaded a benefit concert in support of tsunami relief in Asia. 150 Canadian stars appeared including Anne Murray, Bryan Adams, Blue Rodeo, The Tragically Hip, Oscar Peterson, Celine Dion, Rush and Barenaked Ladies. The concert, which was produced and televised by CBC TV, raised over $4 million in pledges.\n\nLive 8 Concert: On July 2, 2005, Cochrane kicked off the Canadian edition of the Live 8 benefit concerts in Barrie, Ontario performing his hits &quot;Life Is A Highway&quot; and &quot;No Regrets&quot;. The Live 8 concerts took place in the G8 states and in South Africa to pressure world leaders to drop the debt of the world's poorest nations, increase and improve aid, and negotiate fair trade rules in the interest of the poorest countries. \n\n\n\n\nTrapeze\n\nTrapeze-Tom Cochrane &amp; Red Rider (greatest hits): Released by Capital Records in 2002, this 2-disc set included all of Cochrane biggest hits with Red Rider and from his solo career. Two new songs were included in the set: &quot;Pictures from the Edge&quot; and &quot;Just Like Ali&quot;, which Cochrane dedicated to his late father and Muhammad Ali.\n\n\n\n\nTracks: \n\n\nDisc: 1 \n\n\n1. White Hot \n2. Avenue a \n3. Lunatic Fringe \n4. Light in the Tunnel \n5. Power (Strength in Numbers) \n6. Human Race \n7. Can't Turn Back \n8. Napoleon Sheds His Skin \n9. Neruda \n10. Young Thing, Wild Dreams (Rock Me) \n11. Boy Inside the Man \n12. Untouchable One \n13. Ocean Blues (Emotion Blues) \n14. Big League \n15. Victory Day \n16. Good Times \n17. Just Like Ali \n\n\nDisc: 2 \n\n\n1. Life Is a Highway \n2. Mad Mad World \n3. No Regrets \n4. Sinking Like a Sunset \n5. Washed Away \n6. Brave and Crazy \n7. I Wish You Well \n8. Wildest Dreams \n9. Paper Tigers \n10. Dreamer's Dream \n11. I Wonder \n12. Stonecutter's Arms \n13. Pictures from the Edge \n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:6fed905356b843b3718517059172216c68110d1b","amp;dn":"Tom+Cochrane+%26+Red+Rider+-+Trapeze+%28Greatest+Hits%29%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fed905356b843b3718517059172216c68110d1b","infoHashBuffer":{"type":"Buffer","data":[111,237,144,83,86,184,67,179,113,133,23,5,145,114,33,108,104,17,13,27]},"announce":[],"urlList":[]}}