{"title":"Tawny Man Trilogy by Robin Hobb","uid":7993061,"size":2491671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70326afd8ef90ced898d8a7e55dc9867459af497&amp;dn=Tawny+Man+Trilogy+by+Robin+Hobb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"NewSky000","files":4,"time":1357535007,"description":"Title: Tawny Man Trilogy by Robin Hobb\n\nBooks: Fool's Errand, Golden Fool, Fool's Fate\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Fantasy, Sci-Fi, Epic, Adventure\n\nSummary:\n\nIn Fool's Errand, first of the &quot;Tawny Man&quot; trilogy, Robin Hobb brings back Fitz, hero of her emotionally powerful and intrigue-filled Assassin trilogy, from 15 years of self-imposed exile from his royal relations and from the world of power. Hobb is particularly good at the passage of time and the things it does not change; Fitz plausibly thinks of himself as older and more settled than he actually is. She is also good on the actual changes--Fitz's mentor Chade is teetering on the brink of old age and his androgynous ally the Fool has returned to court as the fop Lord Golden; these are characters we cared about before and she makes it matter that they have aged or altered. Fitz is bonded by Wit to a wolf; the heir, Prince Dutiful, the son he never saw, is adrift with his own Wit in a world where people get lynched for it. Hobb's leisurely story-telling never lacks urgency and menace; this is a humane book which includes nightmarish touches along the way. Her sense of the world of magic and the world of political power is acute--she makes us see more than her flawed hero, even though we share his eyes.--Roz Kaveney. - Goodreads Summary of Fool's Errand (Tawny Man Trilogy #1)\n\nNote: This trilogy takes place after Robin Hobbs Farseer Trilogy. It is recommended to read that first to get a better grasp of what goes on in this trilogy.\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:70326afd8ef90ced898d8a7e55dc9867459af497","amp;dn":"Tawny+Man+Trilogy+by+Robin+Hobb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70326afd8ef90ced898d8a7e55dc9867459af497","infoHashBuffer":{"type":"Buffer","data":[112,50,106,253,142,249,12,237,137,141,138,126,85,220,152,103,69,154,244,151]},"announce":[],"urlList":[]}}