{"title":"El.Cid.[dvdrip][spanish]","uid":5943400,"size":733433856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7085df95e7adadec827ea0d1896bbdcf971f6a31&amp;dn=El.Cid.%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"furtaperas","files":-1,"time":1289261968,"description":"TÃƒÂ­tulo :\nEl Cid, la leyenda\n\nAÃƒÂ±o :\n2003\n\nPais :\nEspaÃƒÂ±a\nDuraciÃƒÂ³n :\n82 min.\nCalificaciÃƒÂ³n :\nTodos los pÃƒÂºblicos\nGÃƒÂ©nero :\nInfantil y AnimaciÃƒÂ³n\nDirector :\nPozo, JosÃƒÂ©.\n\nActores :\nFuentes, Manel. Verbeke, Natalia, LeÃƒÂ³n, Loles. Gracia, Sancho. Latre, Carlos.\n\n\nSinopsis :\nRodrigo es un perfecto candidato a hÃƒÂ©roe. Hijo de un noble castellano, su vida transcurre entre la educaciÃƒÂ³n en la corte, las aventuras que comparte con su mejor amigo Sancho y las furtivas visitas a su amada Gimena, la hija del Conde de Gormaz. A Rodrigo, apuesto, joven, divertido y valiente, se le presenta un futuro resplandeciente.\nPero los tiempos de felicidad no duran eternamente, y tras la muerte del Rey Fernando, Rodrigo se ve envuelto en un mundo de tramas y conspiraciones que acabarÃƒÂ¡n con la vida de Sancho y la consiguiente coronaciÃƒÂ³n del infante Alfonso. De repente, Rodrigo pierde todo aquello que ha adquirido sin esfuerzo, su mejor amigo y el amor de su amada Gimena, siendo injustamente desterrado de Castilla y sin honor.\nAlejado de su hogar y en territorio hostil, RodrÃƒÂ­go y unos pocos hombres, con la especial ayuda del principe Al-Mutamin, inician una aventura llena de acciÃƒÂ³n y pasiÃƒÂ³n que jamÃƒÂ¡s olvidarÃƒÂ¡n, recuperando territorios y haciendo frente al temible Ben Yussuff, acÃƒÂ©rrimo enemigo del flamante Rey Alfonso, y empeÃƒÂ±ado en conquistar toda la penÃƒÂ­nsula.\nEn su esfuerzo por reclamar el perdÃƒÂ³n de su Rey, y en busca de recuperar su posiciÃƒÂ³n y el amor de Gimena, Rodrigo descubre los profundos valores universales de la amistad y el honor.","torrent":{"xt":"urn:btih:7085df95e7adadec827ea0d1896bbdcf971f6a31","amp;dn":"El.Cid.%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7085df95e7adadec827ea0d1896bbdcf971f6a31","infoHashBuffer":{"type":"Buffer","data":[112,133,223,149,231,173,173,236,130,126,160,209,137,107,189,207,151,31,106,49]},"announce":[],"urlList":[]}}