{"title":"Radical Face - Ghost (2006) [FLAC]","uid":9103040,"size":293896027,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7170b68696335c9f8bbfbd3d0ef0bc9e6e13b8f0&amp;dn=Radical+Face+-+Ghost+%282006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":5,"uploader":"politux","files":-1,"time":1382805896,"description":"\n  Radical Face - Ghost (2006) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Indie Electronic\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16 \n  Sampling Rate: 44,100 Hz\n\n  01 Asleep on a Train \n  02 Welcome Home \n  03 Let the River In \n  04 Glory \n  05 The Strangest Things \n  06 Wrapped in Piano Strings \n  07 Along the Road \n  08 Haunted\n  09 Winter Is Coming \n  10 Sleepwalking \n  11 Homesick \n\n  Ben Cooper has a few names he works under; as Radical Face, he creates an album that's possibly one of the best debut takes on whatever the word Americana is supposed to represent in the 21st century. But instead of dour re-creations of music that even Uncle Tupelo would have rejected, Ghost is something that lives up to its name -- a strange, murky presence that sometimes is not entirely there, but in the best, most suggestive way. Cooper's singing is understated but sweetly calming, a gentle glaze that recalls the not-quite-shoegaze of many early-'90s U.S. acts that rejected grunge and lo-fi for another approach. Meanwhile, the music is equally cool but hardly cold, a carefully detailed combination of instrumentation that lightly references everything from late-'60s Beach Boys to late-'90s Mogwai in its cinematic scope -- banjos sit well against building drums, strings suddenly appear to add piercing emphasis, and there's a definite hint here and there of Dave Fridmann's full-on widescreen production style on songs like &quot;Glory.&quot; Yet even more strikingly, there's a real joy that suffuses much of the record, as can be heard on the chorus of &quot;Welcome Home.&quot; After so much post-Polyphonic Spree &quot;uplifting&quot; chorale hash infesting NPR-ized rock &amp; roll, the gentle but still exultant beauty here is something special, a blend of vocals, banjo, handclaps and piano that sounds all the better for being a carefully arranged collage. The album's downside is a certain sameness in sound that gets the better of it toward the end -- some songs like &quot;Along the Road&quot; would almost work better separately than in context as a result -- but Ghost is a promising start for Cooper's latest incarnation.","torrent":{"xt":"urn:btih:7170b68696335c9f8bbfbd3d0ef0bc9e6e13b8f0","amp;dn":"Radical+Face+-+Ghost+%282006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7170b68696335c9f8bbfbd3d0ef0bc9e6e13b8f0","infoHashBuffer":{"type":"Buffer","data":[113,112,182,134,150,51,92,159,139,191,189,61,14,240,188,158,110,19,184,240]},"announce":[],"urlList":[]}}