{"title":"The Cuckoo's Calling (Audiobook)","uid":8700411,"size":457851357,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7187204d9163174df8900fd6c5542e28c118a611&amp;dn=The+Cuckoo%27s+Calling+%28Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"penelope13","files":-1,"time":1374054626,"description":"The Cuckoo's Calling \n \nWritten by Robert Galbraith \n\nRead by Robert Glenister \n\n\nPublished by Hachette Audio (April 30, 2013)\n  \nLength: 15 hours, 54 minutes\n\nUNABRIDGED Audiobook\n\n\nA brilliant debut mystery in a classic vein: Detective Cormoran Strike investigates a supermodel's suicide.\n\nAfter losing his leg to a land mine in Afghanistan, Cormoran Strike is barely scraping by as a private investigator. Strike is down to one client, and creditors are calling. He has also just broken up with his longtime girlfriend and is living in his office. Then John Bristow walks through his door with an amazing story: his sister, the legendary supermodel Lula Landry, known to her friends as the Cuckoo, famously fell to her death a few months earlier. The police ruled it a suicide, but John refuses to believe that. The case plunges Strike into the world of multimillionaire beauties, rock-star boyfriends, and desperate designers, and it introduces him to every variety of pleasure, enticement, seduction, and delusion known to man.\n\nYou may think you know detectives, but you've never met one quite like Strike. You may think you know about the wealthy and famous, but you've never seen them under an investigation like this. \n\nIntroducing Cormoran Strike, this is the acclaimed first crime novel by J.K. Rowling, writing under the pseudonym Robert Galbraith.\n\n\n\nFile format:  mp3  (64.0 Kbps, vbr, 24.0 KHz, 2 Channels, Joint Stereo)\n\n","torrent":{"xt":"urn:btih:7187204d9163174df8900fd6c5542e28c118a611","amp;dn":"The+Cuckoo%27s+Calling+%28Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7187204d9163174df8900fd6c5542e28c118a611","infoHashBuffer":{"type":"Buffer","data":[113,135,32,77,145,99,23,77,248,144,15,214,197,84,46,40,193,24,166,17]},"announce":[],"urlList":[]}}