{"title":"The Forsyte Saga   (2002 - Complete Mini-Series)","uid":6747969,"size":12935109508,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:71dec903b03d8ec7fe3094a169c9cf8c0981959c&amp;dn=The+Forsyte+Saga+++%282002+-+Complete+Mini-Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":8,"uploader":"rosie1966","files":14,"time":1318775413,"description":"The Forsyte Saga\n\n2002 TV mini-series in Matroska format - English Audio - Optional Dutch subs\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0260615/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0260615/&lt;/a&gt;\n\nThe Forsyte Saga is an immense drama of sex, power, and money. It chronicles the lives of three generations of a powerful Victorian family. Superior, arrogant and confident on the surface, beneath the imposing veneer lies a festering core of unhappy and brutal relationships, riddled with jealousies and tensions.\n\nAt that heart of the Saga is Soames Forsyte, a rich and successful partner in the family law firm and a staunch upholder of the old moral code. But his fiery, tormented relationship with his beautiful wife Irene upsets his complacency and, as Irene embarks on a passionate affair, the Forsyte Family is cruelly ripped apart in a bitter feud.\n\nA classic of English literature, The Forsyte Saga paints a fascinating picture of early twentieth century London life, charting the progress of a great dynasty from the height of the Victorian era through the turbulent transition into the modern age. The Forsyte Saga is a compelling drama of love, adultery, obsession and deceit, providing an enticing glimpse into a passionate and flamboyant existence.\n\n\nGranada Television's adaptation of The Forsyte Saga achieved the seemingly impossible in Spring 2002, matching the BBC's 35-year-old black-and-white classic version with a richly cast and superbly directed take on John Galsworthy's novels. The Forsyte Saga is nothing if not superior soap opera. It could all have gone horribly wrong, haunted by the spectre of its BBC predecessor--a television legend for anyone over 40. Instead, it succeeds entirely on its own merits with scarcely a weak link; from Stephen Mallatratt's taut and fluid script to David Moore's carefully measured, seamess direction.\n\nRisks were taken to banish the old ghosts, particularly in the casting. In the event, Damian Lewis' repressed Soames and Gina McKee as his ill-matched bride, the enigmatic Irene, are inspired choices delivering complex portraits of unhappy, damaged human beings who deserve our sympathy. In a sea of marvellous cameos and splendid acting, the top honours go to Corin Redgrave and Rupert Graves for their hauntingly sensitive interpretations of Old and Young Jolyon, as well as to Amanda Root's increasingly exasperated Winifred; and Gillian Kearney's sharply intelligent and worldly June. All rounded characters without a weakly written cipher in sight.\n\nMKV format - Video codec H.264\nPicture size 720 x 576\nAudio AC3 English - Dolby Pro Logic 160 Kbps\nSubs: Dutch\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:71dec903b03d8ec7fe3094a169c9cf8c0981959c","amp;dn":"The+Forsyte+Saga+++%282002+-+Complete+Mini-Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71dec903b03d8ec7fe3094a169c9cf8c0981959c","infoHashBuffer":{"type":"Buffer","data":[113,222,201,3,176,61,142,199,254,48,148,161,105,201,207,140,9,129,149,156]},"announce":[],"urlList":[]}}