{"title":"Servants of the People: The Inside Story of New Labour","uid":15854568,"size":1304909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71e4016e369d93c3858dcf2af5b5689a788f9bcb&amp;dn=Servants+of+the+People%3A+The+Inside+Story+of+New+Labour&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"marty14","files":1,"time":1474226240,"description":"Servants of the People: The Inside Story of New Labour - Andrew Rawnsley [epub]\r\n\r\nAndrew Rawnsley's Servants of the People is a timely and fascinating look at New Labour. Every new government promises to represent a new dawn, but for New Labour it was the Covenant that Tony Blair made with Britain. The party that won a landslide victory on May Day 1997 made the special claim that it represented a decisive break with the disappointments of the old left and the old right: its Third Way would transcend both.\r\n\r\nHaving fashioned an extraordinarily wide coalition to secure power, New Labour would hold it as Servants of the People. Was that a grandiloquent way of saying the government would be enslaved to the opinion polls? Or has Tony Blair been pursuing a strategic plan, breathtaking in its audacity, to remake the political landscape of Britain in the third millennium?\r\n\r\n'Downing Street is said to be 'furious' at this book - and it is easy to understand why. It is the first meticulous chronicle of all that has happened since that bright May Day three years ago which first brought the Blair government to office'\r\n- Anthony Howard, Sunday Times\r\n\r\nAndrew Rawnsley is associate editor and chief political commentator for the Observer. For many years he presented BBC Radio 4's Sunday evening Westminster Hour, and he has also made a number of highly acclaimed television documentaries","torrent":{"xt":"urn:btih:71e4016e369d93c3858dcf2af5b5689a788f9bcb","amp;dn":"Servants+of+the+People%3A+The+Inside+Story+of+New+Labour","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e4016e369d93c3858dcf2af5b5689a788f9bcb","infoHashBuffer":{"type":"Buffer","data":[113,228,1,110,54,157,147,195,133,141,207,42,245,181,104,154,120,143,155,203]},"announce":[],"urlList":[]}}