{"title":"William Butler Yeats - Nobel Prize in Literature 1923 (21 books)","uid":11856579,"size":97344616,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71e718247d7388198d5dd888d671963983c2d258&amp;dn=William+Butler+Yeats+-+Nobel+Prize+in+Literature+1923+%2821+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"workerbee","files":56,"time":1430172771,"description":"\nWILLIAM BUTLER YEATS (1865-1939) was an Irish poet/playwright and one of the foremost figures of 20th century literature.  He was awarded the 1923 Nobel Prize in Literature &quot;for his always inspired poetry, which in a highly artistic form gives expression to the spirit of a whole nation.&quot;\n\nA pillar of both the Irish and British literary establishments, in his later years he served as an Irish Senator for two terms.  Yeats was a driving force behind the Irish Literary Revival and, along with Lady Gregory, Edward Martyn, and others, founded the Abbey Theatre, where he served as its chief during its early years.  Yeats is generally considered one of the few writers who completed their greatest works after being awarded the Nobel Prize; such works include &quot;The Tower&quot; (1928) and &quot;The Winding Stair &amp; Other Poems&quot; (1929).\n\nHere are several editions of his complete poetry and plays, including the unpublished early poetry.  But the centerpiece of this torrent is THE COLLECTED WORKS OF W. B. YEATS a 14-volume series (in progress) under the general editorship of eminent Yeats scholar George Bornstein and formerly the late Richard J. Finneran and George Mills Harper.  All the published volumes to-date (April 2015) are included here -- with a very special thanks for the invaluable help supplied by nnikif!\n\n\nThe following books are in ePUB/MOBI or PDF format as indicated:\n\n* COLLECTED PLAYS (Macmillan, 1953). -- PDF\n\n* COLLECTED POEMS (Scribner, 1996).  Revised Second Edition.  Edited by Richard J. Finneran. -- PDF\n\n* COLLECTED WORKS, Vol. I: The Poems (Scribner, 2010).  Revised Second Edition, edited by Richard J. Finneran. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. II: The Plays (Scribner, 2001).  Edited by David R. Clark and Rosalind E. Clark. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. III: Autobiographies (Scribner, 1999).  Edited by Douglas Archibald and William O'Donnell. -- ePUB/MOBI + PDF\n\n* COLLECTED WORKS, Vol. IV: Early Essays (Scribner, 2007).  Edited by Richard J. Finneran and George Bornstein. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. V: Later Essays (Scribner, 1994).  Edited by William H. O'Donnell. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. VI: Prefaces and Introductions (Scribner, 1989).  Edited by William H. O'Donnell. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. VIII: The Irish Dramatic Movement (Scribner, 2003).  Edited by Richard J. Finneran and Mary Fitzgerald. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. IX: Early Articles and Reviews (Scribner, 2004).  Edited by John P. Frayne and Madeleine Marchaterre. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. X: Later Articles and Reviews (Scribner, 2000).  Edited by Colton Johnson. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. XII: John Sherman and Dhoya (Scribner, 1991).  Edited by Richard J. Finnerman. -- ePUB/MOBI\n\n* COLLECTED WORKS, Vol. XIII: A Vision (The Original 1925 Version) (Scribner, 2008).  Edited by Catherine T. Paul and Margaret Mills Harper. -- ePUB/MOBI\n\n* COMPLETE POETRY AND PLAYS (Delphi Classics, 2012) -- ePUB/MOBI\n\n* MYTHOLOGIES (Macmillan, 1959). -- PDF\n\n* UNDER THE MOON: The Unpublished Early Poetry (Scribner, 1995).  Edited by George Bornstein. -- PDF\n\n* A VISION: A Reissue with the Author's Final Revisions (Collier, 1966). -- PDF\n\n* W. B. YEATS AND T. STURGE MOORE: Their Correspondence 1901-1937 (RKP, 1953).  Edited by Ursula Bridge. -- PDF\n\n\n                               == Edited by W. B. Yeats ==\n\n* A BOOK OF IRISH VERSE (Routledge, 2002).  With a new Introduction by John Banville. -- PDF\n\n* IRISH FAIRY AND FOLK TALES (Modern Library, 2003).  Foreword by Paul Muldoon. -- ePUB/MOBI\n\n* IRISH FAIRY AND FOLK TALES (Barnes &amp; Noble, 2009).  Foreword by Paul Muldoon. -- PDF\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n           &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:71e718247d7388198d5dd888d671963983c2d258","amp;dn":"William+Butler+Yeats+-+Nobel+Prize+in+Literature+1923+%2821+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e718247d7388198d5dd888d671963983c2d258","infoHashBuffer":{"type":"Buffer","data":[113,231,24,36,125,115,136,25,141,93,216,136,214,113,150,57,131,194,210,88]},"announce":[],"urlList":[]}}