{"title":"Steinberg Virtual Guitarist and Virtual Guitarist Electric Editi","uid":10657151,"size":3960920168,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:721748c4ede515c9034479b04db778e5ba4a42fc&amp;dn=Steinberg+Virtual+Guitarist+and+Virtual+Guitarist+Electric+Editi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"a_touhou","files":-1,"time":1406676644,"description":"Virtual Guitarist is the perfect rhythm guitarist, it plays both acoustic and electric guitar, offering the right riff for almost every style of music. It can play in any key, master even the most challenging chords, automatically play in time with your song's tempo, and even sync up to the drum's groove, if you wish.\n\nFeatures:\n\nAuthentic-sounding guitar parts, tracked by professional studio guitarists.\nA vast array of styles ranging from silky arpeggios to fat-and-juicy electric guitars riffs.\nWarm, transparent and assertive tone.\nEasy handling and outstanding playability.\n\n------\n\nVirtual Guitarist &quot;Electric Edition&quot; is the perfect rhythm guitarist for anyone needing electric guitar tracks. This VST instrument is based on real recordings, yet is as flexible as a synthesizer. Featuring 29 different players from the 50s to the present day, Virtual Guitarist &quot;Electric Edition&quot; oozes authentic sound character whilst offering unrivalled playability and outstanding tempo flexibility. Also included is a fully featured multi-effect board, useable both as a separate plug-in that you can use on any audio signal or integrated in the VSTi.\n\nSelect a player, select some chords and it plays perfect tracks. Liven your song up with options like syncopation, phrasing variations or long chords. Change shuffle or dynamics, use track doubling or be creative with the many effects provided.\n\n29 different players, variety of guitars/amps.\nVariable playing - shuffle, dynamics, timing, syncopation, long chords.\nFlexible real-time variation (keyboard, mod-wheel, aftertouch, velocity).\nEffects: Wah, AutoFilter, Chorus, Flanger, Phaser, Delay, Reverb.\nVast range of electric guitar styles for all kinds of music.\nStereo width, track doubling and other sound shaping options.\nEffects integrated into VSTi or separately usable as VST plug-in.","torrent":{"xt":"urn:btih:721748c4ede515c9034479b04db778e5ba4a42fc","amp;dn":"Steinberg+Virtual+Guitarist+and+Virtual+Guitarist+Electric+Editi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"721748c4ede515c9034479b04db778e5ba4a42fc","infoHashBuffer":{"type":"Buffer","data":[114,23,72,196,237,229,21,201,3,68,121,176,77,183,120,229,186,74,66,252]},"announce":[],"urlList":[]}}