{"title":"David Shade - Advanced Sexual Hypnosis","uid":8639511,"size":192172285,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:722bf23ad1b8746cae94cb47dfa4af8138d94216&amp;dn=David+Shade+-+Advanced+Sexual+Hypnosis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"acer47x","files":75,"time":1372851115,"description":"David Shade's Manual has been transformed into an audio CD book version that concentrates on the hypnosis components. This is the most powerful material ever presented to give women incredible pleasure. This is the really advanced stuff. This is not for everybody, this is for the man who is serious about the desire to give women incredible pleasure beyond their wildest dreams.\t\nWARNING\nThis Is The Really Advanced Stuff!\n\nAdvanced Sexuality - Erotic Hypnosis - NLP - Energy - and More!&quot;\n\nThis Is The Really Advanced Stuff!\n\nAdvanced Sexuality - Erotic Hypnosis - NLP - Energy - and More!\n\n* Make your woman come continuously for as long as you want. (Hour long orgasms!)\n* Give her multiple orgasms! (As many as she can stand, and then a few more!)\n* Give her an Instant Orgasm On Command! (Come NOW!)\n* Beginner's Tantra. (Continuous ecstasy the very first time!)\n* She will have orgasms when she gives you a BJ!\n* Bring her orgasms to &quot;beyond orgasm!&quot; with Chakra techniques. (Nothing will ever compare again.)\n* Give her orgasms from anal sex!\n* Give her orgasms when you spank her!\n* Her First Vaginal Orgasm, using hypnosis!\n* For the fun of it, make it her reality that She's a Virgin Again!\n* Give her an orgasm when you count to 10!\n* Give her an orgasm, &quot;Like In A Dream&quot;.\n* Empower her to Super Responsiveness\n* The Rape Fantasy. Finally, make it absolutely REAL for her, not just make believe.\n* And if that's not enough, how about the really far out stuff...\n* Give her an orgasm with just your energy! (No touch, no sound, only your energy!)\n* You can make a woman orgasm by touching her nose! Here's how it's done. (CD 2 - Track 3)\n* The High Paid Escort Fantasy -- How to get your woman to play the ultra-naughty role of a high paid hooker! (CD 1 - Track 8)\n* What to do if your girlfriend won't let you hypnotize her! (CD 2 - Track 2)\n* How to use the 7 Chakras as a trance induction. She can't resist because women love 'Energy' (CD 3 - Track 1)\n* The RIGHT WAY and the wrong way to give sexual hypnotic suggestions (CD 1 - Track 6)\n* The true erotic story of a woman's very first vaginal orgasm, including every hypnotic command to make it happen! (CD 2 - Track 1)\n* The 3 stages of Extended Sexual Orgasms and how to use hypnosis to make it happen.\n* How to use hypnosis to get your woman to try anal sex with you... and LOVE IT! (CD 1 - Track 5)\n* The Super Sneaky way to give your woman dreamy hypnotic orgasms while she sleeps! (CD 2 - Track 11)\n* A truly unique way to give a woman orgasms that she won't be able to describe with words! (CD 1 - Track 2)\n* How in hypnosis your woman will bring her most secret TABOO into your sex play! (CD 1 - Track 4)\n* By using trance, you can easily give your woman multiple bed shaking orgasms and have her attack you like a cat in heat. (CD 1 - Track 6)\n* How to set AUDIO ANCHORS you can use to give her a full mind-body orgasm... Anywhere! Anytime you want! (CD 2 - Track 3)\n* And MUCH, much more!\n\nThis is the ultimate guide to sexual hypnosis, now better than ever. You'll also be able to learn while your drive by listening to the CD's. I get comments all the time from guys who want to be able to 'listen and learn', and this time I pulled out all the stops to provide you with kick-ass high quality audio.\n","torrent":{"xt":"urn:btih:722bf23ad1b8746cae94cb47dfa4af8138d94216","amp;dn":"David+Shade+-+Advanced+Sexual+Hypnosis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"722bf23ad1b8746cae94cb47dfa4af8138d94216","infoHashBuffer":{"type":"Buffer","data":[114,43,242,58,209,184,116,108,174,148,203,71,223,164,175,129,56,217,66,22]},"announce":[],"urlList":[]}}