{"title":"[Clips4Sale / Primals Taboo Sex] Veruca James (Sisters Confessio","uid":15581766,"size":670628071,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:72699272e3c8f04b70b3677a5c16ef8e22dbe5fd&amp;dn=%5BClips4Sale+%2F+Primals+Taboo+Sex%5D+Veruca+James+%28Sisters+Confessio&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"LucasCar","files":2,"time":1471419961,"description":"[Clips4Sale / Primals Taboo Sex] Veruca James (Sisters Confession) 480p [Roleplay]\r\n\r\nPart One - Veruca is visiting her big brother to congratulate him on finally divorcing the frumpy bitch who was stifling his adventurous spirit. Recently divorced herself, Veruca tells her brother that her heart was never fully with her ex-husband. Her ex never compared to someone else that she's always adored and looked up to. Her best memories are with this person, and her brother knows him very well. Big brother tells her the mystery man is a fool not to notice a gorgeous woman like Veruca. Talking about how comfortable and happy they've always been with each other as siblings, Veruca asks why they couldn't date. Not taking her seriously, big brother takes a big swig from his glass as they both force some laughter. But then Veruca reveals the truth. The truth about how she used to watch him with his girlfriends, envious of how he fucked them. Before he can react, Veruca pounces, pinning him to the couch as she finally kisses him after all these years of longing. Pent-up desire is rapidly brought to fruition as Veruca delights in finally feeling her big brother's cock inside of her after a lifetime of yearning.\r\n\r\nPart Two - There's a knock on the door, but it's not room service. Veruca hurries into the hotel room, taking big brother by surprise. He's shocked to see her. He'd left a note on her pillow saying that he had to go on a business trip. She rushed to find him, feeling abandoned after their intense night of passion. She knows what she wants, but she senses her brother may be having second thoughts. Veruca wraps her arms around him and talks about how she could be that one woman who cares for him. The one he wakes up to in the morning. They kiss, but he stops to ask her if she's sure. Veruca tells him she's never been more sure about anything in her life. They fuck long into the night, Veruca cumming again and again on big brother's cock. She begs him to fill her pussy with his cum. As it drips out of her freshly fucked pussy, she's elated to finally feel such a sensation after years of fantasizing. She turns to him and asks him to promise that he and his dick belong to her now.\r\n\r\nPart Three - It's not even dawn when Veruca's brother awakes to find her luscious lips wrapped around his dick, her big, beautiful eyes looking back with passion. She uses her fingers to tease him, and she plants little kisses all over. Her tongue dances over every inch of his hard cock, savoring every little lick. When he fills her mouth with cum, she lets it drip down his dick just so she can lap it back up. Before she hits the road, Veruca tells big brother to have a good business trip. She looks forward to seeing him back at home...\r\n \nhttp://screenimage.net/img-57b3fa241118c.html\r\n \nhttp://screenimage.net/img-57b3fa2cea8b9.html \r\n\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n   \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:72699272e3c8f04b70b3677a5c16ef8e22dbe5fd","amp;dn":"%5BClips4Sale+%2F+Primals+Taboo+Sex%5D+Veruca+James+%28Sisters+Confessio","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72699272e3c8f04b70b3677a5c16ef8e22dbe5fd","infoHashBuffer":{"type":"Buffer","data":[114,105,146,114,227,200,240,75,112,179,103,122,92,22,239,142,34,219,229,253]},"announce":[],"urlList":[]}}