{"title":"Nicholas Sparks-The Longest Ride","uid":16000258,"size":380214053,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:72762eecb77fe45b79add09e7ff1ede2b6713b7c&amp;dn=Nicholas+Sparks-The+Longest+Ride&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":3,"uploader":"twocows","files":18,"time":1476117130,"description":"Nicholas Sparks-The Longest Ride\r\n\r\n\r\nIra Levinson is in trouble. At ninety-one years old and alone in the world, he finds himself stranded on an isolated embankment after a car crash. Suffering multiple injuries, he struggles to retain consciousness until a blurry image materializes and comes into focus beside him: his beloved wife, Ruth, who passed away nine years ago. Urging him to hang on, she forces him to remain alert by reminiscing about their lifetime together. Ira knows that Ruth can't possibly be in the car with him, but he clings to her words and his memories.\r\nA few miles away, at a local bull-riding event, a Wake Forest University senior's life is about to change. Recovering from a recent breakup, Sophia Danko meets a young cowboy named Luke. Through Luke, Sophia is introduced to a world in which the stakes are high: reward and ruin—and even life and death—loom large in everyday life. As she and Luke fall in love, Sophia finds herself imagining a future far removed from her plans—if the secret Luke's keeping doesn't destroy it first.Ira and Ruth. Sophia and Luke. Two couples who have little in common and who are separated by years and experience. Yet their lives will converge with unexpected poignancy, reminding us all that even the most difficult decisions can yield extraordinary journeys","torrent":{"xt":"urn:btih:72762eecb77fe45b79add09e7ff1ede2b6713b7c","amp;dn":"Nicholas+Sparks-The+Longest+Ride","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72762eecb77fe45b79add09e7ff1ede2b6713b7c","infoHashBuffer":{"type":"Buffer","data":[114,118,46,236,183,127,228,91,121,173,208,158,127,241,237,226,182,113,59,124]},"announce":[],"urlList":[]}}