{"title":"The Art Of Creative Nonfiction Writing And Selling The Literatur","uid":9825389,"size":1044654,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:727bca87f295fe2d87bc20e00f1cb041e3a1a5cb&amp;dn=The+Art+Of+Creative+Nonfiction+Writing+And+Selling+The+Literatur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1395767405,"description":"Series: Wiley Books for Writers Series\nPaperback: 224 pages\nPublisher: Wiley; 1 edition (January 1, 1997)\nLanguage: English\nISBN-10: 0471113565\nISBN-13: 978-0471113560\n\nA complete guide to the art and craft of creative nonfiction--from one of its pioneer practitioners\n\nThe challenge of creative nonfiction is to write the truth in a style that is as accurate and informative as reportage, yet as personal, provocative, and dramatic as fiction. In this one-of-a-kind guide, award-winning author, essayist, teacher, and editor Lee Gutkind gives you concise, pointed advice on every aspect of writing and selling your work, including:\n* Guidelines for choosing provocative--and salable--topics\n* Smart research techniques--including advice on conducting penetrating interviews and using electronic research tools\n* Tips for focusing and structuring a piece for maximum effectiveness\n* Advice on working successfully with editors and literary agents\n\nBiography\nLee Gutkind, recognized by Vanity Fair as &quot;the Godfather behind creative nonfiction,&quot; is the author and editor of more than 25 books and founder and editor of Creative Nonfiction, the first and largest literary magazine to publish narrative nonfiction exclusively. He is Distinguished Writer-in-Residence in the Consortium for Science, Policy &amp; Outcomes at Arizona State University and a professor in the Hugh Downs School of Human Communication\n\nGutkind has lectured to audiences around the world--from China to the Czech Republic, from Australia to Africa to Egypt. He has appeared on many national radio and televisions shows, including The Daily Show with Jon Stewart (Comedy Central), Good Morning America, National Public Radio's Talk of the Nation and All Things Considered, as well as BBC World. \n\nGutkind is the recipient of grants and awards from many different organizations, from the National Endowment for the Arts to the National Science Foundation.\n\nA prolific author, his most recent books include An Immense New Power to Heal: The Promise of Personalized Medicine and an anthology, At the End of Life: True Stories About How We Die.\n\nHis new book, You Can't Make This Stuff Up, is described by Susan Orlean, author of The Orchid Thief and Rin Tin Tin, as the &quot;essential and definitive guide to creative nonfiction . . . engaging, useful, indispensable and inspiring.&quot;","torrent":{"xt":"urn:btih:727bca87f295fe2d87bc20e00f1cb041e3a1a5cb","amp;dn":"The+Art+Of+Creative+Nonfiction+Writing+And+Selling+The+Literatur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"727bca87f295fe2d87bc20e00f1cb041e3a1a5cb","infoHashBuffer":{"type":"Buffer","data":[114,123,202,135,242,149,254,45,135,188,32,224,15,28,176,65,227,161,165,203]},"announce":[],"urlList":[]}}