{"title":"The 15:17 to Paris: A Terrorist, a Train and Three Friends ...","uid":15932516,"size":1571146,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:734af07889e2e8d2d61880c60aa1df444e797a4a&amp;dn=The+15%3A17+to+Paris%3A+A+Terrorist%2C+a+Train+and+Three+Friends+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"marty14","files":1,"time":1475368832,"description":"The 15:17 to Paris: The True Story of a Terrorist, a Train, and Three American Heroes - Sadler, Skarlatos, Stone, Stern [epub]\r\n\r\nOn August 21, 2015, Ayoub El-Khazzani boarded train #9364 in Brussels, bound for Paris. There could be no doubt about his mission: he had an AK-47, a pistol, a box cutter, and enough ammunition to obliterate every passenger on board. Slipping into the bathroom in secret, he armed his weapons. Another major ISIS attack was about to begin.\r\n\r\nKhazzani wasn’t expecting Anthony Sadler, Alek Skarlatos, and Spencer Stone. Stone was a martial arts enthusiast and airman first class in the US Air Force, Skarlatos was a member of the Oregon National Guard, and all three were fearless. But their decision—to charge the gunman, then overpower him even as he turned first his gun, then his knife, on Stone—depended on a lifetime of loyalty, support, and faith.\r\n\r\nTheir friendship was forged as they came of age together in California: going to church, playing paintball, teaching each other to swear, and sticking together when they got in trouble at school. Years later, that friendship would give all of them the courage to stand in the path of one of the world’s deadliest terrorist organizations.\r\n\r\nThe 15:17 to Paris is an amazing true story of friendship and bravery, of near tragedy averted by three young men who found the heroic unity and strength inside themselves at the moment when they, and 500 other innocent travelers, needed it most","torrent":{"xt":"urn:btih:734af07889e2e8d2d61880c60aa1df444e797a4a","amp;dn":"The+15%3A17+to+Paris%3A+A+Terrorist%2C+a+Train+and+Three+Friends+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"734af07889e2e8d2d61880c60aa1df444e797a4a","infoHashBuffer":{"type":"Buffer","data":[115,74,240,120,137,226,232,210,214,24,128,198,10,161,223,68,78,121,122,74]},"announce":[],"urlList":[]}}