{"title":"John Coltrane &amp; Don Cherry - The Avant-Garde 1966 / 2013","uid":9763012,"size":88588180,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:736cd0c3da061eae367cd8f192a95f75909bd519&amp;dn=John+Coltrane+%26amp%3B+Don+Cherry+-+The+Avant-Garde+1966+%2F+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"Drebben","files":7,"time":1394840162,"description":"\nJohn Coltrane &amp; Don Cherry\nThe Avant-Garde\nRecorded in 1960, released in 1966\n\n\nThe Avant-Garde is John Coltrane's most literal encounter with the music of Ornette Coleman. It features several of Ornette's sidemen: trumpeter Don Cherry, drummer Ed Blackwell, and bassists Charlie Haden and Percy Heath. (Haden plays on two tracks, Heath plays on the other three.)\n\nJohn Coltrane's search for a fresh musical feeling, in which the front line and the rhythm section are more nearly equal, began through an exhaustive study of chords. But alto saxophonist Ornette Coleman and his acolyte Don Cherry had discovered another path by concentrating on rhythmic melodies and a polytonal brand of modality.\n \nColtrane played with Coleman from time to time (though they never recorded), and even studied with Ornette. THE AVANT GARDE is the fruit of their admiration for each other, but co-leader Don Cherry nearly steals the show. Originally inspired by Fats Navarro and Miles Davis, Cherry responded to Coleman's inspiration with fluttery melodic lines and tart harmonic dissonances. \nOn THE AVANT GARDE, his minimalist melodies and witty rhythmic displacements are a perfect contrast to Coltrane's voluminous testimonies, serving to illustrate his innovations in brass phrasing. In addition, the absence of a pianist forces the bass players to carry the whole band. \n \nColtrane did his own thing at this point in his career. That he was willing and eager to step outside his comfort zone to engage the music of another musician says a great deal about the respect he had for Coleman, Cherry, et al. While he's something of a fish out of water on his own record, he plays beautifully, as do his cohorts.\n\n\nCD / 2013 / Remastered / 320Kbps\n\n\n\nTracklist:\n1 Cherryco \t\n2 Focus On Sanity \t\n3 The Blessing \t\n4 The Invisible \t\n5 Bemsha Swing \n\t\n\n \nPersonnel: \nJohn Coltrane (soprano &amp; tenor saxophones) \nDon Cherry (trumpet) \nCharlie Haden, Percy Heath (acoustic bass)\nEd Blackwell (drums)\n\n\n\nRecorded at Atlantic Studios, New York, New York on June 28 &amp; July 8, 1960. \nOriginally released on Atlantic (1451) in 1966.\n\n\nStraight, no chaser.\n:)","torrent":{"xt":"urn:btih:736cd0c3da061eae367cd8f192a95f75909bd519","amp;dn":"John+Coltrane+%26amp%3B+Don+Cherry+-+The+Avant-Garde+1966+%2F+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"736cd0c3da061eae367cd8f192a95f75909bd519","infoHashBuffer":{"type":"Buffer","data":[115,108,208,195,218,6,30,174,54,124,216,241,146,169,95,117,144,155,213,25]},"announce":[],"urlList":[]}}