{"title":"Le onde del destino - Lars Von Trier - [ITA] .avi","uid":4844408,"size":849403904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:737006da032af6d9af7710d2d69d8fc0d0eea4c7&amp;dn=Le+onde+del+destino+-+Lars+Von+Trier+-+%5BITA%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":null,"files":1,"time":1239583640,"description":"Bess McNeill ÃƒÂ¨ un'ingenua e fervente cattolica, abitante di un piccolo paesino scozzese che, contro il volere della comunitÃƒÂ , sposa Jan Nyman, uno straniero operaio che lavora in una piattaforma petrolifera. Durante la lontananza del marito, Bess prega Dio per il suo ritorno, cosÃƒÂ¬ quando l'uomo subisce un grave incidente che lo costringe a rientrare a terra, la donna si sente responsabile perchÃƒÂ¨ ritiene che le sue preghiere non erano state sufficientii. Le preghiere di Bess riflettono il proprio senso di colpa, infuso dalla religione cattolica. A causa dei danni subiti Jan ÃƒÂ¨ bloccato a letto in perenne stato confusionale e costringe la moglie a cercare esperienze sessuali con estranei da farsi raccontare. Accettando la volontÃƒÂ  del marito Bess ritiene di contribuire alla sua salvezza. Ed ÃƒÂ¨ proprio il tema dominante del film: il pensiero di una certa religiositÃƒÂ  che tutto passi attraverso la sofferenza e che questa porti alla salvezza. Se non si coglie questo elemento importante la trama del film puÃƒÂ² essere assimilita ad un banale film dove impera la perversione. Ma niente di tutto questo. La protagonista condanna sÃƒÂ¨ stessa ad una vita squallida e monotematica. Si reca ripetutamente in chiesa in un'ossessionante preghiera per suo marito, annullando completamete la sua persona, ed in questo annullarsi per lui si da ad altri uomini. Bess segue il volere del marito attirandosi addosso la condanna della comunitÃƒÂ  e infilandosi in un tunnel che la porterÃƒÂ  al drammatico finale.","torrent":{"xt":"urn:btih:737006da032af6d9af7710d2d69d8fc0d0eea4c7","amp;dn":"Le+onde+del+destino+-+Lars+Von+Trier+-+%5BITA%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"737006da032af6d9af7710d2d69d8fc0d0eea4c7","infoHashBuffer":{"type":"Buffer","data":[115,112,6,218,3,42,246,217,175,119,16,210,214,157,143,192,208,238,164,199]},"announce":[],"urlList":[]}}