{"title":"The L Word - Season 3 (gremster)","uid":4225738,"size":4401979439,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:73a112875a8c01b6831df3ea64dfa858f8c651d3&amp;dn=The+L+Word+-+Season+3+%28gremster%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":3,"uploader":"gremster","files":13,"time":1212814288,"description":"Season 3, Episode 1: Labia Majora\nOriginal Air Date: 8 January 2006\nSix months later. Bette and Tina, now back together, try to deal with parenting Tina&amp;#039;s newborn daughter, Angelica, while trying to handle an obnoxious, wheelchair-bound, social worker, named Roberta Collie, who disapproves of their unorthodox parenting methods. Meanwhile, Alice, hosting her own radio show, The Chart on KZWA in Santa Monica, cannot get over her breakup with Dana who has gotten back together with Lara Perkins, leading to a hilarious &amp;#039;road rage&amp;#039; chase through the streets... ending when Alice hits Roberta Collie&amp;#039;s car. Helena decides to go into the movie business by purchasing a small and struggling studio, and decides on a chance on her personality being the only one whom tries to comfort Alice with her emotional setbacks. With Mark having moved out of the house, Carmen has moved in, and her romantic relationship with Shane gets a little more serious when Carmen wants to take Shane to meet her parents, and she asks Shane to act &amp;#039;straight&amp;#039;. Kit goes to her son, David, over a medical condition of hers. Jenny, recovering at her parents house in Illinois from her nervous breakdown, decides that she has had enough with Midwest life in dealing with her emotionally barren mother and ungrateful stepfather, and ponders moving back to Los Angeles with her new ultra-butch girlfriend, Moira.\n\n\nSeason 3, Episode 2: Lost Weekend\nOriginal Air Date: 15 January 2006\nKit hires Billie Blaikie, a transvestite party promoter to get the business up at The Planet with a gambling night, while her son, David, quickly disapproves of Billie&amp;#039;s presence. Meanwhile, Jenny wonders where she stands with Moira as they take an eventful road trip back to California, where they pose as a man-woman couple, encounter hateful redneck teens, and dance at a out-of-the-way gay bar for women. Back in Los Angeles, Carmen&amp;#039;s overbearing mother attempts to turn Shane into a more feminine person prior to a family gathering. Following Mrs. Collie&amp;#039;s advice, Bette and Tina try to find a male role model for Angelica leading them to hire Angus Partridge, a struggling musician to help. Helena tries to help Alice get over her obsession with Dana and becomes more depressed and dependent on anti-depressant pills after learning that everyone has forgotten about her birthday. Also, Dana deals with health problems after Lara feels a lump in her breast during a session of their lovemaking.\n\n\nSeason 3, Episode 3: Lobsters\nOriginal Air Date: 22 January 2006\nShane finally gets her dream of opening her own hair styling business at a skateboarding shop called WAX owned by the gay and friendly Chase. Control freak Bette loses her position as the sole provider for the family, forcing Tina to take a job at the studio under Helena. Meanwhile, Jenny and Moira finally arrive back in Los Angeles where Jenny introduces Moira to her surprised friends. Although everybody is casually nice to Moria, she correctly senses their awkwardness and leaves during a welcome-back dinner that Bette takes everyone out to. Dana and Lara make plans to visit France while Alice still obsesses over Dana leading to friction with her radio show job. Kit is surprised by Billie Blaikie who wants to make some drastic changes to the Planet in favor of the local gay crowd. Also, Angus begins to develop an attraction to Kit while continuing to babysit for baby Angelica.\n\n\nSeason 3, Episode 4: Light My Fire\nOriginal Air Date: 29 January 2006\nWhile Tina and Helena attend a documentary screening of up-and-coming film maker Dylan Moreland, Bette travels to Washington D.C. to speak at a Senate hearing about asking for increased funding for left-wing artwork and afterwords, she meets with Senator Barbara Grisham who makes a move on her. Back in Los Angeles, Jenny, in an attempt to provide for both herself and Moira, puts her dreams of becoming a writer on hold and starts working as a waitress at The Planet. Jenny and Moira are also invited to a party hosted by Billie Blaikie where Moira meets like-minded people. Meanwhile, Carmen has to decide whether to give up Shane&amp;#039;s opening party at WAX in exchange for a once-in-a-lifetime opportunity to DJ at an exclusive VIP party that Russell Simmons is throwing. Alice has an emotional meltdown on-the-air during her radio show and giving her boss, Ruth, a migraine. Also, Dana plays at a tennis tournament and declares her love for Lara in front of TV cameras.\n\n\nSeason 3, Episode 5: Lifeline\nOriginal Air Date: 5 February 2006\nAs Tina finds herself attracted to men once again by going onto Internet sex chat rooms, Bette explores Buddhism and also hears good news on the work front. Both Alice and Kit try out the Planet&amp;#039;s Bisexual speed-dating hosted by Billie; Kit with Angelica&amp;#039;s male nanny Angus, and Alice with a lesbian vampire named Uta. Meanwhile, Dana receives devastating news that she has cancer which calls for surgery. Helena pursues the documentary film maker Dylan Moreland despite her claims that she&amp;#039;s straight. Moira goes out on the town as her male alter-ego Max. Also, Shane&amp;#039;s ex-lover, Cherie Peroni Jaffe, now divorced and out-of-the-closet, drops by WAX to see her to talk about her new life which causes instant anger and jealousy in Carmen over their past and the way Cherie treated Shane.\n\n\nSeason 3, Episode 6: Lifesize\nOriginal Air Date: 12 February 2006\nBette discovers Tina&amp;#039;s Internet sex-chat messages and gives her consent (and a possible ultimatum) to explore her feelings for men. Meanwhile, Jenny meets with a publisher about her manuscript for a book, while Billie makes Moira a tempting, but shady offer to give her testosterone drugs. Kit gives in to Angus&amp;#039; advances, and an angry Carmen lays down the law to Shane regarding their relationship over Shane&amp;#039;s one-night fling with Cherie. Helena comes face-to-face with Dylan over where they stand where Dylan wants to continue their fling, despite Dyalan claiming that she&amp;#039;s straight and has a boyfriend, named Danny. Dana checks herself into the hospital for her breast cancer surgery while Lara contacts Dana&amp;#039;s parents to update them on Dana&amp;#039;s condition. Also, a new and improved Alice offers her support to Lara who confides in her the truth about Dana&amp;#039;s condition which leads to the girls rushing to the hospital to be by Dana&amp;#039;s side.\n\n\nSeason 3, Episode 7: Lonestar\nOriginal Air Date: 19 February 2006\nTina takes a business trip to Vancouver, Canada to a movie shoot location and has a chance to explore her feelings for the opposite sex with her producer Josh. Back in Los Angeles, Dana&amp;#039;s cancer treatments put a strain on hers and Lara&amp;#039;s relationship with Dana starting to lose her spirits, her sanity, and her will to live, and begins to lash out at Lara and everyone else. Helena continues her secret romance with Dylan. Meanwhile, Jenny helps Moira in her gender transformation to Max with the testosterone injects. Jenny then travels to New York to meet with an editor over her book being published, and she instantly clashes with the editor over the book&amp;#039;s contents and of Jenny&amp;#039;s continuing insecurity and mental instability over her childhood trauma for Jenny&amp;#039;s both unwilling and unable to get past. Carmen and Shane decide to get matching tattoos out of their renewed love for each other. After a talk with the goth vamp Uta, Alice reverts back in her obsession over Dana by trying to find the life-size Dana cut-out she threw out. Also, Kit finally takes control over the situation at the Planet by firing the self-destructive Billie, while she continues her romance with Angus, and also gets B-52s to perform at The Planet.\n\n\nSeason 3, Episode 8: Latecomer\nOriginal Air Date: 26 February 2006\nJenny plans a charity event to support Max when they find out she/he can&amp;#039;t pay for the top surgery. Helena takes the girls to a surprise trip to honor Dana in her expectant recovery, and Carmen is still dealing with the aftermath of her meeting with Shane&amp;#039;s ex. Meanwhile, Bette kicks Tina out of the bedroom and tries to find peace in Buddhism. In a recording studio, Kit gets help from unexpected sources for her music career.\n\n\nSeason 3, Episode 9: Lead, Follow, or Get Out of the Way\nOriginal Air Date: 5 March 2006\nBette has hard time adjusting to the ascetic lifestyle at the Buddhist retreat in snowy upstate Washington. Back in Los Angeles, Tina goes on a date with a divorced man named Henry. Dana, friends again with Alice, is looking forward to a new career after meeting Dr. Susan Love over her possible recovery. Meanwhile, Jenny throws a benefit party for Max at the WAX, but she gets appalled by his/her increasingly aggressive behavior. Also, Carmen tells the truth to her family about her lesbianism and Shane her love. Helena&amp;#039;s affair with Dylan takes a surprising turn when is served with a lawsuit by Dylan for sexual harassment.\n\n\nSeason 3, Episode 10: Losing the Light\nOriginal Air Date: 12 March 2006\nIn this unusual episode told in real time, Lara is still in Paris, oblivious to Dana&amp;#039;s worsening health. Back in Los Angeles, Alice has maintained a bedside vigil for Dana over the past five days. While taking a stroll, Alice runs into Dana&amp;#039;s ex, Tonya. Across town, Jenny introduces Max to her former boyfriend, Tim, who arrives in town for a visit and who is now married. But Jenny&amp;#039;s reunion with Tim becomes uncomfortable and soon unpleasant when Tim is soon revealed to still harbor a grudge against Jenny, and disapproves of Max as well. Meanwhile, Carmen evens the score with Shane by telling her she too was unfaithful. Elsewhere, Peggy Peabody arrives back in town to help Helena with the lawsuit served by the double-crossing Dylan and her scheming partner, Danny. Helena finally learns (way too late) that Dylan has been setting her up this entire time. Tina has a lunch date with Henry and his friends, but becomes uncomfortable when they assume that baby Angelica is adopted. Kit becomes impatient with Angus when he&amp;#039;s late for their afternoon date. In upstate Washington, a frustrated Bette leaves the Buddhist retreat, but receives a dose of life wisdom from an unexpected source at a remote bus station while waiting to go home.\n\n\nSeason 3, Episode 11: Last Dance\nOriginal Air Date: 19 March 2006\nAt Dana&amp;#039;s funeral and memorial services, her uptight and fiercely conservative parents, still in denial to her true sexual orientation, treat her friends coldly. Afterwards, Alice gets determined to arrange a special event to commemorate their friend by stealing some of Dana&amp;#039;s ashes and scattering them at a special location at a snow-covered summer camp that Dana once told her about. While Helena&amp;#039;s lawsuit with Dyalan is resolved with a surprising outcome, Bette approaches the feminist lawyer Joyce Wischnia to hire her to fight for sole custody of baby Angelica&amp;#039;s, while Tina continues dating Henry. Meanwhile, Max lands a job at a computer company, the same one where he, as &amp;#039;Moira&amp;#039; got turned down, which gives Jenny something to write about. Dealing with her own grief, Shane is willing to make the ultimate commitment to Carmen by proposing marriage. Also, Lara finally arrives from Paris and is comforted by Alice after learning of Dana&amp;#039;s passing.\n\n\nSeason 3, Episode 12: Left Hand of the Goddess\nOriginal Air Date: 26 March 2006\nSix weeks after Dana&amp;#039;s death with everyone still grieving over the loss of their friend, Helena takes over planning Shane and Carmen&amp;#039;s upcoming wedding to be held at the Whistler Ski Resort in British Columbia, Canada. Meanwhile, Shane travels to Portland, Oregon where she has a reunion with her long-estranged father, Gabriel, who has remarried and has a 10-year-old son where Shane invites them to the wedding. At the Whistler resort, Helena pitches in when she has Carmen&amp;#039;s family flown in for the wedding celebration while Peggy Peabody also arrives to reconnect with her daughter. Meanwhile, Jenny and Max continue to drift apart due to their differences when Jenny feels that Max&amp;#039;s determination to live as a man is not part of her world, which leads to Jenny having a brief fling with a French-Canadian lesbian writer named Claude. Kit has stunning news about her newfound romance with Angus that she&amp;#039;s pregnant. Bette continues to become uncomfortable with Tina having Henry along, while she begins having second thoughts about suing Tina for sole custody of baby Angelica. Also, Alice continues to drown her grief with anti-depressant pills, and having mindless sex with Lara, until a talk with a feminist pastor gives her some inspiration to move on with her life.\n","torrent":{"xt":"urn:btih:73a112875a8c01b6831df3ea64dfa858f8c651d3","amp;dn":"The+L+Word+-+Season+3+%28gremster%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73a112875a8c01b6831df3ea64dfa858f8c651d3","infoHashBuffer":{"type":"Buffer","data":[115,161,18,135,90,140,1,182,131,29,243,234,100,223,168,88,248,198,81,211]},"announce":[],"urlList":[]}}