{"title":"Back To The Future Part I, II, III - Trilogy Sci-Fi Michael J Fo","uid":11205297,"size":4402536905,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:73c7b185a6fafb7d91ea8f2fc395826ffd6e0f96&amp;dn=Back+To+The+Future+Part+I%2C+II%2C+III+-+Trilogy+Sci-Fi+Michael+J+Fo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":8,"uploader":"eyezin","files":-1,"time":1413213799,"description":".....................................................\n..:+++++++++++++++++++++++++++++++++++++++++++++++:..\n..:+++++++++++++++Back to the Future++++++++++++++:..\n..:++++++++++++++++++++Trilogy++++++++++++++++++++:..\n..:+++++++++++++++++++++++++++++++++++++++++++++++:..\n.....................................................\n\nBack to the Future.\nIt is the year 1985. Marty McFly, a mild-mannered high school student,\nstopped by Dr. Emmett L. Brown's laboratory to play around with an\namplifier. Then he receives a message from Doc that he needs help from\nhim for Doc's latest invention, a time machine made out of a DeLorean\nsports car that can travel through time instantaneously when it reaches\na speed velocity of 88 MPH. Then, Doc was gunned down by Libyan\nNationalists, Marty makes an effort to escape from the Lybians by using\nthe time machine. Then Marty accidentally warps himself into 1955. Where\nhe meets both of his parents when they were teenagers, then Marty\nunintentionally interrupts his parent's first meeting together, he then\nfinds a younger version of Doc and together they try to find a way to get\nMarty's parents-to-be back together, and to get Marty back to 1985.\n\nStars.\n=&gt;-Michael J Fox.\n=&gt;-Christopher Lloyd.\n=&gt;-Lea Thompson.\n\nDirector.\n=&gt;-Robert Zemeckis.\n\nBack to the Future Part II.\nThis movie begins where Back to the Future ended; with Marty, Doc and\nJennifer going into the future to help Marty and Jennifer's children.\nAfter doing that they return to 1985. But when they arrive they discover\nthat things are not as they remember it. There's a casino which is owned\nby of all people Biff. Marty learns that his father was killed a few\nyears ago and his mother is now married to Biff. Marty meets with Doc\nwho thinks he knows what happened. Somehow Biff got his hands on a book\nfrom the future which has in it all sports results and he used it to bet\non sports and amass his fortune. Marty said he considered doing that but\nDoc nixed it. Somehow the Biff from the future discovered about the time\nmachine and Marty's plan and used the time machine to give his younger\nself the book. So they have to find out when Biff got the book so they\ncan take it away from him. So Marty goes to see him and confronts him\nabout it and Biff tells him and also that he was the one who killed his\nfather. Marty and Doc then go back to of all places 1955 on the day of\nthe school dance. So Marty tries to get the book while trying to avoid\nbeing seen by Doc's younger self and himself who's getting ready to go\nback to 1985. Marty at times gets the book but when Biff calls him a\ncoward, Marty gets incensed which leads to him losing the book so he\nhas to try and get it again.\n\nStars.\n=&gt;-Michael J Fox.\n=&gt;-Christopher Lloyd.\n=&gt;-Lea Thompson.\n\nDirector.\n=&gt;-Robert Zemeckis.\n\nBack to the Future Part III.\nThis movie picks up where the last one left off--Marty stuck in 1955\nafter watching the Delorean vanish after being struck by lightning with\nDoc in it. But moments after, he got a letter from Doc that tells him he\nwas sent to 1885. But the Delorean was damaged and he can't repair it.\nSo he placed it somewhere where he hopes Marty can find it in 1955 and\nhopefully his younger version can repair it so that Marty can return to\n1985. So he goes to the 1955 Doc Brown and tells him about what happened\nand shows him the letter. So they set out to find the Delorean and do\nwhich was hidden near a cemetery. After finding the Delorean, Marty and\nDoc were about to leave when they find a tombstone with Doc's name on it\nthat says he was killed a few days after he sent the letter and that he\nwas killed by someone named Buford Tannen. Marty and Doc go to the\nlibrary and learn that Tannen was a crazed gunman and a photo of Doc in\n1885. Marty then decides to go back to 1885 to save Doc. Upon arriving,\nthe Delorean gets damaged and the gas tank is leaking. Marty then goes\nto town to look for Doc. But along the way he meets Tannen and gets on\nhis bad side. Doc saves him and Tannen threatens Doc. Marty then shows\nDoc the photo of his tombstone. That's when Marty and Doc get ready to\nleave. But when Marty tells him about the gas tank, Doc tells him,\nwithout gas they can't get the Delorean up to 88 miles per hour to\nactivate the time circuits. So they scurry to find a way to get it up\nto that speed before Doc gets shot. They think they found one which\nthey plan to implement on the day he gets shot. Doc then meets Clara\nClayton, the town's new schoolteacher and is smitten with her. That's\nwhen he has second thoughts about leaving. When Tannen tries to make\na move on Doc, Marty stops him that's when Tannen challenges Marty to\na gunfight. Marty initially declines but when Tannen calls him a coward,\nMarty accepts. Doc and Marty's ancestor tries to convince him he's\nmaking a mistake.\n\nStars.\n=&gt;-Michael J Fox.\n=&gt;-Christopher Lloyd.\n=&gt;-Lea Thompson.\n\nDirector.\n=&gt;-Robert Zemeckis.\n\nInfo.\n=&gt;-Genre..........................: Adventure : Comedy : Sci-Fi.\n=&gt;-Release Date...................: 1985 : 1989 : 1990.\n=&gt;-Language.......................: English.\n=&gt;-File Size......................: 1.39 GiB : 1.29 GiB : 1.42 GiB.\n=&gt;-Overall bit rate...............: 1 715 Kbps.\n=&gt;-Movie Runtime..................: 1h 56mn : 1h 47mn : 1h 58mn.\n=&gt;-Back to the Future.............: http://www.imdb.com/title/tt0088763/\n=&gt;-Back to the Future II..........: http://www.imdb.com/title/tt0096874/\n=&gt;-Back to the Future III.........: http://www.imdb.com/title/tt0099088/\n\nVideo.\n=&gt;-Codec..........................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio...................: 16:9.\n=&gt;-Resolution.....................: 1280 x 720.\n=&gt;-Bit rate.......................: 1 500 Kbps Kbps.\n\nAudio English.\n=&gt;-Codec..........................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels.......................: 2 channel Stereo.\n=&gt;-Bit Rate.......................: 112 Kbps.\n=&gt;-Maximum bit rate...............: 237 Kbps.\n\nAudio English Commentary.\n=&gt;-Codec..........................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels.......................: 2 channel Stereo.\n=&gt;-Bit Rate.......................: 96 Kbps.\n=&gt;-Maximum bit rate...............: 190 Kbps.\n\nSubtitles.\n=&gt;-English","torrent":{"xt":"urn:btih:73c7b185a6fafb7d91ea8f2fc395826ffd6e0f96","amp;dn":"Back+To+The+Future+Part+I%2C+II%2C+III+-+Trilogy+Sci-Fi+Michael+J+Fo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73c7b185a6fafb7d91ea8f2fc395826ffd6e0f96","infoHashBuffer":{"type":"Buffer","data":[115,199,177,133,166,250,251,125,145,234,143,47,195,149,130,111,253,110,15,150]},"announce":[],"urlList":[]}}