{"title":"Go Set a Watchman by Harper Lee (epub, mobi, pdf)","uid":12164823,"size":1802750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:741c36fbd7fc2c8170e75e73f24ea2e094e9b39d&amp;dn=Go+Set+a+Watchman+by+Harper+Lee+%28epub%2C+mobi%2C+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":4,"uploader":"ebookism","files":5,"time":1438003036,"description":"Go Set a Watchman by Harper Lee \nEnglish, epub, mobi, pdf, 1.71 Mb, Historical fiction\n\nFrom Harper Lee comes a landmark new novel set two decades after her beloved Pulitzer Prize-winning masterpiece, To Kill a Mockingbird.\nMaycomb, Alabama. Twenty-six-year-old Jean Louise Finch--&quot;Scout&quot;--returns home from New York City to visit her aging father, Atticus. Set against the backdrop of the civil rights tensions and political turmoil that were transforming the South, Jean Louise's homecoming turns bittersweet when she learns disturbing truths about her close-knit family, the town and the people dearest to her. Memories from her childhood flood back, and her values and assumptions are thrown into doubt. Featuring many of the iconic characters from To Kill a Mockingbird, Go Set a Watchman perfectly captures a young woman, and a world, in a painful yet necessary transition out of the illusions of the past--a journey that can be guided only by one's conscience. \nWritten in the mid-1950s, Go Set a Watchman imparts a fuller, richer understanding and appreciation of Harper Lee. Here is an unforgettable novel of wisdom, humanity, passion, humor and effortless precision--a profoundly affecting work of art that is both wonderfully evocative of another era and relevant to our own times. It not only confirms the enduring brilliance of To Kill a Mockingbird, but also serves as its essential companion, adding depth, context and new meaning to an American classic","torrent":{"xt":"urn:btih:741c36fbd7fc2c8170e75e73f24ea2e094e9b39d","amp;dn":"Go+Set+a+Watchman+by+Harper+Lee+%28epub%2C+mobi%2C+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"741c36fbd7fc2c8170e75e73f24ea2e094e9b39d","infoHashBuffer":{"type":"Buffer","data":[116,28,54,251,215,252,44,129,112,231,94,115,242,78,162,224,148,233,179,157]},"announce":[],"urlList":[]}}