{"title":"The Immortal Iron Fist 01-27 + Ex (2007-2009|Digital|MM-ID)","uid":9986408,"size":1047427095,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:76129f12b6825565da479f643124f1bb2432c5cd&amp;dn=The+Immortal+Iron+Fist+01-27+%2B+Ex+%282007-2009%7CDigital%7CMM-ID%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1397796883,"description":"The amazing writing duo of Matt Fraction and Ed Brubaker combine with artists David Aja and Travel Foreman on The Immortal Iron Fist, one of the best modern creative runs in all of the comics industry and especially at Marvel. Brubaker cemented his genius with this work, winning the 2008 Eisner Award for role, in the midst of his epic Captain America run; and Fraction made his name here, and his partnership with Aja would eventually continue into the fourth volume of Hawkeye. This is the story of Orson Randall, the succesor of the previous Iron Fist Danny Rand, and how both must face many bitter enemies and incredible new struggles. Promotional info for the first collected volume - &quot;Many years ago, in the mystical city of Kun' Lun, young Danny Rand stared at a suit behind glass - the garb of the &quot;Immortal Iron Fist&quot; - and knew that he was destined to wear it. But where did this costume come from? Why did it wait for Danny all those years like a shadow of his future? The answer to those questions will stun both him and his readers, as Danny Rand leaps from the pages of his breakout hit in Daredevil to his own history-spanning kung-fu epic that will shatter every perception of what it means to be the Immortal Iron Fist! Brought to you by top-ten writer Ed Brubaker and breakout talent Matt Fraction (Punisher War Journal), with action-packed art by David Aja (Daredevil, Giant-Size Wolverine).&quot;\n\nThis is all 27 issues of the run plus the Annual and two specials - Orson Randall and the Death Queen of California and Orson Randall and the Green Mist of Death. This torrent does NOT include the five-issue Immortal Weapons miniseries but I will upload that in digital as well. Thanks to Minutemen-InnerDemons for these awesome new digital copies, they look fantastic! Previously there were some digital rips from Zone-Empire available but not the full set. Thanks to all the scanners for their efforts; please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:76129f12b6825565da479f643124f1bb2432c5cd","amp;dn":"The+Immortal+Iron+Fist+01-27+%2B+Ex+%282007-2009%7CDigital%7CMM-ID%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76129f12b6825565da479f643124f1bb2432c5cd","infoHashBuffer":{"type":"Buffer","data":[118,18,159,18,182,130,85,101,218,71,159,100,49,36,241,187,36,50,197,205]},"announce":[],"urlList":[]}}