{"title":"Might &amp; Magic Heroes VI Complete Edition (2012) [PCDVD][MULT","uid":7457930,"size":6059567186,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7660b8d7dd6e3801751cc8c64ffafa26a1bad567&amp;dn=Might+%26amp%3B+Magic+Heroes+VI+Complete+Edition+%282012%29+%5BPCDVD%5D%5BMULT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"webchella","files":5,"time":1342720926,"description":"Might &amp; Magic Heroes VI Complete Edition (2012) [PCDVD][MULTi9]\n\n\nYear: 2012\nGenre: Strategy (Turn-based) / 3D\nDeveloper: Black Hole Entertainment\nPublisher: Ubisoft Entertainment\nPlatform: PC\n\nPublication Type: License\nLanguage: MULTi9\nCrack: [run offline]\nSize: 5.64 GB\n\nDescription: \nyuzhet Heroes of Might and Magic VI will cover the events that took place 400 years before the Heroes of Might &amp; Magic 5. All the action takes place in a favorite fantasy world Askhan, where once again planned a war between demons and humans. The centerpiece of the defenders of humanity given to five members of the dynasty of Griffin, which will play a crucial role in the battle between good and evil. Play, however, it will be possible for the different factions - each prepared a separate story campaign, which in its own way tells about the events of Heroes of Might and Magic VI.\nDuring the troubled time of the second eclipse of the moon and Bloody uprising of the Emperor of Demons - Kha-Belekhov. The legendary leader of the Archangels, who was killed during the war, the senior races, and now resurrected. He has plans for the coming invasion of demons, and plotting to regain strength, to kill the old sworn enemies and seize control of the world Askhan. However, he underestimates the strength of the Griffin dynasty. Might and Magic: Heroes VI Dynasty Griffin tells the story at a time when they were the Dukes of the Holy Empire, and sat on the Imperial Throne. In five campaigns unfold the history of children's Glory, the Duke of Griffin. The five characters of the Holy Empire will lead his troops into battle .. but the end of the story? Soon our heroes realize that this empire is not going smoothly. So begins the epic of romance and love, betrayal and secrets, murders and save lives. All five campaigns related to each other a single plot, but you can start playing for any of the parties. But before that you will meet with the Duke of Griffin, the father of the five heroes of the future.\n\nFeatures Complete Edition:\n- Version of the game is based on a license based on the actual version 1.5.1\n- There is DLC &quot;Pirates of the Wild Sea&quot; (&quot;Pirates of the Savage Sea Adventure&quot;) [Supplement until closed due to lack of medicine]\n- The game is packed with a slight contraction\n- By assembling: deadmau5\n\nInstructions and installation information:\nA. Run the installer and install the game\nTwo. Play [Start the game with only a shortcut on your desktop! ]\nStarting with a shortcut (option / offline)\n","torrent":{"xt":"urn:btih:7660b8d7dd6e3801751cc8c64ffafa26a1bad567","amp;dn":"Might+%26amp%3B+Magic+Heroes+VI+Complete+Edition+%282012%29+%5BPCDVD%5D%5BMULT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7660b8d7dd6e3801751cc8c64ffafa26a1bad567","infoHashBuffer":{"type":"Buffer","data":[118,96,184,215,221,110,56,1,117,28,200,198,79,250,250,38,161,186,213,103]},"announce":[],"urlList":[]}}