{"title":"Lord.of.the.Rings-Fellowship.of.the.Ring.DVDrip[vice]","uid":5171533,"size":831021732,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76905caa2dd044e936745c9dea9eb0f026c2ba8b&amp;dn=Lord.of.the.Rings-Fellowship.of.the.Ring.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":4,"uploader":"vicerock","files":-1,"time":1258717381,"description":"LORD OF THE RINGS THE FELLOWSHIP OF THE RING DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 02:51:03\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nElijah Wood\nIan McKellen\nLiv Tyler\nViggo Mortensen\nSean Astin\nCate Blanchett\nJohn Rhys-Davies\nBilly Boyd\nDominic Monaghan\nOrlando Bloom\nChristopher Lee\nHugo Weaving\nSean Bean\nIan Holm\nAndy Serkis\n\nPlot\n\nThe foreword, spoken by Galadriel, shows the Dark Lord Sauron forging the One Ring in order to conquer the lands of Middle-earth. A Last Alliance of Elves and Men is formed to counter Sauron's forces at the foot of Mount Doom, but Sauron kills Elendil, the High King of Men. His son, Prince Isildur grabs Elendil's broken sword Narsil, and slashes at Sauron's hand, separating him from the Ring and vanquishing his army. However, because Sauron's &quot;life force&quot; is bound to the Ring, he is not completely defeated until the Ring itself is destroyed. Isildur takes the Ring and succumbs to its temptation, refusing to destroy it. He is later ambushed and killed by orcs, and the Ring is lost in a river. The Ring is found by the creature SmÃƒÂ©agol thousands of years later, who takes it underground for five centuries, giving him &quot;unnaturally long life&quot; and transforming him into the creature Gollum. Since the Ring is bound to Sauron, it has a will of its own and wants to be found. Therefore, the Ring consciously leaves Gollum in its quest to be reunited with Sauron. However, it is instead found by the hobbit Bilbo Baggins, much to the despair of Gollum. Bilbo returns to his home in the Shire with the Ring, and the story jumps forward in time sixty years.\n\nAt his 111th (&quot;eleventy-first&quot;) birthday, Bilbo leaves the Ring to his nephew and adopted heir Frodo Baggins. After a ride to the Gondorian city of Minas Tirith, while searching for answers, Gandalf the Wizard soon learns it is the One Ring, and that Sauron seeks to retake it. Taking no chances, Gandalf tells Frodo to leave the Shire with the Ring and sends him to Bree with his friend and gardener, Sam, with plans to meet him there after Gandalf goes to Isengard to meet the head of his order, Saruman. Saruman reveals that the NazgÃƒÂ»l, or Ringwraiths, have left Minas Morgul to capture the Ring and kill whoever carries it; having already been corrupted to Sauron's cause, he then imprisons Gandalf atop Orthanc. Gandalf is then forced to watch as Saruman orders his orcs to destroy the forests surrounding Isengard to build weapons of war and create an elite Orc army called the Uruk-hai.\n\nWhile travelling to Bree, Frodo and Sam are soon joined by fellow hobbits Merry and Pippin. After encountering a Ringwraith on the road, they manage to reach Bree, and there they meet a Man called Strider, who agrees to lead them to Rivendell. They agree only because Strider already knows about the NazgÃƒÂ»l and that Gandalf isn't there to guide them. After some travelling, they spend the night on the hill of Weathertop, where they are attacked by the NazgÃƒÂ»l at night. Strider fights off the Ringwraiths, but Frodo is grievously wounded with a morgul blade, and they must quickly get him to Rivendell for healing. While chased by the NazgÃƒÂ»l, Frodo is taken by the elf Arwen to the Elven haven of Rivendell, and healed by her father, Elrond. Arwen also uses her magic to cut off the pursuing Ringwraiths at the Ford of Brunien, summoning a surge of water that sweeps the Ringwraiths away.\nGandalf confronts the Balrog on top of the Bridge of Khazad-dÃƒÂ»m.\n\nIn Rivendell Frodo meets Gandalf, who explains why he didn't meet them at Bree as planned (he had escaped Orthanc and Saruman's clutches with the help of an eagle). In the meantime, there are many meetings between various peoples, and Elrond calls a council to decide what should be done with the Ring. Elrond warns against keeping the Ring in Rivendell for long, knowing that the Elven realm could come under attack from both Mordor and Isengard. The Ring can only be destroyed by throwing it into the fires (that is, lava) of Mount Doom, where it was forged. Mount Doom is located in Mordor, near Sauron's fortress of Barad-dÃƒÂ»r, and the journey to it will be incredibly dangerous. Frodo volunteers to take the Ring to Mount Doom as all the others argue about who should or shouldn't take it. He is accompanied by his hobbit friends and Gandalf, as well as Strider, who is revealed to be Aragorn, the rightful heir to the throne of Gondor. Also travelling with them are the Elf Legolas, the Dwarf Gimli and Boromir, the son of the Steward of Gondor. Together they comprise the Fellowship of the Ring.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0120737/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0120737/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:76905caa2dd044e936745c9dea9eb0f026c2ba8b","amp;dn":"Lord.of.the.Rings-Fellowship.of.the.Ring.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76905caa2dd044e936745c9dea9eb0f026c2ba8b","infoHashBuffer":{"type":"Buffer","data":[118,144,92,170,45,208,68,233,54,116,92,157,234,158,176,240,38,194,186,139]},"announce":[],"urlList":[]}}