{"title":"Pecker Xvid DVDrip (1998) John Waters","uid":4468022,"size":734236672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76b8eed8e1827b6c0856e038ef48761fdaa42466&amp;dn=Pecker+Xvid+DVDrip+%281998%29+John+Waters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"witwiz","files":1,"time":1224994599,"description":"Pecker (so named, at least according to his grandmother, because he always pecks at his food) loves to use the camera to capture his fellow Baltimore residents living their daily lives. Of course, since this is a John Waters movie, those daily lives include visits to strip bars, shoplifting, and various other quirky, and frequently hilarious, human activities. When Pecker's makeshift photo exhibit comes to the attention of a New York art agent (Lili Taylor), Pecker becomes the latest sensation. Unlike the hero in most sudden-fame stories, however, Pecker, as played by Edward Furlong, isn't exactly an innocent; rather, he takes in the world with his eyes, and his mind, wide open. So instead of suffering a precipitous fall, Pecker eventually turns the tables on his more worldly New York peers.\n\nWhile not as outrageous as early Waters features such as Female Trouble and Pink Flamingos, Pecker still has something to offend just about everyone. But those who take the offenses to heart would be missing out on what amounts to a sweet-natured farce. The movie is not so much a pointed satire as a gentle teasing of the art world and its pretensions. The all-embracing world of John Waters allows for lovable freaks from the big city, too.\n\nThe movie sags a bit when it settles into its plot; it can't sustain the comic inspiration reached in the opening scenes of Pecker's encounters with Baltimore's misfits. But running gags about a sugar-addicted child and a ventriloquist-doll Virgin Mary are hilarious. What ultimately makes the movie such a pleasure, though, is Waters's genuine fondness for all of his characters. Aided by a charming cast, including Christina Ricci and Waters regulars Mink Stole and Patty Hearst, Waters has created a surprisingly touching ode to human eccentricity. --Chris Neman","torrent":{"xt":"urn:btih:76b8eed8e1827b6c0856e038ef48761fdaa42466","amp;dn":"Pecker+Xvid+DVDrip+%281998%29+John+Waters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76b8eed8e1827b6c0856e038ef48761fdaa42466","infoHashBuffer":{"type":"Buffer","data":[118,184,238,216,225,130,123,108,8,86,224,56,239,72,118,31,218,164,36,102]},"announce":[],"urlList":[]}}