{"title":"Rescue.2013.Everyday.Heroes-RELOADED","uid":8536596,"size":874935820,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:76d82598c03ff448b0a69bb6348978e31b489264&amp;dn=Rescue.2013.Everyday.Heroes-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Mr.Stifmeister","files":-1,"time":1370278988,"description":"\nnERv\n\nRescue 2013 Everyday Heroes (c) Rondomedia\n\n06/2013 :..... RELEASE.DATE .. PROTECTION .......: Activation\n1 :.......... DISC(S) .. GAME.TYPE ........: Simulation\n\nIn this realistic mixture of simulation, RPG and management game you\ntake part in exciting rescue missions as the head of fire department,\nassemble your force and gradually develop you station.\nDuring complex missions where decisions over life and death are often\nmade, you will get to know what it means to be a true hero of everyday\nlife.\nYou can recruit personnel with different backgrounds for your rescue\ncrew, e.g. firefighters and paramedics. You can also purchase new\nvehicles such as variety of fire engines and ambulances and furnish your\nfire station by buying various props, e.g. office desks, training\nmaterials, gym machines etc.\nAn alarm is calling for the team's attention Put on your boots\nblackened by soot, assemble your team for the mission and head to the\nsite of emergency. Your team must work together to extinguish fires and\nneutralize fire sources in real-time by using extinguishers, fire hoses\nand even foam cannons. Use the cutting device to rescue and recover\ntrapped people from crashed vehicles, assess their condition and render\ntreatment. Each completed mission earns you money that you may invest in\nthe development of your fire station, hiring new personnel for your\nrescue crew and purchasing additional rescue vehicles. Distribute\ndifferent station duties such as vehicle maintenance, cooking and\ncleaning to your crew. Keep up their morale by providing them with free\ntime options. Gain experience and gradually face greater emergencies\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the Game.\n4. Copy the crack from Crack dir to\ninstall directoryRescue2013DataManaged\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:76d82598c03ff448b0a69bb6348978e31b489264","amp;dn":"Rescue.2013.Everyday.Heroes-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76d82598c03ff448b0a69bb6348978e31b489264","infoHashBuffer":{"type":"Buffer","data":[118,216,37,152,192,63,244,72,176,166,155,182,52,137,120,227,27,72,146,100]},"announce":[],"urlList":[]}}