{"title":"Boomerang [1992][DVDrip][eng]","uid":6070779,"size":733968424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:773bc9fae4258be148c5c3bc4176a7801f76b08e&amp;dn=Boomerang+%5B1992%5D%5BDVDrip%5D%5Beng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"Camel-Toe","files":2,"time":1293608371,"description":"Boomerang (1992)\n\nA Player Who's About To Be Played.\nMarcus is a successful advertising executive who woos and beds women almost at will. After a company merger he finds that his new boss, the ravishing Jacqueline, is treating him in exactly the same way. Completely traumatised by this, his work goes badly downhill. But then Jacqueline's more quietly attractive assistant Angela, who has been dating Marcus' best friend, shows herself more than a little concerned by his parlous state.\n-------------------------------------------------------------------------\n\nMarcus Graham (Eddie Murphy) is a successful young marketing executive who has never lacked for attention from women. The cocky ladies' man views each new conquest as another notch on the holster of his oversized ego. But one day the tables are turned, and he falls for a high-powered female executive who treats him the same way he's been treating women for the last 15 years. Marcus realizes that it's not so fun to be on the other side of objectification and rejection, and he soon finds himself becoming a quivering bundle of insecurities. The question is whether he will learn enough from the experience to see that true love has been right under his nose all along.\nColor by DeLuxe; shot on location in New York City in Panavision. Eddie Murphy was reportedly paid $12 million for his role in the film. This is the first major studio project by brothers Warrington and Reginald Hudlin, the producing/directing team who made the indy hit &quot;House Party&quot; (USA/1990), as well as several short documentaries. The Hudlins viewed several screwball comedies from the 1940s before filming &quot;Boomerang&quot;. &quot;We wanted to capture the spirit of those classic films -- the wit, the intelligence and the energy -- in a contemporary setting,&quot; says Reginald. Paramount, in partnership with the Black Filmmaker Foundation, created ten paid observer positions for young African-Americans. Each one interned in a different department to become familiar with the behind-the-scenes world of film production. 50% of the production staff were people of color. The film should not be confused with &quot;Boomerang!&quot; (1947), directed by Elia Kazan and starring Dana Andrews and Lee J. Cobb.\n-------------------------------------------------------------------------\n\nStarring: Eddie Murphy, Robin Givens, Halle Berry, David Alan Grier, Martin Lawrence, Grace Jones, Geoffrey Holder, Eartha Kitt, Chris Rock, Frank Rivers, Angela Logan\nDirector: Reggie Hudlin\nAudio: Dolby Digital 5.1\nAspect Ratio: 1.78:1 16:9 Enhanced\nTransfer Format: Widescreen\nVideo Encoding: Xvid\nAudio Encoding: MP3 128kbps\nCategory: Comedy\nFormat: PAL DVD rip\nYear: 1992\nRating: M15+\nLanguages: English\nSubtitles: None\nRunning Time: 1:51:45 ","torrent":{"xt":"urn:btih:773bc9fae4258be148c5c3bc4176a7801f76b08e","amp;dn":"Boomerang+%5B1992%5D%5BDVDrip%5D%5Beng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773bc9fae4258be148c5c3bc4176a7801f76b08e","infoHashBuffer":{"type":"Buffer","data":[119,59,201,250,228,37,139,225,72,197,195,188,65,118,167,128,31,118,176,142]},"announce":[],"urlList":[]}}