{"title":"Love from Boy - Roald Dahls Letters to his Mother (2016) Gooner","uid":15962979,"size":41042573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:773d7594b29093caf5260204a15642d430223d94&amp;dn=Love+from+Boy+-+Roald+Dahls+Letters+to+his+Mother+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"GoonerTPB","files":2,"time":1475693905,"description":"Love from Boy - Roald Dahls Letters to his Mother (2016) (Epub) Gooner\r\n\r\nPublisher: John Murray (2 Jun. 2016)\r\nLanguage: English\r\nISBN-10: 144478627X\r\nISBN-13: 978-1444786279\r\n\r\n'Dear Mama, \r\nI am having a lovely time here. We play football every day here. The beds have no springs . . .'\r\n\r\nSo begins the first letter that a nine-year-old Roald Dahl penned to his mother, Sofie Magdalene, under the watchful eye of his boarding-school headmaster. For most of his life, Roald Dahl would continue to write weekly letters to his mother, chronicling his adventures, frustrations and opinions, from the delights of childhood to the excitements of flying as a World War II fighter pilot and the thrill of meeting top politicians and movie stars during his time as a diplomat and spy in Washington. And, unbeknown to Roald, his mother lovingly kept every single one of them.\r\n\r\nSofie was, in many ways, Roald's first reader. It was she who encouraged him to tell stories and nourished his desire to fabricate, exaggerate and entertain. Reading these letters, you can see Roald practicing his craft, developing the dark sense of humour and fantastical imagination that would later produce such timeless tales as The BFG, Matilda, Fantastic Mr Fox and The Witches.\r\nThe letters in Love from Boy are littered with jokes and madcap observations; sometimes serious, sometimes tender, and often outrageous. To eavesdrop on a son's letters to his mother is to witness Roald Dahl turning from a boy to a man, and finally becoming a writer","torrent":{"xt":"urn:btih:773d7594b29093caf5260204a15642d430223d94","amp;dn":"Love+from+Boy+-+Roald+Dahls+Letters+to+his+Mother+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773d7594b29093caf5260204a15642d430223d94","infoHashBuffer":{"type":"Buffer","data":[119,61,117,148,178,144,147,202,245,38,2,4,161,86,66,212,48,34,61,148]},"announce":[],"urlList":[]}}