{"title":"Mad Dogs - Season 3","uid":8813667,"size":1544360042,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:77c4d8dc652b9f20c4439ba65c7fdf3fb86a4994&amp;dn=Mad+Dogs+-+Season+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":4,"uploader":"woollytorrent","files":4,"time":1376524012,"description":"Mad Dogs is a British black comedy and psychological thriller television series created by Cris Cole that began airing on Sky1 on 10 February 2011. It is produced by Left Bank Pictures, and co-produced by Palma Pictures. The series stars John Simm, Marc Warren, Max Beesley, and Philip Glenister as four long-time and middle-aged friends getting together in a villa in Majorca to celebrate the early retirement of their friend Alvo (Ben Chaplin). However, after Alvo is murdered, the group find themselves caught up in the world of crime and police corruption.\n\nThe series was initially a story about a rock band, but changed after a feeling that bands have been &quot;done to death&quot;. After gaining interest from some terrestrial networks, the series was commissioned by British Sky Broadcasting. Filming took place on location throughout the island of Majorca in May 2010, and took around four million euros and 44 days to make. The main themes are friendship and growing older; Glenister said it is about ageing and &quot;getting closer to death&quot;. Photographer David LaChapelle directed three 30-second advertisements for the series. Mad Dogs opened with 1.61 million viewers, the 17th highest rated programme ever for Sky1, and attracted positive reactions from critics. They noted similarities with British gangster films, more predominantly the 2000 film Sexy Beast.","torrent":{"xt":"urn:btih:77c4d8dc652b9f20c4439ba65c7fdf3fb86a4994","amp;dn":"Mad+Dogs+-+Season+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77c4d8dc652b9f20c4439ba65c7fdf3fb86a4994","infoHashBuffer":{"type":"Buffer","data":[119,196,216,220,101,43,159,32,196,67,155,166,92,127,223,63,184,106,73,148]},"announce":[],"urlList":[]}}