{"title":"South Park - Season 03 -Crisp","uid":5922297,"size":3102126127,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:77dc5068a02bb51a8f1a19e72747be018b8bc990&amp;dn=South+Park+-+Season+03+-Crisp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":2,"uploader":"crispy1989","files":18,"time":1288469741,"description":"South Park - Season 03\n\nSeries: South Park\nDVD release: December 16, 2003\nNetwork: Comedy Central\nNo. of episodes: 17\nSource: DVD\nVideo format: .avi\nAudio format: MPEG Layer-3\nBit Rate: 134kbps\nWidth: 512\nHeight: 384\n\n----------------------------\n\nS03E01 - Rainforest Schmainforest\nThe children are forced to join a choir sent to Costa Rica to perform against deforestation, but they end up lost in the rainforest and discover that the rainforest is not worth saving. Meanwhile, Kenny falls for a girl in the chorus, but she is reluctant to pursue a long distance relationship.\n\nS03E02 - Spontaneous Combustion\nRandy must solve the problem when citizens start spontaneously combusting. Meanwhile, Cartman plays Jesus in a &quot;Stations of the Cross&quot; play and ends up stuck on the cross.\n\nS03E03 - The Succubus\nWhen Chef gets engaged to a strange woman, the boys are convinced that Chef's fiancee is a demon bent on sucking the life out of men. Meanwhile, Cartman becomes the butt of several pranks by his eye doctor.\n\nS03E04 - Tweek vs. Craig\nStan, Kyle, Cartman, and Kenny pit Tweek and Craig against each other. Meanwhile, the school shop teacher, Mr. Adler, copes with the loss of his wife, who died in a plane crash.\n\nS03E05 - Jackovasaurus\nThe town saves a species from extinction, but finds that they are an extremely annoying race that only Cartman can stand.\n\nS03E06 - Sexual Harassment Panda\nA man in a panda costume is hired to teach the kids about sexual harassment, leading Cartman to sue Stan (and all the kids to sue the school) over claims of being harassed.\n\nS03E07 - Cat Orgy\nCartman is stuck at home with Stan's sister Shelley as his babysitter while his mom is at a meteor shower party. Meanwhile, Cartman's cat, Mr. Kitty, is in heat and goes searching for sex with other cats.\n\nS03E08 - Two Guys Naked in a Hot Tub\nAt the meteor shower party mentioned in the previous episode, Stan is stuck in a basement with a group of nerdy kids from school who become important to him when the ATF stakes out the party, thinking that the attendees will commit suicide when the meteor comes. Meanwhile, Randy feels uncomfortable after he and Gerald watch each other masturbate in a hot tub.\n\nS03E09 - Jewbilee\nOn the night of the aforementioned meteor shower, Kyle, Kenny, and Ike go to a Jewish scout camp where Moses appears.\n\nS03E10 - Chinpokomon\nThe boys become fascinated with the latest fad from Japan, which turns out to be an insidious plot to have American children brainwashed into overthrowing the U.S. government.\n\nS03E11 - Starvin' Marvin in Space\nhe boys must save Starvin' Marvin from the government and a Christian group who cares more about converting people from third-world countries than giving them food and shelter.\n\nS03E12 - Korn's Groovy Pirate Ghost Mystery\nNu metal band Korn guest stars in this episode where they are blamed for making Halloween immoral and the boys use Kyle's grandmother's corpse to scare the fifth graders.\n\nS03E13 - Hooked on Monkey Phonics\nA homeschooled boy decides to start at public school, much to his overprotective parent's fear. Meanwhile, Kyle falls for the boy's sister.\n\nS03E14 - The Red Badge of Gayness\nDuring a Civil War reenactment, Cartman (as General Lee) leads the Confederate army to attack the Union soldiers across America.\n\nS03E15 - Mr. Hankey's Christmas Classics\nMr. Hankey hosts a Christmas musical, featuring South Park characters singing twisted renditions of classic Christmas songs and a memorial piece to voice actress Mary Kay Bergman.\n\nS03E16 - Are You There God? It's Me, Jesus\nCartman and Kenny mistake a colon infection for their menstrual cycle, prompting Kyle to lie about &quot;getting his period&quot; and Stan to ingest hormone pills so he won't feel left out. Meanwhile, Jesus plans a New Years' party and is worried his father won't be there.\n\nS03E17 - World Wide Recorder Concert\nThe boys travel to Arkansas to perform at a recorder concert. Meanwhile, Mr. Garrison confronts his father about not being sexually molested as a child.\n\n----------------------------\n\nPlease seed, comment and enjoy!\n\nBrought to you by Crisp","torrent":{"xt":"urn:btih:77dc5068a02bb51a8f1a19e72747be018b8bc990","amp;dn":"South+Park+-+Season+03+-Crisp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77dc5068a02bb51a8f1a19e72747be018b8bc990","infoHashBuffer":{"type":"Buffer","data":[119,220,80,104,160,43,181,26,143,26,25,231,39,71,190,1,139,139,201,144]},"announce":[],"urlList":[]}}