{"title":"VideoHive - Parallax Intro","uid":14224230,"size":42945352,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:77f2657eb05f7457381292917b3ae8b35c8b8ac5&amp;dn=VideoHive+-+Parallax+Intro&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"DesignWarez","files":1,"time":1460069439,"description":"‘Parallax Intro Kit’ cinematic slide show perfect for your opener, tv show, photo/video slide show or any media opener . Even special events. You can use images instead of videos. Very simple and well organize project. You can easily change the colors in just one simple step. Changing text , drop your media, audio and hit render. Fast rendering project. An elegant and simple photo gallery with parallax effect. This After Effects template is suitable for presenting your family images or videos as well as any business media. This project is clean and simple and contains a variety of beautiful slide designs and it can be also used to present any occasion media: wedding, vacation gallery, photo albums, anniversary, birthdays, friends or other any special events.\r\n\r\nYou can use this template for: wedding and romantic opener or slideshow, special event opener, quick slideshow, photo album, fast and minimal promo, simple slides, lovely slideshow, travel opener, gallery. It can be showcase for your product, commercial promo, adventure slideshow, wedding and romantic opener, you can create presentation for your business. Also, you can combine this template with my other items and create: video album, summer travel or adventure in interesting tour, design your elegant reel, holiday slideshow, simple quick slideshow, showreel, demo reel or any type of slideshow, opener, promo, intro, for your media. Design your own vintage story, video for product launch, corporate presentation, product gallery, site presentation, retro style promotion, lovely opener, dynamic intro, workout instruction, documentary film. Create travel slideshow, simple slides, minimal slideshow, company history video, urban demo reel, trailer, scrolling slides, grunge media opener, sport event, present a new brand, education video, tutorial, christmas, birthday, anniversary, memorial day, wedding day, you can make any event! Create your own magazine demo reel, night party, present your portfolio, opener for any special occasions, application promo. Use it for TV show, design your awesome broadcast pack, awards package, use my work in fashion event and you can give your media more gloss and glamour. Make your own magazine demo reel, night party, present your portfolio, corporate opener, opener for any special occasions, app promo. Create video for YouTube or Vimeo or other media hosting site. You can place video inTwitter or any other social networks and impress your friends. \r\n\r\nInformation: http://videohive.net/item/parallax-intro/13014901","torrent":{"xt":"urn:btih:77f2657eb05f7457381292917b3ae8b35c8b8ac5","amp;dn":"VideoHive+-+Parallax+Intro","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77f2657eb05f7457381292917b3ae8b35c8b8ac5","infoHashBuffer":{"type":"Buffer","data":[119,242,101,126,176,95,116,87,56,18,146,145,123,58,232,179,92,139,138,197]},"announce":[],"urlList":[]}}