{"title":"Locke + Key (Complete) [NVS-D]","uid":9379087,"size":1831663158,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7807c6f6f8d6486052d2340c559ebcf27cf28dc4&amp;dn=Locke+%2B+Key+%28Complete%29+%5BNVS-D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":5,"uploader":"RubrumPopulus","files":-1,"time":1387682425,"description":"This torrent includes the entire IDW series Locke &amp; Key.  All books are written by Joe Hill, and drawn by Gabriel Rodriguez.  Also  included are the various one-shots and specials that have come out in between arcs along the way.\nc2c, noAds, and HD versions are included when available.\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software.  If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n========================================================\n\n\nLocke &amp; Key (Complete)\nLocke &amp; Key tells of Keyhouse, an unlikely New England mansion, with fantastic doors that transform all who dare to walk through them.... and home to a hate-filled and relentless creature that will not rest until it forces open the most terrible door of them all...! Acclaimed suspense novelist and New York Times best-selling author Joe Hill (Heart-Shaped Box) creates an all-new story of dark fantasy and wonder, with astounding artwork from Gabriel Rodriguez.\n\n========================================================\n\n\nLocke &amp; Key - Head Games (Complete)\nFollowing a shocking death that dredges up memories of their father's murder, Kinsey and Tyler Locke are thrown into choppy emotional waters, and turn to their new friend, Zack Wells, for support, little suspecting Zack's dark secret. Meanwhile, six-year-old Bode Locke tries to puzzle out the secret of the head key, and Uncle Duncan is jarred into the past by a disturbingly familiar face. Open your mind - the head games are just getting started!\n\n========================================================\n\n\nLocke &amp; Key - Crown of Shadows (Complete)\nThe dead plot against the living, the darkness closes in on Keyhouse, and a woman is shattered beyond repair, in the third storyline of the Eisner-nominated series, Locke &amp; Key! Dodge continues his relentless quest to find the key to the black door, and raises an army of shadows to wipe out anyone who might get in his way. Surrounded and outnumbered, the Locke children find themselves fighting a desperate battle, all alone, in a world where the night itself has become their enemy.\n\n========================================================\n\n\nLocke &amp; Key - Keys to the Kingdom (Complete)\nJoe Hill and Gabriel Rodriguez's Locke &amp; Key unwinds into its fourth volume in Keys to the Kingdom! With more keys making themselvesknown, and the depths of the Locke's family's mystery ever-expanding, Dodge'sdesperation to end his shadowy quest drives the habitants of Keyhouse evercloser to a revealing conclusion.\n\n========================================================\n\n\nLocke &amp; Key - Clockworks (Complete)\nColonel Adam Crais's minutemen are literally trapped between a rock and a hard place; in the first days of the Revolutionary War, they find themselves hiding beneath 120 feet of New England stone, with a full regiment of redcoats waiting for them in the daylight... and a door into hell in the cavern below.\nThe black door is open, and it's up to a 16-year-old smith named Ben Locke to find a way to close it. The biggest mysteries of the Locke &amp; Key series are resolved as Clockworks opens, not with a bang, but with the thunderous crash of English cannons.\n\n========================================================\n\n\nLocke &amp; Key - Omega (Complete)\nThe Locke family's story began in 2007 in Welcome to Lovecraft, and after five years of tension and terror, there are only seven issues left to their story. The beginning of the end starts here. Dodge has the Omega key, and nothing can stop him from using it.\n\n========================================================\n\n\nLocke &amp; Key - Alpha (Complete)\n'Omega and Alpha,' part 1: In the second-to-the-last issue of Locke &amp; Key, the damned and the saved alike will make their final stand in the Drowning Cave, in a clash of blood and fire. The shadows have never been darker and the end has never been closer. Turn the key and open the last door; it's time to say goodbye.\n\n\n\nThanks goes to Steam, GreenGiant, and theProletariat for these scans.","torrent":{"xt":"urn:btih:7807c6f6f8d6486052d2340c559ebcf27cf28dc4","amp;dn":"Locke+%2B+Key+%28Complete%29+%5BNVS-D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7807c6f6f8d6486052d2340c559ebcf27cf28dc4","infoHashBuffer":{"type":"Buffer","data":[120,7,198,246,248,214,72,96,82,210,52,12,85,158,188,242,124,242,141,196]},"announce":[],"urlList":[]}}