{"title":"State-Sponsored Terrorism, Crimes - Collection 21 (Drone Warfare","uid":11743114,"size":78383492,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78316dc3e9cb952fed4d857cccbaf5ffbd5814de&amp;dn=State-Sponsored+Terrorism%2C+Crimes+-+Collection+21+%28Drone+Warfare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"moman73","files":35,"time":1425875476,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 21 (Drone Warfare):\n\nWe have 35 titles here:\n\n-  Abdul-Rehman - Impact of Drone Attack in Pakistan and the War on Terror, Malmo Univ. (Oct., 2013)\n\n-  Amnesty Int. - USA, Targeted Killing Policies Violate the Right to Life (2012)\n\n-  Amnesty Int. - Will I Be Next; US Drone Strikes in Pakistan (2013)\n\n-  Anderson - Targeted Killing and Drone Warfare; How to Come to Debate Whether There Is a Legal Geography of War, Hoover Institution, Stanford Univ. (2011)\n\n-  Bashir &amp; Crews - Under the Drones; Modern Lives in the Afghanistan-Pakistan Borderlands (2012)\n\n-  Benjamin - Drone Warfare; Killing by Remote Control (2012)\n\n-  Benjamin - War on Demand; the Global Rise of Drones, Rosa Luxemburg Stiftung (June, 2013)\n\n-  Bergen &amp; Rothenberg (Eds.) - Drone Wars; Transforming Conflict, Law, and Policy (2015)\n\n-  Boyle - The Costs and Consequences of Drone Warfare, Int. Affairs (2013)\n\n-  Chomsky &amp; Vltchek - On Western Terrorism from Hiroshima to Drone Warfare (2013)\n\n-  Counting Drone Strike Deaths, Columbia Law School (Oct., 2012)\n\n-  Drone Warfare; Are Strikes by Unmanned Aircraft Ethical, CQ Researcher, Aug. 6, 2010\n\n-  Drone Wars; the Constitutional and Counterterrorism Implications of Targeted Killing, Statement on Behalf of Amnesty Int. USA (April, 2013)\n\n-  Drones; the Physical and Psychological Implications of a Global Theatre of War, Medact (2012)\n\n-  Dworkin - Drones and Targeted Killing; Defining a European Position, European Council on Foreign Relations (July, 2013)\n\n-  Evangelista &amp; Shue (Eds.) - The American Way of Bombing; Changing Ethical and Legal Norms, from B-17s to Drones (2014)\n\n-  Finkelstein et al (Eds.) - Targeted Killings; Law and Morality in an Asymmetrical World (2012)\n\n-  Forge - Designed to Kill; the Case Against Weapons Research (2013)\n\n-  HRW - A Wedding That Became a Funeral; US Drone Attack on Marriage Procession in Yemen (2014)\n\n-  HRW - Losing Humanity; the Case Against Killer Robots (2012)\n\n-  HRW - Shaking the Foundations; the Human Rights Implications of Killer Robots (2014)\n\n-  Human Rights Implications of the Usage of Drones and Unmanned Robots in warfare, Policy Dept., European Parliament (2013)\n\n-  Kaag &amp; Kreps - Drone Warfare (2014)\n\n-  Living Under Drones; Death, Injury, and Trauma to Civilians from US Drone Practice in Pakistan, Stanford-NYU Report, Sept. 2012\n\n-  Martin &amp; Sasser - Predator; the Remote-Control Air War Over Iraq and Afghanistan; a Pilot's Story (2010)\n\n-  Olson &amp; Rashid - Modern Drone Warfare; an Ethical Analysis, American Society for Engineering Education (2013)\n\n-  Recommendations and Report of the Task Force on US Drone Policy, Stimson (June, 2014)\n\n-  Rogers &amp; Hill - Unmanned; Drone Warfare and Global Security (2014)\n\n-  Shaw - Predator Empire; the Geopolitics of US Drone Warfare, Geopolitics (June, 2013)\n\n-  Shaw - The Spatial Politics of Drone Warfare; PhD Dissertation, Univ. of Arizona (2011)\n\n-  Shaw &amp; Akhter - The Dronification of State Violence, Critical Asian Studies (2014)\n\n-  Sterio - The U.S. Use of Drones in the War on Terror; the Illegality of Targeted Killings Under International Law, CWR Journal of Int. Law, (Fall, 2012)\n\n-  Turse &amp; Engelhardt - Terminator Planet; the First History of Drone Warfare, 2001-2050 (2012)\n\n-  Williams - Predators; the CIA's Drone War on al Qaeda (2013)\n\n-  Zenko - Reforming US Drone Strike Policies, Council on Foreign Relations, Report No. 65, Jan. (2013)","torrent":{"xt":"urn:btih:78316dc3e9cb952fed4d857cccbaf5ffbd5814de","amp;dn":"State-Sponsored+Terrorism%2C+Crimes+-+Collection+21+%28Drone+Warfare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78316dc3e9cb952fed4d857cccbaf5ffbd5814de","infoHashBuffer":{"type":"Buffer","data":[120,49,109,195,233,203,149,47,237,77,133,124,204,186,245,255,189,88,20,222]},"announce":[],"urlList":[]}}