{"title":"Michael Jackson - The Essential (2CD) (Re-Rip)[EAC-FLAC][RePoPo]","uid":4999460,"size":1142931054,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7880f0b77e19d25eb7d4970dbeb6545e3300bc49&amp;dn=Michael+Jackson+-+The+Essential+%282CD%29+%28Re-Rip%29%5BEAC-FLAC%5D%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":4,"uploader":"repopo","files":-1,"time":1247445206,"description":"This release fixes some corruption found on the previous FLAC I shared. I'm sorry for those who spent time downloading it, and for the memory of MJ, which that fawlty release might have damaged in some way. Here's my apology in the shape of a new, corrected torrent. I hope you like it.\n\nLong live the King.\n\n*******************************************************************************\n                     Michael Jackson - The Essential (2CD)\n*******************************************************************************\n\nCD: Michael Jackson - The Essential (CD 1)\n\n01. I Want You Back    [0:02:58.57]\n02. ABC    [0:02:57.10]\n03. The Love You Save    [0:03:05.08]\n04. Got To Be There    [0:03:25.02]\n05. Rockin' Robin    [0:02:32.62]\n06. Ben    [0:02:46.18]\n07. Blame It On The Boogie    [0:03:30.40]\n08. Shake Your Body (Down To The Ground)    [0:03:45.54]\n09. Don't Stop 'Til You Get Enough    [0:03:56.35]\n10. Off The Wall    [0:03:46.00]\n11. Rock With You    [0:03:23.06]\n12. She's Out Of My Life    [0:03:37.20]\n13. Can You Feel It    [0:03:50.23]\n14. The Girl Is Mine    [0:03:41.68]\n15. Billie Jean    [0:04:52.72]\n16. Beat It    [0:04:18.03]\n17. Wanne Be Startin' Somethin'    [0:04:17.30]\n18. Human Nature    [0:03:45.73]\n19. P.Y.T. (Pretty Young Thing)    [0:03:58.55]\n20. I Just Can't Stop Loving You    [0:04:11.66]\n21. Thriller    [0:05:14.40]\n\n\nCD: Michael Jackson - The essential (CD2)\n\n01. Bad    [0:04:06.52]\n02. The way you make me feel    [0:04:26.26]\n03. Man in the mirror    [0:05:18.72]\n04. Dirty Diana    [0:04:40.57]\n05. Another part of me    [0:03:46.46]\n06. Smooth criminal    [0:04:17.18]\n07. Leave me alone    [0:04:39.66]\n08. Black or white    [0:03:21.40]\n09. Remember the time    [0:03:59.67]\n10. In the closet    [0:04:48.61]\n11. Who is it    [0:03:59.42]\n12. Heal the world    [0:06:24.70]\n13. Will you be there    [0:03:40.24]\n14. You are not alone    [0:04:55.74]\n15. Earth song    [0:05:02.08]\n16. They don't care about us    [0:04:44.29]\n17. You rock my world    [0:05:08.25]\n\n-------------------------------------------------------------------------------\n\nAlbum Review\tby Rob Theakston\n\nThere are several Michael Jackson greatest-hits compilations out there, each one \nits own take on what should be the definitive portrait of the gloved one's \ncareer. The Ultimate Collection, The Essential Collection (different from the \none here), and Number Ones have all surfaced in 2003 and 2004, and HIStory a few \nyears prior. Each one of these collections, while commendable in its attempt to \nthoroughly document Jackson's accomplishments, has fallen woefully short in one \naspect or another. This has finally been rectified with this installment of \nSony's outstanding Essential collection. Starting with his campaign with his \nbrothers in the Jackson 5, this two-disc set tours through every important \nsingle and every important fan favorite short of including his duet with Paul \nMcCartney on &quot;Say Say Say&quot; (the Beatle does, however, make an appearance here on \n&quot;The Girl Is Mine&quot;). From Off the Wall to Dangerous, it's all here in one \nconcise package, making it the ideal reference point from which exploration into \nhis deeper catalog can begin. While die-hard fans will already have every single \nsong contained herein and may be weary to purchase another greatest-hits \ncompilation short of a greatest-hits compilation including his backing vocals on \nRockwell's &quot;Somebody's Watching Me,&quot; this may be the only one fans and casual \nlisteners will ever have to purchase to get their fill of the King of Pop's \nmagic.\n\n-------------------------------------------------------------------------------\n\nBiography\tby Steve Huey\n\nMichael Jackson was unquestionably the biggest pop star of the '80s, and \ncertainly one of the most popular recording artists of all time. In his prime, \nJackson was an unstoppable juggernaut, possessed of all the tools to dominate \nthe charts seemingly at will: an instantly identifiable voice, eye-popping dance \nmoves, stunning musical versatility, and loads of sheer star power. His 1982 \nblockbuster Thriller became the biggest-selling album of all time (probably his \nbest-known accomplishment), and he was the first black artist to find stardom on \nMTV, breaking down innumerable boundaries both for his race and for music video \nas an art form. Yet as Jackson's career began, very gradually, to descend from \nthe dizzying heights of his peak years, most of the media's attention focused on \nhis increasingly bizarre eccentricities; he was often depicted as an arrested \nman-child, completely sheltered from adult reality by a life spent in show \nbusiness. The snickering turned to scandal in 1993, when Jackson was accused of \nmolesting a 13-year-old boy; although he categorically denied the charges, his \nout-of-court settlement failed to restore his tarnished image. He never quite \nescaped the stigma of those allegations, and while he continued to sell records \nat superstar-like levels, he didn't release them with enough frequency (or, many \ncritics thought, inspiration) to once again become better known for his music \nthan his private life. Whether as a pop icon or a tabloid caricature, Jackson \nalways remained bigger than life.\n\nMichael Joseph Jackson was born August 29, 1958, in Gary, IN. The fifth son of \nsteelworker Joe Jackson, Michael displayed a talent for music and dance from an \nextremely young age. His childhood was strictly regimented; from the start, he \nwas to an extent sheltered from the outside world by his mother's Jehovah's \nWitness faith, and his father was by all accounts an often ill-tempered \ndisciplinarian. Joe began to organize a family musical group around his three \neldest sons in 1962, and Michael joined them the following year, quickly \nestablishing himself as a dynamic stage performer. His dead-on mastery of James \nBrown's dance moves and soulful, mature-beyond-his-years vocals made him a \nnatural focal point, especially given his incredibly young age. Dubbed the \nJackson 5, the group signed to Motown in 1968 and issued their debut single in \nOctober 1969, when Michael was just 11 years old. &quot;I Want You Back,&quot; &quot;ABC,&quot; &quot;The \nLove You Save,&quot; and &quot;I'll Be There&quot; all hit number one in 1970, making the \nJackson 5 the first group in pop history to have their first four singles top \nthe charts. Motown began priming Michael for a solo career in 1971, and his \nfirst single, &quot;Got to Be There,&quot; was issued toward the end of the year; it hit \nthe Top Five, as did the follow-up, a cover of Bobby Day's &quot;Rockin' Robin.&quot; \nLater in 1972, Jackson had his first number one solo single, &quot;Ben,&quot; the title \nsong from a children's thriller about a young boy who befriends Ben, the highly \nintelligent leader of a gang of homicidal rats. Given the subject matter, the \nsong was surprisingly sincere and sentimental, and even earned an Oscar \nnomination. However, the momentum of Jackson's solo career (much like that of \nthe Jackson 5) soon stalled. He released his fourth and final album on Motown in \n1975, and the following year, he and his brothers (save Jermaine) signed to Epic \nand became the Jacksons.\n\nIn 1977, Jackson landed a starring role alongside Diana Ross in the all-black \nfilm musical The Wiz, a retelling of The Wizard of Oz; here he met \nproducer/composer Quincy Jones for the first time. Encouraged by the success of \nthe Jacksons' self-produced, mostly self-written 1978 album Destiny, Jackson \nelected to resume his solo career when his management contract with his father \nexpired shortly thereafter. With Jones producing, Jackson recorded his first \nsolo album as an adult, Off the Wall. An immaculately crafted set of funky \ndisco-pop, smooth soul, and lush, sentimental pop ballads, Off the Wall made \nJackson a star all over again. It produced four Top Ten singles, including the \nnumber one hits &quot;Don't Stop 'til You Get Enough&quot; and &quot;Rock With You,&quot; and went \nplatinum (it went on to sell over seven million copies); even so, Jackson \nremained loyal to his brothers and stayed with the group.\n\nNo group could have contained Jackson's rapidly rising star for long; however, \nthere was still no sign (if there ever could be) that his next album would \nbecome the biggest in history. Released in 1982, the Quincy Jones-produced \nThriller refined the strengths of Off the Wall; the dance and rock tracks were \nmore driving, the pop tunes and ballads softer and more soulful, and all of it \nwas recognizably Michael. Jackson brought in Paul McCartney for a duet, \nguitarist Eddie Van Halen for a jaw-dropping solo, and Vincent Price for a \ncreepy recitation. It was no surprise that Thriller was a hit; what was a \nsurprise was its staying power. Jackson's duet with McCartney, &quot;The Girl Is \nMine,&quot; was a natural single choice, and it peaked at number two; then &quot;Billie \nJean&quot; and the Van Halen track &quot;Beat It&quot; both hit number one, for seven and three \nweeks respectively. Those latter two songs, as well as the future Top Five title \ntrack, had one important feature in common: Jackson supported them with \nelaborately conceived video clips that revolutionized the way music videos were \nmade. Jackson treated them as song-length movies with structured narratives: \n&quot;Billie Jean&quot; set the song's tale of a paternity suit in a nightmarish dream \nworld where Jackson was a solitary, sometimes invisible presence; the anti-gang\n-violence &quot;Beat It&quot; became an homage to West Side Story; and the ten-minute-plus \nclip for &quot;Thriller&quot; (routinely selected as the best video of all time) featured \nJackson leading a dance troupe of rotting zombies, with loads of horror-film \nmakeup and effects. Having never really accepted black artists in the past, MTV \nplayed the clips to death, garnering massive publicity for Jackson and droves of \nviewers for the fledgling cable network. Jackson sealed his own phenomenon by \ndebuting his signature &quot;moonwalk&quot; dance step on May 16, 1983, on Motown's \ntelevised 25th anniversary special; though he didn't invent the moonwalk (as he \nhimself was quick to point out), it became as much of a Jackson signature as his \nvocal hiccups or single white-sequined glove.\n\nShowing no signs of slowing down, Thriller just kept spinning off singles, \nincluding &quot;Wanna Be Startin' Somethin',&quot; the airy ballad &quot;Human Nature,&quot; and \n&quot;P.Y.T. (Pretty Young Thing)&quot;; in all, seven of its nine tracks wound up in the \nTop Ten, obliterating conventional ideas of how many singles could be released \nfrom an album before it ran its course. Thriller stayed on the charts for over \ntwo years, spent 37 nonconsecutive weeks at number one, and became the best-\nselling album of all time; it went on to sell 25 million copies in the U.S. \nalone, and around another 20 million overseas. Naturally, Jackson won a slew of \nawards, including a record eight Grammys in one night, and snagged the largest \nendorsement deal ever when he became a spokesman for Pepsi (he would later be \nburned in an accident while filming a commercial). At the end of 1983, Jackson \nwas again on top of the singles charts, this time as part of a second duet with \nMcCartney, &quot;Say Say Say.&quot; In 1984, Jackson rejoined his brothers one last time \nfor the album Victory, whose supporting tour was one of the biggest (and \npriciest) of the year. The following year, he and Lionel Richie co-wrote the \nanthemic &quot;We Are the World&quot; for the all-star famine-relief effort USA for \nAfrica; it became one of the fastest-selling singles ever.\n\nEven at this early stage, wild rumors about Jackson's private life were \nswirling. His shyness and reluctance to grant interviews (ironically, due in \npart to his concerns about being misrepresented) only encouraged more \nspeculation. Some pointed to his soft-spoken, still girlish voice as evidence \nthat he'd undergone hormone treatments to preserve the high, flexible range of \nhis youth; stories were told about Jackson sleeping in a hyperbaric chamber to \nslow the aging process, and purchasing the skeleton of John Merrick, the \nElephant Man (Jackson did view the bones in the London Hospital, but did not buy \nthem). Jackson bought a large ranch in California which he dubbed Neverland, and \nfilled it with amusement park rides and animals (including the notorious pet \nchimpanzee Bubbles), which only fueled the public's perception of him as a \nsomewhat bizarre eccentric obsessed with recapturing his childhood. He also \nunderwent cosmetic surgery several times, which led to accusations from the \nblack community that his gradually lightening skin tone was the result of an \nintentional effort to become whiter; a few years later, Jackson revealed that he \nhad a disorder called vitiligo, in which pigment disappears from the skin, \nleaving large white blotches and making direct sunlight dangerous. One of the \nrumors that was definitely true was that Jackson owned the rights to the \nBeatles' catalog; in 1985, he acquired ATV Publishing, the firm that controlled \nall the Lennon-McCartney copyrights (among others), which wound up costing him \nhis friendship with McCartney.\n\nDuring his long layoff between records, Jackson indulged his interest in film \nand video by working with George Lucas and Francis Ford Coppola on the 3-D short \nfilm Captain Eo. The special-effects extravaganza was shown at the enormous \nwidescreen IMAX theaters in Disney's amusement parks for 12 years, beginning in \n1986. Finally, Jackson re-entered the studio with Quincy Jones to begin the \nnear-impossible task of crafting a follow-up to Thriller. Bad was released to \nenormous public anticipation in 1987, and was accompanied by equally enormous \npublicity. It debuted at number one, and the first single, &quot;I Just Can't Stop \nLoving You,&quot; with vocal accompaniment by Siedah Garrett, also shot up the charts \nto number one. Like Thriller, Bad continued to spin off singles for well over a \nyear after its release, and became the first album ever to produce five number \none hits; the others were &quot;Bad,&quot; &quot;The Way You Make Me Feel,&quot; &quot;Man in the \nMirror,&quot; and &quot;Dirty Diana.&quot; Jackson supported the album with a lengthy world \ntour that featured a typically spectacular, elaborate stage show; it became the \nhighest-grossing tour of all time. Although Jackson's success was still \nstaggering, there were faint undercurrents of disappointment, partly because of \nthe unparalleled phenomenon of Thriller (Bad &quot;only&quot; sold eight million copies), \nand partly because the album itself didn't seem quite as exuberant or uniformly \nconsistent when compared to its predecessors.\n\nJackson took another long hiatus between albums, giving the media little to \nfocus on besides his numerous eccentricities; by this time, the British tabloids \ndelighted in calling him &quot;Wacko Jacko,&quot; a name he detested. When Jackson \nreturned in with a new album in late 1991, he'd come up with a different \nmoniker: &quot;the King of Pop.&quot; Dangerous found Jackson ending his collaboration \nwith Quincy Jones in an effort to update his sound; accordingly, many of the \ntracks were helmed by the groundbreaking new jack swing producer Teddy Riley. As \nexpected, the album debuted at number one, and its lead single, &quot;Black or \nWhite,&quot; shot to the top as well. Jackson courted controversy with the song's \nvideo, however; after the song itself ended, there was a long dance sequence in \nwhich Jackson shouted, grabbed his crotch, and smashed car windows in a bizarre \ndisplay that seemed at odds with the song's harmonious message. With the video \ngiven a high-profile, prime-time network premiere, Jackson was criticized for \nthe inappropriate violence and the message it might send to his younger fans. \nHowever, Jackson would not be the biggest story in popular music for long. In \nearly 1992, Nirvana's Nevermind symbolically knocked Dangerous out of the number \none spot; after the alternative rock revolution, the pop charts would never be \nquite the same. Jackson scored several more hits off the album, including the \nTop Tens &quot;Remember the Time&quot; and &quot;In the Closet,&quot; but the aggressive &quot;Jam&quot; and \nthe saccharine &quot;Heal the World&quot; both performed disappointingly.\n\nJackson had long preferred the company of children over other adults, and \nbefriended quite a few, inviting them to stay at his Neverland Ranch and enjoy \nthe massive playground he'd assembled over the years. In 1993, Jackson was \naccused of molesting a 13-year-old boy who'd become a frequent guest at \nNeverland. Predictably, there was a tabloid feeding frenzy, and a mainstream \nmedia circus as well. In the court of public opinion, the charges seemed all too \nplausible: Jackson was near-universally perceived as a weirdo, and here was a \nhandy explanation for his heretofore asexual persona and distaste for adult \ncompanions. Additionally, Jackson entered rehab for a short time, seeking \ntreatment for an addiction to pain killers. Investigations were unsuccessful in \nturning up any other boys who echoed the allegations, and Jackson countersued \nhis accusers for attempting extortion; however, in spite of the fact that no \ncriminal charges were ever filed against Jackson, he settled the boy's family's \nsuit out of court in early 1995, paying an estimated 18 to 20 million dollars. \nMany felt the settlement was tantamount to an admission of guilt, and when \nJackson married Lisa Marie Presley in 1994, the move was perceived as a \ndesperate ploy to rehabilitate his image; the marriage broke up just 19 months \nlater, seemingly lending credence to the charge.\n\nIn 1995, Jackson attempted to put the focus back on his music by preparing \nHIStory: Past, Present and Future, Book 1, a two-CD set featuring one disc of \nnew material and one of his greatest hits. The album debuted at number one, but \nthe format backfired on Jackson: his fans already owned the hits, and the new \nalbum simply wasn't strong enough to offset the added cost of the extra disc for \nmany more casual listeners. There were some encouraging signs -- the lead single \n&quot;Scream,&quot; a duet with sister Janet, debuted at number five, setting a new \nAmerican chart record that was broken when the follow-up, &quot;You Are Not Alone,&quot; \nbecame the first single ever to enter the Billboard Hot 100 at number one. But \non the whole, HIStory was something of a disappointment. Additionally, Jackson \ncollapsed during rehearsals for an awards show later that year, and had to be \nrushed to the hospital; what was more, the Eagles' Their Greatest Hits (1971-\n1975) was threatening to catch Thriller's American sales record (it eventually \ndid, and the two continued to run neck and neck). There were signs that Jackson \nwas grasping at his self-proclaimed King of Pop status; the cover of HIStory \ndepicted an enormous statue of Jackson, and he performed at the 1996 BRIT Awards \ndressed as a Messiah, with children and a rabbi surrounding him worshipfully \n(Pulp lead singer Jarvis Cocker stormed the stage to protest Jackson's hubris \nduring the middle of the song). The 1997 remix album Blood on the Dance Floor \nfailed to even go platinum, although remix albums historically don't perform \nnearly as well as new material.\n\nIn late 1996, Jackson remarried, to nurse Debbie Rowe; over the next two years, \nthe couple had two children, son Prince Michael Jackson, Jr. and daughter Paris \nMichael Katherine Jackson. However, Jackson and Rowe divorced in late 1999. In \n2001, Jackson was inducted into the Rock and Roll Hall of Fame, and later held a \nmassive concert at Madison Square Garden celebrating the 30th anniversary of his \nfirst solo record. Among many other celebrity guests, the show featured the \nfirst on-stage reunion of the Jacksons since the Victory tour. In the wake of \nSeptember 11, Jackson put together an all-star charity benefit single, &quot;What \nMore Can I Give.&quot; His new album, Invincible, was released late in the year, \nmarking the first time he'd issued a collection of entirely new material since \nDangerous; it found him working heavily with urban soul production wizard Rodney \nJerkins. Invincible debuted at number one and quickly went double platinum; \nhowever, its initial singles, &quot;You Rock My World&quot; and &quot;Butterflies,&quot; had rather \ndisappointing showings on the charts, with the latter not even reaching the Top \nTen. To compound matters, the expensive &quot;What More Can I Give&quot; single and video \nwere canceled by Sony when executive producer Marc Schaffel was revealed to work \nin pornography. Jackson's camp tried to distance the singer from Schaffel, and \nthe various corporations that were attached to it (McDonalds, Sony) claimed they \nhad minimal involvement if any with the song. Sony and Jackson began a press war \nin the summer of 2002, starting with Jackson's claims that the label asked for \n200 million dollars to pay them back for marketing costs. Although they had \nspent 55 million on his disappointing comeback, Sony released a statement saying \nthat no such request had ever been made. Jackson stewed for a few weeks before \nlaunching a press attack on Sony Music chairman Tommy Mottola, calling him \n&quot;devilish&quot; and making claims that he used racist language and held down black \nartists. Many Sony artists, including Mariah Carey and Ricky Martin, defended \nMottola, but Jackson and his family maintained that racism ended their \nprofessional relationship.\n\nFrom that point, Jackson's career took an extreme turn toward the bizarre, \nstarting with MTV's annual Video Awards. When Britney Spears presented him with \na birthday cake, an offhand remark about being the artist of the millennium \ninspired a rambling Jackson to accept a meaningless trophy (which everyone \npresenting on-stage received) as an actual Artist of the Millennium award. Next \ncame accusations from a promotional company over his promises of a tour and \nseveral appearances that he then canceled. Jackson arrived in court late, gave a \ndrowsy testimony, and inspired gasps when he removed a surgical mask to reveal \nhis nose had caved in from a botched cosmetic surgery. Only days later, German \nfans were horrified when Jackson came to the balcony of his hotel suite and \nbriefly dangled his 11-month old baby Prince Michael II (nicknamed &quot;Blanket&quot; by \nJackson) over the edge with one arm. Although he apologized the next day, \nclaiming he had gotten caught up in the moment, this only did more to cement the \nKing of Pop's public image as an out-of-control millionaire. 2003 turned out to \nnot be Jackson's year as in November his Neverland Ranch was extensively \nsearched by police, whereby he was subsequently arrested on charges of child \nmolestation. That same month the single disc retrospective Number Ones hit the \nstands with one new song, &quot;One More Chance&quot;. A year later - nearly to the day - \nthe four CD and one DVD box set The Ultimate Collection appeared with numerous \nrarities including the original demo for &quot;We Are the World&quot;. In January 2005 his \nchild molestation trial began and by May he was acquitted on all counts. Jackson \nsoon relocated to the Persian Gulf island of Bahrain and began working on new \nmusic including a charity single that would benefit victims of Hurricane \nKatrina. The single never appeared but the two disc The Essential Michael \nJackson did and in 2006 the strange box set Visionary was released featuring 20 \nDualDiscs replicating 20 big hit singles with their videos included on the DVD \nside. In early 2007 it was announced that a comeback album was planned for late \nin the year. \n\n-------------------------------------------------------------------------------\n                               EAC LOG EXTRACTS\n-------------------------------------------------------------------------------\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 11. July 2009, 21:35\n\nMichael Jackson / The Essential (CD 1)\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -8 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\n-------------------------------------------------------------------------------\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 12. July 2009, 12:48\n\nMichael Jackson / The essential (CD2)\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -8 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\n\n-------------------------------------------------------------------------------\n                                ACCURIP REPORTS\n-------------------------------------------------------------------------------\n\n[Verification date: 11/07/2009 22:10:09]\n[Disc ID: 00364bed-0351ae6b-39124315]\nTrack\t[ CRC    ] Status\n 01\t[572c9493] (19/76) Accurately ripped as in pressing(s) #2\n 02\t[a307ee44] (19/75) Accurately ripped as in pressing(s) #2\n 03\t[e9e9acd0] (18/74) Accurately ripped as in pressing(s) #2\n 04\t[08358b89] (18/72) Accurately ripped as in pressing(s) #2\n 05\t[ae74576d] (18/73) Accurately ripped as in pressing(s) #2\n 06\t[ac5fffbc] (18/74) Accurately ripped as in pressing(s) #2\n 07\t[3847ba86] (19/77) Accurately ripped as in pressing(s) #2\n 08\t[9f57b51e] (18/74) Accurately ripped as in pressing(s) #2\n 09\t[6b180655] (19/78) Accurately ripped as in pressing(s) #2\n 10\t[d9212f09] (18/75) Accurately ripped as in pressing(s) #2\n 11\t[2bb92ea9] (18/74) Accurately ripped as in pressing(s) #2\n 12\t[2c554c80] (17/71) Accurately ripped as in pressing(s) #2\n 13\t[3d8851f7] (17/74) Accurately ripped as in pressing(s) #2\n 14\t[acc68091] (17/73) Accurately ripped as in pressing(s) #2\n 15\t[7406253e] (17/75) Accurately ripped as in pressing(s) #2\n 16\t[431cd47b] (16/75) Accurately ripped as in pressing(s) #2\n 17\t[c9acd4ef] (17/74) Accurately ripped as in pressing(s) #2\n 18\t[17590161] (17/70) Accurately ripped as in pressing(s) #2\n 19\t[8383fde4] (17/72) Accurately ripped as in pressing(s) #2\n 20\t[9b0d9172] (17/71) Accurately ripped as in pressing(s) #2\n 21\t[634ce092] (13/71) Accurately ripped as in pressing(s) #2\nOffsetted by 36:\n 01\t[04aee48d] (57/76) Accurately ripped as in pressing(s) #1\n 02\t[7d88e6f8] (56/75) Accurately ripped as in pressing(s) #1\n 03\t[f37200f9] (56/74) Accurately ripped as in pressing(s) #1\n 04\t[8afac030] (54/72) Accurately ripped as in pressing(s) #1\n 05\t[a7e55ef8] (55/73) Accurately ripped as in pressing(s) #1\n 06\t[ed269c49] (56/74) Accurately ripped as in pressing(s) #1\n 07\t[c57769cb] (58/77) Accurately ripped as in pressing(s) #1\n 08\t[5d186e0f] (56/74) Accurately ripped as in pressing(s) #1\n 09\t[521c9f5d] (59/78) Accurately ripped as in pressing(s) #1\n 10\t[7bd0e5bc] (57/75) Accurately ripped as in pressing(s) #1\n 11\t[3d860b95] (56/74) Accurately ripped as in pressing(s) #1\n 12\t[7ba210c7] (54/71) Accurately ripped as in pressing(s) #1\n 13\t[15cc777e] (57/74) Accurately ripped as in pressing(s) #1\n 14\t[354ef2dc] (56/73) Accurately ripped as in pressing(s) #1\n 15\t[326ad449] (58/75) Accurately ripped as in pressing(s) #1\n 16\t[390bfb4c] (59/75) Accurately ripped as in pressing(s) #1\n 17\t[4e9372dc] (57/74) Accurately ripped as in pressing(s) #1\n 18\t[31edbbb3] (53/70) Accurately ripped as in pressing(s) #1\n 19\t[c0e35161] (55/72) Accurately ripped as in pressing(s) #1\n 20\t[c5737c13] (54/71) Accurately ripped as in pressing(s) #1\n 21\t[2fe57a6a] (58/71) Accurately ripped as in pressing(s) #1\n\n-------------------------------------------------------------------------------\n\n[Verification date: 12/07/2009 12:49:35]\n[Disc ID: 002eb7a7-02514d6e-f3122211]\nTrack\t[ CRC    ] Status\n 01\t[b7f12071] (15/74) Accurately ripped as in pressing(s) #3\n 02\t[20f50e62] (15/70) Accurately ripped as in pressing(s) #3\n 03\t[703c971d] (15/72) Accurately ripped as in pressing(s) #3\n 04\t[2b8fbb69] (15/74) Accurately ripped as in pressing(s) #3\n 05\t[44676f44] (15/73) Accurately ripped as in pressing(s) #3\n 06\t[d256cb6e] (15/76) Accurately ripped as in pressing(s) #3\n 07\t[9a7d0c1c] (15/72) Accurately ripped as in pressing(s) #3\n 08\t[4f4dbf48] (15/75) Accurately ripped as in pressing(s) #3\n 09\t[9053d624] (15/72) Accurately ripped as in pressing(s) #3\n 10\t[98a3b299] (14/72) Accurately ripped as in pressing(s) #3\n 11\t[ad5a006c] (14/72) Accurately ripped as in pressing(s) #3\n 12\t[fb4b6ee6] (14/73) Accurately ripped as in pressing(s) #3\n 13\t[8bc7c73a] (15/72) Accurately ripped as in pressing(s) #3\n 14\t[fc59f82b] (15/71) Accurately ripped as in pressing(s) #3\n 15\t[a76c6dff] (15/74) Accurately ripped as in pressing(s) #3\n 16\t[157ba3d2] (16/72) Accurately ripped as in pressing(s) #2\n 17\t[3ed31e5b] (14/69) Accurately ripped as in pressing(s) #3\nOffsetted by -592:\n 01\t[7354f053] (16/74) Accurately ripped as in pressing(s) #2\n 02\t[c19cbac7] (16/70) Accurately ripped as in pressing(s) #2\n 03\t[c1953314] (16/72) Accurately ripped as in pressing(s) #2\n 04\t[cb4509e1] (16/74) Accurately ripped as in pressing(s) #2\n 05\t[7280884c] (16/73) Accurately ripped as in pressing(s) #2\n 06\t[716e580f] (16/76) Accurately ripped as in pressing(s) #2\n 07\t[f49e10aa] (16/72) Accurately ripped as in pressing(s) #2\n 08\t[0c93af2f] (16/75) Accurately ripped as in pressing(s) #2\n 09\t[13cc7233] (16/72) Accurately ripped as in pressing(s) #2\n 10\t[048ac124] (16/72) Accurately ripped as in pressing(s) #2\n 11\t[a5d007f5] (16/72) Accurately ripped as in pressing(s) #2\n 12\t[e8101c2f] (16/73) Accurately ripped as in pressing(s) #2\n 13\t[c477a6f0] (16/72) Accurately ripped as in pressing(s) #2\n 14\t[2e9d169b] (16/71) Accurately ripped as in pressing(s) #2\n 15\t[36f24465] (16/74) Accurately ripped as in pressing(s) #2\n 16\t[af3d7f82] (16/72) Accurately ripped as in pressing(s) #3\n 17\t[d98d25f3] (15/69) Accurately ripped as in pressing(s) #2\nOffsetted by 36:\n 01\t[f015522e] (43/74) Accurately ripped as in pressing(s) #1\n 02\t[02babea5] (39/70) Accurately ripped as in pressing(s) #1\n 03\t[b29dfc08] (41/72) Accurately ripped as in pressing(s) #1\n 04\t[7ab52c91] (43/74) Accurately ripped as in pressing(s) #1\n 05\t[b4f6a8ca] (42/73) Accurately ripped as in pressing(s) #1\n 06\t[cd81ce50] (45/76) Accurately ripped as in pressing(s) #1\n 07\t[b54c00a4] (41/72) Accurately ripped as in pressing(s) #1\n 08\t[ba934dc5] (44/75) Accurately ripped as in pressing(s) #1\n 09\t[69952581] (41/72) Accurately ripped as in pressing(s) #1\n 10\t[a14a67ff] (42/72) Accurately ripped as in pressing(s) #1\n 11\t[8d3df050] (42/72) Accurately ripped as in pressing(s) #1\n 12\t[3e3ccd67] (41/73) Accurately ripped as in pressing(s) #1\n 13\t[a368ae26] (41/72) Accurately ripped as in pressing(s) #1\n 14\t[3ba64d23] (40/71) Accurately ripped as in pressing(s) #1\n 15\t[8ec2083a] (43/74) Accurately ripped as in pressing(s) #1\n 16\t[3db1b307] (40/72) Accurately ripped as in pressing(s) #1\n 17\t[1461d3ca] (40/69) Accurately ripped as in pressing(s) #1\n\n-------------------------------------------------------------------------------\n                      IMPORTANT: PLEASE READ (A REQUEST)\n-------------------------------------------------------------------------------\n\nIt's usual to post comments only to complain about a torrent which doesn't work \nin your configuration.  It's normal, after a few hours/days downloading and \nexpecting a release, to feel deceived if it doesn't work properly, and \nexpressing this is legitimate.\n\nI've often found one comment (negative) on a movie/CD downloaded by 2000+ \npeople, and since that single negative feedback, people simply stop downloading \nand therefore, sharing.  But a few times it was due not to the torrent itself, \nbut to some issues on the downloader side (not updated codecs, misused \ntools...), and that's unfair for the person who took the time to share it for\nfree.\n\nIF YOU FIND THIS RELEASE DESERVES TO BE RECOMMENDED TO OTHERS, HELP BY DROPPING \nA LINE AFTER YOU'VE CHECKED IT.  This way, You'll help in keeping the torrent \nalive, almost as much as keeping it in your HDD until a 1:1 ratio is\nreached.\n\nThanks\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:7880f0b77e19d25eb7d4970dbeb6545e3300bc49","amp;dn":"Michael+Jackson+-+The+Essential+%282CD%29+%28Re-Rip%29%5BEAC-FLAC%5D%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7880f0b77e19d25eb7d4970dbeb6545e3300bc49","infoHashBuffer":{"type":"Buffer","data":[120,128,240,183,126,25,210,94,183,212,151,13,190,182,84,94,51,0,188,73]},"announce":[],"urlList":[]}}