{"title":"Margarethe von Trotta.Die Bleierne Zeit.(Marianne and Juliane).1","uid":6407186,"size":1468567092,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:78c309298b87fbba419b8a957dab97a4c0a49966&amp;dn=Margarethe+von+Trotta.Die+Bleierne+Zeit.%28Marianne+and+Juliane%29.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"pamis2046","files":3,"time":1305848350,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos09.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos09.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos01.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos01.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos05.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos05.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos07.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos07.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos08.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos08.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos10.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1238.photobucket.com/albums/ff491/pamis2046/Cinema/OsAnos10.jpg&lt;/a&gt;\n\nDie bleierne Zeit (1981) \n106 min  -  Drama | History  \n\nDirector: Margarethe von Trotta\nWriter: Margarethe von Trotta\nStars:Jutta Lampe, Barbara Sukowa and RÃƒÂ¼diger Vogler \n\n  Jutta Lampe  ...  Juliane  \n  Barbara Sukowa  ...  Marianne  \n  RÃƒÂ¼diger Vogler  ...  Wolfgang  \n  Doris Schade  ...  The mother  \n  VÃƒÂ©rÃƒÂ©nice Rudolph  ...  Sabine  \n  Luc Bondy  ...  Werner  \n  Franz Rudnick  ...  The father  \n\nCountry:West Germany \nLanguage:German \n\nIn the late 1960s and early 1970s, radical student groups, frustrated with the lack of results from peaceful protests against the Vietnam War, channeled their energies into campaigns of direct action. In the U.S., The Weathermen engaged in widespread civil disobedience including bombings of the Pentagon and the Capitol buildings. In West Germany, a left-wing group that came to be known as the Baader Meinhof Gang or the Red Army Faction, attempted to foment a Marxist-style revolution by engaging in terrorist-style attacks, a campaign that led to robbing banks, kidnappings, and ultimately murder. The three main founding members were Andreas Baader, Gudrun Ensslin, and Ulrike Meinhof. All were captured and sent to prison.\n\nMaragarethe von Trotta's 1981 film, Marianne and Juliane is based on the life of Gudrun Ensslin and her sister Charlotte. Though supporting the same causes, the sisters have a wide divergence of opinion about how to achieve their aims. Juliane (Jutta Lampe) is a feminist reporter who believes that social change can be achieved through political channels while her sister Marianne (Barbara Sukowa) is a member of a terrorist group and believes that violence is justified by the righteousness of her cause. Ms. von Trotta assumes that the viewer has some knowledge of the historical context and does not show specific incidents of direct action or even the source of the group's disaffection. Rather the film is a character study of the two sisters and how Marianne's radical activities affected the people around her.\n\nAs the film opens, Marianne has left her husband and has gone underground as an urban terrorist. Her ex-husband Werner visits Julianne to persuade her to care for their young son Jan telling her that he has accepted a position in Bali for one year and cannot take Jan with him. Juliane, who lives with her long time companion Wolfgang (Rudiger Vogler) is unsympathetic and tells him that she can only accept Jan for a few days, that arrangements must be made to place the boy in a foster home. Soon after we learn that Werner has committed suicide. The story is told using episodic flashbacks that cut in and out of present time, often disrupting the narrative flow. We see the sisters in various stages of their childhood and adolescence in a conservative household where their father was a rigid Presbyterian minister. One flashback depicts how viewing films of the Holocaust in school impacted them deeply.\n\nJuliane's compassion leads her to try to prevent Marianne from continuing her unproductive rage but she is not successful. Marianne is arrested, presumably for her part in a bombing campaign, and sent to prison where she is kept separate and apart from the other prisoners. Although Marianne recognizes that her sister is her last remaining contact with the outside world, she rejects Juliane's attempt at support through her magazine and goes on a hunger strike, protesting the group's isolation. When Marianne refuses to back down or compromise, the result is sad but inevitable.\n\nAt the end, Juliane calls her sister an exceptional woman yet the film does not show us much evidence of this. Although I'm inclined to believe it is true, von Trotta depicts Marianne as rigid and doctrinaire and clearly leaves the impression that any attempt to foment violent revolution in a consumer-driven society is doomed to fail. In any event, what does emerge clearly, however, is the bond of love and support between each sister, brought to life by the magnificent performances of Jutta Lampe and Barbara Sukowa who render their characters with psychological insight and emotional truth.","torrent":{"xt":"urn:btih:78c309298b87fbba419b8a957dab97a4c0a49966","amp;dn":"Margarethe+von+Trotta.Die+Bleierne+Zeit.%28Marianne+and+Juliane%29.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78c309298b87fbba419b8a957dab97a4c0a49966","infoHashBuffer":{"type":"Buffer","data":[120,195,9,41,139,135,251,186,65,155,138,149,125,171,151,164,192,164,153,102]},"announce":[],"urlList":[]}}