{"title":"Run, Spot, Run - The Ethics of Keeping Pets (2016) (Pdf) Gooner","uid":15817315,"size":938537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:792c340202a69010758f7a750332254ad3feb2ca&amp;dn=Run%2C+Spot%2C+Run+-+The+Ethics+of+Keeping+Pets+%282016%29+%28Pdf%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1473704796,"description":"Run, Spot, Run - The Ethics of Keeping Pets (2016) (Pdf) Gooner\r\n\r\nPublisher: University of Chicago Press (13 May 2016)\r\nLanguage: English\r\nISBN-10: 022620989X\r\nISBN-13: 978-0226209890\r\n\r\nA life shared with pets brings many emotions. We feel love for our companions, certainly, and happiness at the thought that we re providing them with a safe, healthy life. But there s another emotion, less often acknowledged, that can be nearly as powerful: guilt. When we see our cats gazing wistfully out the window, or watch a goldfish swim lazy circles in a bowl, we can t help but wonder: are we doing the right thing, keeping these independent beings locked up, subject to our control? Is keeping pets actually &quot;good&quot; for the pets themselves? That s the question that animates Jessica Pierce s powerful &quot;Run, Spot, Run.&quot; A lover of pets herself (including, over the years, dogs, cats, fish, rats, hermit crabs, and more), Pierce understands the joys that pets bring us. But she also refuses to deny the ambiguous ethics at the heart of the relationship, and through a mix of personal stories, philosophical reflections, and scientifically informed analyses of animal behavior and natural history, she puts pet-keeping to the test. Is it ethical to keep pets at all? Are some species more suited to the relationship than others? Are there species one should never attempt to own? And are there ways that we can improve our pets lives, so that we can be confident that we are giving them as much as they give us? Deeply empathetic, yet rigorous and unflinching in her thinking, Pierce has written a book that is sure to help any pet owner, unsettling assumptions but also giving them the knowledge to build deeper, better relationships with the animals with whom they ve chosen to share their lives.&quot;","torrent":{"xt":"urn:btih:792c340202a69010758f7a750332254ad3feb2ca","amp;dn":"Run%2C+Spot%2C+Run+-+The+Ethics+of+Keeping+Pets+%282016%29+%28Pdf%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"792c340202a69010758f7a750332254ad3feb2ca","infoHashBuffer":{"type":"Buffer","data":[121,44,52,2,2,166,144,16,117,143,122,117,3,50,37,74,211,254,178,202]},"announce":[],"urlList":[]}}