{"title":"FXpansion BFD2 drum environment for PC or Mac","uid":6097873,"size":22711330304,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7a0892cfd95cd1b51a0c3fd887857053feabaa24&amp;dn=FXpansion+BFD2+drum+environment+for+PC+or+Mac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":8,"uploader":"Germanus","files":-1,"time":1294848933,"description":"BFD2: an acoustic drum production environment for your computer with unprecedented power and flexibility. Extreme realism and sound quality, fast and easy set up, total plug-in integration to your digital audio workstation.\n\nCustomized 10, 18 or 32 piece kits are at your fingertips, with full control over tuning, damping, ambience levels, velocity response and more. Layer parts of the kit for powerful hybrid sounds perfect for modern productions and flick through preset kit-piece profiles for quick access to dry, damped and other useful settings. BFD2 lets you configure your sounds like a real drum kit instead of pushing buttons on a sampler.\n\nYou can even import your own stereo sample-sets with multiple velocity layers so you can mix and layer your own sounds with BFD2's for experimental kits and 'drum-replacement' production tricks.\n\nA universe of detail and sonic power\n\nThe hyper-detailed 55GB library features sounds with multiple articulations recorded with up to 96 velocity layers to open up new worlds of rhythmic expression. BFD2 makes it possible to program or play convincing nuances and ghost notes, intricately varied and dynamic hihat parts, elaborate cymbal workouts and visceral kick and snare lines.\n\nThe refined tone and definition of the space at London's legendary AIR Lyndhurst studios is captured with two pairs of room mics, including a mid/side set. Meanwhile, the kit is mic'd with stereo overheads and mono close directs. All audio is routed through the magic of a custom Neve desk with Air Montserrat preamps into Prism A/D converters, sealing the foundations of a killer drum sound.\n\nBFD2 is compatible with the entire BFD library, so if you've already bought FXpansion or third-party expansion packs you'll be able to use them in BFD2 and take advantage of all the new sound shaping features to get even more out of your investment.\n\nMix, route and process\n\nBFD2's flexible, comprehensive mixing console lets you blend, route, submix and process the mic channels just like a real-world drum recording. Tweak bleed levels, play with ambient mic width, create aux sends and patch sidechain effects to shape your drums into infinite variations that sound convincing and powerful. The built-in processors include circuit-modelled dynamics, filters and distortion to deliver fat and floor-shaking sounds, while the flanger, bitcrusher, ring mod, delay and other effects allow subtle to extreme timbral variety.\n\nIn fact, the depth and scope of BFD2's mixer rivals that of many fully-fledged sequencing hosts, meaning that you don't have to worry about setting up multiple outputs in your host for mixing your drums. If you want to take advantage of external reverbs and other plugins or outboard you can route channels freely to any of the 32 available outputs. However, if you're more of a musician than an engineer, you may prefer to browse through the supplied presets from experienced studio veterans, suitable for a variety of musical styles.\n\nA versatile and full-featured Groove engine\n\nBFD2's Groove engine provides the perfect environment for editing patterns, setting up performance modes and applying humanization effects for added realism. Although you can create and record your own Grooves, over 5000 stylistically diverse patterns are ready for you to slot straight into your productions or edit and combine with elements of each other to make new, customized parts. You can even lay out a sequence of Grooves to form a full drum track entirely within BFD2.\n\nIf you're a previous user of BFD, you'll love the new time-saving and powerful functional enhancements in the Groove engine like the advanced editor, synced audition previews, individual start and end actions for each Groove and improved sorting, searching and management of your Groove library.\n\nAnd even more...\n\nFurther improvements in BFD2 include the new, intuitive keymapping editor, easier electronic drum setup, comprehensive management of kits and presets, a revamped internal engine, totally re-designed interface, and several ways of exporting multichannel audio directly from BFD2. For example, being able to quickly and effortlessly export individual Grooves as audio makes BFD2 the ultimate custom breakbeat factory.\n\nAll BFD1.5 registered users are eligible to purchase BFD2 upgrade. All BFD1.5 and expansion pack sound content is compatible with BFD2 and BFD2 upgrade.\n &lt;a href=&quot;\nhttp://www.fxpansion.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fxpansion.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:7a0892cfd95cd1b51a0c3fd887857053feabaa24","amp;dn":"FXpansion+BFD2+drum+environment+for+PC+or+Mac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a0892cfd95cd1b51a0c3fd887857053feabaa24","infoHashBuffer":{"type":"Buffer","data":[122,8,146,207,217,92,209,181,26,12,63,216,135,133,112,83,254,171,170,36]},"announce":[],"urlList":[]}}