{"title":"Robot Roller-Derby Disco Dodgeball v1.1.0","uid":11738995,"size":136199913,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7a7cc1889ffc95f9362008a45eaab27d574c7a2f&amp;dn=Robot+Roller-Derby+Disco+Dodgeball+v1.1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"pacolovac","files":1,"time":1425678420,"description":"== About the game:\n\nRace around a neon-lit dance club in jet-powered robots, launch yourself off skate park ramps and nail each other with exploding dodgeballs. \nDisco Dodgeball is part racing game, part arena shooter, part vibrant multiplayer futuresport - all combined into a stupidly crazy fun audiovisual spectacle of physics-based projectile warfare.\n\nIt is rated 99% positive, making it the \nbest-rated multiplayer game on Steam\n\n\n== Features:\n\nSingleplayer Modes\nArcade - It's you versus waves of randomized opponents &amp; powered-up bosses. \nAir Raid - You get an unlimited jetpack and must fly around and perform aerial stunt shots on the enemy team. \nFugitive - Grab the golden ball and RUN! Survive for as long as possible against enemy bots that will hunt you down relentlessly. \nBot Match - Create a solo match using and play against various difficulties of AI-controlled enemies and teammates.\n\nMultiplayer Modes\nDeathmatch Classic - Deathmatch mode. Just get as many KOs and catches as you can. \nScore Battle - Each KO is worth different points depending on the difficulty of the trick shot (mid air, helicopter, ricochets, combos, dunks, etc.) \nElimination - The original dodgeball mode. Get hit once and you're out for the round, but catching a ball will resurrect a teammate. Last team alive wins. \nHoops - Grab the golden ball and toss it through the enemy goal ring to score a point. \nSuper Ball - It's basically keepaway: Grab the golden ball and survive as long as possible. . \nCapture The Cube - Grab the enemy power cube from their base and bring it back to your own. \nGrand Prix - A racing mode where you need to power slide and boost your way around a checkpoint course, all while dodging enemy fire.\nAnd other goodies...\n\n\n== Version:\n\nSteam v1.1.0 from 27.02.2015. \ncracked by CODEX and repacked by Small-games\nFull Release\n\n\n== Version changes:\n\nCan now view and change server from Create Match panel \nAdded Australia (Melbourne) server option \nVersion Number is now a button that takes you to release notes, highlighted if update occurred since last launch \nControls are calibrated at launch to prevent drift \nAdded global stat for Kudos Sent \nFixed performance issue related to Steam Stats \nAdded debug window to observe network health (F8) \nCan now cancel if game is stuck connecting \nAdded exception catch on ascii parsing to avoid game launch crash with certain non-ascii symbols\n\n\n== Instructions:\n\nRun setup, choose location, install \nEnjoy &amp; Seed\n\n\n== System Requirements:\n\nMinimum:\nPentium 4 1.8GHz/Athlon XP 1700+\nGeForce 210/Radeon X600 Series\n1 GB RAM \nWin Xp 32\nDirectX 9\n500 MB hard disk space\n\nTo properly enjoy the game (based on user input from Game-debate.com):\nPentium 4 3.46GHz/Athlon 64 4000+\nGeForce GT 120/Radeon HD 2600 XT\n2 GB RAM \nWin Xp 32\nDirectX 9\n\nRecommended:\nCore 2 Duo E4400 2.0GHz/Athlon 64 X2 Dual Core 4200+\nGeForce GT 340/Radeon X1900 GT\n2 GB RAM \nWin Xp 32\n500 MB hard disk space\n\n\nIf you enjoyed the game then share with others by seeding! Or better yet \nsupport game development and BUY IT!\n\nGame developed by Erik Asmussen \npublished by 82 Apps","torrent":{"xt":"urn:btih:7a7cc1889ffc95f9362008a45eaab27d574c7a2f","amp;dn":"Robot+Roller-Derby+Disco+Dodgeball+v1.1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a7cc1889ffc95f9362008a45eaab27d574c7a2f","infoHashBuffer":{"type":"Buffer","data":[122,124,193,136,159,252,149,249,54,32,8,164,94,170,178,125,87,76,122,47]},"announce":[],"urlList":[]}}