{"title":"The Atomic Bitchwax - The Atomic Bitchwax (1999) Mp3 320","uid":6256660,"size":129927663,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7af28ab91e250f9b2cc181b4e7f013f7c798959a&amp;dn=The+Atomic+Bitchwax+-+The+Atomic+Bitchwax+%281999%29+Mp3+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1300605484,"description":"The Atomic Bitchwax\nThe Atomic Bitchwax (1999)\n\n\nThe Atomic Bitchwax originated as a side project of Monster Magnet lead guitarist Ed Mundell, ex-Godspeed bassist/vocalist Chris Kosnik, and drummer Keith Ackerman. All three of them were by then veterans of the thriving New Jersey stoner rock scene, and, after almost seven years of jamming in their spare time, the trio finally found time to record and release their self-titled debut album in the summer of 1999. Specializing in high-octane, '70s-based hard rock infused with stabs of space rock and psychedelia, and characterized by Mundell's explosive, Tommy Bolin-inspired guitar heroics, Bitchwax's debut stunned retro-rock fans with its unexpected brilliance; but their independent label, MIA, suddenly went out of business barely a year later. Thankfully, the group was instantly snapped up by Tee Pee Records, but their 2000 sophomore effort, Atomic Bitchwax II, was clearly rushed, its songs underwhelmingly second-rate, and the media-shy Mundell struggled to come to terms with his more prominent status as star of the group. In early 2002, The Atomic Bitchwax issued their third album for a third label (Meteor City), the also disappointing Spit Blood, after which they seemed to lose focus as Mundell retreated to his more comfortable, hired-gun role with Monster Magnet. Workaholic Kosnik soon started a new band named Black NASA. But he and Ackerman also resurrected Bitchwax, this time out with Finn Ryan (ex of the space-stoner act Core) on guitar. III appeared through Meteor City in June 2005. \n\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nAudio Quality:\t\tVery High (Lossy)\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\t\t\nSource:\t\t\tWeb\nLabel:\t\t\tMeteor City\n\n\nThough the hard rocking movement which has been baptized as stoner rock has been growing exponentially for many years now, only a few bands such as Monster Magnet and Kyuss have achieved major label distribution or any mainstream success. Officially, the Atomic Bitchwax is only a side project, but their self-titled debut is very impressive, offering adventurous extended jams (&quot;The Formula&quot;) as well as frenetic blasts of energy (&quot;Hey Alright&quot;). Guitarist Ed Mundell might be a team player at his day job with Monster Magnet but he takes over here, displaying great versatility and chops - especially on a manic rendition of his idol Tommy Bolin's &quot;Crazed Fandango&quot;.\n\n\nTrack List:\n\n01.Stork Theme\n02.Birth To The Earth\n03.Hey Alright\n04.Crazed Fandango\n05.Hope You Die\n06.Ain't Nobody Gonna Hang Me In My Home\n07.Kiss The Sun\n08.Gettin Old\n09.Last Of The V8 Intercepters\n10.Shit Kicker\n11.The Formula\n\n\n\nSupport the artists &amp; buy it if you like it. Please don't forget to seed!","torrent":{"xt":"urn:btih:7af28ab91e250f9b2cc181b4e7f013f7c798959a","amp;dn":"The+Atomic+Bitchwax+-+The+Atomic+Bitchwax+%281999%29+Mp3+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7af28ab91e250f9b2cc181b4e7f013f7c798959a","infoHashBuffer":{"type":"Buffer","data":[122,242,138,185,30,37,15,155,44,193,129,180,231,240,19,247,199,152,149,154]},"announce":[],"urlList":[]}}