{"title":"Fanny och Alexander (1982) Xvid 720p HD multisubs and 4.2GB ","uid":6917724,"size":4564195194,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7ba899a3b91f3d45cd9a650984484e3e4ee90e30&amp;dn=Fanny+och+Alexander+%281982%29+Xvid+720p+HD+multisubs+and+4.2GB+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1325089936,"description":" &lt;a href=&quot; http://www.imdb.com/title/tt0083922/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0083922/&lt;/a&gt;\n\n4.2GB file size - 1280 x 720p at 3026k video bitrate 192k Swedish audio track\n\n\nFanny and Alexander is one of the best movies I saw (along with Oxen 1991 \nfrom Sweden too) at a special theater in the University of Alberta neighborhood\nwhere such movies were specially brought in for the academic crowd in particular\nat the time - as third world multicultural ideas instead had few friends openly\ndisplaying such a preference back then.\n\nIt is a great thrill to have to endure sitting through the full length of this\nfeature, as the children of Sweden are in fact a gift from god to all the earth!\n\nWhat great beauty of spirit, what joy in seeing them in their expressions\nof the most naturally beautiful human intelligence, one could conceive of.\nIt is a real joy indeed. There can be no better substitute for such minds than\nto be fully surrounded by their own - completely so - in a way as to give\ncomfort, security, and nourishment to the mind and spirit equally - along with\nall the resources that would be required to make it as god intended - the very\nbest possible - based on the merits already inherent within.\n\nDo buy a Volvo eh! (if you can look like you do really own it with right \nenough pride)\n\nMay god save the people of Sweden from any ideas of being over-run that are\nat present a problem all around Europe in what are alien ways of existing\nby any sense of relative comparison whatever.\n\n\nMichael Rizzo Chessman\n\nmoviesbyrizzo\n\nPS The 13GB version on the net doesnt give you any better audio in what\nis the Swedish language track - although it does offer Russian in addition.\nSo why not settle for this one here with nice enough video too!\n\n\nSubtitles included for English, Danish, Spanish, Russian - please post\nothers if you are able to contribute equally - perhaps using the \nincluded English SRT file folder as a template starting point\n","torrent":{"xt":"urn:btih:7ba899a3b91f3d45cd9a650984484e3e4ee90e30","amp;dn":"Fanny+och+Alexander+%281982%29+Xvid+720p+HD+multisubs+and+4.2GB+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ba899a3b91f3d45cd9a650984484e3e4ee90e30","infoHashBuffer":{"type":"Buffer","data":[123,168,153,163,185,31,61,69,205,154,101,9,132,72,78,62,78,233,14,48]},"announce":[],"urlList":[]}}