{"title":"Erich Fromm - The Art of Loving &amp; other works (10 books)","uid":10059348,"size":150987081,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bcdf35a9f9a07c3bd2dee728446355d4dd75c6c&amp;dn=Erich+Fromm+-+The+Art+of+Loving+%26amp%3B+other+works+%2810+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"workerbee","files":-1,"time":1398708831,"description":"\nERICH FROMM (1900-1980) was a German social psychologist, psychoanalyst, sociologist, humanistic philosopher, and democratic socialist.  Fromm's writings were notable as much for their social and political commentary as for their philosophical and psychological underpinnings.  He was associated with what became known as the Frankfurt School of critical theory.\n\nTHE FEAR OF FREEDOM (1941) [published in the U.S. as ESCAPE FROM FREEDOM] is viewed as one of the founding works of political psychology, exploring humanity's shifting relationship with freedom, with particular regard to the personal consequences of its absence and the psychosocial conditions that facilitated the rise of Nazism.  THE SANE SOCIETY (1955) is a continuation and extension of these concepts and also, in many ways, an answer to Freud's &quot;Civilization and its Discontents&quot;, in which Fromm examines man's escape into over-conformity and the danger of robotism in contemporary industrial society, and offers a complete and systematic exploration of his &quot;humanistic psychoanalysis.&quot;\n\nTHE ART OF LOVING (1956) was an international bestseller which recapitulated and complemented the theoretical principles of human nature found in his earlier works.  Fromm argues the active character of true love involves four basic elements: care, responsibility, respect, and knowledge, and that love as a skill can be taught and developed.\n\nMARX'S CONCEPT OF MAN (1961) provides selections from several of Marx's works, including an influential translation of the &quot;Economic and Philosophic Manuscripts of 1844&quot; by Tom Bottomore.  Made at Fromm's suggestion, this translation marked the first publication of these early writings of Marx in English.\n\n\nThe following books are in PDF format unless otherwise indicated:\n\n* THE ANATOMY OF HUMAN DESTRUCTIVENESS (Holt, Rinehart &amp; Winston, 1973).\n\n* THE ART OF LOVING (Harper &amp; Row, 1956).\n\n* BEYOND THE CHAINS OF ILLUSION: My Encounter with Marx and Freud (Continuum, 2009).\n\n* THE DOGMA OF CHRIST &amp; Other Essays on Religion, Psychology and Culture (Holt, Rinehart &amp; Winston, 1963).\n\n* THE FEAR OF FREEDOM (Routledge, 1942; rep. 2001).  Published in the U.S. as ESCAPE FROM FREEDOM.\n\n* MARX'S CONCEPT OF MAN (1966; rep. Open Road, 2013).  With a translation of Marx's Early Writings by T. B. Bottomore. -- ePUB\n\n* ON DISOBEDIENCE: Why Freedom Means Saying &quot;No&quot; to Power (HarperCollins, 1981). -- ePUB\n\n* THE SANE SOCIETY (Routledge, 1991).  Second, enlarged edition.\n\n* TO HAVE OR TO BE? (1977; rep. Continuum, 1997). -- PDF + ePUB\n\n* YOU SHALL BE AS GODS: A Radical Interpretation of the Old Testament and Its Tradition (Fawcett, 1969).\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                             &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:7bcdf35a9f9a07c3bd2dee728446355d4dd75c6c","amp;dn":"Erich+Fromm+-+The+Art+of+Loving+%26amp%3B+other+works+%2810+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bcdf35a9f9a07c3bd2dee728446355d4dd75c6c","infoHashBuffer":{"type":"Buffer","data":[123,205,243,90,159,154,7,195,189,45,238,114,132,70,53,93,77,215,92,108]},"announce":[],"urlList":[]}}