{"title":"Studio.V5.LogoMaker.3.0-MKDEV.TEAM","uid":5084577,"size":181541793,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d1d356253cf09341ebca67490bdf7fd9e76dae3&amp;dn=Studio.V5.LogoMaker.3.0-MKDEV.TEAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"ilefx","files":3,"time":1252613171,"description":"\nStudio.V5.LogoMaker.3.0-MKDEV.TEAM\n\n\n\nRead the nfo/serial\n\nSEED/ENJOY \n\n\n\nLogoMaker description\n\t \nAn easy to use yet complex Logo Creator\n\nLogoMaker is a very easy to use logo creator that also allows you to create advertisments, page headers and any other identity related graphics in minutes.\n\nThe easy to use features of LogoMaker include hundreds of fully modifiable logo templates and objects categorized by industry and interest, high quality graphical engine, creative tools and special effects.\n\nIn LogoMaker you can work with Regular, Polygonal, Concave, Wavy, Circular, Perspective Text types. All options and effects that can be applied on the images (such as Shadow, Transparency, Blur, Emboss, Gradient, Hue, etc.) can also be applied on text and shapes. However, some additional effects can be applied only on text and shapes, such as: Outline, Character Spacing, Character Angle etc.\n\nLogoMaker enables you to make your own logo by modifying existing templates or by using the library of objects. Simply by using the drag &amp; drop technique, you can add objects, shapes or text from the library of 1800 objects onto the canvas.\n\nFlexible Graphical Engine enables you to manipulate with chosen objects (rotate, size, cut, copy, undo, redo etc.) while more than 50 effects (blur, transparency, shadow etc.) will enable you to adjust objects to your needs. The picture on the left illustrates how to make more than one professionally looking logo by using 4 objects.\n\nHere are some key features of &quot;LogoMaker&quot;:\n\nÃ‚Â· Over 1,500 professionally designed and fully modifiable logo templates categorized by industry and interest.\nÃ‚Â· Over 6,000 objects and shapes for making logos.\nÃ‚Â· Easy to use, drag &amp; drop, graphical engine for image and text manipulation: scale, rotate, align, groups, layers etc.\nÃ‚Â· Vector-based Shape editor to create and customize your own shapes.\nÃ‚Â· Over 50 effects for object and text editing such as Shadow, Transparency, Brightness, Blur, Gradient, etc.\nÃ‚Â· Plug-ins for adding special effects such as Jitter, Pixelate, Sharp, Water etc.\nÃ‚Â· Regular, Polygonal, Concave, Wavy, Circular, Outline and Perspective Text\nÃ‚Â· 3D options for creating 3D text and shapes\nÃ‚Â· One-click effects: Mirror, Plastics, Depth, Glow, Metallic, Bump, etc.\nÃ‚Â· Full screen editing\nÃ‚Â· Export to PDF, JPG, TIF and other file formats\nÃ‚Â· Professional, Creative, Refined &amp; Designer fonts included\nÃ‚Â· The built in Internet browser for accessing new objects, templates, 40,000 free fonts, 100,000 free pictures, etc.\n\nRequirements:\n\nÃ‚Â· Pentium 500 MHz\nÃ‚Â· 128 MB RAM\nÃ‚Â· 250 MB HDD free space","torrent":{"xt":"urn:btih:7d1d356253cf09341ebca67490bdf7fd9e76dae3","amp;dn":"Studio.V5.LogoMaker.3.0-MKDEV.TEAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d1d356253cf09341ebca67490bdf7fd9e76dae3","infoHashBuffer":{"type":"Buffer","data":[125,29,53,98,83,207,9,52,30,188,166,116,144,189,247,253,158,118,218,227]},"announce":[],"urlList":[]}}