{"title":"Slysoft CloneBD 1.0.4.3 Multilingual + Patch - AppzDam","uid":11828147,"size":21813375,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d8272a2978c79c05196203013816569a9048fbf&amp;dn=Slysoft+CloneBD+1.0.4.3+Multilingual+%2B+Patch+-+AppzDam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"AppzDam","files":1,"time":1429547801,"description":"CloneBD lets you copy any unprotected Blu-ray to your hard drive, or any blank Blu-ray disc. With just a few clicks you can choose to make a partial copy of selected titles, audio languages, and subtitle languages, or you can do a straight 1:1 complete copy of your Blu-ray. CloneBD makes perfect 1:1 clones, but also compresses BD-50 to a single BD-25, BD-9 or BD-5.\n\nCloneBD will also convert your Blu-ray discs to all popular file formats, such as .mp4, .mkv, .avi, and any devices like Android, iPhone/iPad, Smart TV, or any other current device. CloneBD supports all regions (A,B,C). There is no need to install a third party driver, since internal UDF 2.50 parser is already included. CloneBD supports multi-core CPUs and NVIDIA CUDA hardware acceleration for fastest copy speed.\n3D Blu-ray and H.265/HEVC is not supported yet, but will be available soon. Please note that commercial Blu-rays might also require AnyDVD HD.\n\nFeatures :\n\nCopy Blu-ray disc 1:1 or partial to hard drive or blank BD-disc\n- Select audio tracks/languages and subtitle languages\n- Compresses BD-50 to a single BD-25, BD-9 or BD-5\n- Convert Blu-ray content into common file formats (mp4, mkv etc)\n- Supports all regions (A,B,C)\n- Easy title selection with included Blu-ray preview player\n- No driver needed, UDF 2.50 parser included\n- Multi-core CPUs and NVIDIA CUDA hardware acceleration\n- 3D support coming soon...\n- H.265/HEVC support coming soon...\n\nRequirements :\n\nA Windows compatible PC with minimum 2 GHz Processor and 1 GB RAM\nWindows XP/XP64/VISTA/VISTA64/Win7/Win7-64/Win8/Win8-64\nAdministrator rights are required to install.\nBlu-ray drive reader/writer\nAbout 50-100 GB of temporary available hard-drive space is necessary to clone Blu-rays\n\nWhat's New :\n\n- improved: burn engine. Some (not all) write errors we're false positives\n- improved: adjust reported unformatted blank disc sizes to expected actual capacity\n- change: preselect the respective disc size in the size selection dropdown on target page according to inserted disc. As a side effect, discs/drives reporting too large capacity have no negative impact on size output.\n- fix: Bert's error information on completion page sometimes vanished after a few seconds\n- fix: automatic disc requester did not show on burn retries (automatically wait for new disc)\n- minor fixes and improvements\n- updated languages, added Welsh","torrent":{"xt":"urn:btih:7d8272a2978c79c05196203013816569a9048fbf","amp;dn":"Slysoft+CloneBD+1.0.4.3+Multilingual+%2B+Patch+-+AppzDam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d8272a2978c79c05196203013816569a9048fbf","infoHashBuffer":{"type":"Buffer","data":[125,130,114,162,151,140,121,192,81,150,32,48,19,129,101,105,169,4,143,191]},"announce":[],"urlList":[]}}