{"title":"DAVE MATTHEWS BAND - THE COMPLETE STUDIO DISCOGRAPHY + AND THEN","uid":3447959,"size":1404880751,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7e044d99a9e8e5eec321a8c38a027586873e821e&amp;dn=DAVE+MATTHEWS+BAND+-+THE+COMPLETE+STUDIO+DISCOGRAPHY+%2B+AND+THEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"requieminadream","files":147,"time":1140569976,"description":"DAVE MATTHEWS BAND - THE COMPLETE STUDIO DISCOGRAPHY + AND THEN SOME...\n\n\n? 1994 ? Under the Table &amp; Dreaming   - Recorded at 192kbps\n? 1996 ? Crash                        ? Recorded at 192kbps\n? 1998 ? Before These Crowded Streets ? Recorded at 192kbps\n? 2001 ? Everyday                     ? Recorded at 128kbps\n? 2002 ? Busted Stuff                 ? Recorded at 256kbps\n? 2005 ? Stand Up                     ? Recorded at 256kbps\n\nExtras!\n\n? The Central Park Concert (2003)     ? Recorded at 192kbps\n? The Gorge (2004)                    ? Recorded at 192kbps\n? DMB Live Trax - Vol. 1              ? Recorded at 192kbps\n? DMB Live Trax - Vol. 2              ? Recorded at 192kbps\n\n\nUnder the Table &amp; Dreaming\n________________________\n*An Amazon.com Essential Recording\n\nAmazon.com Review\nWith popcorn acoustic guitars, trampoline fiddles, bumper-car bass lines, and caramel-coated sax, the Dave Matthews Band&amp;#039;s major-label debut is like an evening at the fair. &quot;The Best of What&amp;#039;s Around&quot; and &quot;What Would You Say&quot; swirl like the amusement-park ride on the album&amp;#039;s cover, sweeping the exhilarated and lightheaded listener higher as the ride spins faster. &quot;Satellite&quot; glides breezily like the prettiest horse on the carousel, &quot;Ants Marching&quot; runs around hitting the bell with the sledgehammer and winning the largest stuffed animals at the target-range booths, and &quot;Lover Lay Down&quot; is the quietest moment on the disc--like the sun setting on a baby&amp;#039;s sleeping, snow-cone-stained face collapsed on her daddy&amp;#039;s shoulder. --Beth Massa\n\n\nCrash\n_____\n*An Amazon.com Essential Recording\n\nAmazon.com Review\nIt&amp;#039;s tempting to label the Dave Matthews Band as torchbearers of the Grateful Dead&amp;#039;s moderate rock fusion and send them off on the next summer tour featuring either Blues Traveler or the Spin Doctors. But there is more at work here, particularly on the band&amp;#039;s second major-label release. Crash pairs soothing sounds (flute, acoustic guitar, six-string bass) with a dark emotional undercurrent. The South African (by way of Virginia) frontman reveals a rare intensity on the title track and the free-form &quot;41,&quot; while the group shows that it&amp;#039;s not afraid to let loose on songs such as the stirring &quot;Too Much.&quot; Producer Steve Lillywhite adds an impressive sheen to the recordings. --Aidin Vaziri\n\n\nBefore These Crowded Streets\n_________________________\n\nAmazon.com Review\nThe Dave Matthews Band is moving its music forward incrementally. While Before These Crowded Streets offers more of the folky melodies and vaguely international rhythms that made this Charlottesville, Virginia, group a major record and concert draw, it also finds them adding subtle new colorings to the mix. Alanis Morissette guests on two cuts, &quot;Spoon&quot; and the disc&amp;#039;s first single, &quot;Don&amp;#039;t Drink the Water&quot;; banjo Bela Fleck steps in, too. Most intriguing, however, is the modernist string arrangement from the Kronos Quartet on the driving &quot;Halloween.&quot; Matthewsat least partly fulfills his obvious hopes to lead something other than a jam band here; at the same time, Streets should keep his fans satisfied. --Rickey Wright\n\n\nEveryday\n________\n\nAmazon.com Review\nWith three years passed and a new producer at the helm, the Dave Matthews Band find themselves stretching beyond the borders of Before These Crowded Streets to more emotionally explorative territory. On Everyday, Matthews&amp;#039;s clenched-jaw delivery has an unrelenting constancy that&amp;#039;s cunning and determined. &quot;I Did It&quot; opens the CD in an aggressive groove, while &quot;When the World Ends&quot; follows with clipped licks that dive into a muddier, open-flowing chorus. From there on out, the floodgates open into something that often recalls Peter Gabriel, which is ironic, given that the band replaced producer Steve Lillywhite, whose work with Gabriel is legendary, with Glen Ballard, whose work with Alanis Morissette is of equal note, if not acclaim. The album is Gabrielesque in scope, from Matthews&amp;#039;s deepening rasp to the epic instrumentation. Yet, what&amp;#039;s lacking is Lillywhite&amp;#039;s ability to capture a sense of naked honesty. Instead, Ballard dosses down the tracks in designer-suit production, unable to save a band that might simply not be up to the task on such an ambitious sonic endeavor. That, combined with Matthews&amp;#039;s tendency to eschew conventional hooks, leaves the album stalled between the group&amp;#039;s jam-band compulsion and radio-friendly packaging. To capture the latent majesty of this album, you&amp;#039;re going to have to hear it live, and with this band, that&amp;#039;s always been precisely the point. --Beth Massa\n\n\nBusted Stuff\n__________\n\nAmazon.com Review\nDave Matthews doesn&amp;#039;t exactly seem thrilled about this release. But how would you feel if you made an album with a producer you didn&amp;#039;t like, dumped it, and then woke up one morning to find it leaked on the Internet and available at every bootleg stall in New York City? That&amp;#039;s pretty much what happened with &quot;The Lillywhite Sessions,&quot; the unreleased, darker predecessor to the blockbuster Everyday album. Rather than turn their back on the fans, however, Matthews and company returned to the studio to do the job right. On Busted Stuff, they revive those solemn songs with diligent intensity, creating lovely swaths of melancholy and transcendence. Elegant tracks like &quot;Grace Is Gone&quot; and &quot;Digging a Ditch&quot; replace the dreary gloss of the last album with dazzling intimacy, and even the band&amp;#039;s usual tendency for meandering jazz-rock flights is kept in check by the sheer weight of the material. Impressive stuff, in spite of what Matthews apparently thinks. --Aidin Vaziri\n\n\nStand Up\n________\n\nAmazon.com Review\nDon&amp;#039;t let the headless CGI dancer on the cover fool you. While Stand Up has a more organic feel than 2001&amp;#039;s radio-ready Everyday, it is hardly an invocation for carefree days spent twirling on the grass. Instead it is a call to arms that carries over much of the insurrectionary spirit the Dave Matthews Band brought to 2004&amp;#039;s Vote for Change Tour. Matthews, sounding rawer than ever, swerves between optimism (&quot;To change the world you only start with one step,&quot; he sings on &quot;You Might Die Trying&quot;) and angst (&quot;See the man with the bomb in his hand/Everybody wake up,&quot; on &quot;Everybody Wake Up [Our Finest Hour Arrives]&quot;), while producer Mark Baston, best known for his small-time work with big-name pop acts like Beyonce and 50 Cent, responds by putting the marching band rhythms of Carter Beauford in the front and galvanizing the music with a crisp R&amp;B edge, most evident in the totally--okay, partially--crunk &quot;Stolen Away on 55th &amp; 3rd.&quot; --Aidin Vaziri\n\n\nThe Central Park Concert\n_____________________\n\nOn September 24, 2003, standing in front of an audience of 100,000 people, the Dave Matthews Band joined the ranks of musicians who have given one of the most notable performances of their careers on the stage at Central Park&amp;#039;s Great Lawn. On this DVD, the Dave Matthews Band -- famous for extended jam sessions at their concerts -- includes 20 tracks from their benefit show for New York City schools.\n\n\nThe Gorge\n_________\n\nAmazon.com Review\nThink what you will of the Dave Matthews Band but they certainly know how to keep their fans satisfied. Just eight months after the release of the lavish Central Park Concert package comes another generous helping of live material, this time in a limited edition three-disc set compiled at the band&amp;#039;s 2002 concerts at Washington State&amp;#039;s scenic Gorge, one of its favorite venues. With more than three-hours of music and video, recorded in 5.1 audio and shot with over 20 high-definition video cameras, even fans that missed the shows will feel the mosquitoes buzzing around their ears. And it&amp;#039;s easy to see why Seattle resident Dave Matthews and his cohorts feel at home here--the natural backdrop provides the perfect setting for their gently inspiring music. &quot;I feel like I&amp;#039;m making a racket in a place that should be quiet,&quot; the frontman says at one point in the documentary, which may suggest why this is a more reverential, detail-oriented performance than its Manhattan predecessor, particularly in songs like the acoustic &quot;Gravedigger&quot; and the leisurely 15-minute-plus version of &quot;Lie In Our Graves.&quot; --Aidin Vaziri\n\n\nDMB Live Trax ? Volume 1\n_______________________\n*Availible only on dmband.com\n\n2 CD set from 12.8.1998, the second night of a two night stand at the Centrum in Worcester, MA. According to crew reports, these were shows that showcased a period of musical growth for the band in which set list standards transcended into virtually new songs.\n\n\nDMB Live Trax ? Volume 2\n_______________________\n*Availible only on dmband.com\n\n3 CD set from 9.12.2004 at Golden Gate Park in San Francisco, CA. The show took place in the Polo Fields of Golden Gate Park and was a benefit concert for Bay Area Charities. From the moment the band hit the stage, the concert immediately became one of the highlights of Dave Matthews Band&amp;#039;s career. Carlos Santana sits in as a special guest for several songs, including the recently written Sugar Will. The 3 CD set also features two additional previously unreleased songs, Joyride and Hello Again.\n\n &lt;a href=&quot;\nhttp://img145.imagevenue.com/img.php?loc=loc121&amp;image=07111_DMBAlbums.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img145.imagevenue.com/img.php?loc=loc121&amp;image=07111_DMBAlbums.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7e044d99a9e8e5eec321a8c38a027586873e821e","amp;dn":"DAVE+MATTHEWS+BAND+-+THE+COMPLETE+STUDIO+DISCOGRAPHY+%2B+AND+THEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e044d99a9e8e5eec321a8c38a027586873e821e","infoHashBuffer":{"type":"Buffer","data":[126,4,77,153,169,232,229,238,195,33,168,195,138,2,117,134,135,62,130,30]},"announce":[],"urlList":[]}}