{"title":"Silent Hill 4 - The Room [Ntsc], Ps2","uid":5083908,"size":2317662201,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7e0e472c374de958f9743006d45d126d5215d116&amp;dn=Silent+Hill+4+-+The+Room+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":5,"uploader":"Big_dude","files":-1,"time":1252565864,"description":"Silent Hill 4 The Room for the Ps2                               Rel. 11/07/2004  \n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nRating:        M (Mature)\nBy:            Konami\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with WinRar, game was tested and works. \nTry 7zip its free google it, if don't have WinRar.\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n        &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n        &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n       &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n       &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\n\nGame Description:\n\nGet Ready for a chilling game that will leave you on the edge of your sit. Offering awesome graphics and storyline by Konami that will make you beg for more. Watch later when the room becomes possessed it will freak you out!\n\nHenry Townshend finds himself trapped in his apartment that's been cursed by a deeply rooted evil. Only by exploring mysterious portals leading to disturbing alternate worlds will Henry begin to uncover the truth. However, in true Silent Hill fashion, mysterious new characters, horrendous creatures, and the undead will use any means necessary to impede his progress. Horrific new monsters, like spirits that can attack through walls and bizarre spider-like beasties, in addition to expansive areas like the forest, prison, and hotel ensures that Silent Hill 4: The Room is a terrifying experience that fans and newcomers alike will never, ever forget.\n\nFeatures:\n\n* A new Silent Hill adventure, where terror comes to your room.\n\n* horrific new monsters, including spirits that can attack through walls.\n\n* Expansive areas to explore, including a forest, prison, and hotel.\n\n* A cast of mysterious new characters.\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBest to burn at 8x or 4x speed.\n\nUse Verbatim Or use Tayio Yuden DVD+R or DVD-R Media for best quality.\n\nUsing any other media might not work at all.\n\nIf using DVD+R then booktype to DVD-ROM \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!","torrent":{"xt":"urn:btih:7e0e472c374de958f9743006d45d126d5215d116","amp;dn":"Silent+Hill+4+-+The+Room+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e0e472c374de958f9743006d45d126d5215d116","infoHashBuffer":{"type":"Buffer","data":[126,14,71,44,55,77,233,88,249,116,48,6,212,93,18,109,82,21,209,22]},"announce":[],"urlList":[]}}