{"title":"Programming Principles and Practice Using C++ (by Bjarne Stroust","uid":7697761,"size":157718201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ea61a246a4bc10e65cd6d611545528c2fea87a9&amp;dn=Programming+Principles+and+Practice+Using+C%2B%2B+%28by+Bjarne+Stroust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"c_eisenbarth","files":-1,"time":1349410883,"description":"This book is for someone who has never programmed before but is willing to work hard to learn.\n\nIt helps you understand the principles and acquire the practical skills of programming using the C++ programming language. My aim is for you to gain sufficient knowledge and experience to perform simple useful programming tasks using the best up-to-date techniques.\n\nHow long will that take?\n\nAs part of a first-year university course, you can work through this book in a semester (assuming that you'll have a workload of four courses of average difficulty). If you work by yourself, don't expect to spend less time than that (maybe 15 hours a week for 14 weeks).\n\nWhy C++?\n\nYou can't learn to program without a programming language, and C++ directly supports the key concepts and techniques used in real-world software.\n\nC++ is one of the most widely used programming languages, found in an unsurpassed range of application areas. You find C++ applications everywhere from the bottom of the oceans to the surface of Mars. C++ is precisely and comprehensively defined by a nonproprietary international standard. Quality and/or free implementations are available on every kind of computer.\n\nMost of the programming concepts that you will learn using C++ can be used directly in other languages, such as C, C#, Fortran, and Java. Finally, I simply like C++ as a language for writing elegant and efficient code.\n\nThis is not the easiest book on beginning programming; it is not meant to be. I just aim for it to be the easiest book from which you can learn the basics of real-world programming.\n\nUnless your name is Stroustrup, what I discuss here is not &quot;your father's C++.&quot;","torrent":{"xt":"urn:btih:7ea61a246a4bc10e65cd6d611545528c2fea87a9","amp;dn":"Programming+Principles+and+Practice+Using+C%2B%2B+%28by+Bjarne+Stroust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ea61a246a4bc10e65cd6d611545528c2fea87a9","infoHashBuffer":{"type":"Buffer","data":[126,166,26,36,106,75,193,14,101,205,109,97,21,69,82,140,47,234,135,169]},"announce":[],"urlList":[]}}