{"title":"Empty Ideas: A Critique of Analytic Philosophy (2014) epub","uid":11746225,"size":373030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f3b63da7c3323e07708ad79990c996eb68739f6&amp;dn=Empty+Ideas%3A+A+Critique+of+Analytic+Philosophy+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"bookzilla","files":1,"time":1426026522,"description":"\n Peter Unger's provocative new book poses a serious challenge to contemporary analytic philosophy, arguing that to its detriment it focuses the predominance of its energy on &quot;empty ideas.&quot;\n\n In the mid-twentieth century, philosophers generally agreed that, by contrast with science, philosophy should offer no substantial thoughts about the general nature of concrete reality. Leading philosophers were concerned with little more than the semantics of ordinary words. For example: Our word &quot;perceives&quot; differs from our word &quot;believes&quot; in that the first word is used more strictly than the second. While someone may be correct in saying &quot;I believe there's a table before me&quot; whether or not there is a table before her, she will be correct in saying &quot;I perceive there's a table before me&quot; only if there is a table there. Though just a parochial idea, whether or not it is correct does make a difference to how things are with concrete reality. In Unger's terms, it is a concretely substantial idea. Alongside each such parochial substantial idea, there is an analytic or conceptual thought, as with the thought that someone may believe there is a table before her whether or not there is one, but she will perceive there is a table before her only if there is a table there. Empty of import as to how things are with concrete reality, those thoughts are what Unger calls concretely empty ideas.\n\n It is widely assumed that, since about 1970, things had changed thanks to the advent of such thoughts as the content externalism championed by Hilary Putnam and Donald Davidson, various essentialist thoughts offered by Saul Kripke, and so on. Against that assumption, Unger argues that, with hardly any exceptions aside from David Lewis's theory of a plurality of concrete worlds, all of these recent offerings are concretely empty ideas. Except when offering parochial ideas, Peter Unger maintains that mainstream philosophy still offers hardly anything beyond concretely empty ideas.\n\n &quot;This incisive book lays crucial challenges at the door of mainstream analytic philosophy, for Unger argues persuasively that (contrary to its explicit self-conception), a great deal of recent philosophy has been concerned with merely conceptual issues-nothing 'concretely substantial'. The book is sure to provoke controversy and healthy debate about the role and value of philosophy.&quot; -Amie L. Thomasson, Professor of Philosophy and Cooper Fellow, University of Miami","torrent":{"xt":"urn:btih:7f3b63da7c3323e07708ad79990c996eb68739f6","amp;dn":"Empty+Ideas%3A+A+Critique+of+Analytic+Philosophy+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f3b63da7c3323e07708ad79990c996eb68739f6","infoHashBuffer":{"type":"Buffer","data":[127,59,99,218,124,51,35,224,119,8,173,121,153,12,153,110,182,135,57,246]},"announce":[],"urlList":[]}}