{"title":"[SYM] Cowboy Bebop - The Complete Original Release (Dual Audio,","uid":10465866,"size":28865998613,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7f9a76166d2abfdcb7896012fee44c8bcc4a0692&amp;dn=%5BSYM%5D+Cowboy+Bebop+-+The+Complete+Original+Release+%28Dual+Audio%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":4,"uploader":"Symbi0tic","files":-1,"time":1404190867,"description":"This is the complete original North American English dub DVD release from 2001, including all 26 sessions that spanned across 6 volumes. This has not been edited in any way. There are no watermarks, the picture is not stretched or cropped and is displayed in the full screen resolution of 720x540. It is presented exactly as originally intended.\n\nIncluded:\nEnglish &amp; Japanese Audio\nEnglish Subtitles (Optional)\n\nIn 2008, Anime Legends released a &quot;Remix&quot; edition of the entire series in the same 6 volume DVD format, however, amongst their &quot;remastering,&quot; there were a lot of completely ridiculous and unnecessary modifications. Unfortunately, this &quot;Remix&quot; release was also used to create the Blu-ray edition released in 2014. Differences between original release and the &quot;Remix&quot; set include but are not limited to:\n\n\n-- Removal of entire scenes, albeit mostly scenery. (Prime example: The beginning of Session 5 has 30 seconds of footage completely cut.)\n\n-- The entire series has went through a brightening filter, washing out colors.\n\n-- Sound effects have been completely changed in various places, not enhanced. (Example: The gunshot at the end of Session 1 doesn't even sound like a gunshot anymore, and it seems like the sound effect gets cut off before it even finishes. Ambience has also been completely removed from space scenes.)\n\n-- Songs have been replaced in certain places. (Example: The next episode preview at the end of Episode 25 now has upbeat music that was used in Jupiter Jazz Part I's eyecatch on repeat rather than the depressing &quot;Farewell Blues&quot; that actually fits the dialogue and mood.) \n\n-- Some songs start/stop at different times, while complete portions of some songs have been removed from scenes (most notably &quot;Blue&quot; from the final episode, as the choir ends and the doves fly by).\n\nThese are only what I've observed from skimming Sessions 1, 5, 25, and 26. I can't imagine how many changes there truly are amongst the entire series.\n\nHowever, what's more disappointing is that the original series seems to be very difficult to find on the internet in any respectable form. Thus, I've taken the initiative to rip my personal DVDs and provide the definitive Cowboy Bebop release for fans old and new alike.\n\n\nI apologize for the large file sizes. It was the only way I could, personally, provide the series without degrading the quality. If someone is proficient enough in the art of video optimization and can cut down the file size without sacrificing the quality, feel free to compress and upload a smaller torrent. I'd appreciate some credit, though!\n\nI hope you enjoy the series in its original form! Be sure to pass it along.","torrent":{"xt":"urn:btih:7f9a76166d2abfdcb7896012fee44c8bcc4a0692","amp;dn":"%5BSYM%5D+Cowboy+Bebop+-+The+Complete+Original+Release+%28Dual+Audio%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f9a76166d2abfdcb7896012fee44c8bcc4a0692","infoHashBuffer":{"type":"Buffer","data":[127,154,118,22,109,42,191,220,183,137,96,18,254,228,76,139,204,74,6,146]},"announce":[],"urlList":[]}}