{"title":"The Collected Stories of Philip K. Dick (5 ePUB and bonus)","uid":11731110,"size":2228298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81068b27d7d6abe69162b94d6a529b3744056ad4&amp;dn=The+Collected+Stories+of+Philip+K.+Dick+%285+ePUB+and+bonus%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"amontoth","files":8,"time":1425402977,"description":"The Collected Stories of Philip K. Dick (5 ePUB and bonus)\n\nNOTE: The previous torrent had one volume duplicated with a cover substitution \nand another missing the cover. I found a different source.\n\nThe Collected Stories of Philip K. Dick is a collection of science fiction \nstories by Philip K. Dick. It was first published by Underwood-Miller in 1987 as \na five volume set. See Philip K. Dick bibliography for information about the \nmass market reprints.\n\nThe actual titles of the volumes have changed as stories were added. These are \nthe titles as published by Citadel Twilight in 1990-1992. See \n[url]http://en.wikipedia.org/wiki/Philip_K._Dick_bibliography#Comparison_of_editions[/url]\n for more information.\n\nMany of the stories had originally appeared in the magazines Fantasy and Science \nFiction, Planet Stories, If, Galaxy Science Fiction, Imagination, Space Science \nFiction, Fantastic Story Magazine, Amazing Stories, Future, Cosmos, Fantasy \nFiction, Beyond Fantasy Fiction, Thrilling Wonder Stories, Startling Stories, \nFantastic Universe, Science Fiction Quarterly, Astounding, Science Fiction \nAdventures, Science Fiction Stories, Orbit, Satellite, Imaginative Tales, \nFantastic, Worlds of Tomorrow, Escapade, Famous Science Fiction, Niekas, Rolling \nStone College Papers, Interzone, Playboy, Omni and The Yuba City High Times. \nContents\n\nThe set was published in four states:\n\n    3 copies were quarterbound in calfskin with a handmade slipcase and the author's signature tipped in.\n    100 copies were bound in red buckram, slipcased, with the author's signature taken from his canceled checks, laid in.\n    405 copies were bound in tan and brown cloth, slipcased, but without signature. (400 of these are numbered from 101-500 and 5 are presentation copies.)\n    800 copies were bound with a yellow-orange binding and did not have a slipcase.\n\nThe volumes were not sold individually. All sets except the trade edition (800 \ncopies) also included a chapbook, &quot;Brief Synopsis for An Alternate World Novel: \nThe Acts of Paul, an outline for a novel that was never written.\nThis is included seperately.\n\n-wikipedia [url}http://en.wikipedia.org/wiki/The_Collected_Stories_of_Philip_K._Dick[/url]\n\n\n[b]The Acts of Paul, Brief Synopsis for Alternate World Novel - Philip K. Dick. (ePUB)[/b]\n\n\n[i]The Philip K. Dick Trust is excited to present these rare, unpublished writings from Philip K. Dick. \nThe Acts of Paul, Brief Synopsis for Alternate World Novel by Philip K. Dick.\n\nThis is a rare 2-page treatment for a novel written by Philip K. Dick in 1982 \nand recently rediscovered by his agent, Russell Galen. This treatment was \nreleased as an insert for 400 limited-edition novels, but has not been published \nelsewhere.\n[/i]\n\n\nThis was left out of my original PKD Collected Stories torrent.\n \n-amontoth","torrent":{"xt":"urn:btih:81068b27d7d6abe69162b94d6a529b3744056ad4","amp;dn":"The+Collected+Stories+of+Philip+K.+Dick+%285+ePUB+and+bonus%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81068b27d7d6abe69162b94d6a529b3744056ad4","infoHashBuffer":{"type":"Buffer","data":[129,6,139,39,215,214,171,230,145,98,185,77,106,82,155,55,68,5,106,212]},"announce":[],"urlList":[]}}