{"title":"The Way of Kings - Brandon Sanderson","uid":11678095,"size":3890028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8265dbb5758c35f610abb09182bbbc0098760f12&amp;dn=The+Way+of+Kings+-+Brandon+Sanderson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1422961392,"description":"According to mythology mankind used to live in The Tranquiline Halls. Heaven. But then the Voidbringers assaulted and captured heaven, casting out God and men. Men took root on Roshar, the world of storms. And the Voidbringers followed . . . They came against man ten thousand times. To help them cope, the Almighty gave men powerful suits of armor and mystical weapons, known as Shardblades. Led by ten angelic Heralds and ten orders of knights known as Radiants, mankind finally won. Or so the legends say. Today, the only remnants of those supposed battles are the Shardblades, the possession of which makes a man nearly invincible on the battlefield. The entire world is at war with itself - and has been for centuries since the Radiants turned against mankind. Kings strive to win more Shardblades, each secretly wishing to be the one who will finally unite all of mankind under a single throne. On a world scoured down to the rock by terrifying hurricanes that blow through every few day a young spearman forced into the army of a Shardbearer, led to war against an enemy he doesn't understand and doesn't really want to fight. What happened deep in mankind's past? Why did the Radiants turn against mankind, and what happened to the magic they used to wield?","torrent":{"xt":"urn:btih:8265dbb5758c35f610abb09182bbbc0098760f12","amp;dn":"The+Way+of+Kings+-+Brandon+Sanderson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8265dbb5758c35f610abb09182bbbc0098760f12","infoHashBuffer":{"type":"Buffer","data":[130,101,219,181,117,140,53,246,16,171,176,145,130,187,188,0,152,118,15,18]},"announce":[],"urlList":[]}}