{"title":"The Beatles - Yellow Submarine [320k MP3]","uid":7710374,"size":95938603,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82f8d8ed52c5738755e0d7d733500f2037a12a7a&amp;dn=The+Beatles+-+Yellow+Submarine+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"smbdownload","files":-1,"time":1349794007,"description":"Yellow Submarine is the tenth studio album by The Beatles in the United Kingdom, released on Apple Records. It was issued as the soundtrack to the film of the same name, which premiered in the United Kingdom seven months prior to the album's release.\n\nOnly one side of the album contains songs performed by The Beatles; of the six, four were previously unissued. &quot;Yellow Submarine&quot; had been simultaneously issued in 1966 as a single and on the album Revolver, and &quot;All You Need Is Love&quot; had been issued as a single in 1967. The second side features the symphonic film score composed by George Martin, in versions recorded specifically for the album.\n\n&quot;All You Need Is Love&quot; appeared in either mono or rechanneled stereo, ('fake stereo') on the US LP Magical Mystery Tour. It debuted in a true stereo mix on LP for this album.\nThe first compact disc release, remastered by George Martin, appeared on 25 August 1987. It is consistent with the British version of the LP. The running order is the same with &quot;Sea of Time&quot; and &quot;Sea of Holes&quot; as separate tracks, the &quot;Nothing Is Real&quot; subtitle remains intact and the review of the White Album with Taylor's introduction is included inside the CD insert.\n\nThe album appeared in a totally different version on 13 September 1999, coinciding with the remastered re-release of the film. Called the Yellow Submarine Songtrack, it dispenses with the George Martin orchestrations, and includes the six Beatles songs from the original album, along with an additional nine songs, all completely remixed for this disc.\n\nIt was reissued a decade later for a third time, along with the entire catalogue, on 9 September 2009. Done at 24-bit/192 kHz resolution, this duplicated the original album, and included both sets of sleeve notes. &quot;Only A Northern Song&quot; appears in its mono mix in this version, instead of the 'fake stereo' mix on the original.\n\n2009 REMASTER - Track Listing [320k MP3]\n\n01. \t&quot;Yellow Submarine&quot; \n02. \t&quot;Only a Northern Song&quot; \n03. \t&quot;All Together Now&quot;   \t\n04. \t&quot;Hey Bulldog&quot;   \t\n05. \t&quot;It's All Too Much&quot; \n06. \t&quot;All You Need Is Love&quot;  \n07. \t&quot;Pepperland&quot;   \t\n08. \t&quot;Sea of Time&quot;   \t \n09. \t&quot;Sea of Holes&quot;   \t \n10. \t&quot;Sea of Monsters&quot;   \t \n11. \t&quot;March of the Meanies&quot;   \t \n12. \t&quot;Pepperland Laid Waste&quot;   \t \n13. \t&quot;Yellow Submarine in Pepperland&quot;  ","torrent":{"xt":"urn:btih:82f8d8ed52c5738755e0d7d733500f2037a12a7a","amp;dn":"The+Beatles+-+Yellow+Submarine+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f8d8ed52c5738755e0d7d733500f2037a12a7a","infoHashBuffer":{"type":"Buffer","data":[130,248,216,237,82,197,115,135,85,224,215,215,51,80,15,32,55,161,42,122]},"announce":[],"urlList":[]}}