{"title":"Amnesia - The Dark Descent GOG","uid":8759846,"size":1196601946,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:83077066ed58d40b6cb0dda40e2a6b7136fc3238&amp;dn=Amnesia+-+The+Dark+Descent+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"AN0NYMOUS142857","files":3,"time":1375223801,"description":"\ngenre: adventure / fpp / horror\nrelease date: September 8, 2010\ncompatible with: Windows (XP, Vista, 7, 8)\nlanguages: Audio and text: English, Russian. Text only: French, German, Italian, Spanish\ndeveloper / publisher: Frictional Games / Frictional Games\ngame modes: single-player\n\nBonus content included for FREE with purchase:\nmanual\nshort story collection\n\nWhat's cool about it:\n\nIncludes Amnesia: The Dark Descent and its DLC, Amnesia: Justine.\nWinner of IGN's &quot;2010 Best PC Horror Game and 2010 Best PC atmosphere&quot; award.\nA thrilling ride through the depths of madness and the darker side of human emotions.\nFeatures a fully simulated world made all the more immersive with the help of a dynamic sound system.\n\nOverview:\n\nThe last remaining memories fade away into darkness. Your mind is a mess and only a feeling of being hunted remains. You must escape. Awake... You stumble through the narrow corridors as the distant cry is heard. It is getting closer. Explore... A sound of dragging feet? Or is your mind playing tricks on you? Experience... Something emerges out of the darkness. It's approaching. Fast. Survive...\n\nStep into Daniel's shoes as he wakes up in a desolate castle, barely remembering anything about his past. As you explore the eerie pathways, you'll take part in Daniel's most troubled memories. The horror doesn't just come from the outside, but from the inside as well. A disturbing odyssey into the dark corners of the human psyche awaits. Amnesia: The Dark Descent, a first person survival horror. A game about immersion, discovery, and living through a nightmare. An experience that will chill you to the core. By using a fully physically simulated world, cutting edge 3D graphics and a dynamic sound system, the game pulls no punches when trying to immerse you. Once the game starts, you will be in control from the beginning to the end. There are no cut-scenes or time-jumps, whatever happens will happen to you first hand. You'll be thrown headfirst into a dangerous world where danger can lurk behind every corner. Your only means of survival are hiding, running, and using your wits. Do you have what it takes to survive?\n\nAge requirements: ESRB Rating: MATURE with Blood and Gore, Language, Nudity, Violence.\n\nMinimum system requirements: Windows XP / Vista / 7 / 8, 2.0 GHz Processor, 2 GB RAM, Graphics: Radeon X1000/GeForce 6 or better , 3 GB HDD, Mouse, Keyboard. Compatibility notice (PC): Integrated Intel graphics cards are not supported\n\nInstallation\n\nInstall and play\n","torrent":{"xt":"urn:btih:83077066ed58d40b6cb0dda40e2a6b7136fc3238","amp;dn":"Amnesia+-+The+Dark+Descent+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83077066ed58d40b6cb0dda40e2a6b7136fc3238","infoHashBuffer":{"type":"Buffer","data":[131,7,112,102,237,88,212,11,108,176,221,164,14,42,107,113,54,252,50,56]},"announce":[],"urlList":[]}}