{"title":"Summer of Blood: The Peasants’ Revolt of 1381","uid":15816460,"size":683439,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:837a8d1bb0c7a809dbef1cea7e7a35d470fadb1b&amp;dn=Summer+of+Blood%3A+The+Peasants%26rsquo%3B+Revolt+of+1381&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"marty14","files":1,"time":1473690753,"description":"Summer of Blood: The Peasants’ Revolt of 1381 - Dan Jones [epub]\r\n\r\nBreathing life into one of British history's most colourful yet under-explored episodes, Dan Jones recreates the dangerous world of the fourteenth century: a time when pain, squalor, misery and disease formed the fabric of daily life. Yet this was also an era of humanity, charity and social responsibility, one which people genuinely believed could be made better. Jones shows how this world was both profoundly different and remarkably similar to our own.\r\n\r\nThe Peasants' Revolt of the summer of 1381, led by the mysterious Wat Tyler and the visionary preacher John Ball, was one of the bloodiest events in British history. To finance an unyielding war with France, a reckless and oppressive tax was imposed upon the English lower orders. Ravaged by war, plague and tyranny, England's villagers rose against their masters for the first time in history. Initial resistance in the Essex village of Brentwood swiftly inspired the desire for revenge in other communities. The outcome of their brave and tragic rising changed England forever.At the heart of the story is a fateful collision of servant and master, as the rural general Wat Tyler pitted his wits and ragtag army against the 14-year-old King Richard II and his advisors, all of whom risked their property, their positions and their lives in the desperate battle to save the English crown from destruction. ‘Summer of Blood’ is the first full popular account in a century of one of the most famous rebellions in history","torrent":{"xt":"urn:btih:837a8d1bb0c7a809dbef1cea7e7a35d470fadb1b","amp;dn":"Summer+of+Blood%3A+The+Peasants%26rsquo%3B+Revolt+of+1381","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837a8d1bb0c7a809dbef1cea7e7a35d470fadb1b","infoHashBuffer":{"type":"Buffer","data":[131,122,141,27,176,199,168,9,219,239,28,234,126,122,53,212,112,250,219,27]},"announce":[],"urlList":[]}}