{"title":"The Slap Complete","uid":7857193,"size":4623660594,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8389f0821eeb92d208c80b0880ed54cafec5c58a&amp;dn=The+Slap+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":5,"uploader":"suzitastik","files":-1,"time":1353799497,"description":"The bestselling cult author of Loaded and Dead Europe turns his blowtorch onto the belly of middle-class suburban Australia and its notions of child-rearing and acceptable behaviour. This is the TV mini series adaptation on the best selling novel.\n\nDescription\nAt a suburban barbecue, a man slaps a child who is not his own. \nThis event has a shocking ricochet effect on a group of people, mostly friends, who are directly or indirectly influenced by the event. \nIn this remarkable novel to TV series, Christos Tsiolkas turns his unflinching and all-seeing eye onto that which connects us all: the modern family and domestic life in the twenty-first century. The Slap is told from the points of view of eight people who were present at the barbecue. The slap and its consequences force them all to question their own families and the way they live, their expectations, beliefs and desires.\nWhat unfolds is a powerful, haunting story about love, sex and marriage, parenting and children, and the fury and intensity - all the passions and conflicting beliefs - that family can arouse. In its clear-eyed and forensic dissection of the ever-growing middle class and its aspirations and fears, The Slap is also a poignant, provocative journey about the nature of loyalty and happiness, compromise and truth.\n\n","torrent":{"xt":"urn:btih:8389f0821eeb92d208c80b0880ed54cafec5c58a","amp;dn":"The+Slap+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8389f0821eeb92d208c80b0880ed54cafec5c58a","infoHashBuffer":{"type":"Buffer","data":[131,137,240,130,30,235,146,210,8,200,11,8,128,237,84,202,254,197,197,138]},"announce":[],"urlList":[]}}