{"title":"Good Morning, Vietnam - Original Motion Piture Soundtrack 320cbr","uid":9439957,"size":86512333,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:840b0e13f22996a6990890a6a2480a3f304eb876&amp;dn=Good+Morning%2C+Vietnam+-+Original+Motion+Piture+Soundtrack+320cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1388990216,"description":"Source; 1988 CD\n\nGood Morning, Vietnam - Original Motion Piture Soundtrack 320cbr (Big Papi) 1988 \n\n\n\nOne of the last of the great Vietnam movies if not the last. I still get confused if that country is one word or two words. - Big Papi\n\n\nBy Lawrance M. VINE VOICE\n\nThe Original Motion Picture Soundtrack of &quot;Good Morning, Vietnam&quot; is exactly what you would expect it to be, a combination of Robin William's maniacal spiels as DJ Adrian Cronauer and some great music from the Sixties. The result is something not too far removed from what it would have been like to listen to Armed Forces Radio in the 'Nam way back when. The only thing missing are the announcements for staff sergeant so-and-so to check in with his command post A.S.A.P. The songs included here are not exactly what you would classify as anti-war songs, although certainly there is something ironic about &quot;Nowhere to Run,&quot; &quot;Liar, Liar&quot; and &quot;What a Wonderful World&quot; in the context of the Vietnam War. There is also a nice mixture of big names, such as James Brown and the Beach Boys, with lesser known artists, like The Searchers, The Rivieras and Them. This actually gives this album a nice sense of authenticity because these are not wall to wall classic hits like we had with the &quot;Forrest Gump&quot; soundtrack. Of course you are going to get tired of William's comedy long before you want to stop listening to the music. The only question is when, but since we can program CDs to skip what we want, this is not going to be a major consideration. However, for all you Drew Carey fans, if you do not already have it, here are The Vogues doing &quot;Five O'Clock World.&quot;","torrent":{"xt":"urn:btih:840b0e13f22996a6990890a6a2480a3f304eb876","amp;dn":"Good+Morning%2C+Vietnam+-+Original+Motion+Piture+Soundtrack+320cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"840b0e13f22996a6990890a6a2480a3f304eb876","infoHashBuffer":{"type":"Buffer","data":[132,11,14,19,242,41,150,166,153,8,144,166,162,72,10,63,48,78,184,118]},"announce":[],"urlList":[]}}