{"title":"SolidWorks 2012 win32 + win64 SP0.0 Multilanguage","uid":7307147,"size":11820188947,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:84173c1f3007d453a30d562d81bd2e0cc00cf5b4&amp;dn=SolidWorks+2012+win32+%2B+win64+SP0.0+Multilanguage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":4,"uploader":"kaoxx","files":4,"time":1338231582,"description":"SolidWorks 2012 marks the 20th release of product development software delivering a range of features that will help you design faster and do your job better. Automated functionality streamlines design with a more continuous workflow. New productivity features accelerate product development, while connectivity tools expand collaboration with teams from around the world. SolidWorks 2012 delivers design that drives your business. \n\nWhat's New in SolidWorks 2012:\n- You are now able to pin documents to the recently used document fly out.\n- You can now switch document units on the fly with the unit switcher located in the bottom right corner of the status bar.\n- You can now choose faces to ignore in sheet metal flat patterns.\n- Swept flanges can now be created in sheet metal and flattened.\n- You can now start typing a command in the search palette, and it will start narrowing down the possibilities (ala the Windows 7 Start button).\n- New equation dialogue; you can change solve order and categorize (and sort) equations\n- Exploded views are now shown on the drawing palette, and there is now a right-click option to explode an existing view.\n- BOM's can now be created without preselecting a view.\n- Balloons can now be ordered numerically around a view.\n- Magnet lines are now available to snap balloons too, like in 3DVIA Composer!\n- Unused view labels (such as those from deleted views) are now automatically reused.\n- Rendering\n- Custom Compass\n- BOM Hotspot\n- Taking a cue from 3DVIA, selecting a component and hitting Tab will hide the component.\n- Manufactured part costing will allow users to account for part costs based on material, machining, and set up.\n- Motion Optimization","torrent":{"xt":"urn:btih:84173c1f3007d453a30d562d81bd2e0cc00cf5b4","amp;dn":"SolidWorks+2012+win32+%2B+win64+SP0.0+Multilanguage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84173c1f3007d453a30d562d81bd2e0cc00cf5b4","infoHashBuffer":{"type":"Buffer","data":[132,23,60,31,48,7,212,83,163,13,86,45,129,189,46,12,192,12,245,180]},"announce":[],"urlList":[]}}