{"title":"The Second Half - Roy Keane.epub","uid":11238492,"size":2102166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8420a273c5549c25097542561c3a43ee8b0d3ae8&amp;dn=The+Second+Half+-+Roy+Keane.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":null,"files":-1,"time":1413637940,"description":"In an eighteen-year playing career for Cobh Ramblers, Nottingham Forest (under Brian Clough), Manchester United (under Sir Alex Ferguson) and Celtic, Roy Keane dominated every midfield he led to glory. Aggressive and highly competitive, his attitude helped him to excel as captain of Manchester United from 1997 until his departure in 2005. Playing at an international level for nearly all his career, he represented the Republic of Ireland for over fourteen years, mainly as team captain, until an incident with national coach Mick McCarthy resulted in Keane's walk-out from the 2002 World Cup. Since retiring as a player, Keane has managed Sunderland and Ipswich and has become a highly respected television pundit.\n\nAs part of a tiny elite of football players, Roy Keane has had a life like no other. His status as one of football's greatest stars is undisputed, but what of the challenges beyond the pitch? How did he succeed in coming to terms with life as a former Manchester United and Ireland leader and champion, reinventing himself as a manager and then a broadcaster, and cope with the psychological struggles this entailed?\n\nIn a stunning collaboration with Booker Prize-winning author Roddy Doyle, THE SECOND HALF blendsand reflection in Roy Keane's inimitable voice. The result is an unforgettable personal odyssey which fearlessly challenges the meaning of success","torrent":{"xt":"urn:btih:8420a273c5549c25097542561c3a43ee8b0d3ae8","amp;dn":"The+Second+Half+-+Roy+Keane.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8420a273c5549c25097542561c3a43ee8b0d3ae8","infoHashBuffer":{"type":"Buffer","data":[132,32,162,115,197,84,156,37,9,117,66,86,28,58,67,238,139,13,58,232]},"announce":[],"urlList":[]}}