{"title":"MirrorMask (2005) 720p BrRip x264 CLOWNSEC (PhreakyFlix)","uid":9157835,"size":2792314524,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:842725dbead67017a1c81243776929fc2aad276e&amp;dn=MirrorMask+%282005%29+720p+BrRip+x264+CLOWNSEC+%28PhreakyFlix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"clownsec","files":-1,"time":1383811805,"description":"MirrorMask (2005) 720p BrRip x264 CLOWNSEC (PhreakyFlix)\n\nThis visually stunning film is the product of a collaboration of award-winning graphic novelist Neil Gaiman (creator of the much-lauded Sandman series), his frequent collaborator Dave McKean (Cages), and The Jim Henson Company, themselves no strangers to elaborate fantasies such as The Dark Crystal. and Labyrinth. As with the latter film, MirrorMask focuses on a young woman unhappy with her daily existence; here, the artistically inclined Helena (Stephanie Leonides), is at odds with her circus performer parents. When a careless insult appears to send her mother (Gina McKee) into a coma, Helena withdraws into the dark and elaborate world of her drawings, in which a scenario very similar to her predicament in the real world is unfolding. Gaiman and director McKean create arresting images to populate Helena's world, and the Henson Company brings them vividly to life with CGI; though the story is occasionally murky, the fantasy elements are imaginative enough to enthrall what will undoubtedly be the film's toughest customers--younger viewers. --Paul Gaita\n\n---\n\nMIRRORMASK is the story of Helena, who works for the family circus, and wishes--quite ironically--that she could run away and join real life. But such is not to be the case, as she finds herself on a strange journey into the Dark Lands, a fantastic landscape filled with giants, Monkeybirds and dangerous sphinxes. Helena searches for the Mirrormask, an object of enormous power that is her only hope of escaping the Dark Lands, waking the Queen of Light and returning home.\n\nBROUGHT TO YOU BY * CLOWNSEC * HONK *\n ","torrent":{"xt":"urn:btih:842725dbead67017a1c81243776929fc2aad276e","amp;dn":"MirrorMask+%282005%29+720p+BrRip+x264+CLOWNSEC+%28PhreakyFlix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"842725dbead67017a1c81243776929fc2aad276e","infoHashBuffer":{"type":"Buffer","data":[132,39,37,219,234,214,112,23,161,200,18,67,119,105,41,252,42,173,39,110]},"announce":[],"urlList":[]}}