{"title":"Topsy-Turvy (1999) Comedy About Making Gilbert &amp; Sullivan's Mik","uid":6142012,"size":1240196420,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:845a788278214fddb79d16337108cf4baa3e7695&amp;dn=Topsy-Turvy+%281999%29+Comedy+About+Making+Gilbert+%26+Sullivan%5C%27s+Mik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"rambam1776","files":-1,"time":1296537833,"description":"Thanks to the OP!\n\nTopsy Turvy\n\nVideo Codec..........: XviD 1.1.0 Final \nVideo Bitrate........: 903kbps \nDuration.............: 2:33:50\nResolution...........: 512*384 \nFramerate............: 29.970 \nAudio Codec..........: 0x0050 MPEG-1 Layer 2 \nAudio Bitrate........: 160 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 1,240,023,040 \n &lt;a href=&quot;\nhttp://bayimg.com/OaDpOaADJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/OaDpOaADJ&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0151568/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0151568/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Topsy-Turvy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Topsy-Turvy&lt;/a&gt;\n\n\nCast\n\nDorothy Atkinson as Jessie Bond, who plays Pitti-Sing\nBrid Brennan as a mad beggar\nJim Broadbent as W. S. Gilbert\nRon Cook as Richard D'Oyly Carte, owner of the Savoy Theater\nAllan Corduner as Arthur Sullivan\nEleanor David as Fanny Ronalds, Sullivan's mistress\nDexter Fletcher as Louis, Sullivan's butler\nVincent Franklin as Rutland Barrington, who plays Pooh-Bah\nLouise Gold as Rosina Brandram, who plays Katisha\nShirley Henderson as Leonora Braham, who plays Yum-Yum\nLesley Manville as Lucy &quot;Kitty&quot; Gilbert, Gilbert's wife\nKevin McKidd as Durward Lely, who plays Nanki-Poo\nNaoko Mori as Miss &quot;Sixpence Please&quot;\nWendy Nottingham as Helen Lenoir, Carte's indispensable assistant[2]\nCathy Sara as Sybil Grey, who plays Peep-Bo\nMartin Savage as George Grossmith, who plays Ko-Ko\nAndy Serkis as John D'Auban, choreographer\nMichael Simkins as Frederick Bovill, who plays Pish-Tush\nSukie Smith as Clothilde, Sullivan's maid\nTimothy Spall as Richard Temple, who plays the Mikado\n\n\nTopsy-Turvy is a 1999 musical drama film about the creation of Gilbert and Sullivan's The Mikado in 1884 and 1885. It was written and directed by Mike Leigh and stars Allan Corduner as Arthur Sullivan and Jim Broadbent as W. S. Gilbert, along with Timothy Spall and Lesley Manville. The film focuses on the creative conflict between playwright and composer, and the momentous decision that the two men made to continue their partnership, which led to the creation of several more famous Savoy Operas between them.\n\nThe film was not released widely, but it received very favourable reviews, including a number of film festival awards and two design Academy Awards. While considered an artistic success, illustrating Victorian era British life in the theatre in depth, the film did not recover its production costs. Leigh cast actors who did their own singing in the film, and the singing performances were faulted by some critics, while others lauded Leigh's strategy.\n\n\nPlot\n\nOn the opening night of Princess Ida at the Savoy Theatre in January 1884, composer Arthur Sullivan (Allan Corduner), who is ill from kidney disease, is barely able to make it to the theatre to conduct. He goes on a holiday to Continental Europe hoping that the rest will improve his health. While he is away, ticket sales and audiences at the Savoy Theatre wilt in the hot summer weather. Producer Richard D'Oyly Carte (Ron Cook) has called on the playwright, W. S. Gilbert (Jim Broadbent), and Sullivan to create a new piece for the Savoy, but it is not ready before Ida closes. Until a new piece can be prepared, Carte revives an earlier Gilbert and Sullivan work, The Sorcerer.\n\nGilbert's idea for their next opera features a transformative magic lozenge, which Sullivan feels is repetitive, since it is similar to the story of The Sorcerer, and mechanical, due to its reliance on a supernatural device. Sullivan, under pressure to write more serious music, says he longs for something that is &quot;probable&quot; and involves &quot;human interest&quot;, and not dependent on magic. Gilbert sees nothing wrong with his libretto and refuses to write a new one, which results in a stand-off. The impasse is resolved after Gilbert and his wife visit a popular exhibition of Japanese arts and crafts in Knightsbridge, London. When the katana sword that he purchased there falls noisily off the wall of his study, he is inspired to write a libretto set in exotic Japan. Sullivan likes the idea and agrees to compose the music for it.\n\nGilbert, Sullivan and Carte work to make The Mikado a success, and many glimpses of rehearsals and stressful backstage preparations for the show follow: Cast members lunch together before negotiating their salaries. Gilbert brings in Japanese girls from the exhibition to teach the ladies' chorus how to walk and use fans in the Japanese manner. The principal cast react to the fittings of their costumes designed by the famous costumier C. Wilhelm. The entire cast object to the proposed cut of the title character's Act Two solo, &quot;A more humane Mikado&quot;. The actors face first-night jitters in their dressing rooms. Finally The Mikado is ready to open. As usual, Gilbert is too nervous to watch the opening performance and paces the streets of London. Returning to the theatre, however, he finds that the new opera is a resounding success.","torrent":{"xt":"urn:btih:845a788278214fddb79d16337108cf4baa3e7695","amp;dn":"Topsy-Turvy+%281999%29+Comedy+About+Making+Gilbert+%26+Sullivan%5C%27s+Mik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"845a788278214fddb79d16337108cf4baa3e7695","infoHashBuffer":{"type":"Buffer","data":[132,90,120,130,120,33,79,221,183,157,22,51,113,8,207,75,170,62,118,149]},"announce":[],"urlList":[]}}