{"title":"Star Wars Episode I, II, III, IV, V, VI - Complete Saga George L","uid":11132698,"size":6799902490,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8479a6d8bd55904907ef3c69833be0981323f505&amp;dn=Star+Wars+Episode+I%2C+II%2C+III%2C+IV%2C+V%2C+VI+-+Complete+Saga+George+L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":10,"uploader":"eyezin","files":-1,"time":1412073663,"description":"..........................................................\n..:++++++++++++++++++++++++++++++++++++++++++++++++++++:..\n..:++++++++++++++++++++++Star Wars+++++++++++++++++++++:..\n..:++++++++++++++++++++Complete Saga+++++++++++++++++++:..\n..........................................................\n\n=&gt;-Star Wars Episode I............: http://www.imdb.com/title/tt0120915/\n=&gt;-Star Wars Episode II...........: http://www.imdb.com/title/tt0121765/\n=&gt;-Star Wars Episode III..........: http://www.imdb.com/title/tt0121766/\n=&gt;-Star Wars Episode IV...........: http://www.imdb.com/title/tt0076759/\n=&gt;-Star Wars Episode V............: http://www.imdb.com/title/tt0080684/\n=&gt;-Star Wars Episode VI...........: http://www.imdb.com/title/tt0086190/\n\nStar Wars Episode I - The Phantom Menace.\nWhen the evil Trade Federation plots to take over the peaceful planet of\nNaboo, Jedi warrior Qui-Gon Jinn and his apprentice Obi-Wan Kenobi embark\non an amazing adventure to save the planet. With them on their journey is\nthe young Queen Amidala, Gungan outcast Jar Jar Binks, and the powerful\nCaptain Panaka, who will all travel to the faraway planets of Tatooine and\nCoruscant in a futile attempt to save their world from Darth Sidious,\nleader of the Trade Federation, and Darth Maul, the strongest Dark Lord\nof the Sith to ever wield a lightsaber.\n\nStars.\n=&gt;-Ewan McGregor.\n=&gt;-Liam Neeson.\n=&gt;-Natalie Portman.\n\nDirector.\n=&gt;-George Lucas.\n\nStar Wars Episode II - The Attack of the Clones.\nSet ten years after the events in The Phantom Menace. After an assassination\nattempt on the life of Senator Padme Amidala, Jedi Knight Obi-Wan Kenobi and\nhis Padawan learner Anakin Skywalker are sent to investigate. After tracking\ndown the assassin, she is killed before any information can be driven out of\nher. The two Jedi are then sent on two different missions, Anakin is sent to\nNaboo with Padme and Obi-Wan is sent to the planet of Kamino where he will\ninvestigate the assassination attempts. Little does he know, he is\ninvestigating some of the biggest events of the Star Wars saga, as he finds\nout that there is a connection between the assassination attempts and a\nseparatist movement led by a former Jedi against the Republic. The Galactic\nRepublic finds itself at the brink of a civil war.\n\nStars.\n=&gt;-Hayden Christensen.\n=&gt;-Natalie Portman.\n=&gt;-Ewan McGregor.\n\nDirector.\n=&gt;-George Lucas.\n\nStar Wars Episode III - Revenge of the Sith.\nThree years after the onset of the Clone Wars; the noble Jedi Knights are\nspread out across the galaxy leading a massive clone army in the war against\nthe Separatists. After Chancellor Palpatine is kidnapped, Jedi Master Obi-Wan\nKenobi and his former Padawan, Anakin Skywalker, are dispatched to eliminate\nthe evil General Grievous. Meanwhile, Anakin's friendship with the Chancellor\narouses suspicion in the Jedi Order, and dangerous to the Jedi Knight himself.\nWhen the sinister Sith Lord, Darth Sidious, unveils a plot to take over the\ngalaxy, the fate of Anakin, the Jedi order, and the entire galaxy is at stake.\nUpon his return, Anakin Skywalker's wife Padme Amidala is pregnant, but he is\nhaving visions of her dying in childbirth. Anakin Skywalker ultimately turns\nhis back on the Jedi, thus completing his journey to the dark side and his\ntransformation into Darth Vader. Obi-Wan Kenobi must face his former apprentice\nin a ferocious lightsaber duel on the fiery world of Mustafar.\n\nStars.\n=&gt;-Hayden Christensen.\n=&gt;-Ewan McGregor.\n=&gt;-Natalie Portman.\n\nDirector.\n=&gt;-George Lucas.\n\nStar Wars Episode IV - A New Hope.\nLuke Skywalker stays with his foster aunt and uncle on a farm on Tatooine. He\nis desperate to get off this planet and get to the Academy like his friends,\nbut his uncle needs him for the next harvest. Meanwhile, an evil emperor has\ntaken over the galaxy, and has constructed a formidable Death Star capable of\ndestroying whole planets. Princess Leia, a leader in the resistance movement,\nacquires plans of the Death Star, places them in R2-D2, a droid, and sends him\noff to find Obi-Wan Kenobi. Before he finds him, R2-D2 ends up on the Skywalkers\nfarm with his friend C-3PO. R2-D2 then wanders into the desert, and when Luke\nfollows, they eventually come across Obi-Wan. Will Luke, Obi-Wan and the two\ndroids be able to destroy the Death Star, or will the Emperor rule forever?\n\nStars.\n=&gt;-Mark Hamill.\n=&gt;-Carrie Fisher.\n=&gt;-Harrison Ford.\n\nDirector.\n=&gt;-George Lucas.\n\nStar Wars Episode V - The Empire Strikes Back.\nAfter receiving a vision from Obi-Wan Kenobi and fleeing the ice world of Hoth\nwith his friends after an Imperial attack, Luke Skywalker travels to the marsh\nplanet of Dagobah, where he is instructed in the ways of the Force by the\nlegendary Jedi Master Yoda. Meanwhile, Han Solo and Princess Leia make their way\nto planet Bespin, where they are greeted by Han's old friend, a shifty gambler\nnamed Lando Calrissian. Ambushed by the Empire shortly after their arrival, Han\nand his friends are imprisoned by Darth Vader. Luke leaves Dagobah to rescue\nhis friends, and is met by Vader and a startling revelation.\n\nStars.\n=&gt;-Mark Hamill.\n=&gt;-Carrie Fishern.\n=&gt;-Harrison Ford.\n\nDirector.\n=&gt;-Irvin Kershner.\n\nStar Wars Episode VI - The Return of the Jedi.\nAs the evil Emperor himself oversees the construction of the new Death Star by\nDarth Vader and the Galactic Empire, smuggler Han Solo is rescued from the clutches\nof the vile gangster Jabba the Hutt by his friends, Luke Skywalker, Princess Leia\nand Chewbacca. Leaving Skywalker Jedi training with Master Yoda, Solo returns to\nthe Rebel fleet to prepare to complete his battle with the Empire itself. During\nthe ensuing fighting, the newly returned Skywalker is captured by Vader. Can the\nRebels, and their newfound friends, the Ewoks, help restore freedom to the galaxy?\n\nStars.\n=&gt;-Mark Hamill.\n=&gt;-Harrison Ford.\n=&gt;-Carrie Fisher.\n\nDirector.\n=&gt;-Richard Marquand.\n\nInfo.\n=&gt;-Genre..........................: Action : Adventure : Sci-Fi.\n=&gt;-Release Date...................: 1999 : 2002 : 2005 : 1977 : 1980 : 1983.\n=&gt;-Language.......................: English.\n=&gt;-File Size......................: 1.07GiB : 1.12GiB : 1.10GiB : 1006MiB : 1.00GiB : 1.06GiB.\n=&gt;-Overall bit rate...............: 1 127 Kbps.\n=&gt;-Movie Runtime..................: 2h16mn : 2h22mn : 2h20mn : 2h04mn : 2h07mn : 2h14mn.\n\nVideo.\n=&gt;-Codec..........................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio...................: 2.35:1.\n=&gt;-Resolution.....................: 1280 x 544.\n=&gt;-Bit rate.......................: 1 000 Kbps.\n\nAudio English.\n=&gt;-Codec..........................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels.......................: 2 channel Stereo.\n=&gt;-Bit Rate.......................: 112 Kbps.\n=&gt;-Maximum bit rate...............: 155 Kbps.\n\nSubtitles.\n=&gt;-English.","torrent":{"xt":"urn:btih:8479a6d8bd55904907ef3c69833be0981323f505","amp;dn":"Star+Wars+Episode+I%2C+II%2C+III%2C+IV%2C+V%2C+VI+-+Complete+Saga+George+L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8479a6d8bd55904907ef3c69833be0981323f505","infoHashBuffer":{"type":"Buffer","data":[132,121,166,216,189,85,144,73,7,239,60,105,131,59,224,152,19,35,245,5]},"announce":[],"urlList":[]}}