{"title":"Windows 10 Pro NL - Tweaked &amp; Secured 64-Bit","uid":12516340,"size":4352837348,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:849a766ab793ef4443e777910d3f1ea826faea2c&amp;dn=Windows+10+Pro+NL+-+Tweaked+%26amp%3B+Secured+64-Bit&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":4,"uploader":"rubberboy37","files":1,"time":1443774993,"description":".NET Framework 3.5 is in deze Windows 10 al geheel ingeschakeld omdat je dit namelijk  vaak nodig hebt voor bepaalde software, en bij de meeste Windows 10 versies wil/kan het de .NET Pramework 3.5 niet installeren.\r\n\r\nTijdens de installatie van Windows 10 zullen de grootste oprivacy instellingen worden uitgeschakeld door de O&amp;O ShutUp, zodat Microsoft zo min mogelijk van je te weten krijgt. Zelf kan je de privacy instellingen aan of uit zetten met de meegeleverde O&amp;O ShutUp Anti-Spy Tool for Windows 10.\r\n\r\nTijdens de installatie van Windows 10 zijn de meeste Windows Updates t/m 15 september 2015 al voor je geintegreerd in deze versie zodat het up to date is. \r\n\r\nNOTE: Sommige Windows Updates konden helaas niet worden geintregeerd omdat deze alleen als LIVE UPDATE geinstalleeerd moeten/kunnen worden, dit zijn echter maar zeer kleine updates van o.a. de Windows Defender. Toch zal je na installatie van Windows 10 de resterende updates aangeboden krijgen via de automatische updates. Microsoft heeft de optie verborgen/verbergen updates weggelaten, maar met het bijgeleverde tooltje kan je deze optioe weer weergeven.\r\n\r\nIn deze installatie is voor de snelheid en stabiliteit o.as. GodMode ingeschakeld en het welbekende UAC (User Account Controll) volledig uitgeschakeld.\r\n\r\nHet aanmelden met een Microsoft account wordt bij deze versie overgeslagen, echter kan je natuurlijk zelf alsnog je lokale account aan een Microsoft account koppelen.\r\n\r\nDeze ISO past op een DVD5. Je dient deze ISO te branden op een DVD5 of op een USB-stick te zetten van minimaal 8 GB. Het programma Windows7-USB-DVD-Download-Tool-Installer-en-US en Rufus is meegeleverd.\r\n\r\nDeze Windows 10 versie is na de installatie permanent geactiveerd door de laatste KMSPico. KMSPico activeert ook automatisch Microsoft Office, mocht je deze nog gaan installeren.\r\n\r\n\r\nNa de installatie van deze Windows 10 versie zijn de volgende handige programma's geinstalleerd:\r\n\r\n- Revo Uninstaller Pro v3.1.4 NL\r\n- WinRar v5.21 Final NL\r\n- CCleaner Technician Edition v5.09.5343 NL\r\n- Malwarebytes Anti-Exploit Premium v1.07.1.1015\r\n- KMSPico v10.1.6\r\n\r\n\r\nLET OP: Het is ten strengste aanbevolen om je systeem na installatie van deze Windows 10 versie nog één keer handmatig op te starten! Op deze manier worden nameluijk echt alle tweaks volledig doorgevoerd, en werkt alle software naar behoren!","torrent":{"xt":"urn:btih:849a766ab793ef4443e777910d3f1ea826faea2c","amp;dn":"Windows+10+Pro+NL+-+Tweaked+%26amp%3B+Secured+64-Bit","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"849a766ab793ef4443e777910d3f1ea826faea2c","infoHashBuffer":{"type":"Buffer","data":[132,154,118,106,183,147,239,68,67,231,119,145,13,63,30,168,38,250,234,44]},"announce":[],"urlList":[]}}