{"title":"Savage Sword of Conan [the Barbarian] Complete 001-235","uid":6804948,"size":8387710814,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:84e078a6ba06560f8129f4f08479dd650e676d92&amp;dn=Savage+Sword+of+Conan+%5Bthe+Barbarian%5D+Complete+001-235&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":5,"uploader":"mike18xx2","files":-1,"time":1320827834,"description":"Complete Curtis/Marvel series. Recommend reading with HoneyView.\n\nWikipedia: The Savage Sword of Conan was a black-and-white magazine-format comic book series published beginning in 1974 by Curtis Magazines, an imprint of Marvel Comics, and then later by Marvel itself. Savage Sword of Conan starred Robert E. Howard's most famous creation, Conan the Barbarian, and has the distinction of being the longest-surviving title of the short-lived Curtis imprint.\n\nAs a &quot;magazine,&quot; Savage Sword of Conan didn't have to conform to the Comics Code Authority, making it a publication of choice for many illustrators. It soon became one of the most popular comic series of the 1970s and is now-considered a cult classic. Roy Thomas was the editor and primary writer for the series' first few years (until issue 60), which featured art by such notable illustrators as Neal Adams, Dick Giordano, Barry Windsor-Smith, John Buscema, Alfredo Alcala, Jim Starlin, Al Milgrom, Pablo Marcos, and Walter Simonson. Painted covers were provided by such artists as Earl Norem, Bob Larkin, and Joe Jusko.\n\nSavage Sword of Conan was published under the Curtis imprint until issue 60, when it became part of the Marvel Magazine Group. Stories from the comic were reprinted in the Marvel UK title of the same name. Savage Sword of Conan ran until issue #235 (July 1995).","torrent":{"xt":"urn:btih:84e078a6ba06560f8129f4f08479dd650e676d92","amp;dn":"Savage+Sword+of+Conan+%5Bthe+Barbarian%5D+Complete+001-235","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84e078a6ba06560f8129f4f08479dd650e676d92","infoHashBuffer":{"type":"Buffer","data":[132,224,120,166,186,6,86,15,129,41,244,240,132,121,221,101,14,103,109,146]},"announce":[],"urlList":[]}}