{"title":"Sufjan Stevens - Discography (2001-2012) [FLAC]","uid":8909907,"size":5103950924,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:84ed94c95a27b8852597444f572d272186a484cd&amp;dn=Sufjan+Stevens+-+Discography+%282001-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"politux","files":-1,"time":1378994629,"description":"\n  Sufjan Stevens - Discography (2001-2012) [FLAC]\n\n  Genres: Pop/Rock, Folk\n  Styles: Indie Pop, Singer/Songwriter\n  Source: CD, WEB\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2001 Enjoy Your Rabbit\n  2004 A Sun Came - 2nd Edition\n  2004 Greetings From Michigan - The Great Lakes State\n  2004 Seven Swans\n  2005 Illinois\n  2006 The Avalanche \n  2006 Presents Songs for Christmas (5 CD)\n  2009 The BQE\n  2010 The Age of Adz\n  2012 Silver &amp; Gold (5 CD)\n\n  A singer/songwriter and multi-instrumentalist, Detroit-born Sufjan Stevens started venturing into the music world while attending Hope College as a member of Marzuki, a folk-rock band based in Holland, Michigan. Following the release of two full-length albums with the group, Stevens decided to go solo in late 1999, investing fully in a career that was waiting to shine by itself. Sun Came, his debut album, appeared in 2000, confirming his superior musical command, complex instrumentation, and sparkling melodies. The promotion of the disc included playing on the road with the Danielson Famile, with whom he began regularly working. The heavily electronic Enjoy Your Rabbit, a song cycle concerning the animals of the Chinese zodiac, hit record stores in 2001, followed in 2003 by Greetings from Michigan: The Great Lake State, a 15-track conceptual piece produced and performed by Stevens -- he played over 20 instruments -- that placed his home state under the writer's microscope. Despite the record's narrowed focus, it was among the best reviewed work that year and made many critics' year-end lists. In 2004, Stevens released his follow-up, Seven Swans, a thoughtful, spiritual, and quasi-mystical collection of standalone songs produced by Danielson Famile mastermind Daniel Smith.\n\n  Stevens returned to his ambitious &quot;states&quot; project in 2005 with the epic Illinoise (extended title: Sufjan Stevens Invites You To: Come on Feel the Illinoise), which became one of the best-reviewed album of 2005, spawning accolades both regional and international -- it was also smacked with a lawsuit concerning the depiction of DC Comics icon Superman on the cover, who was eventually covered by a balloon sticker and subsequently removed from further pressings. The 21-track Avalanche: Outtakes &amp; Extras from the Illinois Album and the five-disc Christmas box set Songs for Christmas arrived in 2006, followed in 2007 by the instrumental BQE, a self-described &quot;symphonic and cinematic exploration of New York City's infamous Brooklyn-Queens Expressway&quot; that was commissioned by the Brooklyn Academy of Music and performed on three consecutive nights (November 1-3, 2007) in front of a film shot by Stevens, who had officially relocated to New York in 2000. Run Rabbit Run, a version of 2001's Enjoy Your Rabbit performed by the Osso String Quartet, and a recorded version, BQE, arrived in October 2009. In 2010, Stevens surprised everybody by releasing All Delighted People, a nearly 60-minute EP of new music. An all-new studio album, the surreal electronic pop manifesto The Age of Adz, arrived later, in October of that year. In 2012 Stevens released the five-EP box set Silver &amp; Gold: Songs for Christmas, Vols. 6-10, the sequel to 2006's Songs for Christmas, Vols. 1-5.","torrent":{"xt":"urn:btih:84ed94c95a27b8852597444f572d272186a484cd","amp;dn":"Sufjan+Stevens+-+Discography+%282001-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84ed94c95a27b8852597444f572d272186a484cd","infoHashBuffer":{"type":"Buffer","data":[132,237,148,201,90,39,184,133,37,151,68,79,87,45,39,33,134,164,132,205]},"announce":[],"urlList":[]}}