{"title":"Ark Scorched Earth Expansion","uid":15826731,"size":3690854149,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8572b17434f254e4e69e31b80e8c52d5f4fb4469&amp;dn=Ark+Scorched+Earth+Expansion&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"Panzix","files":1,"time":1473858499,"description":"Here is my first torrent, which is the expansion pack to Ark: Survival Evolved, Scorched Earth. It has been tested to work on retail ark and the cracked version that is played via &quot;spacewar&quot;. It is quite simple and is just the needed map files, mod files, and a patcher. \r\n****YOU WILL NEED THE RETAIL VERSION OF ARK TO PLAY THIS OR THE CRACKED VERSION AS THIS IS AN EXPANSION PACK, NOT A STANDALONE RELEASE.****\r\nFor people playing cracked ark through spacewar, this includes Scorched Earth AND Center. \r\nEnjoy, and please leave feedback in the comments. If this does well I will upload Primitive+ next. \r\n\r\n\r\nDescription:\r\nStranded naked, dehydrated &amp; starving in a vast desert, even the most seasoned ARK survivors must quickly find water, hunt for food, harvest, craft items, and build shelter to have any chance for survival. Use skills honed on ARK's faraway Island to kill, tame, breed, and ride the fantastical new creatures that have evolved to survive the Desert's ultra harsh conditions, including... DRAGONS! Travel back and forth between the Island and the Desert to team up with hundreds of players across both worlds or play locally!\r\n\r\nEXPLORE A NEW WORLD\r\nScorched Earth takes ARK players to an entirely new land, composed of six unique, desert themed biomes – dunes, high desert, mountains, canyons, badlands and oasis – each with their own aesthetic and ecosystem. Littered with ruins, geysers, and intricate ancient cave systems, survivors will find a whole new frontier to explore and master.\r\n\r\nTAME NEW CREATURES\r\nThe biomes of Scorched Earth are filled with dangerous new creatures, and the intrepid survivor will find that many of them can be tamed. Among others, lead a caravan of the camel-like Morellatops, or rain fire down upon your enemies from the back of an elemental Wyvern. Just mind your step, or you might attract a Death Worm!\r\n\r\nCRAFT OVER 50 NEW ITEMS\r\nUsing what resources they can scrounge together, survivors can craft distinct new outfits and structures to beat the heat, and new tools to help them survive in this desolate environment. Players can use whips, boomerangs, flamethrowers, chainsaws, and much more to defend themselves, or such things as tents, wells, wind turbines, and oil refineries to provide their bases with resources. When used creatively, these tools can open up whole new strategies for survival, self defense or epic tribal warfare.\r\n\r\nCONQUER NEW CHALLENGES\r\nPrepare yourself for dangerous electrical storms, blinding sand storms, befuddling heat stroke, and unleash the power of the mysterious Obelisks to come face-to-face with the ARK’s deadliest boss creature to date – the ferocious Manticore! Does it protect a powerful weapon, a precious relic, or the mysteries of the ARK itself? Only survivors who posses the courage to confront this fearsome beast will learn the truth.\r\n\r\nSystem Requirements\r\nWindows Mac OS X SteamOS + Linux\r\nMINIMUM: \r\nOS: 64-Bit Windows 7 Service Pack 1, or Windows 8 \r\nProcessor: 2 GHz Dual-Core 64-bit CPU \r\nMemory: 4000 MB RAM \r\nStorage: 10000 MB available space","torrent":{"xt":"urn:btih:8572b17434f254e4e69e31b80e8c52d5f4fb4469","amp;dn":"Ark+Scorched+Earth+Expansion","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8572b17434f254e4e69e31b80e8c52d5f4fb4469","infoHashBuffer":{"type":"Buffer","data":[133,114,177,116,52,242,84,228,230,158,49,184,14,140,82,213,244,251,68,105]},"announce":[],"urlList":[]}}