{"title":"The Dirty Little Kindle Book Of Sex Quotes (Epub) Gooner","uid":11716816,"size":1151094,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85fcf88e11ed6b066611fe37989665f58b85d3d7&amp;dn=The+Dirty+Little+Kindle+Book+Of+Sex+Quotes+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1424617048,"description":"Publisher: Mark Zedler; 1 edition (May 23, 2010)\nLanguage: English\nASIN: B003ODIYZ8\n\n&quot;It's not true that I had nothing on. I had the radio on.&quot; declared Marilyn Monroe illustrating her wonderful sense of humour. Kevin Costner suggested &quot;Sex and golf are the two things you can enjoy even if you're not good at them.&quot; And let's not forget Ken Hammond who once remarked &quot;What's the three words you never want to hear while making love? 'Honey, I'm home'.&quot;\n\nMost everyone enjoys reading quotes about sex. We delight in reading them because they are so often uncomfortably true. Sex quotes often convey an embedded message that we know to be true but are often afraid or unwilling to utter in public. Without a doubt few things can spice up a conversation about sex or sexuality more than a well-chosen sex quote. Given our affinity for sex quotes, wouldn't it be great to have the best sex quotes available compiled in a free eBook? Well here it is folks!\n\nThe Dirty little eBook of Sex Quotes is organized into 30 categories for quick easy reference. This eBook is the ultimate source for the best sex quotes around. This eBook is not only makes for great reading it is also very visually appealing.\n\nThis eBook has it all: Dirty Sex, Bisexuality, Money, Chastity, The Tao of Sex, Safe Sex, Relationships and many more. All told, you have in your possession well over 200 of the best sex quotes ever","torrent":{"xt":"urn:btih:85fcf88e11ed6b066611fe37989665f58b85d3d7","amp;dn":"The+Dirty+Little+Kindle+Book+Of+Sex+Quotes+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85fcf88e11ed6b066611fe37989665f58b85d3d7","infoHashBuffer":{"type":"Buffer","data":[133,252,248,142,17,237,107,6,102,17,254,55,152,150,101,245,139,133,211,215]},"announce":[],"urlList":[]}}