{"title":"Nudge - Improving Decisions About Health, Wealth, and Happiness","uid":5341084,"size":501824257,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8617cbe7cf3be21f2526cd68ecb7d2430a5f33a1&amp;dn=Nudge+-+Improving+Decisions+About+Health%2C+Wealth%2C+and+Happiness+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"bobok11","files":97,"time":1265483477,"description":"Audiobook - Nudge - Improving Decisions About Health, Wealth, and Happiness (Richard H. Thaler, Cass R. Sunstein)\n\nLength: 11h28m\n96kb/s\n\nEvery day, we make decisions on topics ranging from personal investments to schools for our children to the meals we eat to the causes we champion.\n\nUnfortunately, we often choose poorly.\n\nThaler and Sunstein invite us to enter an alternative world, one that takes our humanness as a given. They show that by knowing how people think, we can design choice environments that make it easier for people to choose what is best for themselves, their families, and their society. Thaler and Sunstein demonstrate how thoughtful choice architecture can be established to nudge us in beneficial directions without restricting freedom of choice.\n\nNudge offers a unique new take-from neither the left nor the right-on many hot-button issues, for individuals and governments alike.\n\n&quot;I love this book. It is one of the few books I've read recently that fundamentally changes the way I think about the world. Just as surprising, it is fun to read, drawing on examples as far afield as urinals, 401(k) plans, organ donations, and marriage. Academics are not supposed to be able to write this well.&quot;\n\n-Steve Levitt, professor of economics, University of Chicago, author of Freakonomics\n\n","torrent":{"xt":"urn:btih:8617cbe7cf3be21f2526cd68ecb7d2430a5f33a1","amp;dn":"Nudge+-+Improving+Decisions+About+Health%2C+Wealth%2C+and+Happiness+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8617cbe7cf3be21f2526cd68ecb7d2430a5f33a1","infoHashBuffer":{"type":"Buffer","data":[134,23,203,231,207,59,226,31,37,38,205,104,236,183,210,67,10,95,51,161]},"announce":[],"urlList":[]}}