{"title":"Wondershare MobileGo for Android v4.5.0.263 Incl. Patch-MPT","uid":10156291,"size":40812922,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:86b92a1c8409376067eb14a145845346ced2d35e&amp;dn=Wondershare+MobileGo+for+Android+v4.5.0.263+Incl.+Patch-MPT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"AtomTPB","files":7,"time":1400165345,"description":"Description:\nWondershare MobileGo for Android is a professional solution that can help you preview the photos on your phone, export videos and songs, as well as explore contacts and installed apps.\n\nThis one-stop mobile manager helps you achieve a simple but effective mobile management of your contacts, music files, movies, SMS, photos, and applications such as multimedia converting, data transferring, contact management, data backup, and other phone managements between your PC and Android phone.\n\n\nFeatures:\n- Freely import and export contacts to ensure you record all your contacts easily and conveniently. So far the only format supported is vCard.\n- Easily add, delete, group and back up all of your contacts for your Android smart phone.\n- Automatically convert the incompatible formats into compatible ones when you try to import multimedia files from PC to your phone.\n- Freely transfer any of your favorite movies and music files from PC to your phone without worrying about the compatibility of file formats.\n- Simply build a new playlist, export to local, rename, delete, and set ringtones, etc. to organize your media files.\n- Freely manage and handle pictures and photos like transferring, rotating, deleting, renaming and so on.\n- Easily backup Contacts, SMS, APK Applications from android to your PC with one click in case that your mobile is lost or stolen, or whenever you need to change your phone.\n- Quickly restore your backup data on PC to your Android phone.\n\n\nSystem Requirements:\n- Operating System: Windows 8.1/8/7/XP/2003/Vista\n- Processor: 750MHz Intel or above, or AMD CPU\n- Free Hard Disk Space: 200 MB or more\n- RAM: 256 MB or above\n\n\nWhat's New in Version 4.5.0:\n. Optimized the one-click root function, and greatly improved the success rate of root.\n2. Support one-click root upgrade online.\n","torrent":{"xt":"urn:btih:86b92a1c8409376067eb14a145845346ced2d35e","amp;dn":"Wondershare+MobileGo+for+Android+v4.5.0.263+Incl.+Patch-MPT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86b92a1c8409376067eb14a145845346ced2d35e","infoHashBuffer":{"type":"Buffer","data":[134,185,42,28,132,9,55,96,103,235,20,161,69,132,83,70,206,210,211,94]},"announce":[],"urlList":[]}}