{"title":"Hoefler &amp; Frere-Jones typefaces","uid":4127948,"size":19753919,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8710336de7b87b8faba366b411bc346dad39ef61&amp;dn=Hoefler+%26+Frere-Jones+typefaces&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"blubbbla","files":1,"time":1207886194,"description":"The famous Hoefler &amp; Frere-Jones fonts:\nSince 1989, Jonathan Hoefler and Tobias Frere-Jones have helped some of the world&amp;#039;s foremost publications, corporations, and institutions develop their unique voice through typography. Their body of work includes some of the world&amp;#039;s most famous designs, typefaces marked by both high performance and high style. In 2004, The Hoefler Type Foundry entered its sixteenth year as Hoefler &amp; Frere-Jones. H&amp;FJ continues to work with brand leaders in every sector, developing original typefaces and licensing fonts from its library of nearly 1,000 designs, and it publishes fonts exclusively through its New York sales office and its web site at typography.com. \n\nFonts included:\nAcropolis HTF; Appellation Logo HTF; Champion Gothic HTF; Chrysler HTF; Deseret HTF; Didot HTF; Ehmcke HTF; Fetish No. 338 HTF; Gestalt HTF; Gotham HTF; Gotham Rounded HTF; Hand Cancelled HTF; Historical HTF; Hoefler Text HTF; Hoefler Titling HTF; Knockout Series A to G HTF; Leviathan HTF; Mercury HTF; Numbers; Odeon Condensed HTF; Requiem Unlocked HTF; Saracen HTF; Schneidler Titling HTF; Today Statoil; Verlag HTF; Whitney HTF; Whitney Index HTF; Whitney Numeric HTF; Woodtype Antique XXXCond HTF; Woodtype Gothic Extended HTF; Ziggurat HTF\n\n\n","torrent":{"xt":"urn:btih:8710336de7b87b8faba366b411bc346dad39ef61","amp;dn":"Hoefler+%26+Frere-Jones+typefaces","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8710336de7b87b8faba366b411bc346dad39ef61","infoHashBuffer":{"type":"Buffer","data":[135,16,51,109,231,184,123,143,171,163,102,180,17,188,52,109,173,57,239,97]},"announce":[],"urlList":[]}}