{"title":"Atlas of Material Damage - George Wypych","uid":15869372,"size":8323085,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:871b303ffe8f5717f840806cda78c71b9451f501&amp;dn=Atlas+of+Material+Damage+-+George+Wypych&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"clouderone","files":1,"time":1474411296,"description":"Atlas of Material Damage - George Wypych (ChemTec, 2012).pdf\r\n\r\nProduct reliability is the major aim of technological know-how. Uninterrupted performance of manufactured products at typical and extreme conditions of its use is the major goal of product development and the most important indicator of material quality.\r\n\r\nThis book provides information on defect formation and materials damage. The following aspects of material performance are discussed:\r\n\r\n1 Effect of composition, morphological features, and structure of different materials on material performance, durability, and resilience\r\n\r\n2 Analysis of causes of material damage and degradation\r\n\r\n3 Effect of processing conditions on material damage\r\n\r\n4 Effect of combined action of different degradants on industrial products\r\n\r\n5 Systematic analysis of existing knowledge regarding the modes of damage and morphology of\r\n\r\ndamaged material\r\n\r\n6 Methods of analysis of material damage\r\n\r\n7 Comparison of experiences generated in different sectors of industry regarding the most frequently encountered failures, reasons for these failures, and potential improvements preventing future damage\r\n\r\nThe name &quot;Atlas&quot; was selected to indicate emphasis of the book on illustration with many real examples of damaged products and discussion of causes of damage and potential for material improvements.\r\n\r\nSpecial chapter contains examples of damage encountered in different groups of industrial products. Each group of materials is discussed according to the following breakdown:\r\n\r\n1 Examples of damage typically encountered in a group under discussion\r\n\r\n2 Results of structural analysis of degradation (e.g., image analysis, surface and bulk mapping by analytic techniques such as NMR, XPS, thermography, etc.)\r\n\r\n3 Credit to the source of images, references, and explanations\r\n\r\n4 Conditions under which material was degraded\r\n\r\n5 Discussion of morphological features and observations\r\n\r\nData and images are provided for many material types, making this a hard-working reference guide for engineers working in a range of different market sectors.\r\nAs well as providing core data, this reference explains the range of test and imaging techniques available, enabling engineers and scientists to take optimal and cost effective decisions.\r\nAn essential tool for identifying material damage and implementing successful maintenance and replacement regimes","torrent":{"xt":"urn:btih:871b303ffe8f5717f840806cda78c71b9451f501","amp;dn":"Atlas+of+Material+Damage+-+George+Wypych","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"871b303ffe8f5717f840806cda78c71b9451f501","infoHashBuffer":{"type":"Buffer","data":[135,27,48,63,254,143,87,23,248,64,128,108,218,120,199,27,148,81,245,1]},"announce":[],"urlList":[]}}