{"title":"Johann W. von Goethe - Faust &amp; other works (21 books)","uid":11223372,"size":91652543,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:877141fc4e3f513d8d368ceb08e1f737a9603f81&amp;dn=Johann+W.+von+Goethe+-+Faust+%26amp%3B+other+works+%2821+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"workerbee","files":-1,"time":1413410916,"description":"\nJOHANN WOLFGANG von GOETHE (1749-1832) was a German writer and thinker whose body of work includes epic and lyric poetry written in a variety of metres and styles; prose and verse dramas; memoirs; an autobiography; literary and aesthetic criticism; treatises on botany, anatomy, and colour; and four novels.\n\nHis first novel, THE SORROWS OF YOUNG WERTHER (1774), instantly made the 24-year-old Goethe an international literary celebrity.  It was an important novel of the Sturm und Drang period in German literature, and profoundly influenced the later Romantic literary movement.  Six translations are included here, along with his third novel, ELECTIVE AFFINITIES (1809).\n\nFAUST (1808-32), a tragic play in two parts, is his most famous work and one of the greatest works of German literature.  Seven translations are included in this collection.  Goethe's poetic work served as a model for an entire movement in German poetry termed Innerlichkeit (&quot;introversion&quot;).  Many of them were set to music throughout the eighteenth and nineteenth centuries by a number of composers, including Mozart, Beethoven, Schubert, Schumann, Brahms, Gounod, Wagner, Wolf, and Mahler.\n\nGoethe was also keenly involved in natural science, represented here by his first major scientific work, the METAMORPHOSIS OF PLANTS (1788), and an anthology of his SCIENTIFIC STUDIES (1988).\n\nRalph Waldo Emerson selected Goethe, along with Plato, Napoleon, and William Shakespeare, as one of six &quot;representative men&quot; along with Plato, Napoleon, and William Shakespeare.  Goethe's comments and observations form the basis of several biographical works, most notably Johann Peter Eckermann's CONVERSATIONS WITH GOETHE (1836, 1848).  There are frequent references to Goethe's various sayings and maxims throughout the course of Friedrich Nietzsche's work and there are numerous allusions to Goethe in the novels of Hermann Hesse and Thomas Mann as well as in the psychological writings of C.G. Jung.\n\n\nThe following books are in PDF format unless otherwise noted:\n\n* CONVERSATIONS WITH ECKERMANN, 1823-1832 (North Point, 1984).  Translated by John Oxenford. -- PDF + ePUB\n\n* ELECTIVE AFFINITIES (Penguin, 2005).  Translated by R. J. Hollingdale. -- ePUB\n\n* FAUST: Part One (Collier, 1962).  Translated by Bayard Taylor; revised and edited by Stuart Atkins.\n\n* FAUST: Part One (Penguin Classics, 1949).  Translated by Philip Wayne.\n\n* FAUST (Oxford UP, 1987/1994).  2 volumes.  Translated with an Introduction and Notes by David Luke. -- ePUB\n\n* FAUST (Anchor Books, 1963).  Bilingual edition.  Translated with an Introduction by Walter Kaufmann.\n\n* FAUST (Bantam Classics, 1962/1985).  Bilingual edition.  Translated with an Introduction by Peter Sahn. -- PDF + ePUB\n\n* FAUSTUS: From the German of Goethe, Translated by Samuel Taylor Coleridge (Oxford UP, 2007).  Edited by Frederick Burwick and James C. McKusick.\n\n* ITALIAN JOURNEY, 1786-1788 (North Point, 1982).  Translated by W. H. Auden and Elizabeth Mayer.\n\n* THE METAMORPHOSIS OF PLANTS (MIT, 2009).  Introduction and photography by Gordon L. Miller.\n\n* THE METAMORPHOSIS OF PLANTS (Bio-Dynamic Farming &amp; Gardening Association, 2004).  Translated by Anne E. Marshall and Heinz Grotzke. -- ePUB\n\n* SCIENTIFIC STUDIES [The Collected Works, Vol. 12] (Suhrkamp, 1988).  Edited and translated by Douglas Miller.\n\n* SELECTED POEMS [The Collected Works, Vol. 1] (Princeton UP, 1994).  Bilingual edition.  Edited by Christopher Middleton, with translations by Michael Hamburger, David Luke, Christopher Middleton, John Frederick Nims, and Vernon Watkins.\n\n* THE SORROWS OF YOUNG WERTHER (Modern Library, 2004).  Translated by Burton Pike.\n\n* THE SORROWS OF YOUNG WERTHER &amp; NOVELLA (Vintage Classics, 1990).  Translated by Elizabeth Mayer and Louise Bogan, with a Foreword by W. H. Auden.\n\n* THE SORROWS OF YOUNG WERTHER &amp; SELECTED WRITINGS (Signet Classics, 2013).  Translated by Catherine Hutter with an Introduction by Marcelle Clements and a new Afterword by Elisabeth Krimmer. -- ePUB\n\n* THE SUFFERINGS OF YOUNG WERTHER (W. W. Norton &amp; Co., 2012).  Translated by Stanley Corngold. -- ePUB\n\n* THE SUFFERINGS OF YOUNG WERTHER (Ungar, 1957).   Translated by Bayard Quincy Morgan.\n\n* WEST-EAST DIVAN: The Poems, with &quot;Notes and Essays&quot; (SUNY, 2010).  Translated by Martin Bidney (&quot;Divan&quot;), and &quot;Notes and Essays&quot; by Martin Bidney and Peter Anton von Arnim [pages missing].\n\n* THE WORKS OF JOHANN W. von GOETHE (Delphi Classics, 2013) -- ePUB\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                           &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:877141fc4e3f513d8d368ceb08e1f737a9603f81","amp;dn":"Johann+W.+von+Goethe+-+Faust+%26amp%3B+other+works+%2821+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"877141fc4e3f513d8d368ceb08e1f737a9603f81","infoHashBuffer":{"type":"Buffer","data":[135,113,65,252,78,63,81,61,141,54,140,235,8,225,247,55,169,96,63,129]},"announce":[],"urlList":[]}}