{"title":"Your Brain on Porn: Internet Pornography and the Emerging Scienc","uid":11149376,"size":1983789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88abb6d3c94e924962ab40c1187cefde372d833d&amp;dn=Your+Brain+on+Porn%3A+Internet+Pornography+and+the+Emerging+Scienc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":null,"files":-1,"time":1412307347,"description":"&quot;As is the case so often with new phenomena, science lags behind lived experience. Gary Wilson brings the two together powerfully as he explores the addiction that dare not speak its name. This book crackles with energy, urgency and humour. It offers up the hope of recovery to those struggling with internet porn addiction and it does so with compassion and informed authority. As a clinician I recognise the stories within its pages and I recognise the value of the solutions offered. This book is not to be missed.\n\n~Dr. David McCartney,\n\nPrimary Care Addiction Specialist, Edinburgh\n\nYou may be reading this because you're troubled by your use of pornographic material. Maybe you have been spending more time looking at graphic material than you want to, despite a determination to cut back. Maybe you are finding it difficult to climax during sex, or you're plagued by unreliable erections. Maybe you've escalated to fetish material that you find disturbing.\n\nThis website aims to provide you with information that can help take back control. Its articles, videos and first-person accounts will bring you up to speed with what we know about internet porn use and its effects on the brain. But the sheer volume of material can be overwhelming.\n\nIf you are in a hurry to get to grips with what's going on in your brain and understand why modern porn is so compelling and can be so harmful - and what to do about it - Gary Wilson, this site's creator, and Anthony Jack, a professor of cognitive neuroscience at Case Western University, have teamed up to write Your Brain on Porn: Internet Pornography and the Emerging Science of Addiction, which sets out the current state of our understanding as clearly and concisely as possible. Give us a few hours of your undivided attention and we'll do our best to get you on track.&quot;\n\nsource:\n\nAll of the author's proceeds go to porn addiction research, so please buy the book if you would like to support it. The book is only $5 USD with the link above. Thank you :)","torrent":{"xt":"urn:btih:88abb6d3c94e924962ab40c1187cefde372d833d","amp;dn":"Your+Brain+on+Porn%3A+Internet+Pornography+and+the+Emerging+Scienc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88abb6d3c94e924962ab40c1187cefde372d833d","infoHashBuffer":{"type":"Buffer","data":[136,171,182,211,201,78,146,73,98,171,64,193,24,124,239,222,55,45,131,61]},"announce":[],"urlList":[]}}