{"title":"Digital Anarchy Beauty Box 3.0.7 for Photoshop [ChingLiu]","uid":10857068,"size":14656136,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:88d881bec9eedd73f6960ddec5387b607c4780a1&amp;dn=Digital+Anarchy+Beauty+Box+3.0.7+for+Photoshop+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1408846485,"description":"Apply Digital Makeup for a photo makeover after the shoot\n\nThe Beauty Box skin retouching plugin provides photographers and digital artists with an easy and powerful way of smoothing out skin and removing blemishes using Adobe Photoshop, Aperture and Photoshop Elements. Whether the software is used for a glamour shoot, senior portraits or just a personal photo, Beauty Box Photo achieves a consistently professional result.\n\nIncreased Speed: Beauty Box is up to 600% faster. By using OpenCL, Beauty Box Photo is super fast on both AMD and Nvidia graphics cards. \nAutomatic Mask: The Auto-Mask button automatically creates an underlying mask. This is brand new in 3.0 and does an amazing job of accurately selecting skin tones.\nSmart Skin Smoothing: Adjust the skin smoothing effects with three Smoothing controls. This uses sophisticated algorithms for smoothing the skin areas while retaining the skin texture. \nShine Reduction: This slider lets you reduce the hot spots caused by bright lights on shiny/sweaty skin.\n30+ Preset Styles: Add a variety of color effects on top of the basic retouching to give your photo a glamour, fashion, or dark and evil look.\nBatch Processing: Let Beauty Box set the mask and smoothing automatically for batch processing. With the new speed increase, you can retouch up to 900 12mp images an hour. Great for labs or high volume photographers.\nControl Over Mask: Make changes to the mask with advanced Mask tools (though generally you won't need to!).\nDetail Sharpening: Use fine-tuning controls to preserve important details like hair, eyelashes and jewelry.\nAdd Texture: Bring back skin texture like pore structure that can be lost because of the smoothing.\n\nSystem Requirements\n\n-Windows XP (64 bit), Vista, 7, 8 (32-64 bit)\n-Adobe Photoshop CS2 to CC\n-Adobe Elements 9.0 to 12.0\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.digitalanarchy.com/beautyPS/main.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.digitalanarchy.com/beautyPS/main.html&lt;/a&gt;","torrent":{"xt":"urn:btih:88d881bec9eedd73f6960ddec5387b607c4780a1","amp;dn":"Digital+Anarchy+Beauty+Box+3.0.7+for+Photoshop+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88d881bec9eedd73f6960ddec5387b607c4780a1","infoHashBuffer":{"type":"Buffer","data":[136,216,129,190,201,238,221,115,246,150,13,222,197,56,123,96,124,71,128,161]},"announce":[],"urlList":[]}}