{"title":"Let it Be - The Beatles","uid":7908731,"size":33536254,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8903ab7b2815f4a42f9e49c9616a8baa6cc34074&amp;dn=Let+it+Be+-+The+Beatles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"PiratePrincess","files":12,"time":1355159058,"description":"Let It Be is the 12th and final studio album released by the English rock band the Beatles. It was released on 8 May 1970 by the band's Apple Records label shortly after the group announced their break-up.\n\nMost of Let It Be was recorded in January 1969, before the recording and release of the album Abbey Road. For this reason, some critics and fans, such as Mark Lewisohn, argue that Abbey Road should be considered the group's final album and Let It Be the penultimate. Let It Be was originally intended to be released before Abbey Road during mid-1969 as Get Back, but the Beatles were unhappy with this version, which was mixed and compiled by Glyn Johns, and it was temporarily shelved. A new version of the album was created by Phil Spector in 1970 and finally released as Let It Be, serving as the album for the 1970 motion picture of the same name. While three songs from the sessions were released as singles before the album's release, &quot;Get Back&quot;/&quot;Don't Let Me Down&quot; and &quot;Let It Be&quot;, the songs were remixed by Spector for the album and &quot;Don't Let Me Down&quot; was not included.\n\nDespite a mixed review from Rolling Stone magazine at the time of its release, the album was ranked number 86 in the magazine's list of the 500 greatest albums of all time in 2003.[1] This was, however, adjusted to #392 in the 2012 version.[2]\n\nLet It Be... Naked was released in 2003, an alternative version of the album stripping much of Phil Spector's production work and using some different versions of songs.","torrent":{"xt":"urn:btih:8903ab7b2815f4a42f9e49c9616a8baa6cc34074","amp;dn":"Let+it+Be+-+The+Beatles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8903ab7b2815f4a42f9e49c9616a8baa6cc34074","infoHashBuffer":{"type":"Buffer","data":[137,3,171,123,40,21,244,164,47,158,73,201,97,106,139,170,108,195,64,116]},"announce":[],"urlList":[]}}