{"title":"High Pressure Phase Behaviour of Multicomponent Fluid Mixtures","uid":15910994,"size":5350734,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8977922c966253d16ff44601b9fd2fde8a293d54&amp;dn=High+Pressure+Phase+Behaviour+of+Multicomponent+Fluid+Mixtures&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"clouderone","files":1,"time":1475113592,"description":"High Pressure Phase Behaviour of Multicomponent Fluid Mixtures - Richard J. Sadus (Elsevier, 1992).pdf\r\n\r\nThe high pressure phase behaviour of binary fluid mixtures has been extensively studied during the last three decades. There is ample experimental data for a wide variety of binary mixtures and extensive methods for prediction have been developed. In contrast, the investigation of ternary and other multicomponent fluids is in its infancy. Experimental ternary mixture critical data are very rare and theoretical studies have been limited to data correlation rather than genuine prediction. The phase behaviour of ternary and other multicomponent fluid mixtures has many novel aspects which are not manifested in binary mixtures. The properties of ternary mixtures are also likely to be more difficult to characterize experimentally. It is in this context that calculated phase diagrams have an important role in leading the discovery of new phenomena and guiding experimental work.\r\n\r\nThe criteria for phase equilibria of multicomponent fluids with particular emphasis on the critical state are examined in this book, and models for predicting fluid equilibria (e.g., different equations of state) are compared. Particular attention is paid to the critical state of ternary mixtures which has hitherto been largely neglected. The problems associated with predicting ternary equilibria are discussed, and some novel aspects of ternary critical phenomena are illustrated. \r\n\r\n\r\nThe books also describes a novel type of critical transition which appears to be a common feature of the equilibria of ternary mixtures. Extensive phase diagrams of a wide range of ternary mixtures including systems containing carbon dioxide, water, nitrogen and tetrafluoromethane as one or more component are presented. The theoretical treatment is detailed in the appendix and a computation of known experimental critical points is also included","torrent":{"xt":"urn:btih:8977922c966253d16ff44601b9fd2fde8a293d54","amp;dn":"High+Pressure+Phase+Behaviour+of+Multicomponent+Fluid+Mixtures","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8977922c966253d16ff44601b9fd2fde8a293d54","infoHashBuffer":{"type":"Buffer","data":[137,119,146,44,150,98,83,209,111,244,70,1,185,253,47,222,138,41,61,84]},"announce":[],"urlList":[]}}