{"title":"Rang and Dale's Pharmacology Flash Cards, Updated Edition [PDF] ","uid":10740582,"size":9277015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89c14968db33c3b1c9d1bd4a973fe31ea3171f53&amp;dn=Rang+and+Dale%27s+Pharmacology+Flash+Cards%2C+Updated+Edition+%5BPDF%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"0xmovva","files":2,"time":1407748382,"description":"Author: Maureen M. Dale MB BCh PhD (Author), Dennis G. Haylett BSc PhD (Author)\nPublisher: Churchill Livingstone; Box Flc Cr edition (January 21, 2014)\nLanguage: English\nISBN-10: 0702059579\nISBN-13: 978-0702059575\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nReview what you learn in class and reinforce essential drug information. Using generic drug names, Rang &amp; Dale's Pharmacology Flash Cards cover the actions, mechanisms of action, pharmacokinetic aspects, clinical uses and adverse effects of all important drugs. The 320 cards are divided into sets, each covering a different body system. Each card features a multi-color diagram that indicates how drugs may exert their action on that system. Detailed information is presented on the reverse side so that you can easily test your knowledge of the drug. With a portable format and references to Rang and Dale's Pharmacology, 7th Edition and Dale and Haylett: Pharmacology Condensed, 2nd Edition, these cards make it easy to review what you need to know in pharmacology.\n\nIncludes multi-color diagrams of the main pathophysiology affected by drugs to put them in the context in which they act on the body.\nDetails all important drugs and refers to drugs with similar actions/uses.\nDemonstrates clinical correlations so you can apply the material to real life situations.\nPresents the cards arranged by system to match Rang and Dale's Pharmacology, 7th Edition to better prepare you for exams, including Best of Five and USMLE Step 1.\nReferences Rang and Dale's Pharmacology, 7th Edition and Dale and Haylett: Pharmacology Condensed, 2nd Edition to allow ready access to further information.","torrent":{"xt":"urn:btih:89c14968db33c3b1c9d1bd4a973fe31ea3171f53","amp;dn":"Rang+and+Dale%27s+Pharmacology+Flash+Cards%2C+Updated+Edition+%5BPDF%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89c14968db33c3b1c9d1bd4a973fe31ea3171f53","infoHashBuffer":{"type":"Buffer","data":[137,193,73,104,219,51,195,177,201,209,189,74,151,63,227,30,163,23,31,83]},"announce":[],"urlList":[]}}