{"title":"The Fourth Crusade and the Sack of Constantinople","uid":15770714,"size":1054724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a51b6935a511506beb1af4c096feff590e5ef1a&amp;dn=The+Fourth+Crusade+and+the+Sack+of+Constantinople&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"marty14","files":1,"time":1473201189,"description":"The Fourth Crusade and the Sack of Constantinople - Jonathan Phillips [epub]\r\n\r\nIn 1202, zealous western Christians gathered in Venice determined to liberate Jerusalem from the grip of Islam. But the crusaders never made it to the Holy Land. Steered forward by the shrewd Venetian doge, they descended instead on Constantinople, wreaking devastation so terrible and inflicting scars so deep that as recently as 2001 Pope John Paul II offered an apology to the Greek Orthodox Church. The crusaders spared no one: They raped and massacred thousands, plundered churches, and torched the lavish city. A prostitute danced on the altar of the ravaged Hagia Sophia. And by 1204, barbarism masquerading as piety had shattered on of the great civilizations of history.\r\n\r\nHere, on the eight hundredth anniversary of the sack, is the extraordinary story of this epic catastrophe, told for the first time outside of academia by Jonathan Phillips, a leading expert on the crusades. Knights and commoners, monastic chroniclers, courtly troubadours, survivors of the carnage, and even Pope Innocent III left vivid accounts detailing the events of those two fateful years. Using their remarkable letters, chronicles, and speeches, Phillips traces the way in which any region steeped in religious fanaticism, in this case Christian Europe, might succumb to holy war","torrent":{"xt":"urn:btih:8a51b6935a511506beb1af4c096feff590e5ef1a","amp;dn":"The+Fourth+Crusade+and+the+Sack+of+Constantinople","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a51b6935a511506beb1af4c096feff590e5ef1a","infoHashBuffer":{"type":"Buffer","data":[138,81,182,147,90,81,21,6,190,177,175,76,9,111,239,245,144,229,239,26]},"announce":[],"urlList":[]}}