{"title":"Sword of Truth Series (1994-2013) Terry Goodkind (multi) ","uid":9506244,"size":40416919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b8d4d713ba8369afd8a0517732c65d9397d7991&amp;dn=Sword+of+Truth+Series+%281994-2013%29+Terry+Goodkind+%28multi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":3,"uploader":"7","files":-1,"time":1390321325,"description":"Sword of Truth Series by Terry Goodkind\n\n\nFormat: mobi/epub/azw3\nGenre: Fantasy\nDate: 1 January 1994 - 22 August 2013\n\nThe Sword of Truth is a series of twelve epic fantasy novels written by Terry Goodkind. The books follow the protagonists Richard Cypher, Kahlan Amnell and Zeddicus Zu'l Zorander on their quest to defeat oppressors who seek to control the world and those who wish to unleash evil upon the world of the living. While each novel was written to stand alone, except for the final three that were intended to be a trilogy, they follow a common timeline and are linked by ongoing events that occur throughout the series.\n\nThe series began in 1994 with Wizard's First Rule and Goodkind has since written eleven more novels in addition to a novella titled Debt of Bones. The last novel in the series, The Third Kingdom, was released in 2013.\n\nSword of Truth\n\nDebt of Bones (#0.5) (2001) (Prequel Novella)\nWizard's First Rule (#1) (1994)\n\nThe masterpiece that started The New York Times bestselling epic Sword of Truth.\n\nIn the aftermath of the brutal murder of his father, a mysterious woman, Kahlan Amnell, appears in Richard Cypher's forest sanctuary seeking help....and more. His world, his very beliefs, are shattered when ancient debts come due with thundering violence.\n\nIn a dark age it takes courage to live, and more than mere courage to challenge those who hold dominion, Richard and Kahlan must take up that challenge or become the next victims. Beyond awaits a bewitching land where even the best of their hearts could betray them. Yet, Richard fears nothing so much as what secrets his sword might reveal about his own soul. Falling in love would destroy them--for reasons Richard can't imagine and Kahlan dare not say.\n\nIn their darkest hour, hunted relentlessly, tormented by treachery and loss, Kahlan calls upon Richard to reach beyond his sword--to invoke within himself something more noble. Neither knows that the rules of battle have just changed....or that their time has run out.\n\nThis is the beginning. One book. One Rule. Witness the birth of a legend.\n\nStone of Tears (#2) (1995)\nBlood of the Fold (#3) (1996)\nTemple of the Winds (#4) (1997)\nSoul of the Fire (#5) (1999)\nFaith of the Fallen (#6) (2000)\nThe Pillars of Creation (#7) (2001)\nNaked Empire (#8) (2003)\nChainfire (#9) (2005)\nPhantom (#10) (2006)\nConfessor (#11) (2007)\n\nRichard and Kahlan\n\nThe Omen Machine (#1) (2011)\nThe Third Kingdom (#2) (2013)\n\nThe Legend of Magda Searus\n\nThe First Confessor (2012) (#1)\n\nSet centuries prior to the main Sword of Truth series, it tells the story of Magna Searus - the first Mother Confessor.\n\nAuthor:\n\nTerry Goodkind is a contemporary American writer and author of the best-selling epic fantasy series, The Sword of Truth, creator of the television show The Legend of the Seeker, and writer of the self-published epic, The First Confessor: The Legend of Magda Searus (a prequel and origin story of the first Mother Confessor).","torrent":{"xt":"urn:btih:8b8d4d713ba8369afd8a0517732c65d9397d7991","amp;dn":"Sword+of+Truth+Series+%281994-2013%29+Terry+Goodkind+%28multi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b8d4d713ba8369afd8a0517732c65d9397d7991","infoHashBuffer":{"type":"Buffer","data":[139,141,77,113,59,168,54,154,253,138,5,23,115,44,101,217,57,125,121,145]},"announce":[],"urlList":[]}}