{"title":"Particle Illusion 3 0","uid":3320668,"size":153827010,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8b9cdf817da24937f82912320b49f3e7ecb5e2c1&amp;dn=Particle+Illusion+3+0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"gurgel","files":1,"time":1114287275,"description":"particleIllusion has been used in countless television shows since it's release in 1998: animated shows like Max Steel and Roughneck Chronicles: Starship Troopers; sci-fi standbys Star Trek: Voyager and Star Trek: Enterprise; even shows that you don't think of as special effects showcases like (NBC soap opera) Passions, Sesame Street, and That 70's Show.\n\nYou can understand why particleIllusion is used in the sci-fi shows -- they are loaded with explosions, smoke, and other traditional particle effects. There are so many effects shots on some of those shows and production schedules are so tight that the effects houses involved look for the fastest and easiest way to get believable effects. particleIllusion works perfectly for many of the effects shots needed in these types of shows.\n\nSci-fi shows are one thing, but you might be wondering how a particle effects system is used in those other shows. Although it does great &amp;quot;traditional&amp;quot; particle effects such as smoke, fire, and explosions, particleIllusion is so versatile that it can do a HUGE variety of other effects as well. Sparkles are one obvious use (the title sequence for Sesame Street's Journey To Ernie segment uses particleIllusion-generated sparkles), but particleIllusion makes available an expansive library of &amp;quot;preset&amp;quot; artistic and stylized effects that can fill almost any creative need. For example, one of the stylized firework/explosion presets was used as a transition into a dream sequence in That 70's Show.\n\nThe extremely large (and always growing -- check the downloads page for a new emitter library each month) and diverse collection of preset effects is one of the reasons that particleIllusion is used in so many commercials as well. Small budgets, incredibly short production schedules, and frequent last-minute changes -- all are part of producing television commercials, whether local, regional, or national. Having access to a wide variety of preset effects takes some of the pressure off -- select a library emitter and drop it into the project, make a few adjustments (if desired) and you're done! Why buy expensive video &amp;quot;clip art&amp;quot; libraries when you can get similar results using particleIllusion?\n\nLast-second changes? Client waiting for the finished spot? With particleIllusion's realtime rendering, there is no waiting for results. You can see the effect of your changes immediately, allowing you to go through many iterations in the time you'd be waiting for other particle systems to render a single change. Get the exact look you want and keep your client happy -- even when he's standing over your shoulder &amp;quot;directing&amp;quot; all of your changes.\n\n\n\nhttp://www.wondertouch.com/","torrent":{"xt":"urn:btih:8b9cdf817da24937f82912320b49f3e7ecb5e2c1","amp;dn":"Particle+Illusion+3+0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b9cdf817da24937f82912320b49f3e7ecb5e2c1","infoHashBuffer":{"type":"Buffer","data":[139,156,223,129,125,162,73,55,248,41,18,50,11,73,243,231,236,181,226,193]},"announce":[],"urlList":[]}}