{"title":"Nigella Christmas: Food, Family, Friends, Festivities - Nigella","uid":11613375,"size":16079176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bcc1808a360a1a5f5b1e497e9ecea248a811647&amp;dn=Nigella+Christmas%3A+Food%2C+Family%2C+Friends%2C+Festivities+-+Nigella+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"MentalZero","files":-1,"time":1417484965,"description":"By popular demand - Nigella's book of Christmas. For years her fans have been asking when she would write a Christmas book... and here it is, a glorious, glittering festive treat.\n\nNigella Christmas comprises reliable, practical, easy-to-follow recipes and reassuring advice about planning and cooking ahead, presented in a gorgeous glittering package which will make this the ultimate gift to yourself and for family and friends.\n\nIllustrated with over 150 fabulous full-colour photographs by Lis Parsons (photographer of the bestselling Nigella Express), including method photos and lavish double-page 'spreads', Nigella Christmas is in a new, larger and irresistible format. It includes everything from scrumptious Christmas cakes and puddings, to quick and easy homemade presents (biscuits, preserves and other standbys) and edible tree-decorations, recipes for feeding friends and family over the holiday season with minimum stress and maximum enjoyment (cook and freeze ahead or slow-cook in the oven), as well as Christmas party food and drinks. And, of course, exciting and inspiring variations for the Main Event itself - from traditional super-juicy turkey, festive ginger-baked ham, special trimmings and the Ultimate Christmas Pud, all the way to the special vegetarian Christmas feast, by way of goose or pork-and-cranberry options and a Prodigious Pavlova...\n\nHer cakes, as always, gladden the heart, and her 'At-a-Glance Christmas Dinner Countdown' helps take the stress and strain out of the Big Day itself. Nigella Christmas will surely be a perennial favourite, the book we will all reach for - for inspiration and reassurance - as soon as the Christmas lights start going up....\n\nAbout the Author\n\nNigella Lawson is the author of bestselling books, How to Eat, How to Be a Domestic Goddess, Nigella Bites, Forever Summer, Feast and Nigella Express, which, together with her successful TV series - on BBC 2, Channel 4, as well as the American Food Network - have made hers a household name around the world. She is a contributor to the New York Times and lives in London with her family","torrent":{"xt":"urn:btih:8bcc1808a360a1a5f5b1e497e9ecea248a811647","amp;dn":"Nigella+Christmas%3A+Food%2C+Family%2C+Friends%2C+Festivities+-+Nigella+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bcc1808a360a1a5f5b1e497e9ecea248a811647","infoHashBuffer":{"type":"Buffer","data":[139,204,24,8,163,96,161,165,245,177,228,151,233,236,234,36,138,129,22,71]},"announce":[],"urlList":[]}}