{"title":"Damares  - Diamante  (2010)","uid":6533213,"size":551948938,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8bd8045c950563ab11b62c3b59d915f06d520b30&amp;dn=Damares++-+Diamante++%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"ViegasGiblin","files":30,"time":1310421567,"description":"Damares tem seu reconhecimento desde o ano 2004 quando lanÃƒÂ§ou o CD O Deus que Faz. Mas foi em 2008 que se tornou reconhecida nacionalmente com o CD Apocalipse, que se tornou fenÃƒÂ´meno de vendas, rendendo o disco de platina pela marca das 320 mil cÃƒÂ³pias vendidas. Hoje, Apocalipse jÃƒÂ¡ ultrapassou a marca de 1.000.000 de cÃƒÂ³pias comercializadas. A canÃƒÂ§ÃƒÂ£o &quot;Sabor de Mel&quot;, foi muito executada em rÃƒÂ¡dios e igrejas Brasil a fora.\n\nEm 2009, a Damares gravou um CD/DVD ao vivo na cidade de Curitiba, na casa de shows Curitiba Master Hall, onde cantou seus maiores sucessos. Tanto o CD quanto o DVD foram certificados com disco de ouro, pelas vendagens superiores a 50 mil cÃƒÂ³pias de cada.\n\nRecentemente, Damares participou do CD Promessas, da gravadora Som Livre, onde entraram duas de suas canÃƒÂ§ÃƒÂµes de bastante destaque, sendo elas: &quot;Sabor de Mel&quot; e &quot;Milagres&quot;.\n\nDesde o lanÃƒÂ§amento do CD Apocalipse, Damares possui uma extensa agenda por todo o paÃƒÂ­s e tambÃƒÂ©m em paÃƒÂ­ses onde canÃƒÂ§ÃƒÂµes como &quot;Sabor de Mel&quot; sÃƒÂ£o bastante executadas.\n\nEm 2010 deixou oficialmente, depois de quase 10 anos, sua antiga gravadora, a Louvor Eterno, passando a fazer parte do casting da Sony Music. Seu primeiro trabalho pela Sony, chama-se &quot;Diamante&quot;, foi lanÃƒÂ§ado no final de novembro e saiu de fÃƒÂ¡brica com mais de 80 mil cÃƒÂ³pias vendidas. Em menos de 1 mÃƒÂªs, o disco jÃƒÂ¡ vendeu 130 mil cÃƒÂ³pias. A canÃƒÂ§ÃƒÂ£o &quot;Um novo vencedor&quot;, ganhou os primeiros lugares em rÃƒÂ¡dios de todo o paÃƒÂ­s.\n\nDamares tambÃƒÂ©m representa a volta de grandes sucessos do gospel na Web, tendo suas canÃƒÂ§ÃƒÂµes com exibiÃƒÂ§ÃƒÂµes que ultrapassam a marca de 10 milhÃƒÂµes de acessos, dentre elas podendo destacar Sabor de mel que com apenas 1 vÃƒÂ­deo ultrapassou a marca de mais de 5 milhÃƒÂµes de exibiÃƒÂ§ÃƒÂµes e Apocalipse que com apenas 2 vÃƒÂ­deos ultrapassa a marca de mais de 6 milhÃƒÂµes de visualizaÃƒÂ§ÃƒÂµes. O single &quot;Um novo vencedor&quot; de seu trabalho &quot;Diamante&quot; pela Sony Music foi sucesso absoluto na web tendo seus vÃƒÂ­deos ultrapassado 4oo mil acessos em pouco mais de 1 mÃƒÂªs.\n\nDamares foi classificada pelo Gospel Channel em 2008 como uma das maiores cantoras pentecostais do Brasil. Ela foi a grande responsÃƒÂ¡vel por colocar a mÃƒÂºsica pentecostal no topo depois de 3 anos em decadÃƒÂªncia.\n\nMÃƒÂºsicas\n 01 Diamante\n 02 Derrepente\n 03 Um novo vencedor\n 04 GlÃƒÂ³ria\n 05 Fim do mundo\n 06 Sacrificio e adoraÃƒÂ§ÃƒÂ£o\n 07 Na mesa do rei\n 08 Derrama ShekinÃƒÂ¡h (Part. LÃƒÂ¡zaro)\n 09 Quem viver verÃƒÂ¡\n 10 AdoraÃƒÂ§ÃƒÂ£o sem fim\n 11 AÃƒÂ§ÃƒÂ£o de Deus\n 12 Precisidade\n 13 O Brasil ÃƒÂ© do Senhor\n 14 Consolador\n\n","torrent":{"xt":"urn:btih:8bd8045c950563ab11b62c3b59d915f06d520b30","amp;dn":"Damares++-+Diamante++%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bd8045c950563ab11b62c3b59d915f06d520b30","infoHashBuffer":{"type":"Buffer","data":[139,216,4,92,149,5,99,171,17,182,44,59,89,217,21,240,109,82,11,48]},"announce":[],"urlList":[]}}