{"title":"Offensive Security PWK  v1.0.1 (2014) PDF","uid":11580689,"size":18815615,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bfe7543670823e9f73bf91b3f54d281ca5a3d37&amp;dn=Offensive+Security+PWK++v1.0.1+%282014%29+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":null,"files":1,"time":1417123829,"description":"\n\n\nOffensive Security Penetration Testing with Kali Linux \n\n\nPublished: 2014\n\n\nDescription:\n\n\nPenetration Testing with Kali Linux (PWK) is an online training course designed for network administrators and security professionals who need to acquaint themselves with the world of offensive information security. This penetration testing training introduces the latest hacking tools and techniques in the field and includes remote virtual penetration testing labs for practicing the course materials. Penetration Testing with Kali Linux attempts to simulate a full penetration test, from start to finish, by injecting the student into a rich, diverse, and vulnerable network environment.\n\nPenetration Testing with Kali Linux is an entry-level course but still requires students to have certain knowledge prior to attending the class. A solid understanding of TCP/IP, networking, and reasonable Linux skills are required. This course is not for the faint of heart; it requires practice, testing, and the ability to want to learn in a manner that will grow your career in the information security field and defeat any learning plateau. Offensive Security challenges you to rise above the rest, dive into the fine arts of advanced penetration testing, and to Try Harder.\n\n\nContents:\n\n1. Lab guide/PDF only","torrent":{"xt":"urn:btih:8bfe7543670823e9f73bf91b3f54d281ca5a3d37","amp;dn":"Offensive+Security+PWK++v1.0.1+%282014%29+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bfe7543670823e9f73bf91b3f54d281ca5a3d37","infoHashBuffer":{"type":"Buffer","data":[139,254,117,67,103,8,35,233,247,59,249,27,63,84,210,129,202,90,61,55]},"announce":[],"urlList":[]}}