{"title":"Ottoman Empire eBooks Collection ","uid":10567952,"size":1789249455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c5136faef8fc5383ba81261cad1bd390f210e64&amp;dn=Ottoman+Empire+eBooks+Collection+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"sidmal","files":-1,"time":1405550190,"description":"Ottoman Empire eBooks Collection (Repost)\n English | 169 PDF | Large Books Collection | 1.66 GB\nGenre: History\n\n The Ottoman Empire was an empire which lasted from 27 July 1299 to 1 November 1922 (623 years), when the Sultanate was abolished. The Ottoman Empire was one of the lasting empires in history; such that the Ottoman State, its politics, conflicts, and cultural heritage in a vast geography provide one of the longest continuous narratives. During the 16th and 17th centuries, in particular at the height of its power under the reign of Suleiman the Magnificent, the empire was one of the most powerful states in the world ? a multinational, multilingual empire that stretched from the southern borders of the Holy Roman Empire to the outskirts of Vienna, Royal Hungary (modern Slovakia) and the Polish?Lithuanian Commonwealth in the north to Yemen and Eritrea in the south; from Algeria in the west to Azerbaijan in the east; controlling much of southeast Europe, Western Asia and North Africa. At the beginning of the 17th century the empire contained 32 provinces and numerous vassal states, some of which were later absorbed into the empire, while others were granted various types of autonomy during the course of centuries. With Constantinople as its capital and vast control of lands around the Mediterranean basin, the empire was at the center of interactions between the Eastern and Western worlds for over six centuries.\n\n A PDF collection of 169 eBooks about the Ottoman Empire. eBooks are sorted on publisher's name.\n\n\nComplete List of Ebooks Included\nABC-CLIO A Military History of the Ottomans, From Osman to Ataturk (2009).pdf\n Academica Press A Study of Ottoman Narratives on Architecture, Text Context and Hermeneutics (2010) (Scan, OCR).pdf\n Basic Books The Enemy at the Gate, Habsburgs Ottomans and the Battle for Europe (2008).pdf\n Brill Publishing An Ottoman Mentality, The World of Evliya Celebi (2006).pdf\n Brill Publishing Barbary Corsairs, The End of a Legend 1800-1820 (2005).pdf\n Brill Publishing Christianity Under Islam in Jerusalem, The Question of the Holy Sites in Early Ottoman Times (2001).pdf\n Brill Publishing Conversion to Islam in the Balkans, Kisve Bahasi Petitions and Ottoman Social Life 1670-1730 (2004).pdf\n Brill Publishing Empire Islam and Politics of Difference, Ottoman Rule in Yemen 1849-1919 (2011).pdf\n Brill Publishing Forging Urban Solidarities, Ottoman Aleppo 1640-1700 (2010).pdf\n Brill Publishing Guild Dynamics in 17th-Century Istanbul, Fluidity and Leverage (2004).pdf\n Brill Publishing Living in the Ottoman Ecumenical Community, Essays in Honour of Suraiya Faroqhi (2008).pdf\n Brill Publishing Local Court Provincial Society and Justice in the Ottoman Empire, Legal Practice and Dispute Resolution in Cankiri and Kastamonu 1652-1744 (2003).pdf\n Brill Publishing Nomads Migrants and Cotton in the Eastern Mediterranean, The Making of the Adana-Mersin Region 1850-1908 (2010).pdf\n Brill Publishing Ransom Slavery along the Ottoman Borders (2007).pdf\n Brill Publishing Society and Politics in an Ottoman Town, Ayntab in the 17th Century (2007).pdf\n Brill Publishing Studies in Ataturk's Turkey, The American Dimension (2009).pdf\n Brill Publishing Taste of Modernity, Sufism Salafiyya and Arabism in Late Ottoman Damascus (2001).pdf\n Brill Publishing The Capitulations and the Ottoman Legal System, Qadis Consuls and Beraths in the 18th Century (2005).pdf\n Brill Publishing The Crimean Khanate and Poland-Lithuania, International Diplomacy on the European Periphery 15th-18th Century (2011).pdf\n Brill Publishing The Guilds of Ottoman Jerusalem (2001).pdf\n Brill Publishing The Image of an Ottoman City, Imperial Architecture and Urban Experience in Aleppo in the 16th and 17th Centuries (2004).pdf\n Brill Publishing The Ottoman Crimean War 1853-1856 (2010) (no OCR).pdf\n Brill Publishing The Ottomans and the Balkans, A Discussion of Historiography (2002).pdf\n Brill Publishing The Sons of Bayezid, Empire Building and Representation in the Ottoman Civil War of 1402-1413 (2007).pdf\n Brill Publishing Tocqueville in the Ottoman Empire, Rival Paths to the Modern State (2004).pdf\n Cambria Press Assyrians Kurds and Ottomans, Intercommunal Relations on the Periphery of the Ottoman Empire (2008) (Scan, OCR).pdf\n Cambridge University Press A Monetary History of the Ottoman Empire (2000).pdf\n Cambridge University Press A Social History of Ottoman Istanbul (2010).pdf\n Cambridge University Press An Economic and Social History of the Ottoman Empire Vol. 1, 1300-1600 (1994) (no OCR).pdf\n Cambridge University Press Approaching Ottoman History, An Introduction to the Sources (1999).pdf\n Cambridge University Press Catholics and Sultans, The Church and the Ottoman Empire 1453-1923 (1983).pdf\n Cambridge University Press Christians and Jews in the Ottoman Arab World, The Roots of Sectarianism (2001).pdf\n Cambridge University Press Cumans and Tatars, Oriental Military in the Pre-Ottoman Balkans 1185-1365 (2005).pdf\n Cambridge University Press Economic Life in Ottoman Jerusalem (1989).pdf\n Cambridge University Press Empire of Difference, The Ottomans in Comparative Perspective (2008).pdf\n Cambridge University Press History of Turkey Vol. 3, The Later Ottoman Empire 1603-1839 (2006).pdf\n Cambridge University Press History of the Ottoman Empire and Modern Turkey Vol. 1, Empire of the Gazis (1976).pdf\n Cambridge University Press History of the Ottoman Empire and Modern Turkey Vol. 2, Reform Revolution and Republic (1977).pdf\n Cambridge University Press Legal Imperialism, Sovereignty and Extraterritoriality in Japan the Ottoman Empire and China (2010).pdf\n Cambridge University Press Nature and Empire in Ottoman Egypt, An Environmental History (2011).pdf\n Cambridge University Press Studies in Old Ottoman Criminal Law (1973).pdf\n Cambridge University Press The Climate of Rebellion in the Early Modern Ottoman Empire (2011).pdf\n Cambridge University Press The Ottoman Empire 1700-1922 2nd (2005).pdf\n Cambridge University Press The Ottoman Empire and Early Modern Europe (2004).pdf\n Cambridge University Press The Ottoman Road to War in 1914, The Ottoman Empire and the First World War (2008).pdf\n Cambridge University Press The Politics of Households in Ottoman Egypt, The Rise of the Qazdaglis (1997).pdf\n Cambridge University Press The Shiites of Lebanon under Ottoman Rule 1516-1788 (2010).pdf\n Cambridge University Press Theodore Spandounes, On the Origin of the Ottoman Emperors (1997) (no OCR).pdf\n Cambridge University Press Women and Slavery in the Late Ottoman Empire, The Design of Difference (2010).pdf\n Central European University Press Balkan Family Structure and the European Pattern, Demographic Developments in Ottoman Bulgaria 2nd (2006).pdf\n Crete University Press The Ottoman Emirate 1300-1389 (1993).pdf\n Facts On File Encyclopedia of the Ottoman Empire (2009).pdf\n Frank Cass Publishers The Great Powers and the End of the Ottoman Empire (2005).pdf\n Greenwood Press Daily Life in the Ottoman Empire (2011).pdf\n Greenwood Press Ordered to Die, A History of the Ottoman Army in the First World War (2001).pdf\n Greenwood Press The Ottoman Empire (2008).pdf\n Greenwood Publishing Defeat in Detail, The Ottoman Army in the Balkans 1912-1913 (2003).pdf\n Harvard University Press The Berlin-Baghdad Express, The Ottoman Empire and Germany's Bid for World Power (2010).pdf\n Henry Holt Publishing A Peace to End All Peace, The Fall of the Ottoman Empire and the Creation of the Middle East (1989).pdf\n I.B. Tauris Publishers Among the Ottomans, Diaries from Turkey in World War I (2011).pdf\n I.B. Tauris Publishers Artisans of Empire, Crafts and Craftspeople Under the Ottomans (2009).pdf\n I.B. Tauris Publishers Cities of the Mediterranean, From the Ottomans to the Present Day (2010).pdf\n I.B. Tauris Publishers Frontiers of Ottoman Studies, State Province and the West Vol. 1 (2005).pdf\n I.B. Tauris Publishers Governing Property Making the Modern State, Law Administration and Production in Ottoman Syria (2007).pdf\n I.B. Tauris Publishers Guarding the Frontier, Ottoman Border Forts and Garrisons in Europe (2007).pdf\n I.B. Tauris Publishers Innovation and Empire in Turkey, Sultan Selim III and the Modernisation of the Ottoman Navy (2008).pdf\n I.B. Tauris Publishers Jerusalem, From the Ottomans to the British (2009).pdf\n I.B. Tauris Publishers Lightning over Yemen, A History of the Ottoman Campaign 1569-71 (2002).pdf\n I.B. Tauris Publishers Ottoman Haifa, A History of Four Centuries under Turkish Rule (2011).pdf\n I.B. Tauris Publishers Ottoman Propaganda and Turkish Identity, Literature in Turkey during World War I (2007).pdf\n I.B. Tauris Publishers Ottoman Reform and Muslim Regeneration, Studies in Honour of Butrus Abu-Manneh (2005).pdf\n I.B. Tauris Publishers Ottoman Tulips Ottoman Coffee, Leisure and Lifestyle in the 18th Century (2007).pdf\n I.B. Tauris Publishers Ottomania, The Romantics and the Myth of the Islamic Orient (2010).pdf\n I.B. Tauris Publishers Ottomans Looking West, The Origins of the Tulip Age and its Development in Modern Turkey (2008).pdf","torrent":{"xt":"urn:btih:8c5136faef8fc5383ba81261cad1bd390f210e64","amp;dn":"Ottoman+Empire+eBooks+Collection+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c5136faef8fc5383ba81261cad1bd390f210e64","infoHashBuffer":{"type":"Buffer","data":[140,81,54,250,239,143,197,56,59,168,18,97,202,209,189,57,15,33,14,100]},"announce":[],"urlList":[]}}