{"title":"John Saul-Black Creek Crossing  -Second Child [Epub]","uid":15908441,"size":2887678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ccfde34d900341c39f545a39586d978630f8d59&amp;dn=John+Saul-Black+Creek+Crossing++-Second+Child+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"twocows","files":5,"time":1475076027,"description":"John Saul-Black Creek Crossing\r\nHorror\r\n\r\nThe dark history and dire secrets of a peaceful small town are summoned from the shadows of the past. Unholy forces are stirred from long slumber to monstrous new life. And two young misfits discover the chilling art of turning persecution into retribution. With these eerie ingredients, bestselling master John Saul once again works his unique brand of sinister magic to conjure an unforgettable tale of unspeakable terror.\r\n\r\nFor most of her young life, thirteen-year-old Angel Sullivan has been on the outside looking in, enduring the taunts of cruel schoolmates and the angry abuse of a bitter father. Then Angel's family moves to the quaint town of Roundtree, Massachusetts--where a charming home is available, a promising job awaits Angel's unemployed father, and most of all, the chance to make a new start beckons to the shy, hopeful teenager. But when she is shunned by her new classmates, Angel falls deeper into despair. Until she meets Seth Baker, a fellow outcast--and a fateful kinship is forged.\r\n\r\n\r\nSecond Child\r\nby John Saul\r\n\r\n\r\n\r\nOne hundred years ago, in the beautiful village of Secret Cove, Maine, on the night of the annual August Moon Ball, a shy and lovely servant girl committed an act so unspeakably violent that its legacy still lives. Now, the blood-drenched past of this small town is about to come to life once more--just in time for this year's August Moon Ball","torrent":{"xt":"urn:btih:8ccfde34d900341c39f545a39586d978630f8d59","amp;dn":"John+Saul-Black+Creek+Crossing++-Second+Child+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ccfde34d900341c39f545a39586d978630f8d59","infoHashBuffer":{"type":"Buffer","data":[140,207,222,52,217,0,52,28,57,245,69,163,149,134,217,120,99,15,141,89]},"announce":[],"urlList":[]}}