{"title":"Guitar Lesson - Warren Haynes - Electric Blues and Slide Guitar","uid":5452654,"size":2926608431,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8cf97b94783af81d87739d14f12e7a03a0dee777&amp;dn=Guitar+Lesson+-+Warren+Haynes+-+Electric+Blues+and+Slide+Guitar+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"lorknozzel","files":2,"time":1269236834,"description":"# Format: Closed-captioned, Color, DVD, NTSC, Subtitled\n# Language: English\n# Subtitles: French, German, Italian, Spanish\n# Region: Region Free\n# Aspect Ratio: 1.33:1\n# Number of discs: 1\n# Studio: Hot Licks\n# DVD Release Date: November 15, 2005\n# Run Time: 88 minutes\n\n\n\nThey must have mastered this dvd from the vhs version because the quality is about that of a vhs video capture. That said, it's good enough for a guitar lesson and the audio quality is better than the vhs version.\n\nOne thing I liked about this dvd is the option to see the exercises at half speed but at normal pitch. It's the first dvd I've used with that feature and it's nice for the first couple attempts at hard licks.\n\nBecause the original wasn't that sharp, I sharpened it slightly and recompressed the video. The video quality is slightly better than the original and the dvd is 1gb smaller :)\n\nAbout Warren Haynes - Electric Blues and Slide Guitar\nWarren Haynes, of the Allman Brothers Band, has also enjoyed an outstanding solo career as a bluesman. On this great DVD he covers a wide range of blues and slide skills and techniques, including phrasing, vibrato, string bending, and soloing as well as mixing major and minor scales, using space, and looking for blue notes within intervals. An intense and rewarding blues lesson guaranteed to improve your playing! Includes a new introduction by Jeff Golub. Jeff began his career as guitarist for rocker Billy Squier. He has recorded numerous solo CDs and is a highly valued session player and sideman, having worked with such artists as Peter Wolf, John Waite, Tina Turner, Vanessa Williams, and Rod Stewart. You'll never miss a note! You see the music and the tablature on screen as it's being played! All right- and left-hand techniques are shown in close up and with helpful split-screen effects to make learning easy. Also includes: Artist biography, selected discography, suggested listening, and more.\n\n1 hour, 28 minutes. Language: English - Subtitles and menus for French, German, Italian, Spanish.","torrent":{"xt":"urn:btih:8cf97b94783af81d87739d14f12e7a03a0dee777","amp;dn":"Guitar+Lesson+-+Warren+Haynes+-+Electric+Blues+and+Slide+Guitar+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cf97b94783af81d87739d14f12e7a03a0dee777","infoHashBuffer":{"type":"Buffer","data":[140,249,123,148,120,58,248,29,135,115,157,20,241,46,122,3,160,222,231,119]},"announce":[],"urlList":[]}}