{"title":"Edraw Soft Edraw Max 6.5.3.2114 + patch-AoReTeam","uid":7442760,"size":45242101,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8d5109b10144f230fd3736c67b8f2514ba49b00f&amp;dn=Edraw+Soft+Edraw+Max+6.5.3.2114+%2B+patch-AoReTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"mrriser007","files":-1,"time":1342275195,"description":"Edraw Max enables students, teachers and business professionals to reliably create and publish kinds of diagrams to represent any ideas. It's an all-in-one graphics software that makes it simple to create professional-looking flowcharts, organizational charts, network diagrams, business presentations, building plans, mind maps, fashion designs, UML diagrams, workflows, program structures, web design diagrams, electrical engineering diagrams, directional maps, database diagrams and more. With large pre-drawn libraries and more than 4600 vector symbols, drawing couldn't be easier! Edraw Max lets you create a wide range of diagrams using templates, shapes, and drawing tools while working in an intuitive and familiar Office-style environment.\n\nEDraw Max is a vector-based diagramming application with rich examples and templates. Easy to create flow charts, organizational charts, business process, UML diagrams, work flows, program structures, network diagrams, chart and graphics, mind map, directional maps and database diagrams.\n\nWith pre-drawn libraries and more than 2000 vector symbols, drawing couldn't be easier! EDraw Max includes all the libraries and examples of EDraw product line.\n\nEDraw Max is a new, rapid and powerful graphic design software, novel, small and exquisite, who works in the following fields:\nÂ· Flow Charts\nÂ· Organizational Charts\nÂ· Work Flows\nÂ· Software\nÂ· UML Diagrams\nÂ· Network Diagrams\nÂ· Business Process\nÂ· Charts &amp; Graphics\nÂ· Directional Map\nÂ· Database Diagrams etc.","torrent":{"xt":"urn:btih:8d5109b10144f230fd3736c67b8f2514ba49b00f","amp;dn":"Edraw+Soft+Edraw+Max+6.5.3.2114+%2B+patch-AoReTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d5109b10144f230fd3736c67b8f2514ba49b00f","infoHashBuffer":{"type":"Buffer","data":[141,81,9,177,1,68,242,48,253,55,54,198,123,143,37,20,186,73,176,15]},"announce":[],"urlList":[]}}