{"title":"Our Mathematical Universe: My Quest... (2014) Max Tegmark (multi","uid":9505915,"size":79619790,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d55795920b9cb5fb9b8d9156dc2cfcbac775157&amp;dn=Our+Mathematical+Universe%3A+My+Quest...+%282014%29+Max+Tegmark+%28multi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"7","files":-1,"time":1390317536,"description":"Our Mathematical Universe: My Quest for the Ultimate Nature of Reality (2014) Max Tegmark (multi)\n\n\nOur Mathematical Universe: My Quest for the Ultimate Nature of Reality\nby Max Tegmark\n\n\nFormat: mobi/epub/azw3\nLength: 432 pages\nGenre: Non-Fiction/Science\nDate: 7 January 2014\n\nHow large is reality? What is everything made of? Why is our universe the way it is?\n\nOur Mathematical Universe boldly confronts one of the deepest questions at the fertile interface of physics and philosophy: why is mathematics so spectacularly successful at describing the cosmos?\n\nThrough lively writing and wonderfully accessible explanations, Max Tegmark-one of the world's leading theoretical physicists - guides the reader to a possible answer, and reveals how, if it's right, our understanding of reality itself would be radically altered.\n\nOur Mathematical Universe is a journey to explore the mysteries uncovered by cosmology and to discover the nature of reality. Our Big Bang, our distant future, parallel worlds, the sub-atomic and intergalactic - none of them are what they seem. But there is a way to understand this immense strangeness - mathematics. Seeking an answer to the fundamental puzzle of why our universe seems so mathematical, Tegmark proposes a radical idea: that our physical world not only is described by mathematics, but that it is mathematics. This may offer answers to our deepest questions:\n\nAuthor:\n\nMax Tegmark is author or co-author of more than 200 technical papers, twelve of which have been cited more than 500 times. He has featured in dozens of science documentaries, and his work with the SDSS collaboration on galaxy clustering shared the first prize in Science magazine's &quot;Breakthrough of the Year: 2003&quot;. He holds a Ph.D from the University of California, Berkeley, and is a physics professor at MIT. ","torrent":{"xt":"urn:btih:8d55795920b9cb5fb9b8d9156dc2cfcbac775157","amp;dn":"Our+Mathematical+Universe%3A+My+Quest...+%282014%29+Max+Tegmark+%28multi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d55795920b9cb5fb9b8d9156dc2cfcbac775157","infoHashBuffer":{"type":"Buffer","data":[141,85,121,89,32,185,203,95,185,184,217,21,109,194,207,203,172,119,81,87]},"announce":[],"urlList":[]}}