{"title":"The Witcher: Enhanced Edition GOG","uid":8360835,"size":13089946635,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8d72b79e3ab92882b5e17262bdb9de280f501d37&amp;dn=+The+Witcher%3A+Enhanced+Edition+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":7,"uploader":"AN0NYMOUS142857","files":-1,"time":1365618952,"description":"    genre    rpg / action / fantasy\n    download size    8.5 GB\n    release date    October 26, 2007\n    compatible with    Windows (XP, Vista, 7, 8)\n    languages    Audio: English, French, Italian, German, Spanish, Czech, Hungarian, Polish, Russian. Text: Chinese\n    developer / publisher    CD Projekt RED / CD Projekt\n    game modes    single-player\n\n    Bonus content included:\n    manual\n    18 wallpapers\n    game guide\n    2 maps\n    music inspired by The Witcher\n    soundtrack\n    7 behind the scenes\n    5 creator interviews (Atari)\n    9 creator interviews (CD Projekt RED)\n    music video\n    26 avatars\n    artbook\n    The Witcher calendar\n    The Witcher story\n\n    Arguably one of the best RPGs ever made, with a mature, non-linear story and a challenging combat system\n    Beautiful graphics and an enchanting soundtrack create a very unique dark fantasy atmosphere\n    The Witcher's universe is created by Andrzej Sapkowski - bestselling fantasy author\n\nOverview:\n\nYour name is Geralt of Rivia and you are a witcher, that means you kill monsters for a living. You were given special training to be the best at what you do and your body has been enhanced with potent elixirs to help you do it.\n\nSuffering from amnesia you remember nothing of your past. Kaer Morhen, the last remaining keep of the witchers, was attacked by a mysterious organization, just as you were starting to lick your wounds there. The battle is won but the secret recipe for the mutagen, a substance required to create more of your kind, has been stolen. The surviving witchers set out to find and reclaim it and punish everyone involved. Memory loss or not, you are one of them.\n\nSet in a dark fantasy world with a unique medieval, yet somewhat modern, feel to it, The Witcher isn't just another fantasy RPG. With a deep story, complex characters, and tough choices that actually matter, this game will keep you glued to your monitor for days.\n\nAge requirements: ESRB Rating: MATURE with Violence, Strong Sexual Content, Strong Language, Nudity, Blood and Gore. PEGI Rating: 18+ with Violence, Bad Language.\n\nMinimum system requirements: Windows XP, Intel Pentium 4 2.4GHz or AMD Athlon 64 +2800, 1 GB RAM for Windows XP, 1.5 GB for Vista, NVIDIA GeForce 6600 or ATI Radeon 9800 or better, 8.5 GB available hard drive space, DirectX 9.0c compliant soundcard\nMinimum system requirements (Mac): OS X 10.6.8 or later. Processor: Intel Core Duo 2GHz+ Memory: 2GB of RAM Graphics: nVidia GeForce 320M (or better), AMD Radeon HD 6750M (or better) or Intel HD Graphics 3000, Recommended two-button mouse, or Apple mouse with Secondary Button / Secondary Click enabled.\n\nInstall and Play.","torrent":{"xt":"urn:btih:8d72b79e3ab92882b5e17262bdb9de280f501d37","amp;dn":"+The+Witcher%3A+Enhanced+Edition+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d72b79e3ab92882b5e17262bdb9de280f501d37","infoHashBuffer":{"type":"Buffer","data":[141,114,183,158,58,185,40,130,181,225,114,98,189,185,222,40,15,80,29,55]},"announce":[],"urlList":[]}}