{"title":"Second World War Infantry Tactics: The European Theatre","uid":15752537,"size":10733674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8edf6f40b34d1a4396a102ca34cfbd578df2431e&amp;dn=Second+World+War+Infantry+Tactics%3A+The+European+Theatre&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"marty14","files":1,"time":1473038529,"description":"Second World War Infantry Tactics: The European Theatre - Stephen Bull [epub]\r\n\r\nThe 'poor bloody infantry' do the dirty front-line work of war. It bears the brunt of the fighting and often suffers disproportionately in combat in comparison with the other armed forces. Yet the history of infantry tactics is too rarely studied and often misunderstood.\r\n\r\nStephen Bull, in this in-depth account, concentrates on the fighting methods of the infantry of the Second World War. He focuses on the infantry theory and the combat experience of the British, German, American and Soviet armies. His close analysis of the rules of engagement, the tactical manuals, the training and equipment is balanced by vivid descriptions of the tactics as they were tested in action. These operational examples show how infantry tactics on all sides developed as the war progressed, and they give a telling insight into the realities of infantry warfare. This accessible and wide-ranging survey is a fascinating introduction to the fighting methods of the opposing ground forces as they confronted each other on the European battlefields of 70 years ago","torrent":{"xt":"urn:btih:8edf6f40b34d1a4396a102ca34cfbd578df2431e","amp;dn":"Second+World+War+Infantry+Tactics%3A+The+European+Theatre","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8edf6f40b34d1a4396a102ca34cfbd578df2431e","infoHashBuffer":{"type":"Buffer","data":[142,223,111,64,179,77,26,67,150,161,2,202,52,207,189,87,141,242,67,30]},"announce":[],"urlList":[]}}