{"title":"FotoMagico with SN v. 4.4.2 ","uid":8362098,"size":110162490,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8f583430fec597044c458ec41e198b7f03daf953&amp;dn=FotoMagico+with+SN+v.+4.4.2+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"polisdavid","files":-1,"time":1365658294,"description":"Official Web Site: &lt;a href=&quot; http://boinx.com/fotomagico&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://boinx.com/fotomagico&lt;/a&gt;\n\nSerial courtesy of Special [K] and edited by 1 digit by TOBW for version 4.2.2. And there is also a serial in Serial Box that also might work for additional licenses if needed.\n\nFotoMagico lets you create professional slideshows from your photos and music with just a few, simple mouse clicks. It sports a very clean and intuitive yet powerful user interface. High image quality, fast performance, and user flexibility were some of the design goals for this application.\n\nCreate the most spectacular slideshows:\n\n* Scale, move, rotate, zoom or pan around your images to highlight that \n  part that matters the most.\n\n* Your slides fit together perfectly with the new, gorgeous transitions.\n\n* Provide more meaning with subtle titles here and there.\n\nPerform a breathtaking show:\n\n* Your slideshow uses the best possible resolution of your presentation \n  device.\n\n* Use large displays, HDTV screens and other high resolution devices.\n\n* Even on a VGA projector, your photos will look better with \n  FotoMagico.\n\nYour audience will want to take it home:\n\n* Burn DVDs of your slideshow with iDVD or Roxio Toast.\n\n* Put your slideshow on the new iPod.\n\n* Export in almost any QuickTime format.\n\nYour audience will never fall asleep again.\n\nWhat's New:\n\n* Fixed a big memory leak when changing the selection in the \n  Storyboard. This memory leaked caused version 4.2.1 to quickly \n  become unusable.\n\n* When a movie is too short for a long slide, FotoMagico no no longer \n  automatically changes the slide duration. Instead it visualizes the \n  problem, displays an alert icon and offers an explanation and solutions \n  in the popover that appears when clicking on the alert icon.\n\n* The about box is now a regular window with a close box, as opposed \n  to a modal window that can only be closed by clicking inside the \n  window.\n\n* The file format has been updated to be more efficient with external \n  media files in the OS X sandbox environment.\n\n* Quick Save used to be broken after the user canceled closing a \n  document. It now works again.\n\n* Make sure that the Stage gets redrawn when everything is deselected\n   in the Storyboard.\n\n* Fixed a couple of exceptions that could cause inconsistent states in the \n  application.\n\n* Various small fixes.\n\nSystem Requirements:\n\nIntel Mac, OS X.7.4 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:8f583430fec597044c458ec41e198b7f03daf953","amp;dn":"FotoMagico+with+SN+v.+4.4.2+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f583430fec597044c458ec41e198b7f03daf953","infoHashBuffer":{"type":"Buffer","data":[143,88,52,48,254,197,151,4,76,69,142,196,30,25,139,127,3,218,249,83]},"announce":[],"urlList":[]}}