{"title":"Mind Hacks - Tips &amp; Tools For Using Your Brain.epub Gooner","uid":9619682,"size":3825306,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fa3a8fa2a7e9358cea9589ca220b0e6df16962b&amp;dn=Mind+Hacks+-+Tips+%26amp%3B+Tools+For+Using+Your+Brain.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1392482400,"description":"Mind Hacks: Tips &amp; Tools for Using Your Brain - Tom Stafford, Matt Webb\n\n\nThe brain is a fearsomely complex information-processing environment--one that often eludes our ability to understand it. At any given time, the brain is collecting, filtering, and analyzing information and, in response, performing countless intricate processes, some of which are automatic, some voluntary, some conscious, and some unconscious.\n\nCognitive neuroscience is one of the ways we have to understand the workings of our minds. It's the study of the brain biology behind our mental functions: a collection of methods--like brain scanning and computational modeling--combined with a way of looking at psychological phenomena and discovering where, why, and how the brain makes them happen.\n\n\nWant to know more? Mind Hacks is a collection of probes into the moment-by-moment works of the brain. Using cognitive neuroscience, these experiments, tricks, and tips related to vision, motor skills, attention, cognition, subliminal perception, and more throw light on how the human brain works. Each hack examines specific operations of the brain. By seeing how the brain responds, we pick up clues about the architecture and design of the brain, learning a little bit more about how the brain is put together.\n\nMind Hacks begins your exploration of the mind with a look inside the brain itself, using hacks such as &quot;Transcranial Magnetic Stimulation: Turn On and Off Bits of the Brain&quot; and &quot;Tour the Cortex and the Four Lobes.&quot; Also among the 100 hacks in this book, you'll find:\n* Release Eye Fixations for Faster Reactions \n* See Movement When All is Still \n* Feel the Presence and Loss of Attention \n* Detect Sounds on the Margins of Certainty \n* Mold Your Body Schema \n* Test Your Handedness \n* See a Person in Moving Lights \n* Make Events Understandable as Cause-and-Effect \n* Boost Memory by Using Context \n* Understand Detail and the Limits of Attention\nSteven Johnson, author of &quot;Mind Wide Open&quot; writes in his foreword to the book, &quot;These hacks amaze because they reveal the brain's hidden logic; they shed light on the cheats and shortcuts and latent assumptions our brains make about the world.&quot; If you want to know more about what's going on in your head, then Mind Hacks is the key--let yourself play with the interface between you and the world.","torrent":{"xt":"urn:btih:8fa3a8fa2a7e9358cea9589ca220b0e6df16962b","amp;dn":"Mind+Hacks+-+Tips+%26amp%3B+Tools+For+Using+Your+Brain.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fa3a8fa2a7e9358cea9589ca220b0e6df16962b","infoHashBuffer":{"type":"Buffer","data":[143,163,168,250,42,126,147,88,206,169,88,156,162,32,176,230,223,22,150,43]},"announce":[],"urlList":[]}}