{"title":"Danielle Steel Romance Collection 1977-2013 (multi)","uid":9506210,"size":158817767,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fc83d5a4844ca29964afdf3f83595598df89528&amp;dn=Danielle+Steel+Romance+Collection+1977-2013+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":3,"uploader":"7","files":-1,"time":1390321071,"description":"Danielle Steel Romance Collection 1977-2013\n\n\nFormat: mobi/epub/azw3\nGenre: Romance\nDate: 1977-2013\n\nDanielle Steel is an American novelist, currently the bestselling author alive and the fourth bestselling author of all time, with over 800 million copies sold.\n\nBased in California for most of her career, Steel has produced several books a year, often juggling up to five projects at once. All her novels have been bestsellers, including those issued in hardback. Her formula is fairly consistent, often involving rich families facing a crisis, threatened by dark elements such as jail, fraud, blackmail and suicide. Steel has also published children's fiction and poetry, as well as raising funds for the treatment of mental illness. Her books have been translated into 28 languages, with 22 adapted for television, including two that have received Golden Globe nominations.\n\nPassion's Promise (1977)\n\nSmart, beautiful, and very rich, Kezia Saint Martin leads two lives: one as a glamorous socialite jetting between the poshest places in Europe and America; the other, under a false name, as a dicated journalist committed to justice and her profession.\n\nBut the two worlds are pulling her apart, leaving her conflicted about her identity and the lies she tells to every man she meets. Then she meets Lucas Johns, a bold, dynamic crusader for social change--and an ex-con. Their attraction is immediate, but their love may be just one step from tragedy at any time.\n\nThe Promise (1978)\n\nYoung architect Micheal Hillyard and artist Nancy McAllister are determined to get married despite his wealthy mother's disapproval. Then minutes before their wedding, a terrifying accident and a cruel deception separate Micheal and Nancy--perhaps forever. Each pursues a new life--Nancy in California, Micheal in New York. But eventually nothing--and no one--can keep them apart as they keep their vow never to say good-bye.\n\nNow and Forever (1979)\nSeason of Passion (1979)\nSummer's End (1979)\nTo Love Again (1980)\nThe Ring (1980)\nLoving (1980)\nPalomino (1981)\nRemembrance (1981)\nA Perfect Stranger (1982)\nCrossings (1982)\nOnce in A Lifetime (1983)\nThurston House (1983)\nChanges (1983)\nFull Circle (1984)\nFamily Album (1985)\nSecrets (1985)\nWanderlust (1986)\nFine Things (1987)\nKaleidoscope (1987)\nZoya (1988)\nDaddy (1989)\nStar (1989)\nMessage From Nam (1990)\nNo Greater Love (1991)\nHeartbeat (1991)\nJewels (1992)\nMixed Blessings (1992)\nVanished (1993)\nWings (1994)\nAccident (1994)\nThe Gift (1994)\nLightning (1995)\nFive Days in Paris (1995)\nMalice (1996)\nSilent Honor (1996)\nThe Ghost (1997)\nSpecial Delivery (1997)\nThe Ranch (1997)\nThe Wedding (1998)\nThe Klone and I (1998)\nThe Long Road Home (1998)\nMirror Image (1998)\nBittersweet (1999)\nIrresistible Forces (1999)\nGranny Dan (1999)\nJourney (2000)\nThe House on Hope Street (2000)\nLeap of Faith (2001)\nLone Eagle (2001)\nThe Kiss (2001)\nThe Cottage (2002)\nSunset In St. Tropez (2002)\nAnswered Prayers (2002)\nDating Game (2003)\nSafe Harbour (2003)\nJohnny Angel (2003)\nEchoes (2004)\nRansom (2004)\nSecond Chance (2004)\nMiracle (2005)\nImpossible (2005)\nToxic Bachelors (2005)\nH.R.H. (2006)\nThe House (2006)\nComing Out (2006)\nBungalow Two (2007)\nSisters (2007)\nAmazing Grace (2007)\nRogue (2008)\nHonor Thyself (2008)\nA Good Woman (2008)\nOne Day at a Time (2009)\nMatters of the Heart (2009)\nSouthern Lights (2009)\nBig Girl (2010)\nFamily Ties (2010)\nLegacy (2010)\nHotel Vendome (2011)\n44 Charles Street (2011)\nHappy Birthday (2011)\nBetrayal (2012)\nFriends Forever (2012)\nThe Sins of the Mother (2012)\nUntil The End Of Time (2013)\nFirst Sight (2013)\n\nNew York. London. Milan. Paris.\n\nFashion week in all four cities. A month of endless interviews, parties, unflagging work and attention to detail. At the centre of the storm is Timmie O'Neill, whose renowned line, 'Timmie O', is the embodiment of casual chic, in fashion and for the home. She has created an international empire that inspires, fills, and consumes her life.\n\nIn a world where humility and compassion are all too rare, Timmie's humour, kindness, integrity, and creativity are inspirational. Yet as blessed as she feels by her success, she harbours the private wounds of a devastating childhood and past tragedy. Always willing to take risks in business, she never risks her heart - until an intriguing Frenchman comes into her life during Paris Fashion Week. There is every reason why they must remain apart. But neither can deny their growing friendship and the electricity that sparks whenever they meet.\n\nAre they brave enough to face what comes next? And will they do it together - or apart?\n\nWinners (2013)\n\nWhen a horrific chairlift accident leaves 17-year-old competitive skier Lily Thomas paralyzed, she must come to grips with the fact that she'll not only be confined to a wheelchair for the rest of her life, but will never fulfill her lifelong dream of winning Olympic gold.\n\nMeanwhile, her wealthy father, who has doted on Lily since her mother died when she was three, is devastated as he watches his only child lose all she once cherished and suffer through the arduous road to recovery.\n\nBut just as all hope seems lost, Lily meets Teddy, a young man even more badly injured than she, but as doggedly determined to live an enriching life. Danielle Steel is at her best in this powerful story of a father and daughter triumphing together over unthinkable tragedy, creating new lives for themselves and providing hope for others along the way.","torrent":{"xt":"urn:btih:8fc83d5a4844ca29964afdf3f83595598df89528","amp;dn":"Danielle+Steel+Romance+Collection+1977-2013+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fc83d5a4844ca29964afdf3f83595598df89528","infoHashBuffer":{"type":"Buffer","data":[143,200,61,90,72,68,202,41,150,74,253,243,248,53,149,89,141,248,149,40]},"announce":[],"urlList":[]}}