{"title":"I Am Malala (audiobook) By Malala Yousafzai 2013 English","uid":9037898,"size":572496493,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9037e2adae33f928549f99078b2f7c9ae02b0465&amp;dn=I+Am+Malala+%28audiobook%29+By+Malala+Yousafzai+2013+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"BosuxRedsux","files":30,"time":1381548944,"description":"I Am Malala: The Girl Who Stood Up for Education and Was Shot by the Taliban (Audiobook) By Malala Yousafzai with Christina Lamb, read by Archie Panjabi\nUnabridged edition 2013 | 19 hours and 52 mins | ISBN: 147897978X | Mp3 64kbps | 545 MB\n\n\nIn 2009 Malala Yousafzai began writing a blog on BBC Urdu about life in the Swat Valley as the Taliban gained control, at times banning girls from attending school. When her identity was discovered, Malala began to appear in both Pakistani and international media, advocating the freedom to pursue education for all. In October 2011, gunmen boarded Malala's school bus and shot her in the face, a bullet passing through her head and into her shoulder. Remarkably, Malala survived the shooting.\n\nAt a very young age, Malala Yousafzai has become a worldwide symbol of courage and hope. Her shooting has sparked a wave of solidarity across Pakistan, not to mention globally, for the right to education, freedom from terror and female emancipation. I Am Malala, the memoir of Malala Yousafzai, will shed insight into the lives of those children who cannot attend school, will tell the inspiring story of a schoolgirl faced the Taliban with courage and bravery.","torrent":{"xt":"urn:btih:9037e2adae33f928549f99078b2f7c9ae02b0465","amp;dn":"I+Am+Malala+%28audiobook%29+By+Malala+Yousafzai+2013+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9037e2adae33f928549f99078b2f7c9ae02b0465","infoHashBuffer":{"type":"Buffer","data":[144,55,226,173,174,51,249,40,84,159,153,7,139,47,124,154,224,43,4,101]},"announce":[],"urlList":[]}}