{"title":"Tokyo Fashion City (2016) (Epub) Gooner","uid":15984624,"size":60497395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9092469307f9174674b9c889804bb408e0f9d0ce&amp;dn=Tokyo+Fashion+City+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":3,"uploader":"GoonerTPB","files":2,"time":1475949300,"description":"Tokyo Fashion City - A Detailed Guide to Tokyos Trendiest Fashion Districts (2016) (Epub) Gooner\r\n\r\nPublisher: Tuttle Publishing; Paperback with Flaps edition (October 18, 2016)\r\nLanguage: English\r\nISBN-10: 4805313390\r\nISBN-13: 978-4805313398\r\n\r\nThe fashionable, eccentric pedestrians of Tokyo are captured with hundreds of portrait photographs in this fun guide to Tokyo street fashion.\r\n\r\nTokyo is considered one of the world's style capitals for its vibrant youth fashion culture. Part guide book, part fashion photography album, Tokyo Fashion City takes a stroll through eight Tokyo neighborhoods, each with its own unique fashion characteristics, to see what streetwise young Tokyoites are wearing, where they're shopping, what they're eating and drinking, and where they're hanging out. \r\n\r\nAuthor Philomena Keet and photographer Yuri Manabe accompany the reader to Harajuku where high fashion rubs shoulders with hip-hop style; to Shibuya, birthplace of the &quot;gal&quot; and stomping ground for Tokyo's most sophisticated fashionistas; to hipster hangout Daikanyama; to the goth and geek meccas of Shinjuku and Ikebukuro; to bohemian Koenji and otaku neighborhood Nakano; to Ginza's lunching ladies and dapper gentlemen; to the cosplay paradise of Akihabara; and to the narrow lanes of East Tokyo, where everyday Japanese fashion gets a traditional touch. \r\n\r\nEach chapter is packed with photographs of young fashionistas captured as they go about their daily lives, with info-rich captions, and insightful text giving the background to the trends and tribes featured. With the inclusion of area maps, and shop and cafe listings, Tokyo Fashion City is an indispensable resource for readers wishing to keep a finger on Tokyo's style pulse","torrent":{"xt":"urn:btih:9092469307f9174674b9c889804bb408e0f9d0ce","amp;dn":"Tokyo+Fashion+City+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9092469307f9174674b9c889804bb408e0f9d0ce","infoHashBuffer":{"type":"Buffer","data":[144,146,70,147,7,249,23,70,116,185,200,137,128,75,180,8,224,249,208,206]},"announce":[],"urlList":[]}}