{"title":"The Silkworm (Cormoran Strike Book 2) Robert Galbraith Audiobook","uid":10507855,"size":500167185,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:909a447178d9a4bce24f79b4c903eecfd21e0d36&amp;dn=The+Silkworm+%28Cormoran+Strike+Book+2%29+Robert+Galbraith+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404805395,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Silkworm\n\nWritten by: Robert Galbraith\nNarrated by: Robert Glenister\nLength: 17 hrs and 22 mins\nSeries: Cormoran Strike, Book 2\nFormat: Unabridged\nRelease Date:06-19-14\nProgram Type: Audiobook\n\nPrivate investigator Cormoran Strike returns in a new mystery from Robert Galbraith, author of the number-one international best seller The Cuckoo's Calling.\n\nWhen novelist Owen Quine goes missing, his wife calls in private detective Cormoran Strike. At first, Mrs. Quine just thinks her husband has gone off by himself for a few days - as he has done before - and she wants Strike to find him and bring him home.\n\nBut as Strike investigates, it becomes clear that there is more to Quine's disappearance than his wife realizes. The novelist has just completed a manuscript featuring poisonous pen-portraits of almost everyone he knows. If the novel were to be published, it would ruin lives - meaning that there are a lot of people who might want him silenced.\n\nWhen Quine is found brutally murdered under bizarre circumstances, it becomes a race against time to understand the motivation of a ruthless killer, a killer unlike any Strike has encountered before...\n\nA compulsively listenable crime novel with twists at every turn, The Silkworm is the second in the highly acclaimed series featuring Cormoran Strike and his determined young assistant, Robin Ellacott.","torrent":{"xt":"urn:btih:909a447178d9a4bce24f79b4c903eecfd21e0d36","amp;dn":"The+Silkworm+%28Cormoran+Strike+Book+2%29+Robert+Galbraith+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"909a447178d9a4bce24f79b4c903eecfd21e0d36","infoHashBuffer":{"type":"Buffer","data":[144,154,68,113,120,217,164,188,226,79,121,180,201,3,238,207,210,30,13,54]},"announce":[],"urlList":[]}}