{"title":"[FSX] IMAGINE SIM - VHHH HONG KONG CHEK LAP KOK","uid":8529061,"size":48684790,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:909bd87fce1fd504312e5f207696d5c83dba81a5&amp;dn=%5BFSX%5D+IMAGINE+SIM+-+VHHH+HONG+KONG+CHEK+LAP+KOK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"nT8go7A","files":1,"time":1370099955,"description":"Hong Kong International Airport is the main airport in Hong Kong, People's Republic of China. It is colloquially known as Chek Lap Kok Airport (èµ¤é±²è§’æ©Ÿå ´), because it was built on the island of Chek Lap Kok by land reclamation, and also to distinguish it from its predecessor, the closed Kai Tak Airport. The airport opened for commercial operations in 1998, replacing Kai Tak, and is an important regional trans-shipment centre, passenger hub and gateway for Mainland China and destinations across the world. Despite a relatively short history, Hong Kong International Airport is consistently voted the world's best in terms of design and passenger comfort.\n\nThe airport features custom made runways, terminal buildings rendered to 5cm per pixel scale, an interactive docking system to park you right on your mark, taxiways with highly realistic concrete textures, full airport taxiway and runway signage, 3D approach lighting and full ILS navigation. There are hundreds of airport vehicles and ground personnel, aircraft can be found parked at custom textured parking positions, all hangers, cargo and airport auxiliary buildings are modelled.\n\nIn addition to all of this, VHHH looks stunning after dark with beautifully lit buildings and parking areas. Complete airport taxiway and runway lighting is also included","torrent":{"xt":"urn:btih:909bd87fce1fd504312e5f207696d5c83dba81a5","amp;dn":"%5BFSX%5D+IMAGINE+SIM+-+VHHH+HONG+KONG+CHEK+LAP+KOK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"909bd87fce1fd504312e5f207696d5c83dba81a5","infoHashBuffer":{"type":"Buffer","data":[144,155,216,127,206,31,213,4,49,46,95,32,118,150,213,200,61,186,129,165]},"announce":[],"urlList":[]}}