{"title":"What Is It? (2005, Crispin Hellion Glover)","uid":5168588,"size":1207579756,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:912b4867fed9c98c4583bb0af290ba50347eff2d&amp;dn=What+Is+It%3F+%282005%2C+Crispin+Hellion+Glover%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"revtherev","files":1,"time":1258559606,"description":"This is Crispin Hellion Glover's surreal art film &quot;What Is It?&quot;. It has excellent stuff such as reoccurring snail torture and a porn star giving a man with real life cerebral palsy a handjob. It has never been commercially distributed to theaters or home video, only shown at Crispin Glover's art shows. This is a rip of a DVDScreener. The quality is pretty bad, but it's the only copy available to the general public. I got it from CG, and the person who upped it there got it from KG. I've looked for it on public trackers before but never found it; everyone must have this, so I am putting it up here.\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:912b4867fed9c98c4583bb0af290ba50347eff2d","amp;dn":"What+Is+It%3F+%282005%2C+Crispin+Hellion+Glover%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"912b4867fed9c98c4583bb0af290ba50347eff2d","infoHashBuffer":{"type":"Buffer","data":[145,43,72,103,254,217,201,140,69,131,187,10,242,144,186,80,52,126,255,45]},"announce":[],"urlList":[]}}