{"title":"ABC of Anxiety and Depression [PDF] [StormRG]","uid":11173751,"size":3276343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:933e393a3163bf0b5107acc1cd6195c6aa9e5fc4&amp;dn=ABC+of+Anxiety+and+Depression+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"0xmovva","files":-1,"time":1412742232,"description":"TITLE/EDITIONABC of Anxiety and Depression\nAuthor: Linda Gask (Editor), Carolyn Chew-Graham (Editor)\nSeries: ABC Series\nPaperback: 88 pages\nPublisher: BMJ Books; 1 edition (October 6, 2014)\nLanguage: English\nISBN-10: 1118780795\nISBN-13: 978-1118780794\nFormat: Retail PDF\n\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n________________________________________________________________________________\n\n\nABC of Anxiety and Depression is a practical guide to the assessment, treatment and management of patients with anxiety and depression as they commonly present in primary care.\n\nIt begins with an introduction to views on the understanding of anxiety and depression. The following chapters cover how anxiety and depression present in different patient groups such as children and young people, adults, older people and during antenatal/postnatal periods. It then addresses anxiety and depression as comorbidities with chronic illness, and within special populations and settings.\n\nThe options for treatment and management of anxiety and depression are considered with guidance on when referral to secondary care may be appropriate and the current best practice in psychological therapies, drug treatment and social interventions. Cases are used to illustrate the complexities of managing patients with anxiety and depression.\n\nThe title concludes with an important chapter on practitioner well-being.\n\nABC of Anxiety and Depression is a practical resource all general practitioners and family physicians working with patients with anxiety and depressive disorders. It is also relevant for primary health care professionals who are part of clinical teams treating patients with anxiety and depression, and conditions where anxiety and depression are common comorbidities, as well as psychologists, counsellors, social workers, and medical and nursing students.","torrent":{"xt":"urn:btih:933e393a3163bf0b5107acc1cd6195c6aa9e5fc4","amp;dn":"ABC+of+Anxiety+and+Depression+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"933e393a3163bf0b5107acc1cd6195c6aa9e5fc4","infoHashBuffer":{"type":"Buffer","data":[147,62,57,58,49,99,191,11,81,7,172,193,205,97,149,198,170,158,95,196]},"announce":[],"urlList":[]}}