{"title":"Blackguards 2 (Latest With 2.0 Patch) (GOG)","uid":11687817,"size":5064434963,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:93cc1326d5f18f6ef155e48ce664d47cda175aad&amp;dn=Blackguards+2+%28Latest+With+2.0+Patch%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":5,"uploader":"Sarah116","files":8,"time":1423383691,"description":"Hey guys, here blackguards 2. It contains the latest 2.0 patch. Hope you guys enjoy and please help seed.\n\n\n--------------------\n\n\nBlackguards 2 is the sequel of the turn-based strategy-RPG and will deliver more hexfield battles and an even grittier story filled with violence and crime.\n\nChoose your playstyle: no matter if front line combat monster, mage or ranged fighter it's in your hands how you want to develop your character. Every action has consequences, so make your decisions wisely. Death may be just around the corner.\n\nThree years have passed since Count UriaÂ´s plots. The Vanquishers of the Nine Hordes long parted ways but life in Aventuria went on. Cassia, a young woman of noble descent, has only one goal: She wants to claim the Shark Throne, no matter the price; and be it only for one day. Unfortunately, there are two problems that potentially foil her plans. First of all, she spends her days incarcerated in a dungeon and secondly, there is already a man on her throne: Marwan. She is neither fond nor proficient in matters of diplomacy or politics, so she chooses a more... practical approach. She intends to break out of prison and overthrow Marwan to claim the throne herself. For this, she needs strong allies. She needs to recruit an army of Sellswords and rally the Vanquishers of the Nine Hordes around her. Sounds like a solid plan, doesn't it? But then again, how cunning must one be to escape the dungeon's walls; and how reckless must one be to gather and command the worst scum of the realms?\n\n\n*Recruit mercenaries, find upgrades and build an indomitable army\n\n*Find the Vanquishers of the Nine Hordes and see what has become of Takate, Naurim and Zurbaran\n\n*A story with many twists and turns, fateful decisions and more than 20 challenging hours of playtime awaits you\n\n*Command up to 20 characters in your party and lead them to death or glory\n\n*Master and finish the game on many different non-linear paths\n\n*Make decisions influencing your squad and the ending of the game\n\n*Choose your spells, talents and skills wisely, since they dictate your strategy on the battlefield. Give priority to offensive or tactic in challenging battles\n\n*Interact with your environment and let walls collapse or even discover new routes on your journey through Aventuria.\n\n---------------------------\n\nRecruit mercenaries, find upgrades and build an indomitable army\nFind the Vanquishers of the Nine Hordes and see what has become of Takate, Naurim and Zurbaran\nA story with many twists and turns, fateful decisions and more than 20 challenging hours of playtime awaits you\nCommand up to 20 characters in your party and lead them to death or glory\nMaster and finish the game on many different non-linear paths\nMake decisions influencing your squad and the ending of the game\nChoose your spells, talents and skills wisely, since they dictate your strategy on the battlefield. Give priority to offensive or tactic in challenging battles\nInteract with your environment and let walls collapse or even discover new routes on your journey through Aventuria.\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/blackguards_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/blackguards_2&lt;/a&gt;","torrent":{"xt":"urn:btih:93cc1326d5f18f6ef155e48ce664d47cda175aad","amp;dn":"Blackguards+2+%28Latest+With+2.0+Patch%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93cc1326d5f18f6ef155e48ce664d47cda175aad","infoHashBuffer":{"type":"Buffer","data":[147,204,19,38,213,241,143,110,241,85,228,140,230,100,212,124,218,23,90,173]},"announce":[],"urlList":[]}}