{"title":"Sid.Meiers.Civilization.Beyond.Earth.Rising.Tide.Addon-RELOADED","uid":12537734,"size":3294513815,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:93e69dfcb91a5300354f8d0db30bb5232cb0aafd&amp;dn=Sid.Meiers.Civilization.Beyond.Earth.Rising.Tide.Addon-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"mercs215","files":68,"time":1444344277,"description":"\n                █    ▄▀▀█ ▄▀▀  ▓   ▄▀▀▄ ▄▀▀▄ ▄▀▄  ▄▀▀  ▄▀▄     █\r\n                █▄▄▄ █▀▓  ▓▀ ▄ █   █  ▓ █▀▀▓ ▓  █ ▓▀ ▄ █  ▓ ▄▄▄█\r\n                       █  ▀▀▀▀ ▀▀▀  ▀▀  ▀    ▀▀▀  ▀▀▀▀ ▀▀▀\r\n            Sid Meiers Civilization Beyond Earth Rising Tide (c) 2K\r\n    \r\n        10/2015 :..... RELEASE.DATE .. PROTECTION .......: Steam\r\n              1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\r\n   \r\n                   ▄▀▀  ▄▀▀▄ ▄▀▄▀▄ ▄▀▀  ▀ ▄▀▀▄ ▄▀▀▄ ▄▀▀▄ ▄▀\r\n  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ █ ▀▓ █▀▀▓ █   ▓ ▓▀ ▄ █ █  ▓ ▓▀   █  ▓ ▀▀▀█ ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\r\n                    ▀▀  ▀    ▀   ▀ ▀▀▀▀ ▀ ▀    ▀     ▀▀   ▀▀\r\n  After the first wave of great colony ships departed Earth, the jubilation\r\n  of humanity was short-lived. Those left behind fell into a violent struggle\r\n  over the quickly-diminishing resources on their barren home world. From\r\n  this tumultuous time, two new factions arose. These newcomers were grounded\r\n  not in the idealism of their predecessors, but on opportunism, resilience,\r\n  ruthlessness, and above all a commitment to their own survival. \r\n  Now, many decades after their first landfall on a new planet, the proud\r\n  survivors of the first expeditions beyond Earth look up to see the skies\r\n  darkened by a new breed of pioneers. \r\n  Beyond Earth extended the Civilization franchise from its historical\r\n  setting into the possible futures of science fiction. Rising Tide extends\r\n  Beyond Earth to new frontiers on the planet's surface and beneath its seas,\r\n  adding even more choices and diplomatic options as you continue to build\r\n  just one more turn toward a new vision for the future of humanity. \r\n  * Colonize the Ocean: Build floating settlements and access natural\r\n    resources hidden beneath the seas of the alien planet. Alien beasts with\r\n    unique abilities inhabit the water and challenge the player in new ways.\r\n    The ocean provides a fully replayable map, new gameplay mechanics and\r\n    strategic possibilities for players to reign supreme on their new world. \r\n  * Dynamic Leader Traits: Players and AI Leaders alike unlock new Traits\r\n    through gameplay and activate different combinations to respond to the\r\n    changing world. These dynamic sets of Traits also provide benefits and\r\n    add to the new Diplomacy system, governed by the new Fear and Respect\r\n    attributes. \r\n  * New, Enhanced Diplomatic Options: Shape the diplomatic landscape by\r\n    using political capital to upgrade your traits, change diplomatic\r\n    relationships, and leverage the benefits of your allies' traits. \r\n  * New Sponsors: Four new factions have been added to the game including\r\n    Al Falah, nomad explorers descended from wealthy and resilient Middle\r\n    Eastern states that possess a rich cultural and commercial heritage. \r\n  * New Artifact System: Collect and combine powerful relics to unlock new\r\n    perks, unit upgrades, and buildings for your faction on the new world. \r\n  * New Hybrid Units: Affinities are competing visions for the future of\r\n    humanity. By investing in multiple Affinities, rather than specializing\r\n    in just one, players can unlock special hybrid Affinity units and\r\n    upgrades. \r\n  * New Biomes: Two new world types have been added. Primordial worlds are\r\n    rife in volcanic activity and the chaotic landscape of a world still\r\n    forming. Frigid worlds have cooled in their great age, their surfaces\r\n    covered with icy oceans and frozen tundra. \r\n  * This includes all previous updates and DLC\r\n             ▀ ▄▀▀▄ ▄▀   ▓▄▄  ▄▀▀▄ ▓   ▓   ▄▀▀▄ ▄▀▀▄ ▓▄▄  ▄▀▀  ▄▀\r\n  ▀▀▀▀▀▀▀▀▀▀ █ █  ▓ ▀▀▀█ █  ▄ █▀▀▓ █   █   █  ▓ █  ▓ █  ▄ ▓▀ ▄ ▀▀▀█ ▀▀▀▀▀▀▀▀▀▀\r\n             ▀ ▀     ▀▀   ▀▀▀ ▀    ▀▀▀ ▀▀▀ ▀     ▀▀   ▀▀▀ ▀▀▀▀  ▀▀\r\n  1. Unrar.\r\n  2. Burn or mount the image.\r\n  3. Install the game. \r\n  4. Copy over the cracked content from the /Crack directory on the image to\r\n     your game install directory.\r\n  5. Play the game.\r\n  6. Support the software developers. If you like this game, BUY IT!\r\n  \r\n    NOTE: Sid.Meiers.Civilization.Beyond.Earth-RELOADED is required.\r\n               ▄▀▀  ▄▀▀█ ▄▀▀▄ ▓  ▄ ▄▀▀█ ▄▀▀▄ ▄▀▀▄ ▓▄▄  ▄▀▀  ▄▀\r\n  ▀▀▀▀▀▀▀▀▀▀▀▀ █ ▀▓ █▀▓  █  ▓ █  ▓ █▀▀  █  ▓ █  ▓ █  ▄ ▓▀ ▄ ▀▀▀█ ▀▀▀▀▀▀▀▀▀▀▀▀▀\r\n                ▀▀    █   ▀▀   ▀▀  ▀    ▀     ▀▀   ▀▀▀ ▀▀▀▀  ▀▀","torrent":{"xt":"urn:btih:93e69dfcb91a5300354f8d0db30bb5232cb0aafd","amp;dn":"Sid.Meiers.Civilization.Beyond.Earth.Rising.Tide.Addon-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93e69dfcb91a5300354f8d0db30bb5232cb0aafd","infoHashBuffer":{"type":"Buffer","data":[147,230,157,252,185,26,83,0,53,79,141,13,179,11,181,35,44,176,170,253]},"announce":[],"urlList":[]}}