{"title":"Akhenaten: Dweller in Truth","uid":15816177,"size":1806385,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93ef6ff38bf7964dadd4ea8a12c76b1572b9cc47&amp;dn=Akhenaten%3A+Dweller+in+Truth&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"marty14","files":1,"time":1473686177,"description":"Akhenaten: Dweller in Truth - Naguib Mahfouz [epub]\r\n\r\nFrom the winner of the Nobel Prize for Literature and author of the Cairo trilogy, comes Akhenaten, a fascinating work of fiction about the most infamous pharaoh of ancient Egypt.\r\n\r\nIn this beguiling new novel, originally published in 1985 and now appearing for the first time in the United States, Mahfouz tells with extraordinary insight the story of the &quot;heretic pharaoh,&quot; or &quot;sun king,&quot;--and the first known monotheistic ruler--whose iconoclastic and controversial reign during the 18th Dynasty (1540-1307 B.C.) has uncanny resonance with modern sensibilities.   Narrating the novel is a young man with a passion for the truth, who questions the pharaoh's contemporaries after his horrible death--including Akhenaten's closest friends, his most bitter enemies, and finally his enigmatic wife, Nefertiti--in an effort to discover what really happened in those strange, dark days at Akhenaten's court.  As our narrator and each of the subjects he interviews contribute their version of Akhenaten, &quot;the truth&quot; becomes increasingly evanescent.  Akhenaten encompasses all of the contradictions his subjects see in him: at once cruel and empathic, feminine and barbaric, mad and divinely inspired, his character, as Mahfouz imagines him, is eerily modern, and fascinatingly ethereal.  An ambitious and exceptionally lucid and accessible book, Akhenaten is a work only Mahfouz could render so elegantly, so irresistibly","torrent":{"xt":"urn:btih:93ef6ff38bf7964dadd4ea8a12c76b1572b9cc47","amp;dn":"Akhenaten%3A+Dweller+in+Truth","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ef6ff38bf7964dadd4ea8a12c76b1572b9cc47","infoHashBuffer":{"type":"Buffer","data":[147,239,111,243,139,247,150,77,173,212,234,138,18,199,107,21,114,185,204,71]},"announce":[],"urlList":[]}}