{"title":"Burnout 3  Takedown NTSC  PS2","uid":4817573,"size":1914580228,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:93f7577c4cbf2a4bfa11ff52c45d6dea2c597986&amp;dn=Burnout+3++Takedown+NTSC++PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":6,"uploader":"macf81","files":38,"time":1238618917,"description":"Desenvolvedor:Criterion Games\nDistribuidor:EA Games\nGÃƒÂªnero:Corrida\nLanÃƒÂ§amento: 07 de setembro de 2004\nFaixa etÃƒÂ¡ria:Inadequado para menores de 14 anos\n\nBurnout ÃƒÂ© uma sÃƒÂ©rie de corrida que estreou na sexta geraÃƒÂ§ÃƒÂ£o (PS2, Xbox e Gamecube) e angariou uma considerÃƒÂ¡vel parcela de fÃƒÂ£s ao colocar o jogador no papel de um piloto insano provido de um veÃƒÂ­culo extremamente veloz. Entre uma aceleraÃƒÂ§ÃƒÂ£o e outra, inÃƒÂºmeros carros de passeios interferem na disputa ocasionando vÃƒÂ¡rias vezes colisÃƒÂµes memorÃƒÂ¡veis. A presenÃƒÂ§a de ÃƒÂ³xido-nitroso (NOS ou NO2) que se reabastece constantemente concede ao jogo um carÃƒÂ¡ter totalmente arcade.\n\nExistem diversos modos de jogos, sendo que muitos deles premiam os jogadores por fazerem manobras e dirigirem arriscadamente. PorÃƒÂ©m, o principal destaque fica por conta dos acidentes, apresentados em cÃƒÂ¢mera-lenta, a fim de impressionar o jogador com um carro em pedaÃƒÂ§os. Existe atÃƒÂ© mesmo um modo que concede mais pontos para aquele que destruir seu carro da maneira mais violenta possÃƒÂ­vel. No caso de Burnout 3: Takedown, a virtude reside nos 67 veÃƒÂ­culos e nos mais de 100 fases que alimentam os impulsos de velocidade dos jogadores.\n\n\n    *    EA Games\n    * Criterion Games\n    * Racing\n    * Release: Sep 7, 2004 Ã‚Â»\n    * ESRB: Teen\n\nBurnout 3 takes the series even further, now featuring a unique &quot;crash and burn&quot; racing concept and a one-of-a-kind special effects engine that delivers spectacular visuals. The intensity heats up as players race, and often crash, their way through oncoming traffic in an attempt to claim the top spot. Boasting multiple single-player, multiplayer and online crash and race modes, Burnout 3 offers players the opportunity to race through busy city streets and be rewarded for taking risks that result in heart-pounding action and electrifying crashes.\n\n\n\nOlvida todo lo que sabes sobre las carreras, Burnout 3 reescribe las reglas de la carretera. PrepÃƒÂ¡rate a conducir por el filo de la navaja del riesgo y la recompensa: sacar de la carretera o que te saquen, robar turbo o que tus rivales te lo roben a ti. Utiliza tu coche como arma para eliminar a tus rivales en la lucha por el primer puesto, cambia de carril, golpea y pelea para conseguir mayor velocidad, ir mÃƒÂ¡s rÃƒÂ¡pido y GANAR. Con Burnout 3 la franquicia alcanza nuevas cotas, con grÃƒÂ¡ficos de alta definiciÃƒÂ³n, adictiva acciÃƒÂ³n multijugador para 6 jugadores online y 2 jugadores offline y las colisiones mÃƒÂ¡s espectaculares a este lado de Hollywood.","torrent":{"xt":"urn:btih:93f7577c4cbf2a4bfa11ff52c45d6dea2c597986","amp;dn":"Burnout+3++Takedown+NTSC++PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93f7577c4cbf2a4bfa11ff52c45d6dea2c597986","infoHashBuffer":{"type":"Buffer","data":[147,247,87,124,76,191,42,75,250,17,255,82,196,93,109,234,44,89,121,134]},"announce":[],"urlList":[]}}