{"title":"Cobrinha BJJ 7 Volume DVD Set Rubens Charles","uid":4757949,"size":2244345462,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:93f862b560496112455b4f7bcebe069aa65212e8&amp;dn=Cobrinha+BJJ+7+Volume+DVD+Set+Rubens+Charles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"Midnighter_Tribe","files":-1,"time":1236553770,"description":"Rubens Charles &quot;Cobrinha&quot; - The 3 time BJJ world champion and 2 time nogi world champion now shares his techniques with the world. Get a close up of the closed guard, butterfly guard, half guard, spider guard, double underhooks, inverted guard, and the omoplata. Learn a bunch of new and unique attacks that will keep your opponent guessing. Find out some more ways to stop your attacker from passing your guard. Finally, Charles shows you how to sweep your partner and get a dominant position. After watching the moves in the studio, sit back and watch the included footage of Cobrinha doing the same exact moves in competition. If you're serious about BJJ there's no one better to learn from in the world!\n\nVol 1: Closed Guard\nIn this volume, Cobrinha shows you all of his favorite moves from the closed guard. To start out, he shows how to pull guard from standing and immediately sweep or submit. Then you'll see all of his favorite submissions from the closed guard including his &quot;arm wrap&quot; and &quot;lapel across the back&quot; that he's famous for. Finally Cobrinha shows his favorite sweeps from closed guard that put you right in the position for submission.\n\nVol 2: Butterfly Guard\nIn this volume, Charles shows all the ways he likes to attack and sweep from the butterfly guard. Whether your back is flat on the ground, you've tried a hook sweep and failed, or you already have the double underhooks, Cobrinha will make your butterfly guard a dangerous position.\n\nVol 3: Half Guard\nAnyone that has seen Cobrinha in competition knows that his half guard is not a safe place to hang out in. In this section, Rubens shows you how sweep, take the back, recover full guard or submit. Not only regular half guard, but the deep half guard sweeps are also shown.\n\nVol 4: Spider Guard\nIn the spider guard volume, Cobrinha shows you why this guard should be a regular guard that you practice. Charles shows it all from spinning drills to grip breaks to big sweeps and Cobrinha's famous &quot;leg lasso&quot; position.\n\nVol 5: Double Underhook\nPerhaps the most complete instruction on what to do when your opponent attempts the double underhooks guard pass. Cobrinha starts off by showing how to prevent the pass and the stack. From there he shows how to go straight for the submission, recover guard, take the back, and more. After you master these techniques you'll welcome your opponent to attempt this pass!\n\nVol 6: Inverted Guard\nThe inverted guard is one of Cobrinha's least understood positions. In this volume Charles clearly shows how to get into the inverted guard, how to sweep, how to transition to takedowns, and how to transition to the de la riva guard for more sweeping fun.\n\nVol 7: Omoplata\nThe shoulder lock - this is an attack that you're almost guaranteed to see at least once in each of Cobrinha's matches. In this volume he shares 4 different omoplata drills to get you comfortable attacking the shoulder lock from various positions. From there Charles shares 5 of his favorite ways to finish the omoplata. Make one of Cobrinha's best submissions one of your own.","torrent":{"xt":"urn:btih:93f862b560496112455b4f7bcebe069aa65212e8","amp;dn":"Cobrinha+BJJ+7+Volume+DVD+Set+Rubens+Charles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93f862b560496112455b4f7bcebe069aa65212e8","infoHashBuffer":{"type":"Buffer","data":[147,248,98,181,96,73,97,18,69,91,79,123,206,190,6,154,166,82,18,232]},"announce":[],"urlList":[]}}