{"title":"AmpliTube.VST(Fender+X-Gear)","uid":5016159,"size":187750443,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:94431e07b6c28cf3988c05df3c224d966ff2c828&amp;dn=AmpliTube.VST%28Fender%2BX-Gear%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"XoLWoX","files":2,"time":1248222860,"description":"AmpliTubeÂ® FenderÂ® is the first and only official guitar/bass Amp and FX software suite made by IK Multimedia in cooperation with legendary music icon FenderÂ® Musical Instruments Corporation. With a collection of 49 pieces of gear collected from the most sought after classic and modern FenderÂ® amps (including the \u001865 Twin ReverbÂ®, \u001857 Deluxe&quot;, \u001959 BassmanÂ® LTD, \u001864 VibroverbÂ® Custom, Super-Sonic&quot;, Metalhead&quot; and many more), cabinets, stomp boxes and rack effects, AmpliTube FenderÂ® sets a new standard for software amplifiers.\n\n\n\nX-Gear.VST.RTAS v1.41\n\nAmpliTube X-GEAR is a software shell-host that allows you to open, in stand-alone and plug-in mode, any current \u001cPowered by AmpliTube\u001d product(AmpliTube 2, AmpliTube FenderÂ®, AmpliTube Jimi Hendrix&quot;, AmpegÂ® SVX, AmpliTube Metal) in a single interface with full mixing and matching between a massive number of accurately modeled gear, plus the ability to control them live and in the studio with the StompIO, StealthPedal or any traditional MIDI controller.\n\nAmpliTube X-GEAR (which stands for eXpandable Guitar Effects and Amps Rig) represents the first fully modular and customizable amp and FX modeling software environment, providing instant access to 195 superbly modeled amps and effects from all current \u001cPowered by AmpliTube\u001d range and even further expandability with future products.\n\n\nAmpliTube X-Gear:\n\n   * The first fully modular, customizable and expandable amp and FX modeling software system\n   * Provides a single host interface for AmpliTube 2, AmpliTube FenderÂ®, AmpegÂ® SVX,\n   * AmpliTube Jimi Hendrix&quot;, AmpliTube Metal, and future \u001cPowered by AmpliTube\u001d products\n   * Full mixing and matching between all the modeled gear\n   * Opens and reads all \u001cPowered by AmpliTube\u001d presets\n   * Allows full automation of each opened model\u0019s parameters\n   * Allows complete integration with StompIO or StealthPedal, IK\u0019s range of audio interfaces/floor controllers\n   * Allows MIDI controls with MIDI learn functionality\n   * Works both as a RTAS/AU/VST plug-in and standalone version on Mac/PC","torrent":{"xt":"urn:btih:94431e07b6c28cf3988c05df3c224d966ff2c828","amp;dn":"AmpliTube.VST%28Fender%2BX-Gear%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94431e07b6c28cf3988c05df3c224d966ff2c828","infoHashBuffer":{"type":"Buffer","data":[148,67,30,7,182,194,140,243,152,140,5,223,60,34,77,150,111,242,200,40]},"announce":[],"urlList":[]}}