{"title":"Matt Ridley: Genome, The Red Queen (E-books, PDF)","uid":4788808,"size":4697343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:949d108b31bb75bac6679d443b6e5ab0e6e47c9d&amp;dn=Matt+Ridley%3A+Genome%2C+The+Red+Queen+%28E-books%2C+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"4ehfuedd2","files":-1,"time":1237644127,"description":"Books by Matt Ridley\n\nGenome\n------\nThe human genome, the complete set of genes housed in twenty-three pairs of chromosomes, is nothing less than an autobiography of our species. Spelled out in a billion three-letter words using the four-letter alphabet of DNA, the genome has been edited, abridged, altered and added to as it has been handed down, generation to generation, over more than three billion years. With the first draft of the human genome due to be published in 2000, we, this lucky generation, are the first beings who are able to read this extraordinary book and to gain hitherto unimaginable insights into what it means to be alive, to be human, to be conscious or to be ill.\n\nBy picking one newly discovered gene from each of the twenty-three human chromosomes and telling its story, Matt Ridley recounts the history of our species and its ancestors from the dawn of life to the brink of future medicine. He finds genes that we share with bacteria, genes that distinguish us from chimpanzees, genes that can condemn us to cruel diseases, genes that may influence our intelligence, genes that enable us to use grammatical language, genes that guide the development of our bodies and our brains, genes that allow us to remember, genes that exhibit the strange alchemy of nature and nurture, genes that parasitise us for their own selfish ends, genes that battle with one another and genes that record the history of human migrations. From Huntington's disease to cancer, he explores the applications of genetics: the search for understanding and therapy, the horrors of eugenics and the philosophical implications for understanding the paradox of free will. \n\n\nThe Red Queen\n-------------\nReferring to Lewis Carroll's Red Queen from Through the Looking-Glass, a character who has to keep running to stay in the same place, Matt Ridley demonstrates why sex is humanity's best strategy for outwitting its constantly mutating internal predators. The Red Queen answers dozens of other riddles of human nature and culture -- including why men propose marriage, the method behind our maddening notions of beauty, and the disquieting fact that a woman is more likely to conceive a child by an adulterous lover than by her husband. Brilliantly written, The Red Queen offers an extraordinary new way of interpreting the human condition and how it has evolved.\n\n--------\nI'm looking for other books by Matt Ridley (The Origins of Virtue; Agile Gene; Nature via Nurture). Please let me know if you have them.","torrent":{"xt":"urn:btih:949d108b31bb75bac6679d443b6e5ab0e6e47c9d","amp;dn":"Matt+Ridley%3A+Genome%2C+The+Red+Queen+%28E-books%2C+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"949d108b31bb75bac6679d443b6e5ab0e6e47c9d","infoHashBuffer":{"type":"Buffer","data":[148,157,16,139,49,187,117,186,198,103,157,68,59,110,90,176,230,228,124,157]},"announce":[],"urlList":[]}}