{"title":"Dying Every Day: Seneca at the Court of Nero","uid":15861608,"size":16152107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94cb9167ab46149dc327e2e187080dab65e5691d&amp;dn=Dying+Every+Day%3A+Seneca+at+the+Court+of+Nero&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"marty14","files":1,"time":1474304982,"description":"Dying Every Day: Seneca at the Court of Nero - James Romm [epub]\r\n\r\nAt the center, the tumultuous life of Seneca, ancient Rome’s preeminent writer and philosopher, beginning with banishment in his fifties and subsequent appointment as tutor to twelve-year-old Nero, future emperor of Rome. Controlling them both, Nero’s mother, Julia Agrippina the Younger, Roman empress, great-granddaughter of the Emperor Augustus, sister of the Emperor Caligula, niece and fourth wife of Emperor Claudius.\r\n     \r\nRomm writes that Seneca watched over Nero as teacher, moral guide, and surrogate father, and, at seventeen, when Nero abruptly ascended to become emperor of Rome, Seneca, a man never avid for political power became, with Nero, the ruler of the Roman Empire. We see how Seneca was able to control his young student, how, under Seneca’s influence, Nero ruled with intelligence and moderation, banned capital punishment, reduced taxes, gave slaves the right to file complaints against their owners, pardoned prisoners arrested for sedition. But with time, as Nero grew vain and disillusioned, Seneca was unable to hold sway over the emperor, and between Nero’s mother, Agrippina—thought to have poisoned her second husband, and her third, who was her uncle (Claudius), and rumored to have entered into an incestuous relationship with her son—and Nero’s father, described by Suetonius as a murderer and cheat charged with treason, adultery, and incest, how long could the young Nero have been contained?\r\n            \r\nDying Every Day is a portrait of Seneca’s moral struggle in the midst of madness and excess. In his treatises, Seneca preached a rigorous ethical creed, exalting heroes who defied danger to do what was right or embrace a noble death. As Nero’s adviser, Seneca was presented with a more complex set of choices, as the only man capable of summoning the better aspect of Nero’s nature, yet, remaining at Nero’s side and colluding in the evil regime he created","torrent":{"xt":"urn:btih:94cb9167ab46149dc327e2e187080dab65e5691d","amp;dn":"Dying+Every+Day%3A+Seneca+at+the+Court+of+Nero","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94cb9167ab46149dc327e2e187080dab65e5691d","infoHashBuffer":{"type":"Buffer","data":[148,203,145,103,171,70,20,157,195,39,226,225,135,8,13,171,101,229,105,29]},"announce":[],"urlList":[]}}