{"title":"Napoleon Total War - All DLC packs(v1.3 1754335753)","uid":8780300,"size":11626849967,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:950cc6fe4e6744b75ead8c557a02ba25fa5f1498&amp;dn=Napoleon+Total+War+-+All+DLC+packs%28v1.3+1754335753%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":12,"uploader":"Enkhsaikhan","files":-1,"time":1375695021,"description":"System Requirements\nNapoleon: Total War Minimum Requirements:\nXP/Vista/Windows 7\nCPU: 2.3 GHz CPU with SSE2 (Streaming SIMD Extensions 2)\nRAM: 1 GB RAM (XP), 2 GB RAM (Vista/Windows 7)\nVideo: 256 MB DirectX 9.0c shader model 2b compatible GPU\nDirectX 9.0c\n23GB disk space\n\nNapoleon: Total War Recommended System:\nXP/Vista/Windows 7\nCPU: 2.6 GHz Dual Core CPU\nRAM: 2 GB RAM (XP), 4 GB RAM (Vista/Windows 7)\nVideo: 256 MB DirectX 9.0c shader model 3 compatible GPU\nDirectX 9.0c\n23GB disk space\n \nGame version: v 1.3.0.1754.335753 \n\nDLCs: \nImperial Edition \nCoalition Battle Pack \nThe Peninsular Campaign \nHeroes Of The Napoleonic Wars \nImperial Eagle Pack \nElite Regiments \nImperial Guard Pack \nCommunity Reward Unit \n\nAs with all other games in the Total War series, Napoleon consists of two gameplay types: a turn-based geopolitical campaign - which requires players to build structures in a faction's territories to produce units and create a source of income, research new technologies, deal with other in-game factions through diplomacy, trade and war, send agents on missions, create and command armies, and eventually become the world's dominant faction - and real-time tactical battles where players command huge armies to direct the course of any battles that take place.\nNapoleon contains four campaigns, two of which follow Napoleon's early military career. The first career event is the Italian campaign of 1796, while the second is the French invasion of Egypt in 1798. Both feature smaller, optional missions that help drive the story forward. The major French campaign, however, is the so-called &quot;Mastery of Europe,&quot; which resembles the holistic modes of previous Total War games. Conversely, the &quot;Campaigns of the Coalition&quot; allows players to govern Great Britain, Russia, Prussia or the Austrian Empire and attempt to defeat Napoleonic France in Europe. Each major campaign requires players to obtain a certain number of territories, although unlike Empire: Total War, one does not need to wait till the end of the campaign to be declared winner. Like in Empire, revolutions and revolts can affect the course of a player's campaign; France however in the Mastery of Europe campaign is all but immune to revolution. For the first time in the Total War franchise, attrition now plays a part on the campaign map. Depending on the location, armies will lose men due to heat or snow. Unlike Empire, the losses an army has on campaign are automatically replenished when in friendly territory. Some of Napoleon's most famous battles such as Austerlitz, Battle of the Pyramids, and Waterloo are available as historical scenarios, separate from the campaign.\n\n1. Just extract them where you want the game to be installed\n2. And play","torrent":{"xt":"urn:btih:950cc6fe4e6744b75ead8c557a02ba25fa5f1498","amp;dn":"Napoleon+Total+War+-+All+DLC+packs%28v1.3+1754335753%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"950cc6fe4e6744b75ead8c557a02ba25fa5f1498","infoHashBuffer":{"type":"Buffer","data":[149,12,198,254,78,103,68,183,94,173,140,85,122,2,186,37,250,95,20,152]},"announce":[],"urlList":[]}}