{"title":"Michael Tsokos - Smak Śmierci [PL] eds [  ]","uid":15975942,"size":584546729,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:951e05879bc7867c0e8c4495d4ccf59ac41f4f85&amp;dn=Michael+Tsokos+-+Smak+%C5%9Amierci+%5BPL%5D+eds+%5BMP3%4096%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"everdarksoul","files":30,"time":1475839599,"description":"Audiobook PL - _ części /   \r\nrozmiar: 557 MB / czas: 13:30:03\r\nczyta: Adam Bauman\r\n\r\nThriller o prawdziwej zbrodni, autorstwa najsłynniejszego niemieckiego specjalisty medycyny sądowej – jedynego autora, którego powieści i książki non-fiction to bestsellery numer jeden!\r\nTo, co Simon Beckett znał ze stażu dziennikarskiego na Trupiej Farmie, profesor Tsokos zna z naukowego doświadczenia, a na listach bestsellerów czuje się równie dobrze, jak przy stole sekcyjnym.\r\n\r\nKamienne serce - symbol, który praktycznie w każdym człowieku budzi pierwotny strach. Strach przed bestią w ludzkiej postaci, która nie zna empatii i współczucia...\r\nZobaczyć pierwszy raz miejsce zbrodni to wstrząsające przeżycie. Doktor Abel zna je aż za dobrze. Codziennie ogląda śmierć. Badał więcej martwych ciał, niż mógłby zliczyć. Nie jest człowiekiem, którego łatwo zaszokować. Aż do teraz…\r\nSeryjny morderca zabija w całej Europie. Nieuchwytny, nieprzewidywalny, przerażająco okrutny. Jego ofiary: samotne kobiety. Na ich ciałach wypisuje tajemnicze hasło.\r\nŻeby go zidentyfikować, Fred Abel, ekspert medycyny sądowej i były żołnierz, przeprowadza specjalistyczną analizę DNA. I zostaje uwikłany w sprawę głębiej, niż by chciał. Bo głównym podejrzanym jest jego dawny przyjaciel, którego córeczka właśnie umiera...\r\nAbel, przytłoczony własnymi dramatami, musi zdemaskować prawdziwego mordercę. Tym razem jednak wiedza wybitnego specjalisty to za mało. Bo stanie twarzą w twarz z najokrutniejszym złem - nie przy stole sekcyjnym, lecz podczas szaleńczego pościgu i walki o życie…\r\n_____________________________________________\r\nopinie:\r\n\r\n&quot;...Nikt nie zna lepiej otchłani ludzkiej natury. Michael Tsokos zamienia autentyczny przypadek kryminalny w spektakularny thriller o prawdziwej zbrodni. Jego historie mrożą krew w żyłach...&quot;\r\n- &quot;Bild am Sontag&quot;\r\n\r\n&quot;...Nic nie jest tak okrutne jak rzeczywistość. Autopsja okrucieństwa to wybuchowa mieszanka faktów i fikcji....&quot;\r\n- Sebastian Fitzek, autor &quot;Pasażera 23&quot;\r\n\r\nW 2012, mistrz thrillera Sebastian Fitzek wybrał Tsokosa na współautora powieści &quot;Odcięci&quot; (polska premiera 11.2016) bestsellera Top 20 &quot;Der Spiegiel&quot; przez 23 tygodnie!","torrent":{"xt":"urn:btih:951e05879bc7867c0e8c4495d4ccf59ac41f4f85","amp;dn":"Michael+Tsokos+-+Smak+%C5%9Amierci+%5BPL%5D+eds+%5BMP3%4096%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"951e05879bc7867c0e8c4495d4ccf59ac41f4f85","infoHashBuffer":{"type":"Buffer","data":[149,30,5,135,155,199,134,124,14,140,68,149,212,204,245,154,196,31,79,133]},"announce":[],"urlList":[]}}