{"title":"The Who - Who's Next [1971][1995][320 KBPS][RMSTD]","uid":8927235,"size":196432642,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9565926f047bb5f195aae82e022be20187873981&amp;dn=The+Who+-+Who%27s+Next+%5B1971%5D%5B1995%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":3,"uploader":"LameDuck69","files":21,"time":1379387757,"description":"The Who - Who's Next [1971][1995][RMSTD]\n\n\n\n\n\n01. Baba O'Riley    \n02. Bargain   \n03. Love Ain't For Keeping    \n04. My Wife   \n05. The Song Is Over    \n06. Getting In Tune  \n07. Going Mobile   \n08. Behind Blue Eyes   \n09. Won't Get Fooled Again   \n10. Pure And Easy    \n11. Baby Don't You Do It  \n12. Naked Eye    \n13. Water   \n14. Too Much Of Anything   \n15. I Don't Even Know Myself  \n16. Behind Blue Eyes (Alternate Studio Version)\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n*** NOT MY RIP ***   I Converted This From A FLAC File I Downloaded.  Thanks To The Original Uploader For The Share.\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nThe Who are an English rock band who emerged in 1964 with singer Roger Daltrey, guitarist Pete Townshend, bassist John Entwistle, and drummer Keith Moon. They combined popular singles, such as &quot;My Generation&quot; (1965), &quot;Substitute&quot; (1966), &quot;I Can See for Miles&quot; (1967), &quot;Pinball Wizard&quot; (1969), and &quot;Won't Get Fooled Again&quot; (1971), with critically acclaimed albums such as the rock operas Tommy (1969), and Quadrophenia (1973). They are known for energetic live performances which, since a performance at the Railway Hotel in Wealdstone in June 1964 when Townshend smashed his guitar in anger and frustration, often include smashing their instruments. For much of their career they have been regarded as the third most important British rock act after the Beatles and the Rolling Stones.\n\nThe band developed from Daltrey's band, the Detours, and rose to fame in the UK with a series of top ten hit singles, boosted in part by pirate radio stations such as Radio Caroline, beginning in January 1965 with &quot;I Can't Explain&quot;. The albums My Generation (1965), A Quick One (1966) and The Who Sell Out (1967) followed, with the first two reaching the UK top five. They first hit the US Top 40 in 1967 with &quot;Happy Jack&quot; and hit the top ten later that year with &quot;I Can See for Miles&quot;. Their fame grew with memorable performances at the Monterey Pop, Woodstock and Isle of Wight music festivals. The 1969 release of Tommy was their first major commercial success, reaching number 4 in the US charts. Various sources estimate the album has now sold over 20 million copies internationally. This was followed up by the successes of Who's Next (1971), Quadrophenia (1973), The Who by Numbers (1975), and Who Are You (1978). With the exception of The Who by Numbers, all of these reached the top 5 of the US charts, with by Numbers making the top 10. Also successful was the live album Live at Leeds (1970), and the soundtrack album The Kids Are Alright (1979), reaching number 4 and 8 on the US charts, respectively. The Who have sold about 100 million records, and have charted 27 top forty singles in the United Kingdom and United States, as well as 17 top ten albums, with 18 Gold, 12 Platinum and 5 Multi-Platinum album awards in the United States alone.\n\nKeith Moon died at the age of 32 on 7 September 1978, after which the band released two studio albums, the UK and US top five Face Dances (1981) and the US top ten It's Hard (1982), with drummer Kenney Jones from The Small Faces/The Faces, before disbanding in 1983. They re-formed at events such as Live Aid and for reunion tours such as their 25th anniversary tour (1989) and the Quadrophenia tours of 1996, 1997, 2012 and 2013. In 2000, the three surviving original members discussed recording an album of new material, but their plans were temporarily stalled by Entwistle's death at the age of 57 in 2002. Townshend and Daltrey continue to perform as the Who and in 2006 they released the studio album Endless Wire, which reached the top ten in the UK and US.\n\nThe Who were inducted into the Rock and Roll Hall of Fame in 1990, their first year of eligibility; the display describes them as &quot;Prime contenders, in the minds of many, for the title of World's Greatest Rock Band.&quot; TIME magazine wrote in 1979 that &quot;No other group has ever pushed rock so far, or asked so much from it.&quot; Rolling Stone magazine wrote: &quot;Along with the Beatles and the Rolling Stones, the Who complete the holy trinity of British rock.&quot; They received a Lifetime Achievement Award from the British Phonographic Industry in 1988 and from the Grammy Foundation in 2001, for creative contributions of outstanding artistic significance to the field of recording. In 2008 surviving members Townshend and Daltrey were honoured at the 31st Annual Kennedy Center Honors.\n\n-----------------------------------------------------------------------------------\n\nWho's Next is the fifth studio album by English rock band The Who, released in August 1971. The album had origins in a rock opera conceived by Pete Townshend called Lifehouse as an attempt to follow Tommy. The ambitious, complex project did not come to fruition at the time and instead, many of the songs written for the project were compiled onto Who's Next as a collection of unrelated songs. After difficulty with initial recording sessions at the New York Record Plant, events stabilized with the arrival of producer Glyn Johns, who worked on the finished album. The album featured the group's first use of the synthesizer, particularly on the tracks &quot;Baba O'Riley&quot; and &quot;Won't Get Fooled Again&quot;.\n\nThe album was a critical and commercial success when it was released, and has been certified 3Ã— platinum by the RIAA. It continues to be critically acclaimed and has been reissued on CD several times, adding additional material intended for the Lifehouse project.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:9565926f047bb5f195aae82e022be20187873981","amp;dn":"The+Who+-+Who%27s+Next+%5B1971%5D%5B1995%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9565926f047bb5f195aae82e022be20187873981","infoHashBuffer":{"type":"Buffer","data":[149,101,146,111,4,123,181,241,149,170,232,46,2,43,226,1,135,135,57,129]},"announce":[],"urlList":[]}}