{"title":"Adobe Edge Animate CC 2014 (preactivated) RePack by D!akov","uid":10722920,"size":245780678,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:96178f2781ddafa39fac659251c70dce18d84b52&amp;dn=Adobe+Edge+Animate+CC+2014+%28preactivated%29+RePack+by+D%21akov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"yfjfrj","files":2,"time":1407510440,"description":"Adobe Edge Animate CC 2014 RePack by D!akov\n\nEdge Animate lets web designers create interactive HTML animations for web, digital publishing, rich media advertising and more, reaching both desktop and mobile with ease.\nIt will provide users with a new web motion and interaction design tool that allows designers to bring animated content to websites, using web standards like HTML5, javascript, and CSS3.\n\nAdobe Edge Animate addresses web application developers that left the old-school format behind and entered the new era of animated, interactive as well as modern content.\nWith Adobe Edge Animate, your creative expression and efficiency are not at all tackled but put to good use through new technologies and great user-oriented features. Amongst them, the highlights are represented by the motion paths and templates alongside the Adobe Content Delivery Network (CDN) option for hosting files.\nFeatures:a\nPrecise animation:\nAdd motion to graphics and HTML elements with amazing accuracy thanks to the innovative timeline editor in Edge Animate. Edit property-based keyframes and use enhanced easing equations for precise control, or use the Pin tool to help speed up the animation process.\n\nIntuitive interface:\nCreate your designs on a WebKit based stage so your compositions have fidelity across modern browsers. Design with an assortment of familiar styling options and effects to create engaging HTML content.\n\nReusable symbols:\nCreate nested animations with independent timelines and interactive capabilities. Symbols are reusable and can be controlled via exposed APIs and pre-built code snippets.\n\nRich interactive capabilities:\nAdd depth to your work by handling user interaction and playback control. Use a built-in code snippet library, or add your own javascript code using the code editor.\n\nNative HTML support:\nOpen existing HTML pages and add motion to individual elements. Edge Animate works natively with HTML, and the animation code is stored in a separate file so the integrity of the page is preserved.\n\nDrawing and text tools:\nBuild compositions from scratch using drawing and text tools, and manipulate objects with an array of transformation and styling options. You can also import a variety of web graphics such as SVG, JPEG, PNG, and GIF files.\n\nPublishing options:\nPublish with options such as emitting HTML markup for SEO friendliness, choosing whether jQuery should be packaged with the project, or adding a preloader to specify what should be shown before the project is downloaded.\n\nResizable layouts:\nCreate compositions that can adapt to different screen sizes, such as tablets and smartphones.\n\nWeb fonts:\nAdd richer typography to your compositions by integrating with a web font service such as Typekit.\n\nDigital Publishing support:\nImport Edge Animate compositions into the Adobe Digital Publishing Suite with Adobe InDesign CS6, or into Apple iBooks Author.\n\nDown-level browser support:\nGenerate content that gracefully fails on browsers that don't support the latest web standards. Animations fall back to a static state, which you can define on the down-level stage. Edge Animate also supports Google Chrome Frame for additional compatibility on older browsers.\n\nMobile-ready content:\nContent created with Edge Animate is designed to work reliably on iOS and Android devices, and modern browsers such as Firefox, Chrome, Safari, and Internet Explorer 9.\n\nWhat's New:\n-Support for HTML5 video\n-Import sprite sheets from Flash Pro, Photoshop or other design tools\n-Linking support for DPS Articles\n-Updated actions editor\n-Copy and paste SVG artwork from Illustrator\n-Hand and Zoom tools\n\n[System Requirements]:\n-IntelÂ® PentiumÂ® 4 or AMD AthlonÂ® 64 processor\n-WindowsÂ® 7, Windows 8, and Windows 8.1 operating system\n-1GB of RAM\n-200MB of available hard-disk space for installation\n-1280x800 display with 16-bit video card\n\nLanguages: English","torrent":{"xt":"urn:btih:96178f2781ddafa39fac659251c70dce18d84b52","amp;dn":"Adobe+Edge+Animate+CC+2014+%28preactivated%29+RePack+by+D%21akov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96178f2781ddafa39fac659251c70dce18d84b52","infoHashBuffer":{"type":"Buffer","data":[150,23,143,39,129,221,175,163,159,172,101,146,81,199,13,206,24,216,75,82]},"announce":[],"urlList":[]}}