{"title":"Ray Lamontagne - Till The Sun Turns Black","uid":4187078,"size":70396811,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96dce1791b51239b850ad1f50683451c32156018&amp;dn=Ray+Lamontagne+-+Till+The+Sun+Turns+Black&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":4,"uploader":"billy_stretcher","files":14,"time":1210730690,"description":"Ray Lamontagne\nTill The Sun Turns Black\nAmericana/Contemporary Folk/Singer-Songwriter\n2006\n192Kbps\n\n1.Be Here Now \n2.Empty \n3.Barfly \n4.Three More Days \n5.Can I Stay \n6.You Can Bring Me Flowers \n7.Gone Away from Me \n8.Lesson Learned \n9.Truly, Madly, Deeply \n10.Till the Sun Turns Black \n11.Within You \n\nFront, Back And CD Cover Included.\n\n\nThis is just plain and simple a gorgeous record! \n\nThe follow up to 2004&amp;#039;s Trouble is overall a more hushed affair. Gone are the throaty theatrics of the first album and in its place are quiet vocals, lilting guitars and whispy strings. Produced again by the great Ethan Johns, who also wrote and plays on the album, they have once more come up with a winning formula.\n\nEach track lilts and twirls around the usual subjects of love and loss, emotion and hope, each presented in that special way. Each following on from the last like night follows day.\n\nThe quiet vocal and hushed strings of &quot;Can i Stay&quot; and the funky groove of &quot;Three More Days&quot; prove that he is no one trick pony.\n\nIts not often that a songwriter of this calibre graces us with his presence and when they do you just got to let them in and say thankyou.\n\nHow do you follow a debut record that achieved out-of-the-blue grandeur on its way to selling a quarter of a million copies? For Maine&amp;#039;s Ray LaMontagne, it&amp;#039;s all about shaking up the formula, evading repetition and delivering the unexpected. Till the Sun Turns Black finds the introspective singer/songwriter complementing his folk-country ways with traces of strings and horns and spooky soulful background voices. Songs like &quot;You Can Bring Me Flowers&quot; and &quot;Three More Days&quot; are the most R&amp;B-influenced, the latter shuffling about ala The Band or Tony Joe White. Despite its brooding lyrics, &quot;Empty&quot; has a rollicking, almost breezy delivery, a perfect balance to either the hushed title track, the unnerving &quot;Be Here Now&quot; or the horn-fortified waltz, &quot;Gone Away From Me.&quot; Throughout the 11-song sequence, and especially on the final song &quot;Within You,&quot; LaMontagne&amp;#039;s voice remains the record&amp;#039;s most crucial element, as vibrant as it is tattered and as harsh as it is flawless.\n\nEnjoy! :)","torrent":{"xt":"urn:btih:96dce1791b51239b850ad1f50683451c32156018","amp;dn":"Ray+Lamontagne+-+Till+The+Sun+Turns+Black","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96dce1791b51239b850ad1f50683451c32156018","infoHashBuffer":{"type":"Buffer","data":[150,220,225,121,27,81,35,155,133,10,209,245,6,131,69,28,50,21,96,24]},"announce":[],"urlList":[]}}