{"title":"Make: Basic Arduino Projects","uid":9911260,"size":125385688,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97787462034c69eecca7c36b8cec377fac6359da&amp;dn=Make%3A+Basic+Arduino+Projects&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"el_hadi","files":-1,"time":1396901377,"description":"Make: Basic Arduino Projects\n26 Experiments with Microcontrollers and Electronics\nby Don Wilcher\nMaker Media, Inc | February 2014 | pdf | 260 pages\n\nThis companion book to MakerShed's Ultimate Arduino Microcontroller Pack provides 26 clearly explained projects that you can build with this top-selling kit right away--including multicolor flashing lights, timers, tools for testing circuits, sound effects, motor control, and sensor devices.\n\nWith the Ultimate Arduino Microcontroller Pack, you'll find everything from common components such as resistors and capacitors to specialized sensors and actuators like force-sensing resistors and motors. The kit also features the Arduino Uno Microcontroller and a MakerShield, the definitive prototyping shield for Arduino.\n\n* Build 26 cool mini Arduino projects and gadgets\n* Work on projects that are both instructive and have practical application\n* Get circuit diagrams and detailed instructions for building each project\n* Understand circuit design and simulation with easy-to-use tools\n\nAbout the Author\nDon Wilcher is a passionate teacher of electronics technology and an electrical engineer with 26 years of experience. He's worked on industrial robotic systems, automotive electronic modules, systems, and embedded wireless controls for small consumer appliances. While at Chrysler Corporation, Don developed a weekend enrichment pre-engineering program for inner city kids. He is the Department Chair for the School of Electronics Technology of ITT Technical Institute at the Madison, AL campus.","torrent":{"xt":"urn:btih:97787462034c69eecca7c36b8cec377fac6359da","amp;dn":"Make%3A+Basic+Arduino+Projects","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97787462034c69eecca7c36b8cec377fac6359da","infoHashBuffer":{"type":"Buffer","data":[151,120,116,98,3,76,105,238,204,167,195,107,140,236,55,127,172,99,89,218]},"announce":[],"urlList":[]}}