{"title":"Cannonball Adderley - Somethin' Else (1958 ) [Jazz][mp3 320][sc","uid":5702529,"size":106498981,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:977ff1c0dc74022062403427bc28bdd30c920ec8&amp;dn=Cannonball+Adderley+-+Somethin%5C%27+Else+%281958+%29+%5BJazz%5D%5Bmp3+320%5D%5Bsc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"schon55","files":11,"time":1279559947,"description":"Cannonball Adderley - Somethin' Else \nAudio CD (October 25, 1990) \nLabel: Blue Note Records \nQuality: mp3 cbr 320 kbps\n\nThere are a few reissues of this absolutely great Cannonball Adderley recording. The first five cuts on all the reissues are the same 5 cuts that make up the original vinyl LP. A few of the reissued CD's have an additional sixth cut. The sixth cut was discovered by Blue Note and initially released in Japan in 1982 and given the name &quot;Allison's Uncle&quot; because Nat Adderley's daughter was born on the day it was recorded. Further research revealed that the mystery tune is a Hank Jones composition that the pianist recorded as &quot;Rangoon&quot; with the Gigi Gryce/Donald Byrd Jazz Lab quintet for a Jubilee label in August 1957. Therefore, please be advised that &quot;Allison's Uncle&quot; and &quot;Rangoon&quot; and the same exact cut, just with a different name for the same song. I got this info from the Rudy Van Gelder Edition footnotes by Bob Blumenthal. Tidbits like this are very important to me and thought it might be valuable to others as well. ~ Tony NYC\n\nThis is a lovely, accessible, balanced collection which shows off Miles and Cannonball at their peaks (1958) and is a great companion to the more widely known &quot;Kind of Blue&quot;. The ten minutes of &quot;Autumn Leaves&quot; is achingly beautiful, especially via earphones, but all six selections are just fine, including the &quot;Alison's Uncle&quot; number left off the original vinyl release for lack of playing time. One thing to remember about buying jazz through Amazon or other on-line sources is that a one-minute &quot;sample&quot; of a six or ten-minute improvisation can be quite misleading. I was not impressed by the &quot;samples&quot; I heard from this disc, but I found a good price and went ahead and bought it anyway. The totality is so much different, and better, than the sampled portions! The two horn giants here are wonderfully supported by Hank Jones at the keyboard, Sam Jones on bass, and the great Art Blakey on the drums. This is music you'll find it quite hard to get tired of. ~ William E. Adams\n\nMiles practically steals the show on this underrated masterpiece. Well, perhaps underrated is the wrong term--more at 'underappreciated'. This is an impeccable recording, just shy (in my humble opinion) of the lofty standard set by &quot;Kind of Blue.&quot; As one reviewer noted, he's heard nothing but positive feedback when he's played this for the casual, unassuming listener. To sum it up in a sentence, if somebody requested me to &quot;play some good jazz&quot; and I didn't have &quot;Kind of Blue&quot; with me, I'd play this. Heck, even if I did have &quot;Kind of Blue,&quot; it'd be a toss-up. Everybody's playing is just so assured, and the arrangements are beautiful, particularly the muted, pensive take on &quot;Autumn Leaves.&quot; Blakey swings and shuffles like mad, Miles is at his broodingest best, Hank Jones plays like a genius, light as a feather yet majestically assured; and Cannonball is at his bluesy best. Buy this record...it's tight! ~ Christopher Jones\n\nPersonnel:\nMiles Davis (trumpet)\nCannonball Adderley (alto saxophone)\nHank Jones (piano)\nSam Jones (bass)\nArt Blakey (drums)\n\nCannonball Adderley - Somethin' Else Tracks:\n01  Autumn Leaves\n02  Love For Sale\n03  Somthin' Else\n04  One For Daddy-O\n05  Dancing In The Dark\n06  Bangoon * (Allison's Uncle)\n*Not part of the original album","torrent":{"xt":"urn:btih:977ff1c0dc74022062403427bc28bdd30c920ec8","amp;dn":"Cannonball+Adderley+-+Somethin%5C%27+Else+%281958+%29+%5BJazz%5D%5Bmp3+320%5D%5Bsc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"977ff1c0dc74022062403427bc28bdd30c920ec8","infoHashBuffer":{"type":"Buffer","data":[151,127,241,192,220,116,2,32,98,64,52,39,188,40,189,211,12,146,14,200]},"announce":[],"urlList":[]}}