{"title":"Fitzcarraldo (Werner Herzog, 1982)","uid":3417962,"size":1470109835,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9781af4badcc3fbe308528111a332494fb4c48fe&amp;dn=Fitzcarraldo+%28Werner+Herzog%2C+1982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"Bluesoul","files":4,"time":1133865323,"description":"Fitzcarraldo\nDirected by: Werner Herzog\t\nYear: 1982\nLanguage: English, Spanish, German\nSubtitles: English\n\n\nRuntime: CD1: 01:18:24  CD2: 01:12:24  \nVideo Codec: DivX 5.0\nVideo Bitrate: CD1: 997 kb/s CD2: 1094 kb/s\nResolution: 640x352 (1.82:1) [=20:11]\nFPS: 25.000\nAudio:  MP3 126 kb/s (63/ch, stereo) VBR LAME3.93\n\n\nBrian Sweeney Fitzgerald (Klaus Kinski), known as Fitzcarraldo to the native Peruvians, is an avid opera lover and rubber baron who dreams of building an opera house in the Peruvian jungle. To accomplish this, he plans to reach an isolated patch of rubber trees and make his fortune. But these trees are not directly accessible by river because of dangerous rapids, so Fitzcarraldo runs his ship as close as possible via an alternate river and then enlists the aid of the native Peruvians to drag his ship over a mountain to the desired area. However, the natives seem to have their own agenda in so mysteriously acceding to Fitzcarraldo's wishes. The results manage to both mock and affirm the dreams of determined figures like Fitzcarraldo, making absurdity out of the stuff of human endeavor without negating the beauty of that effort. There is hardly a more awe-inspiring or arresting image than that of Fitzcarraldo's ship pulling itself up the mountain with cables and pulleys, or of the ship resting in mid-ascent as seen through the thick morning fog of the jungle.\n\nThe tortured production history of Werner Herzog's Fitzcarraldo (ably recorded in Les Blank's documentary Burden of Dreams) tends to take the spotlight away from this deeply mesmerizing film. And that's unfortunate, because the film itself is even more fascinating than the trials and tribulations, amazing though they might be, that led to its being made. Part of the problem is the film's deliberate, some \nmight say ponderous, pace, which invites the viewer to experience the slow immersion into the jungle that Fitzcarraldo and company experience. Herzog did something similar in Aguirre, the Wrath of God, sometimes aiming his camera at the river rapids for extended periods of time, with hypnotic results. This could never happen in a Hollywood film, and it should be treasured. \n\nKlaus Kinski is god, and this is a movie extraordinaire! :)\n\n\n***********************************************************************************\n\nwww.freakyflicks.tk\n\nSEED AS LEAST AS MUCH AS YOU HAVE DOWNLOADED...PLEASE!\n\n'If we all seed just 1:1, give at least what we take, these torrents will NEVER DIE'\n\nSimply search for 'freakyflicks' \n*************************************** \n************** FREAKYFLICKS ************* \n***************************************","torrent":{"xt":"urn:btih:9781af4badcc3fbe308528111a332494fb4c48fe","amp;dn":"Fitzcarraldo+%28Werner+Herzog%2C+1982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9781af4badcc3fbe308528111a332494fb4c48fe","infoHashBuffer":{"type":"Buffer","data":[151,129,175,75,173,204,63,190,48,133,40,17,26,51,36,148,251,76,72,254]},"announce":[],"urlList":[]}}