{"title":"A Midsummer Night's Dream 1935 DvdRip Mp4 Lee1001","uid":9911696,"size":1151539006,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:980b791dd3f74e1185f7e0c10e94fb16a44840c6&amp;dn=A+Midsummer+Night%27s+Dream+1935+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"xultfoad","files":2,"time":1396909916,"description":"A Midsummer Night's Dream 1935 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0026714/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0026714/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/A_Midsummer_Night%27s_Dream_(1935_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/A_Midsummer_Night%27s_Dream_(1935_film)&lt;/a&gt;\nProbably giddy with their Depression-era profits, MGM went on a 'culture' binge starting in 1934 or so, adapting famous novels in a bid for the kind of upscale notices that lead to Academy Award nominations. Warner's retaliatory effort in this sweepstakes is 1935's A Midsummer Night's Dream, a wondrous adaptation of Shakespeare's play set to the music of Felix Mendelssohn and dressed up with phenomenally successful special effects. \n\nFamed stage director Max Reinhardt had floored Tinseltown with a concert and dance version of Dream at the Hollywood Bowl, and Warners signed him almost instantly to recreate the experience on film. The movie is famous for its high production values and excellent, if wildly eccentric, star turns by James Cagney and Joe E. Brown. The result is funny and beautiful -- and truly magical. \n\nNote:There is a 6 minute Overture at the start and 3 minutes exit music at the end\n[img]http://img803.imageshack.us/img803/761/ecszf6mk1tgescfg.jpg[/img]\nA Midsummer Night's Dream is a 1935 American film of William Shakespeare's play, directed by Max Reinhardt and William Dieterle, and starring Ian Hunter, James Cagney, Mickey Rooney, Olivia de Havilland, Joe E. Brown, Dick Powell, and Victor Jory. \n\nProduced by Henry Blanke and Hal Wallis for Warner Brothers, and adapted by Charles Kenyon and Mary C. McCall Jr. from Reinhardt's Hollywood Bowl production of the previous year, the film is about the events surrounding the marriage of the Duke of Athens, Theseus, and the Queen of the Amazons, Hippolyta. These include the adventures of four young Athenian lovers and a group of six amateur actors, who are controlled and manipulated by the fairies who inhabit the forest in which most of the story is set. The play, which is categorized as a comedy, is one of Shakespeare's most popular works for the stage and is widely performed across the world. \n\nFelix Mendelssohn's music was extensively used, as re-orchestrated by Erich Wolfgang Korngold. The ballet sequences featuring the fairies were choreographed by Bronislava Nijinska.\n\nVIDEO\nSize.... 1.09gb\nDuration.... 01:17:24\nCodec.... divx\nFrame Width..... 640\nFrame Height.... 480\nData Rate....1831kbps\nFrame Rate.... 25F/S\nAUDIO\nBit Rate.... 192kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:980b791dd3f74e1185f7e0c10e94fb16a44840c6","amp;dn":"A+Midsummer+Night%27s+Dream+1935+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"980b791dd3f74e1185f7e0c10e94fb16a44840c6","infoHashBuffer":{"type":"Buffer","data":[152,11,121,29,211,247,78,17,133,247,224,193,14,148,251,22,164,72,64,198]},"announce":[],"urlList":[]}}