{"title":"[SoM]Nanny McPhee - Tata Matilda[DvdRip-Xvid-Ita-Mp3]","uid":4692237,"size":734017536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:986750ae98ecd435e4a6d0d698030ea039056000&amp;dn=%5BSoM%5DNanny+McPhee+-+Tata+Matilda%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"mitimex","files":1,"time":1233432697,"description":"Cedric Brown,impiegato in un'agenzia funebre, ha da poco perso la moglie ed ora vive con i suoi sette figli bambini: Simon, Tora, Lily, Eric, Cristiana, Sebastian e la piccola Agatha, nota Aggie. I bambini sono incredibilmente indisciplinati, combinano un disastro dietro l'altro e fanno impazzire il padre. Nessuna tata ÃƒÂ¨ mai riuscita a domarli. Un giorno, mentre i bambini stanno distruggendo la cucina e facendo scherzi alla signora Blatherwick, la rozza e perfida cuoca, ecco che, mentre il signor Brown va in cucina scortato dalla domestica Evangeline, si sente bussare alla porta. Il signor Brown apre e davanti a lui si presenta una donna orrenda dal vasto aspetto stregonesco. Dice di essere Tata Matilda. Essa scende in cucina e riesce a mandare a letto i bambini con una magia, e da allora i bambini non si azzardano piÃƒÂ¹ a combinare guai di nessun tipo. Essa ha cinque lezioni da impartire loro, e non appena essi le avranno apprese, andrÃƒÂ  via. La famiglia ÃƒÂ¨ sotto la minaccia della crudele zia Adelaide, che li sostiene con un assegno mensile, e che ha detto al signor Brown che se non si sarebbe risposato entro un mese avrebbe sospeso l'assegno Infatti, mentre i bambini sono ancora sotto la guida di Tata Matilda, che diventa piÃƒÂ¹ bella ogni volta che essi imparano le sue lezioni, ecco che il padre, suo malgrado, chiede la mano della signora Quickly, che accetta volentieri. Ma in realtÃƒÂ , oltre al suo aspetto sgradevole, si tratta di una persona estremamente maligna. Il giorno del matrimonio i bambini, appoggiati da Tata Matilda, combinano l'ennesimo disastro e la festa diventa una battaglia di torte. Infine Cristiana e Sebastian strappano alla Quickly una ciocca di capelli che in realtÃƒÂ  si rivelano una parrucca. Allora essa va ad aggredirli, definendoli &quot;orribili ripugnanti mostruose creature&quot;. Il padre li protegge e, dopo che la signora Quickly se ne sarÃƒÂ  andata, sposerÃƒÂ  la premurosa Evangeline. Tata Matilda, raggiunto il suo scopo di farli diventare diligenti, va via.","torrent":{"xt":"urn:btih:986750ae98ecd435e4a6d0d698030ea039056000","amp;dn":"%5BSoM%5DNanny+McPhee+-+Tata+Matilda%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"986750ae98ecd435e4a6d0d698030ea039056000","infoHashBuffer":{"type":"Buffer","data":[152,103,80,174,152,236,212,53,228,166,208,214,152,3,14,160,57,5,96,0]},"announce":[],"urlList":[]}}