{"title":"Hexen II Ultimate Pack","uid":5488258,"size":169523055,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9a651e34dc57f5d4108c53e181cc312ca9b3655e&amp;dn=Hexen+II+Ultimate+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"zeroman72","files":4,"time":1270845922,"description":"Change Log\n\n04.10.2010\n - Included: Hammer of Thyrion 1.4.4-pre8 (x86 &amp; x64 depending on users OS type)\n - Included: HexenWorld 0.22 (x86 &amp; x64 depending on users OS type)\n - Included: HexenWorld Mods: Dungeon Break, HexArena, HWCTF, Rival Kingdoms, &amp; Siege\n - Included: Fortress of 4 Doors Mod\n\n08.04.2008\n - Changed installer format to .exe(linux users can now install) - set texture mode to anisotropic 16x for GL Hexen II users  \n- added an autorun for visual effects\n\n06.30.2008\n - fixed multiplayer over internet for Windows XP users ONLY(you can now play over the internet without using a vlan program if both routers have DMZ enabled)(does NOT work in Windows 7 or Vista without Hamachi\n\n05.03.2008\n - fixed multiplayer problem in Portal of PrÃƒÂ¦vus when trying to host a non listen server\n\n04.28.2008\n - fixed forgotten shortcut to launcher in start menu \n\nGreetings to all...This is a small project I have been working on in the past few years. The main goal behind this project is to revive the Hexen II community.\n\nThis package includes the full version of Hexen II and Hexen II: Portal of PrÃƒÂ¦vus, along with the Unofficial Quake Engine (UQE), Hammer of Thyrion (HoT), various game styles, mods, and fixes. Please share this package of goods with a friend, family member, colleague, or co-worker...and let the games begin once again!\n\nPlease note the easiest way to play multiplayer on Hexen II is via Hamachi. Hamachi is free VPN software, which can be found in the link below. You can either create a network in Hamachi, or join a pre-existing one. Once you are in a network, you can begin playing right away!\n\nRemember, if you have a previous version of Hexen II on your system, please remove it before installing the current.\n\nTo install, simply run HEXEN2_ULTIMATE_PACK_SAMKOV_04.09.2010.exe, and follow the dialog.\n\n\n\n\nThe images above are of some of the maps in the game, here is a small description for each of the maps listed above....\n\n1) Map Name: Village3 - Stables - The continent you begin on is called Blackmarsh, The Stables which are part of Blackmarsh are filled with Knight Archers, Giant Spiders, and if you look in the sky you may catch a glimpse of a Fire Imp.\n\n2) Map Name: Meso2 - Plaza of the Sun - The continent of Mazaera is filled with beings that will rip your flesh apart.  Some of these include Giant Scorpions, Iron Golems, Skull Wizards, Were-Jaguars, and Were-Panthers.  While on Mazaera you must watch where you walk, for there are death traps set up to bring your journey to a halt. \n\n3) Map Name: Egypt2 - Ancient Temple Of Nefertum - While in the continent of Thysis, some argue that it is the most difficult Hub to complete.  Watch your health bar as you will fight against many Ice Imps, Mummies, Iron Golems, and even Black Bog Scorpions.\n\n4) Map Name: Keep1 - Eidelon's Lair - You will begin back on Blackmarsh, where you started in Hexen II.  It is the first series of maps on the expansion pack: Hexen II Portal of PrÃƒÂ¦vus.  At times it will seem very difficult to move through the  Knight Archers, Skull Wizards, and Giant Spiders....but do your best to push through their forces of evil.\n\n5) Map Name: Romeric5 - Temple of Mars - The continent of Septimus is filled with many dangers, watch out for Medusas, Archer Lords, and Shadow Wizards that lurk in hidden places, as they often plan ambush attacks against you.\n\n6) Map Name: Tibet1 - Tulku - Tulku is an icy continent full of fowl beasts that will ravage your mortal body.  Two new beasts found in Tulku are the Gyagk and the Snow Leopard.  Don't enter Tulku unprepared or you will end up like the many travelers who came before you.... \n\nSome people may still experience connection problems in Hexen II multiplayer, to fix this, the easiest solution is Hamachi\n\nHamachi can be found here: https://secure.logmein.com/products/hamachi2/download.aspx&quot;&gt;\n\nIn Hamachi, you will create a network, and your friend(s) join the network you have created.  You then host a Hexen II server and they connect to your hamachi ip which you will be able to see in the hamachi application.\n\n\nEnjoy your download!\nIf you like this installer, have questions or complaints please feel free to comment.\nAnd please remember to seed!\n\n\nINFOHASH:\nDATA: HEXEN2_ULTIMATE_PACK_04.09.2010_SAMKOV.exe\nCRC32: 272bf0cf\nMD5: 37709322342d4253ee9c1df199fa4a2a\nSHA1: 991b97095d9439b1e83020e568441dd8271f3f90","torrent":{"xt":"urn:btih:9a651e34dc57f5d4108c53e181cc312ca9b3655e","amp;dn":"Hexen+II+Ultimate+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a651e34dc57f5d4108c53e181cc312ca9b3655e","infoHashBuffer":{"type":"Buffer","data":[154,101,30,52,220,87,245,212,16,140,83,225,129,204,49,44,169,179,101,94]},"announce":[],"urlList":[]}}