{"title":"Native.Instruments.SESSION.GUITARIST.STRUMMED.ACOUSTIC.KONTAKT.D","uid":13259764,"size":8270323712,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9ac7e644097fce339f8000bbdc8de5abf5709cfc&amp;dn=Native.Instruments.SESSION.GUITARIST.STRUMMED.ACOUSTIC.KONTAKT.D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":8,"uploader":"Rimisky","files":1,"time":1453254379,"description":"SESSION GUITARIST – STRUMMED ACOUSTIC captures the sound of a benchmark dreadnought acoustic, played by a seasoned studio pro. Easily browse an encyclopedia of authentic strumming patterns and load them as fast as your inspiration strikes.\r\n\r\nPLAYER’S PARADISE\r\n\r\nSTRUMMED ACOUSTIC distills years of dedicated practice into an interface designed for simplicity. A convenient keyboard layout lets you control strumming patterns and endings with your left hand while playing chords with your right hand. Mod- and pitch wheels adjust playing position and accent strength – all in real time.\r\n\r\nENDLESS SONIC DEPTHS\r\n\r\nSearch strumming patterns by where the accents fall on the beat. The Pattern Browser shows you every pattern matching that accent structure. STRUMMED ACOUSTIC even handles the most esoteric jazz chords with ease. And every performance features the smoothest chord transitions, real string noise, and impressive musicality for world-class playing every time.\r\n\r\nEASY-TO-USE EFFECTS\r\n\r\nThe Sound control panel lets you add a doubled guitar part directly in the interface for extra dimension and width. Fine-tune the character of the acoustic with ready-to-use compression presets. Perfectly place your guitar in the mix with EQ settings designed by a professional engineer. And add additional space and depth with convolution reverb – directly from STRUMMED ACOUSTIC’s interface","torrent":{"xt":"urn:btih:9ac7e644097fce339f8000bbdc8de5abf5709cfc","amp;dn":"Native.Instruments.SESSION.GUITARIST.STRUMMED.ACOUSTIC.KONTAKT.D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac7e644097fce339f8000bbdc8de5abf5709cfc","infoHashBuffer":{"type":"Buffer","data":[154,199,230,68,9,127,206,51,159,128,0,187,220,141,229,171,245,112,156,252]},"announce":[],"urlList":[]}}