{"title":"Lifeless.Planet - SKIDROW","uid":10307505,"size":717794973,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9b1e39d2779104ed4c1d09372e96910fd2872402&amp;dn=Lifeless.Planet+-+SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Taker009","files":-1,"time":1402151057,"description":"S K I D R O W\nthe leading force \n\nproudly presents\nLifeless Planet (c) KISS ltd \n\n07-06-2014......Release Date  Protection.................Steam\nAction.............Game Type  Disk(s)....................1 DVD \n\nRELEASE NOTES \n\nWhile seeking life on a distant planet, an astronaut discovers an\nabandoned Russian town. He suspects his mission is a hoax until a\nmysterious young woman saves him from a strange and deadly phenomenon\nLifeless Planet is a third-person action-adventure that features an\nold-school sci-fi story and spectacular environments in the spirit of\nclassic action-adventures \n\nAfter a hard landing on the planet, the astronaut discovers the planet\nthat was reported to be rich with life is instead a barren wasteland\nWhen he goes searching for his crew, he makes a more startling\ndiscovery: evidence that humans have already been to this planet years\nago! When he comes upon a deserted Soviet-era Russian town, he struggles\nto make sense of his mission. Did his light-speed travel to the planet\nsend him back in time? Or is this all some strange Cold War hoax? \n\nAlong the way, the astronaut meets a Russian woman, Aelita, who is\nsomehow able to survive the hostile atmosphere of the planet. Through\nan unusual natural phenomenon, her skin causes the soil to glow green\nunder her feet. The player must use these glowing tracks as a guide\nacross the planet past treacherous and deadly threats. Is she leading\nhim to safety... or an untimely death? \n\nLifeless Planet was inspired by Cold War era science fiction stories\nposing questions about humankind's desire for space travel. What if\nyou journeyed across the galaxy to another planet, only to find humans\nhad already been there? What kind of person would sign up for a one-way\nmission, leaving behind planet Earth and everyone they've ever known\nand love... to go in search of an Earth-like planet? \n\nEquipped with a limited-use jet-pack and a mobile robotic arm, the\nplayer must use wits and skill to solve puzzles, unravel the mystery\nand survive the Lifeless Planet! \n\nFeatures: \n\nExplore 20 unique and atmospheric environments on a vast and\ntreacherous planet \n\nFollow a mysterious young woman as she guides you past dangerous\nterrain and deadly life-forms \n\nInvestigate the startling discovery of an abandoned Russian town \n\nExperience an exciting and intriguing story through rich graphics and\ncinematic cut-scenes \n\nINSTALL NOTES \n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy the cracked content from the SKIDROW folder and into the main\ninstall folder and overwrite\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy! \n\nGREETINGS \n\nTo all friends of the family and honorable rival groups!","torrent":{"xt":"urn:btih:9b1e39d2779104ed4c1d09372e96910fd2872402","amp;dn":"Lifeless.Planet+-+SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b1e39d2779104ed4c1d09372e96910fd2872402","infoHashBuffer":{"type":"Buffer","data":[155,30,57,210,119,145,4,237,76,29,9,55,46,150,145,15,210,135,36,2]},"announce":[],"urlList":[]}}