{"title":"Mid Morning Matters with Alan Partridge - COMPLETE - Season 1, 2","uid":15554935,"size":1746739822,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b78e3143b7beeb2f9e80eb1f34eb82af94a68be&amp;dn=Mid+Morning+Matters+with+Alan+Partridge+-+COMPLETE+-+Season+1%2C+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":5,"uploader":"7436746","files":13,"time":1471055749,"description":"http://www.imdb.com/title/tt1923623/\r\n\r\nFamous DJ Alan Partridge gives us an insight into what happens behind the microphone at North Norfolk digital radio.\r\nStars: Steve Coogan, Tim Key, Simon Greenall\r\n \nhttps://www.wikiwand.com/en/Mid_Morning_Matters_with_Alan_Partridge\r\n\r\nMid Morning Matters is a British digital radioshow parody written by Steve Coogan, Neil Gibbons, Rob Gibbons and Armando Iannucci, produced by Baby Cow Productions and funded by the British arm of Australian lager company Foster's, starring Coogan as fictional radio DJ Alan Partridge. The first of twelve 15-minute episodes was uploaded to the Foster's Funny website on 5 November 2010, and then available on YouTube. Six 30-minute episodes titled Alan Partridge Mid Morning Matters: Special Edition, edited from the web series, began airing on Sky Atlantic HD in July 2012 as part of a deal between producers Baby Cow and BSkyB.[1] A second series consisting of six episodes was announced on 1 July 2014 to air on Sky Atlantic in 2016[2] with a premiere date of 16 February.[3]\r\n\r\nPlot\r\nThe show is shot from the perspective of a Webcam in the studio of fictional station 'North Norfolk Digital'. In Mid Morning Matters Alan Partridge (Steve Coogan) is back working as a disc jockey, after the failure of his television career. He is occasionally joined by 'Side-kick Simon' (Tim Key) who eventually leaves or is fired due to Alan's gradual dislike towards him. Alan is noticeably annoyed when he discovers that Simon has started guesting as a side-kick on another radio show (Bedtime with Branning). Much of the comedy surrounding Simon stems from his failure to grasp political correctness on sensitive issues, forcing Alan to deal with his slip-ups. After Simon's departure, Alan recruits a new side-kick, Zoe (Pippa Duffy), and quickly develops a crush on her. In the final part of series one, Zoe reveals she is going travelling for three months, much to Alan's disappointment. The episode ends with a shot through the window into the recording booth as Zoe hugs Alan and gives him a kiss on the cheek; there is no sound and it is unknown what Alan has said to warrant this reaction. This is a rare low-key ending to an Alan Partridge series with the high point coming in Episode 10 when Alan rebukes Side-kick Simon for his role in a practical joke on him","torrent":{"xt":"urn:btih:9b78e3143b7beeb2f9e80eb1f34eb82af94a68be","amp;dn":"Mid+Morning+Matters+with+Alan+Partridge+-+COMPLETE+-+Season+1%2C+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b78e3143b7beeb2f9e80eb1f34eb82af94a68be","infoHashBuffer":{"type":"Buffer","data":[155,120,227,20,59,123,238,178,249,232,14,177,243,78,184,42,249,74,104,190]},"announce":[],"urlList":[]}}