{"title":"Passware Kit Forensic 12.5 Build 6875 Retail (Keygen-FFF) [Ching","uid":8986995,"size":54403938,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9ba9f17a2f843453fc980ed739e357cb072131b1&amp;dn=Passware+Kit+Forensic+12.5+Build+6875+Retail+%28Keygen-FFF%29+%5BChing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"Ching_Liu","files":-1,"time":1380692280,"description":"Reduce time spent on recovering passwords, improve recovery rates, and get more control over the password recovery process.\n\nKey Features \n\n-Recovers passwords for 200+ file types and decrypts hard disks providing an all-in-one user interface Updated!\n-Supports batch file processing Updated!\n-Scans computers and network for password-protected files and encrypted hard disk images (Encryption Analyzer Professional included) New!\n-Acquires memory images of the seized computers (FireWire Memory Imager included)\n-Retrieves electronic evidence in a matter of minutes from a Windows Desktop Search Database (Search Index Examiner included)\n-Recovers Mac User Login passwords and FileVault2 keys from computer memory\n-Supports Distributed and Cloud Computing password recovery\n-Runs from a USB thumb drive and recovers passwords without installation on a target PC (Portable Version included)\n-Available as SDK for .NET\n-Includes 1-year Subscription to updates\n\nGeneral Features\n\n-Instantly recovers many password types\n-Instantly decrypts MS Word and Excel files up to version 2003 (20 Credits for Decryptum attack included)\n-Resets passwords for Local and Domain Windows Administrators instantly\n-Recovers encryption keys for hard disks protected with BitLocker in minutes, including BitLocker ToGo\n-Decrypts TrueCrypt, FileVault2, and PGP volumes in minutes\n-Recovers passwords for Windows users from a memory image or a standalone SAM file, including UPEK\n-Recovers passwords for Facebook, Google, and other websites from live memory images or hibernation files\n-Recovers passwords for iTunes backups: both iPad and iPhone\n-Instantly recovers passwords for email, websites and network connections from standalone registry files\n-Extracts passwords from encrypted Mac keychain files\n-Extracts passwords from Windows/Unix/Mac hashes\n-Provides 9 different password recovery attacks (and any combination of them) with an easy-to-use setup wizard and drag &amp; drop attacks editor\n-Uses multiple-core CPUs and NVIDIA and ATI GPUs efficiently to speed up the password recovery process by up to 100 times Updated!\n-Uses Tableau TACC hardware accelerators to speed up the password recovery process by up to 25 times\n-Provides detailed reports with MD5 hash values\n-Integrated with Guidance EnCase v.7 or higher\n\nBenefits for Computer Forensics \n\nThis complete electronic evidence discovery solution reports all password-protected items on a computer and gains access to these items using the fastest decryption and password recovery algorithms. Many types of passwords are recovered or reset instantly, and advanced acceleration methods are used to recover difficult passwords. Passware Kit Forensic introduces batch file processing and a new attacks editor, which sets up the password recovery process in the most precise way to provide the quickest decryption solution possible. The highest performance is achieved with Distributed Password Recovery, using the computing power of multiple computers. \n\nPassware Kit Forensic includes a Portable version that runs from a USB drive and finds encrypted files, recovers files and websites passwords without modifying files or settings on the host computer. Perform a complete encrypted evidence discovery process without installing Passware Kit on a target PC.\n\nPassware Kit Forensic, complete with Passware FireWire Memory Imager, is the first and only commercial software that instantly decrypts BitLocker, TrueCrypt, FileVault2, and PGP hard disks, MS Office 2013 documents, as well as instantly recovers passwords for websites, Windows and Mac users, by analyzing hibernation files and live memory images acquired via FireWire.\n\nNEW IN PASSWARE KIT 12.5\n\n-Encrypted volumes and hard disk images are detected during a computer scan\n-Unprotected files are created automatically for batch processes\n-Hardware acceleration: AMD ATI cards are now supported for MS Office 2013, Zip, and Apple iTunes password recovery\n-Memory analysis: Passwords are extracted from Windows 8 hibernation files\n-Password recovery for MS Outlook 2013 and Peachtree 2013\n\nSystem Requirements\n\n-Microsoft Windows XP, Vista, Server 2003/2008/2012, or Windows 7/8 (32-bit or 64-bit) installed and configured on your system\n-1 GHz processor (2.4 GHz recommended)\n-512 MB of RAM (1 GB recommended)\n-150 MB of free hard disk space (more if you use custom dictionaries)\n\nPassware software supports PC platforms only. However, it can recover passwords for some files created on Macintosh such as FileMaker. You can run Passware products on a Virtual PC or Parallels Desktop to unprotect your files.\n\nFor Windows Key, a Windows Setup 32-bit CD is required, as well as a burning CD-RW drive in order to record a password reset CD instead of the USB disk. \n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.lostpassword.com/kit-forensic.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lostpassword.com/kit-forensic.htm&lt;/a&gt;","torrent":{"xt":"urn:btih:9ba9f17a2f843453fc980ed739e357cb072131b1","amp;dn":"Passware+Kit+Forensic+12.5+Build+6875+Retail+%28Keygen-FFF%29+%5BChing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ba9f17a2f843453fc980ed739e357cb072131b1","infoHashBuffer":{"type":"Buffer","data":[155,169,241,122,47,132,52,83,252,152,14,215,57,227,87,203,7,33,49,177]},"announce":[],"urlList":[]}}