{"title":"Sexually Broken--MILF-tastic Syren De Mer on fucking machine for","uid":9199731,"size":901573601,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9c54e03c365dc768b2c32710a5a5cba1a22dbb32&amp;dn=Sexually+Broken--MILF-tastic+Syren+De+Mer+on+fucking+machine+for&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"merzedes","files":-1,"time":1384566583,"description":"MILF-tastic Syren De Mer on a fucking machine for the 1st time while 2 cocks use her throat hole! | Syren De Mer | Matt Williams\n\nNovember 15, 2013\n\n\nMP4 only.\n\n\nSyren De Mer is a lifestyle swinger that got into porn because she is a complete and total pervert that likes fucking strange and showing her body off. She is a chiseled MILF that simply can't get her fill of cock and eagerly seeks the subspace you get from being throughly cockdrunk.\n\nYou wouldn't think someone as experienced as Syren would have any cherries left to pop, but she gives up not one but two today. Here at Sexuallybroken we like them clean-shaven, and Syren agrees to go completely smooth for a shoot for the very first time. We are flattered. So flattered we take her freshly shaven pussy and pop it onto a fucking machine for the very first time. Bound on a Y-shaped wooden device with her head dangling down, her throat is perfectly exposed for the onslaught of dick she is about to receive. And while her throat is mercilessly drilled, all the while the fucking machine will be mercilessly drilling on the other end.\n\nThe fucking machine is ramped up and the thrust of it is so hard and deep you can see Syren's taunt stomach bulging from the force of it. We can guarantee that no matter how much swinging this MILF has done, she has never been dicked down like this before. As she gasps from the overwhelming sensation, her wide open mouth makes a perfect target and we simply walk right up and own her tonsils. One after another the cocks make themselves at home. She can't escape, she can't wiggle, all she can do is suck the dick.\n\nNot content with the drilling Syren is receiving, we add the vibrator in top of it. It works, and the results are instant and undeniable. The bondage, the dick, the fucking, the orgasms, it all gels into the perfect storm of sex, and you can literally see as Syren slips off into subspace. She is reduced to a sweaty, moaning, dizzy shell of a swinger that doesn't even know which end is up. Thank you for the cherries Syren! \n\nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_15sdemer3/SexuallyBroken-Syren-De-Mer-MILF-tastic-Syren-De-Mer-on-a-fucking-machine-for-the-1st-time-while-2-cocks-use-her-throat-hole.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_15sdemer3/SexuallyBroken-Syren-De-Mer-MILF-tastic-Syren-De-Mer-on-a-fucking-machine-for-the-1st-time-while-2-cocks-use-her-throat-hole.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:9c54e03c365dc768b2c32710a5a5cba1a22dbb32","amp;dn":"Sexually+Broken--MILF-tastic+Syren+De+Mer+on+fucking+machine+for","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c54e03c365dc768b2c32710a5a5cba1a22dbb32","infoHashBuffer":{"type":"Buffer","data":[156,84,224,60,54,93,199,104,178,195,39,16,165,165,203,161,162,45,187,50]},"announce":[],"urlList":[]}}