{"title":"Learning and Memory - A Comprehensive Reference","uid":15567974,"size":46692936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c7b5737d0c2966d5651ed08fd419fecb970df6a&amp;dn=Learning+and+Memory+-+A+Comprehensive+Reference&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"clouderone","files":1,"time":1471226472,"description":"Learning and Memory - A Comprehensive Reference - John H. Byrne (AP, 2008).pdf\r\n\r\nThe study of Learning and Memory is a central topic in Neuroscience and Psychology. It is also a very good example of a field that has come into maturity on all levels - in the protein chemistry and molecular biology of the cellular events underlying learning and memory, the properties and functions of neuronal networks, the psychology and behavioural neuroscience of learning and memory. Many of the basic research findings are directly applicable in the treatment of diseases and aging phenomena, and have found their way into educational theory and praxis.\r\n\r\nLearning and Memory - A comprehensive reference is the most comprehensive source of information about learning and memory ever assembled, and the definitive reference work on the topic. In four volumes, Editor-in-Chief John H. Byrne (University of Texas), together with volume editors Howard Eichenbaum (Boston University) for Systems and Neuroscience, Randolf Menzel (Freie Universität Berlin) for Behavioral Approaches, Henry Roediger (Washington University) for Cognitive Psychology, and David Sweatt (University of Alabama, Birmingham) for Molecular Mechanisms, have put together a truly authoritative collection of overview articles in 159 chapters on over 3000 pages. Learning and Memory - A Comprehensive Reference presents an extensive, integrated summary of the present state of research in the neurobiology and psychology of learning and memory and covers an enormous range of intellectual territory. With topics ranging from the neurochemistry and neurobiology of learning at the cellular and synaptic levels, systems neurobiology, the study of remarkable capabilities in animals (such as homing), ethological and behavioristic analyses, mechanisms, psychology, and disorders of learning and memory in humans, the work broadly covers all topics in the neurobiology and psychology of learning and memory. There is no other handbook with such a comprehensive coverage and depth. The authors selected are the leading scholars for the particular topics on which they write. \r\n\r\n* The most comprehensive and authoritative resource available on the topic of learning and memory and its mechanisms \r\n* Representing outstanding scholarship, each chapter is written by a leader in the field and an expert in the topic area\r\n* Relevant and useful for newcomers and advanced researchers alike\r\n* All topics represent the most up to date research\r\n* A must have set for all medical, neuroscience and psychology libraries, and of great value to neighbouring disciplines, including education \r\n* Selected chapters from the on-line version can be used to great effect in teaching\r\n* Full color throughout, hundreds of illustrations, four volumes, 159 chapters, 3000 pages\r\n* Available in print and on-line","torrent":{"xt":"urn:btih:9c7b5737d0c2966d5651ed08fd419fecb970df6a","amp;dn":"Learning+and+Memory+-+A+Comprehensive+Reference","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c7b5737d0c2966d5651ed08fd419fecb970df6a","infoHashBuffer":{"type":"Buffer","data":[156,123,87,55,208,194,150,109,86,81,237,8,253,65,159,236,185,112,223,106]},"announce":[],"urlList":[]}}