{"title":"Functional Neurosurgery (Neurosurgical Operative Atlas) 2nd Ed [","uid":10688992,"size":21542781,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9cd85c7639506f0fc6772ead6c298d7f6c2693d9&amp;dn=Functional+Neurosurgery+%28Neurosurgical+Operative+Atlas%29+2nd+Ed+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"tahir99","files":1,"time":1407096658,"description":"Functional Neurosurgery (Neurosurgical Operative Atlas)\n\nby Phillip A. Starr (Editor), Nicholas M. Barbaro (Editor), Paul S. Larson (Editor)\n\nTRUE PDF, BOOKMARKED\n\nimage\n\nISBN-13: 978-1588903990 | ISBN-10: 1588903990 | Edition: 2nd Edition | November 11, 2008\n\n\nPart of the second edition of the classic Neurosurgical Operative Atlas series, Functional Neurosurgery provides step-by-step guidance on the innovative and established techniques for managing epilepsy, pain, and movement disorders. This atlas covers the current surgical procedures, providing concise descriptions of indications and surgical approaches, as well as recommendations for how to avoid and manage postoperative complications. The authors describe the underlying physiological principles and state-of-the art recording techniques that are used for brain localization. This edition addresses topics that are rarely covered in other texts, including motor cortex stimulation for neuropathic pain, novel technical approaches for insertion of deep brain stimulator electrodes, and radiosurgery for movement disorders.\n\nHighlights:\n\nNew chapters on the evolving indications for deep brain stimulation, frameless neuronavigation techniques, and interventional MRI-guided treatments\nMore than 650 high-quality images demonstrating anatomy and surgical steps\nConsistent format in all chapters to enhance ease of use\n\nIdeal for neurosurgeons and residents, this operative atlas is a practical surgical guide that will serve as both a reference and a refresher prior to performing a specific procedure.\n\nSeries descriptionThe American Association of Neurological Surgeons and Thieme have collaborated to produce the second edition of the acclaimed Neurosurgical Operative Atlas series. Edited by leading experts in the field, the series covers the entire spectrum of neurosurgery in five volumes. In addition to Functional Neurosurgery, the series also features:\n\nNeuro-Oncology, edited by Behnam Badie\nSpine and Peripheral Nerves, edited by Christopher Wolfla and Daniel K. Resnick\nPediatric Neurosurgery, edited by James Tait Goodrich ","torrent":{"xt":"urn:btih:9cd85c7639506f0fc6772ead6c298d7f6c2693d9","amp;dn":"Functional+Neurosurgery+%28Neurosurgical+Operative+Atlas%29+2nd+Ed+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cd85c7639506f0fc6772ead6c298d7f6c2693d9","infoHashBuffer":{"type":"Buffer","data":[156,216,92,118,57,80,111,15,198,119,46,173,108,41,141,127,108,38,147,217]},"announce":[],"urlList":[]}}