{"title":"Natures Pharmacopeia - 1st Edition (2016) (Epub) Gooner","uid":15749200,"size":54329622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9cf26c34ec65a5aceed3dc2be3bb3c982d31f3fc&amp;dn=Natures+Pharmacopeia+-+1st+Edition+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1473010366,"description":"Natures Pharmacopeia - A World of Medicinal Plants - 1st Edition (2016) (Epub) Gooner\r\n\r\nPublisher: Columbia University Press; 1 edition (27 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 0231166613\r\nISBN-13: 978-0231166614\r\n\r\nThis beautifully illustrated, elegantly written textbook pairs the best research on the biochemical properties and physiological effects of medicinal plants with a fascinating history of their use throughout human civilization, revealing the influence of nature's pharmacopeia on art, war, conquest, and law. By chronicling the ways in which humans have cultivated plant species, extracted their active chemical ingredients, and investigated their effects on the body over time, Nature's Pharmacopeia also builds an unparalleled portrait of these special herbs as they transitioned from wild flora and botanical curiosities to commodities and potent drugs. The book opens with an overview of the use of medicinal plants in the traditional practices and indigenous belief systems of people in the Americas, Africa, Asia, and ancient Europe. It then connects medicinal plants to the growth of scientific medicine in the West. Subsequent chapters cover the regulation of drugs; the use of powerful plant chemicals-such as cocaine, nicotine, and caffeine-in various medical settings; and the application of biomedicine's intellectual frameworks to the manufacture of novel drugs from ancient treatments. Geared toward nonspecialists, this text fosters a deep appreciation of the complex chemistry and cultural resonance of herbal medicine, while suggesting how we may further tap the vast repositories of the world's herbal knowledge to create new pharmaceuticals","torrent":{"xt":"urn:btih:9cf26c34ec65a5aceed3dc2be3bb3c982d31f3fc","amp;dn":"Natures+Pharmacopeia+-+1st+Edition+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cf26c34ec65a5aceed3dc2be3bb3c982d31f3fc","infoHashBuffer":{"type":"Buffer","data":[156,242,108,52,236,101,165,172,238,211,220,43,227,187,60,152,45,49,243,252]},"announce":[],"urlList":[]}}