{"title":"Improving Production with Lean Thinking by Javier Santos, Richar","uid":9378079,"size":4601036,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d531b2b9a1c2ca7273971a793e8c4037f0ca20e&amp;dn=Improving+Production+with+Lean+Thinking+by+Javier+Santos%2C+Richar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"420weedman","files":5,"time":1387654584,"description":"Unique coverage of manufacturing management techniques--complete with cases and real-world examples. \nImproving Production with Lean Thinking picks up where other references on production processes leave off. It is increasingly important to integrate and systematize lean thinking throughout production/manufacturing and the supply chain because the market is becoming more competitive, products are becoming more complex, and product life is getting shorter and shorter. With a practical focus, this book encompasses the science and analytical background for improving manufacturing, control, and design. It covers specific methodologies and tools for: \n* Material flow and facilities layout, including a six step layout design process \n* The design of cellular layouts \n* Analyzing and improving equipment efficiency, including Poka-Yoke, motion study, maintenance, SMED, and more \n* Environmental improvements, including 5S implementation \nWith real-life case studies of successful European and American approaches to lean manufacturing, this reference is ideal for engineers, managers, and researchers in manufacturing and production facilities as well as students. It bridges the gap between production/manufacturing and supply chain techniques and provides a detailed roadmap to improved factory performance.\n[img]http://images.mobilism.org/?dm=MTT9[/img]","torrent":{"xt":"urn:btih:9d531b2b9a1c2ca7273971a793e8c4037f0ca20e","amp;dn":"Improving+Production+with+Lean+Thinking+by+Javier+Santos%2C+Richar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d531b2b9a1c2ca7273971a793e8c4037f0ca20e","infoHashBuffer":{"type":"Buffer","data":[157,83,27,43,154,28,44,167,39,57,113,167,147,232,196,3,127,12,162,14]},"announce":[],"urlList":[]}}