{"title":"Daredevil v3 by Waid 01-36 + Ex (2011-2014|Digital|Zone-Empire+)","uid":9637103,"size":1059688576,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9d95c4ae1feef23f3c834e8ef63330f86a760764&amp;dn=Daredevil+v3+by+Waid+01-36+%2B+Ex+%282011-2014%7CDigital%7CZone-Empire%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":4,"uploader":"VikTSlick","files":-1,"time":1392859983,"description":"Mark Waid, Chris Samnee and a plethora of other artists combine to give Daredevil his due as one of the finest of recent comic book runs comes to an end. This Eisner-Award winning run shows Waid at the top of his form and redefines Matt Murdock for the modern era. After the events of Shadowland and DD: Reborn, a newly invigorated and joyous Murdock returns to New York - despite rumors abounding that he is Daredevil. It quickly becomes clear that that bit of information will be used against him in every trial, so Matt and his partner Foggy figure out a way to make their clients self-reliant. All the while, Daredevil continues to fight crime at night and deals with organized crime, supercriminals, new and old enemies (and some friends!), and problems that even he can't solve - like Foggy's fading health. Waid gives Daredevil a new lease on life, and fills each page with an almost gleeful tone, in complete contrast to the most recent portrayals of the characters. Waid uses Matt's blindness in clever and interesting ways and constantly gives us a feel how Daredevil is so good at what he does through his inner monologue. Gone is the defeatist attitude and it is replaced with a joi de vivre that burts through the page. The tremendous art by Chris Samnee, Marcos Martin and others is wonderful too; through inventive use of paneling and highlights we get a real sense of how Matt functions day-to-day and as a hero. Special mention must be made to colorists Muntsa Vicente and Javier Rodriguez, who give each page tons of vivid splashes and bold choices that really stand out. This is one of the best modern comics in a good long while and it is sad to see it come to an end - but nothing lasts forever, right? Now you can enjoy it too!\n\nI have divided this torrent into 7 parts - though the comic has shorter arcs and such than most stuff these days, I think these 7 divisions are a useful way to break up chunks of the story. These are NOT official meta-titles, just what I thought fit - so feel free to re-organize as you see fit. I have included the relevant tie-in issues to two storylines, Devil and the Details and The Omega Effect. Those are Amazing Spider-Man 677, Avenging Spider-Man 006 and The Punisher 010. The Annual is included as well. Every issue of the main series (+ the annual) is DIGITAL by Zone-Empire, as opposed to previous uploads of this run. The three bonus issues are digital as well; ASM 677 is by TheGroup, AvSM 08 is by Minutemen-InnerDemons, and TP 10 is by Nahga Empire. Thanks to all those scanner groups for their hard work, please seed and enjoy! :-) ","torrent":{"xt":"urn:btih:9d95c4ae1feef23f3c834e8ef63330f86a760764","amp;dn":"Daredevil+v3+by+Waid+01-36+%2B+Ex+%282011-2014%7CDigital%7CZone-Empire%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d95c4ae1feef23f3c834e8ef63330f86a760764","infoHashBuffer":{"type":"Buffer","data":[157,149,196,174,31,238,242,63,60,131,78,142,246,51,48,248,106,118,7,100]},"announce":[],"urlList":[]}}