{"title":"The.Banner.Saga.Update.v2.1.65-RELOADED","uid":9540482,"size":26837523,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9de4c1044ec03174b87b312c3548eaf22ad52283&amp;dn=The.Banner.Saga.Update.v2.1.65-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"Tenguken","files":9,"time":1391033055,"description":"The Banner Saga Update v2.1.65 (c) Versus Evil\n\n01/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\nDISC(S) .. GAME.TYPE ........: Indie, RPG, Strategy\n\nCheck the included .txt file for a list of what's new.\n\nLive through an epic role-playing Viking saga where your strategic choices\ndirectly affect your personal journey. Make allies as you travel with your\ncaravan across this stunning yet harsh landscape. Carefully choose those who\nwill help fight a new threat that jeopardizes an entire civilization. Every\ndecision you make in travel, conversation and combat has a meaningful effect\non the outcome as your story unfolds. Not everyone will survive, but they\nwill be remembered.\nKey Features\n* Player choice that drives your own narrative  every decision you make in\ntravel, conversation and combat has a meaningful effect on the outcome as\nyour story unfolds.\n* Over 25 playable characters from 2 different races, human and varl, the\nhorned giants  embark on your epic journey with a variety of characters from\n7 different classes, each with unique abilities and upgrade options to fit\nyour play style.\n* Strategic combat with consequences - victory or defeat and even the\npermanent loss of a character depends on which characters you choose to take\ninto battle and what decisions you make afterwards.\n* The journey is as important as battle  your role in building and managing\nyour caravan as you travel the vast frozen landscape is critical to not only\nyour own survival but the survival of an entire civilization.\n* An epic Viking saga brought to life in 2D glory  beautifully hand drawn\ncombat sequences and animations, accompanied by an evocative score from\nGrammy-nominated composer Austin Wintory, will immerse you into a fantasy\nrealm inspired by Norse mythology.\n* Multiplayer Combat Enhanced  sharpen your combat skills in the free\nmultiplayer game Factions. Compete against other players with many of the\ncharacter classes you see in The Banner Saga.\n\n1. Unrar.\n2. Install the update.\n3. Copy over the cracked content from the /Crack directory to your game\ninstall directory.\n4. Play the game. Start it using the shortcut created with the main game\ninstaller. If you want to start it using the .exe, add the following\nparameters: &quot;-console --saga saga1/saga1.json.z --new_music --offline&quot;\n5. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:9de4c1044ec03174b87b312c3548eaf22ad52283","amp;dn":"The.Banner.Saga.Update.v2.1.65-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9de4c1044ec03174b87b312c3548eaf22ad52283","infoHashBuffer":{"type":"Buffer","data":[157,228,193,4,78,192,49,116,184,123,49,44,53,72,234,242,42,213,34,131]},"announce":[],"urlList":[]}}