{"title":"The Elder Scrolls IV - Oblivion","uid":7284896,"size":4453339136,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9e66680c289e719e89176fb0162908e89c394bbf&amp;dn=The+Elder+Scrolls+IV+-+Oblivion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"MW2366","files":-1,"time":1337551220,"description":"The Elder Scrolls IV: Oblivion is an action role-playing open world video game developed by Bethesda Game Studios and published by Bethesda Softworks and the Take-Two Interactive subsidiary 2K Games. It is the fourth installment in The Elder Scrolls action fantasy video game series, following The Elder Scrolls III: Morrowind and followed by The Elder Scrolls V: Skyrim.\n\n\n\nNow for instructions\n--------------------\n\n1. After downloading this file, proceed to BURN the file to DVD with any of your favorite ISO programs.\n2. Install the game, after burning it to disc.\n\nEnjoy your crack-free Oblivion, all you need is the disc.\n\n\n\nUploader's Note: Now, as I write this, I have my own burned copy of Oblivion which is taken straight from the disc itself after being physically cracked by my older computer's CD-Drive. So luckily I had these files on my computer at the time as it became unscannable, I still have that disc, and thankfully there's no 'write-protection' (IE DRM, no cracks here!) to Oblivion's retail version.\n\nAlso, this is THE ORIGINAL TES IV: Oblivion, there are NO expansions to it, not that the expansions are hard to find or install either.","torrent":{"xt":"urn:btih:9e66680c289e719e89176fb0162908e89c394bbf","amp;dn":"The+Elder+Scrolls+IV+-+Oblivion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e66680c289e719e89176fb0162908e89c394bbf","infoHashBuffer":{"type":"Buffer","data":[158,102,104,12,40,158,113,158,137,23,111,176,22,41,8,232,156,57,75,191]},"announce":[],"urlList":[]}}