{"title":"Smashing Logo Design (ePUB) {32Skulls}","uid":10987905,"size":19292496,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e8456b988087e7899cc9464d42841092bdcf9b0&amp;dn=Smashing+Logo+Design+%28ePUB%29+%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409946087,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nThe ultimate guide to Logo Design from the world's most popular resource for web designers and developers\nWeb designers and developers now find themselves tasked with designing not only a client's Web site, but also their logo and brand identity. By adding Logo Design to your portfolio, you also add brand skills and unique content. This unparalleled guide dives into the topic of design theory and tells you everything you need to know in order to build remarkable logo. No matter your level of experience, Smashing Magazine covers techniques and best practices in understandable way. You'll look behind the scenes at the art of creating identities. From theory to instruction to inspiration, this must-have book addresses the challenges and rewards of creating a logo that adheres to specific rules of successful design.* Details the process of creating a memorable and unique logo, from finding inspiration to executing the design* Looks at what makes a logo successful, various typefaces to explore, ways to use color, the pros and cons of vector, how to prepare for print, and more* Zeroes in on the research, concepts, and techniques that go into designing an amazing logo* Includes more than 400 never-before-published logos, interviews with established designers, and biographies of logo design masters with case studies of their iconic work* Appeals to a wide range of readers, from aspiring designer to experienced professional\nEncompassing everything about the art of creating identities, this is the only book you need to get started designing today.\n\n\nBy Gareth Hardy\nPublished by John Wiley &amp; Sons in 2011\nEPUB, 304 pages, English","torrent":{"xt":"urn:btih:9e8456b988087e7899cc9464d42841092bdcf9b0","amp;dn":"Smashing+Logo+Design+%28ePUB%29+%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e8456b988087e7899cc9464d42841092bdcf9b0","infoHashBuffer":{"type":"Buffer","data":[158,132,86,185,136,8,126,120,153,204,148,100,212,40,65,9,43,220,249,176]},"announce":[],"urlList":[]}}