{"title":"Daniel Matt - The Essential Kabbalah: Heart of Jewish Mysticism","uid":10495427,"size":2845309,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ea6f6c23e5db3d5617c3565bef09e59607ab452&amp;dn=Daniel+Matt+-+The+Essential+Kabbalah%3A+Heart+of+Jewish+Mysticism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"workerbee","files":-1,"time":1404609664,"description":"\nThe Essential Kabbalah: The Heart of Jewish Mysticism (HarperCollins, 1995).  Edited and translated by Daniel C. Matt.\n\nISBN: 9780062511638 | 240 pages | PDF\n\n\nThis translation of key texts from the Kabbalah for the layperson includes a compact presentation of each primary text and features a practical analysis and vital historical information that offer insight into the various aspects of Jewish mysticism.  The sampling of works ranges from the earliest medieval European texts to 20th-century interpretations, and includes poems, symbolic stories, meditations, and ruminations by such important figures as Moses de Leon, Moses Cordovero, Isaac Luria, and Abraham Isaac Kook.  Matt's translations have both a spareness and a poetic flair that makes reading these highly esoteric selections a richly moving experience.\n\nA short introduction traces the history of Kabbalah, explaining its salient concepts and symbols, and notes provide background on the featured texts and writers.  A brief bibliography is provided for those who want to explore more of these extraordinary texts.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                                 &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:9ea6f6c23e5db3d5617c3565bef09e59607ab452","amp;dn":"Daniel+Matt+-+The+Essential+Kabbalah%3A+Heart+of+Jewish+Mysticism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ea6f6c23e5db3d5617c3565bef09e59607ab452","infoHashBuffer":{"type":"Buffer","data":[158,166,246,194,62,93,179,213,97,124,53,101,190,240,158,89,96,122,180,82]},"announce":[],"urlList":[]}}