{"title":"Learn the Saxophone [DVDRip]","uid":6553905,"size":785231914,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9ed2b75d4233bf26c8fe07cff2c4b31c886c6828&amp;dn=Learn+the+Saxophone+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"pizzaslice","files":2,"time":1311205115,"description":"Movies : Other : DVD Rip : English\n &lt;a href=&quot;\nhttp://tamingthesaxophone.com/saxophone-instruction-dvd.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tamingthesaxophone.com/saxophone-instruction-dvd.html&lt;/a&gt;\n\nXVID, 512 x 384, Qf=0.19, 192 kbs (stereo)\n\nJools Holland &quot;Music Makers&quot; series Saxophone Tuition DVD\n\nFor complete beginners, but useful for the first two or more years of playing\n\nPete has recorded with artists such as REM, Elton John, Joe Jackson and many more. He worked as a teacher of saxophone, composition and jazz/pop performance at Southampton University Music Department from 1999 - 2002 and is now working full time as a TV and film music composer.\n\nHe devised and and presented the Jools Holland &quot;Music Makers&quot; series saxophone instruction video which is now released on DVD. This is available worldwide (currently being translated into Chinese) and is for beginners who want to learn the saxophone in a lighthearted but very practical way. It is geared towards pop, rock and blues saxophone playing, but is also useful if you want to learn to play in many other styles. Learning can be fun!. All of the online saxophone tuition resources and exercises can be used along with the instruction DVD.\n\nIn this program, he introduces beginners to the alto saxophone: the parts of the saxophone and how to assemble them, fitting the reed, posture and breathing, saxophone embouchure, holding and blowing into the saxophone, tuning, fingering, notes and intervals, tonguing and slurring, bending notes and vibrato, the rudiments of reading music and keeping time, scales, triad arpeggios, how to improvise simple songs, and playing the blues.","torrent":{"xt":"urn:btih:9ed2b75d4233bf26c8fe07cff2c4b31c886c6828","amp;dn":"Learn+the+Saxophone+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ed2b75d4233bf26c8fe07cff2c4b31c886c6828","infoHashBuffer":{"type":"Buffer","data":[158,210,183,93,66,51,191,38,200,254,7,207,242,196,179,28,136,108,104,40]},"announce":[],"urlList":[]}}