{"title":"The End of Faith: (Religion, Terror) Sam Harris, AZW3 EPUB MOBI","uid":11533301,"size":2473015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f9ac009558b6239481847eacf1399b8e568e7d0&amp;dn=The+End+of+Faith%3A+%28Religion%2C+Terror%29+Sam+Harris%2C+AZW3+EPUB+MOBI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":3,"uploader":"FreddyFroggy1","files":-1,"time":1416597863,"description":"The End of Faith: Religion, Terror, and the Future of Reason Sam Harris, AZW3 (Kindle) EPUB MOBI, Published 2005.\n\nNon-fiction. Tags: Christianity,  Islam,  Politics,  Religion,  Science.\n\nThis book has appeared here before, but in the copies I have seen, the formatting has not done justice to the content.  Posted for the first time, here are clean(er) versions, which include a new Chapter 10 containing followup material filched from Sam Harris's website. \n\nNatalie Angier wrote in The New York Times: &quot;The End of Faith articulates the dangers and absurdities of organized religion so fiercely and so fearlessly that I felt relieved as I read it, vindicated....Harris writes what a sizable number of us think, but few are willing to say.&quot;\n\nThis important and timely book delivers a startling analysis of the clash of faith and reason in today's world. Harris offers a vivid historical tour of mankind's willingness to suspend reason in favor of religious beliefs, even when those beliefs are used to justify harmful behavior and sometimes-heinous crimes. He asserts that in the shadow of weapons of mass destruction, we can no longer tolerate views that pit one true god against another. Most controversially, he argues that we cannot afford moderate lip service to religion; an accommodation that only blinds us to the real perils of fundamentalism. While warning against the encroachment of organized religion into world politics, Harris also draws on new evidence from neuroscience and insights from philosophy to explore spirituality as a biological, brain-based need. He calls on us to invoke that need in taking a secular humanistic approach to solving the problems of this world.\n\nFirst published in 2004, what Harris has to say about Islam is especially relevant in these (still) troubled times","torrent":{"xt":"urn:btih:9f9ac009558b6239481847eacf1399b8e568e7d0","amp;dn":"The+End+of+Faith%3A+%28Religion%2C+Terror%29+Sam+Harris%2C+AZW3+EPUB+MOBI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f9ac009558b6239481847eacf1399b8e568e7d0","infoHashBuffer":{"type":"Buffer","data":[159,154,192,9,85,139,98,57,72,24,71,234,207,19,153,184,229,104,231,208]},"announce":[],"urlList":[]}}