{"title":"Joan of Arc: A History","uid":15826774,"size":1398399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9fbdaffacdd4f0fbf75350549301bf825e1773a8&amp;dn=Joan+of+Arc%3A+A+History&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"marty14","files":1,"time":1473860156,"description":"Joan of Arc: A History - Helen Castor [epub]\r\n\r\nHelen Castor tells afresh the gripping story of the peasant girl from Domrémy (now called Domrémy-la-Pucelle in her honour) who hears voices from God, leads the French army to victory, is burned at the stake for heresy, and eventually becomes a saint. But unlike the traditional narrative, a story already shaped by the knowledge of what Joan would become and told in hindsight, Castor’s Joan of Arc: A History takes us back to fifteenth century France and tells the story forwards. Instead of an icon, she gives us a living, breathing woman confronting the challenges of faith and doubt, a roaring girl who, in fighting the English, was also taking sides in a bloody civil war. We meet this extraordinary girl amid the tumultuous events of her extraordinary world where no one — not Joan herself, nor the people around her — princes, bishops, soldiers, or peasants — knew what would happen next.\r\n\r\nAdding complexity, depth, and fresh insight into Joan’s life, and placing her actions in the context of the larger political and religious conflicts of fifteenth century France, Joan of Arc: A History is history at its finest and a surprising new portrait of this remarkable woman","torrent":{"xt":"urn:btih:9fbdaffacdd4f0fbf75350549301bf825e1773a8","amp;dn":"Joan+of+Arc%3A+A+History","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fbdaffacdd4f0fbf75350549301bf825e1773a8","infoHashBuffer":{"type":"Buffer","data":[159,189,175,250,205,212,240,251,247,83,80,84,147,1,191,130,94,23,115,168]},"announce":[],"urlList":[]}}