{"title":"A Line in the Sand: The Struggle that Shaped the Middle-East","uid":15789274,"size":1813243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0121e7cfa6a15c92bcecdad0d04691be02b5140&amp;dn=A+Line+in+the+Sand%3A+The+Struggle+that+Shaped+the+Middle-East&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"marty14","files":1,"time":1473369214,"description":"A Line in the Sand: Britain, France and the Struggle that Shaped the Middle East - James Barr [epub]\r\n\r\nIn 1916, in the middle of the First World War, two men secretly agreed to divide the Middle East between them. Sir Mark Sykes was a visionary politician; Francois Georges-Picot a diplomat with a grudge. The deal they struck, which was designed to relieve tensions that threatened to engulf the Entente Cordiale, drew a line in the sand from the Mediterranean to the Persian frontier. Territory north of that stark line would go to France; land south of it, to Britain. Against the odds their pact survived the war to form the basis for the post-war division of the region into five new countries Britain and France would rule. The creation of Britain's 'mandates' of Palestine, Transjordan and Iraq, and France's in Lebanon and Syria, made the two powers uneasy neighbours for the following thirty years.\r\n\r\nThrough a stellar cast of politicians, diplomats, spies and soldiers, including T. E. Lawrence, Winston Churchill and Charles de Gaulle, A Line in the Sand vividly tells the story of the short but crucial era when Britain and France ruled the Middle East. It explains exactly how the old antagonism between these two powers inflamed the more familiar modern rivalry between the Arabs and the Jews, and ultimately led to war between the British and the French in 1941 and between the Arabs and the Jews in 1948. In 1946, after many years of intrigue and espionage, Britain finally succeeded in ousting France from Lebanon and Syria, and hoped that, having done so, it would be able to cling on to Palestine. Using newly declassified papers from the British and French archives, James Barr brings this overlooked clandestine struggle back to life, and reveals, for the first time, the stunning way in which the French finally got their revenge","torrent":{"xt":"urn:btih:a0121e7cfa6a15c92bcecdad0d04691be02b5140","amp;dn":"A+Line+in+the+Sand%3A+The+Struggle+that+Shaped+the+Middle-East","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0121e7cfa6a15c92bcecdad0d04691be02b5140","infoHashBuffer":{"type":"Buffer","data":[160,18,30,124,250,106,21,201,43,206,205,173,13,4,105,27,224,43,81,64]},"announce":[],"urlList":[]}}