{"title":"Chuck Wendig - Life Debt (Star Wars: The Aftermath Trilogy #2)","uid":15559558,"size":2792617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a04eb7cc5ee26f2a29071198904041d9c8193e99&amp;dn=Chuck+Wendig+-+Life+Debt+%28Star+Wars%3A+The+Aftermath+Trilogy+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"skarzz","files":1,"time":1471110625,"description":"Set between the events of Return of the Jedi and The Force Awakens, the never-before-told story that began with Star Wars: Aftermath continues in this thrilling novel, the second book of Chuck Wendig’s New York Times bestselling trilogy.\r\n\r\nIt is a dark time for the Empire. . . . \r\n\r\nThe Emperor is dead, and the remnants of his former Empire are in retreat. As the New Republic fights to restore a lasting peace to the galaxy, some dare to imagine new beginnings and new destinies. For Han Solo, that means settling his last outstanding debt, by helping Chewbacca liberate the Wookiee’s homeworld of Kashyyyk.\r\n\r\nMeanwhile, Norra Wexley and her band of Imperial hunters pursue Grand Admiral Rae Sloane and the Empire’s remaining leadership across the galaxy. Even as more and more officers are brought to justice, Sloane continues to elude the New Republic, and Norra fears Sloane may be searching for a means to save the crumbling Empire from oblivion. But the hunt for Sloane is cut short when Norra receives an urgent request from Princess Leia Organa. The attempt to liberate Kashyyyk has carried Han Solo, Chewbacca, and a band of smugglers into an ambush—resulting in Chewie’s capture and Han’s disappearance.\r\n\r\nBreaking away from their official mission and racing toward the Millennium Falcon’s last known location, Norra and her crew prepare for any challenge that stands between them and their missing comrades. But they can’t anticipate the true depth of the danger that awaits them—or the ruthlessness of the enemy drawing them into his crosshairs","torrent":{"xt":"urn:btih:a04eb7cc5ee26f2a29071198904041d9c8193e99","amp;dn":"Chuck+Wendig+-+Life+Debt+%28Star+Wars%3A+The+Aftermath+Trilogy+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a04eb7cc5ee26f2a29071198904041d9c8193e99","infoHashBuffer":{"type":"Buffer","data":[160,78,183,204,94,226,111,42,41,7,17,152,144,64,65,217,200,25,62,153]},"announce":[],"urlList":[]}}