{"title":"She &amp; Him - Classics (2014) [FLAC]","uid":11581760,"size":227440248,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a055637b5dcaf1c07a76595a320802462716f3db&amp;dn=She+%26amp%3B+Him+-+Classics+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"politux","files":-1,"time":1417135577,"description":"\n  She &amp; Him - Classics (2014) [FLAC]\n\n  Genre: Rock\n  Style: Indie\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 900 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Stars Fell on Alabama \n  02 Oh No, Not My Baby \n  03 It's Not for Me to Say \n  04 Stay Awhile \n  05 This Girl's in Love With You \n  06 Time After Time \n  07 She \n  08 Teach Me Tonight \n  09 It's Always You \n  10 Unchained Melody \n  11 I'll Never Be Free \n  12 Would You Like to Take a Walk? \n  13 We'll Meet Again\n\n  She &amp; Him feature the somewhat unlikely pairing of country-folk artist M. Ward and actress/singer/songwriter Zooey Deschanel. While starring in the 2007 film The Go-Getter, Deschanel was asked by director Martin Hynes to perform a duet with Ward, who had agreed to helm the movie's soundtrack. The two recorded a cover of Richard &amp; Linda Thompson's &quot;When I Get to the Border&quot; and later reconvened in Portland, where they began recording Deschanel's original songs (which the actress had previously demoed for years, but kept secret) in Ward's studio. Drawing upon analog production techniques and a shared love of vintage pop bands, the duo emerged with Volume One, a collection of songs that introduced Deschanel as a singer/songwriter in her own right.\n\n  Released in March 2008, Volume One received support from a number of critics, with Paste magazine even deeming it the year's best album. The duo soon embarked on a summer-long tour, after which Deschanel and Ward began working on a second album. Volume Two arrived in early 2010, cracking the Billboard Top Ten during its first week and paving the way for another successful tour. Drawing inspiration from classic holiday offerings from the likes of the Carpenters, The Beach Boys, and Vince Guaraldi, Ward and Deschanel's third outing under the moniker found the duo tackling their first collection of Christmas music. The resulting A Very She &amp; Him Christmas arrived in October 2011. The pair returned to making their breezy pop in 2013 with Volume 3, an album of summery pop that arrived in the spring of that year. In 2014, the duo announced that a second covers album, following their 2011 Christmas offering, would be released. Titled Classics, the record focuses on the works of legendary musicians such as Aretha Franklin, Dusty Springfield, Frank Sinatra, and Elvis Costello","torrent":{"xt":"urn:btih:a055637b5dcaf1c07a76595a320802462716f3db","amp;dn":"She+%26amp%3B+Him+-+Classics+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a055637b5dcaf1c07a76595a320802462716f3db","infoHashBuffer":{"type":"Buffer","data":[160,85,99,123,93,202,241,192,122,118,89,90,50,8,2,70,39,22,243,219]},"announce":[],"urlList":[]}}