{"title":"J. D. Salinger - Three Stories (edited) (epub, mobi)","uid":9266818,"size":415368,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a079b870e7916c92f59fb7541718d52eff07fa7d&amp;dn=J.+D.+Salinger+-+Three+Stories+%28edited%29+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"pharmakate","files":-1,"time":1385712321,"description":"J. D. Salinger - Three Stories (unpublished, 2013).\n\n\nThe Ocean Full of Bowling Balls\nBirthday Boy\nPaula\nLetter to John Woodman\n\nEpub, mobi, docx\n\nThis torrent consists of edited versions of the three Salinger stories leaked on November 27, 2013. The stories appeared on the internet in the form of image files that seem to be derived from raw OCR text of a scan of the original manuscripts. As such they are often hard to read, since Salinger's manuscripts, the OCR text, and the image files were all in an unfinished state.\n\nFor this release of those stories, the image files were OCR'd, consistent formatting was applied to the output, and the text was proofread and edited for consistency and readability. Obvious errors (some of which were Salinger's, and some of which apparently were introduced via the scanning/OCR process) have been corrected, especially in punctuation, but also in spelling and other areas.\n\nFor &quot;Birthday Boy&quot; and &quot;Paula,&quot; it was necessary to edit the text in several places to make it intelligible. These editorial intrusions into Salinger's text are as minimal as possible; the only goal has been to make the stories readable. In one or two cases the editor was unable to determine the meaning, so the text was not changed; in a few other cases, guesswork was necessary (e.g., &quot;sniped&quot; has here been changed to &quot;snipped&quot;). Others might come to different conclusions about Salinger's intentions.\n\nI highly recommend the stories -- they are not junk, but are moving and beautiful and sometimes frightening.\n\nThe source used for this version can be found here:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/9259575&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/9259575&lt;/a&gt;\n\namong many other places.","torrent":{"xt":"urn:btih:a079b870e7916c92f59fb7541718d52eff07fa7d","amp;dn":"J.+D.+Salinger+-+Three+Stories+%28edited%29+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a079b870e7916c92f59fb7541718d52eff07fa7d","infoHashBuffer":{"type":"Buffer","data":[160,121,184,112,231,145,108,146,245,159,183,84,23,24,213,46,255,7,250,125]},"announce":[],"urlList":[]}}