{"title":"Nassim Nicholas Taleb - Antifragile","uid":7975333,"size":468021903,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a0836305613a6e0b9863bfd21d44e32b09abf855&amp;dn=Nassim+Nicholas+Taleb+-+Antifragile&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"zis123","files":-1,"time":1356968901,"description":"From the best-selling author of The Black Swan and one of the foremost thinkers of our time, Nassim Nicholas Taleb, a book on how some things actually benefit from disorder.\nIn The Black Swan Taleb outlined a problem, and in Antifragile he offers a definitive solution: how to gain from disorder and chaos while being protected from fragilities and adverse events. For what Taleb calls the &quot;antifragile&quot; is actually beyond the robust, because it benefits from shocks, uncertainty, and stressors, just as human bones get stronger when subjected to stress and tension. The antifragile needs disorder in order to survive and flourish.\nTaleb stands uncertainty on its head, making it desirable, even necessary, and proposes that things be built in an antifragile manner. The antifragile is immune to prediction errors. Why is the city-state better than the nation-state, why is debt bad for you, and why is everything that is both modern and complicated bound to fail? The audiobook spans innovation by trial and error, health, biology, medicine, life decisions, politics, foreign policy, urban planning, war, personal finance, and economic systems. And throughout, in addition to the street wisdom of Fat Tony of Brooklyn, the voices and recipes of ancient wisdom, from Roman, Greek, Semitic, and medieval sources, are heard loud and clear.\nExtremely ambitious and multidisciplinary, Antifragile provides a blueprint for how to behave - and thrive - in a world we don't understand, and which is too uncertain for us to even try to understand and predict. Erudite and witty, Taleb's message is revolutionary: What is not antifragile will surely perish.","torrent":{"xt":"urn:btih:a0836305613a6e0b9863bfd21d44e32b09abf855","amp;dn":"Nassim+Nicholas+Taleb+-+Antifragile","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0836305613a6e0b9863bfd21d44e32b09abf855","infoHashBuffer":{"type":"Buffer","data":[160,131,99,5,97,58,110,11,152,99,191,210,29,68,227,43,9,171,248,85]},"announce":[],"urlList":[]}}