{"title":"Hardtied--Dirty Slut  Lorelei Lee  Matt Williams High","uid":15742531,"size":2130110785,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:a08ff72de9ed5ea252fa60b36a1d51d3c6bfe6c2&amp;dn=Hardtied--Dirty+Slut++Lorelei+Lee++Matt+Williams+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"merzedes","files":1,"time":1472934429,"description":"Dirty Slut | Lorelei Lee | Matt Williams\r\n\r\nAugust 31, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nGood Girl Gets Treated Rough Like She Likes \r\n\r\nIf you saw Lorelei Lee walking down the street you might think at first that she was a classic good girl. In her everyday life she gives off an air of innocence and sweetness. But we know Lorelei better than all that. We know just the kind of nasty, messed up shit she likes to do and to have done to her. And since we are in the position of being readily able to provide those things to her, we consider it our duty and our pleasure to do so. \r\n\r\nFirst Matt Williams gets her tied up standing with her arms and legs spread by ropes at each of her wrists and ankles. With her all strung up spread eagle it's much easier for him to get to all the vulnerable spots that make Lorelei squeal like the filthy slut she is. He sets up a rope wrapped around her waist and threaded through her pussy and ties a rock at the end so it pulls against her. Then he takes his flogger and starts beating her tits and her ass until she starts shrieking through her ball gag. When the drool starts pouring out from her mouth he puts away the flogger and takes out the hitachi so he can break up her beatings with some entertainment.\r\n\r\nNext he ties Lorelei down to a small table on her back with her legs spread, but now Matt is more focused on her little bare feet and what torment he can give through them. He takes out a cane and starts whacking them so hard you can hear the cane as it tears through the air. He keeps going at her mercilessly, offering her feet a break only if he gets to beat her pussy. She isn't agreeing to it, but he still wants to play with her between her legs, so he takes out the hitachi and presses it against her clit until she cums for him as much as he likes. \r\n\r\nScreens \nhttp://www.hardtied.com/hogtied/bondage/trailer.php?y=2016&amp;p=08_31llee&amp;u=Hardtied-Lorelei-Lee-Dirty-Slut\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:a08ff72de9ed5ea252fa60b36a1d51d3c6bfe6c2","amp;dn":"Hardtied--Dirty+Slut++Lorelei+Lee++Matt+Williams+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a08ff72de9ed5ea252fa60b36a1d51d3c6bfe6c2","infoHashBuffer":{"type":"Buffer","data":[160,143,247,45,233,237,94,162,82,250,96,179,106,29,81,211,198,191,230,194]},"announce":[],"urlList":[]}}