{"title":"SketchUp 2014 for Architectural Visualization","uid":10591199,"size":23177606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a11632d86a3b78bb06b85619bea6f8d81f871604&amp;dn=SketchUp+2014+for+Architectural+Visualization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"freeshare4all","files":1,"time":1405799747,"description":"\n\nOverview\n\nTake advantage of the new features of SketchUp 2014\nCreate picture-perfect photo-realistic 3D architectural renders for your SketchUp models\nPost-process SketchUp output to create digital watercolor and pencil art\nMake the most of SketchUp with the best plugins and add-on software to enhance your models\nIn Detail\n\nSketchUp is an amazing and remarkably powerful 3D modeling software used by millions of architects, visualizers, and drafters across the globe. It allows you to create animated 3D drawings and photorealistic renderings that approximate real-life objects easily.\n\nThis book is the perfect introduction to SketchUp 2014. It will help you to get started quickly and efficiently to produce and present commercial quality photorealistic or artistic outputs of your designs. It will teach you how to plan and set up the content of your scenes, use SketchUp and professional rendering software to produce stunning visuals and animations, and how to add an artistic touch to your images.\n\nWhat you will learn from this book\n\nProduce a photorealistic rendering of a scene modeled in SketchUp\nRender ultra-realistic soft shadows from multiple light sources\nMaster the low polygon modeling techniques that you need to adopt for visualizations\nWork with texturing techniques utilizing PhotoMatch and your own digital photos\nEnhance your models by adding depth of field and other postprocessing tricks in GIMP\nDevise movie-set scenes to digitally photograph your projects\nEnhance your SketchUp scenes by adding lamps, sun, and sky lighting\nAdd smooth camera paths for airborne and walk-through animations\nLearn all of the simple tricks to ensure you get great-looking models when rendered\nApproach\n\nBeginning with a quick start tutorial which will get you up and running with SketchUp 2014 quickly, you will move on to learning the key skills you will need to wow your clients with stunning visualizations through a series practical steps, tips and tricks.\n\nWho this book is written for\n\nIf you are a SketchUp user, from an amateur right through to an architectural technician, professional architect, or designer, this is the book for you. This book is also suitable as a companion to any architectural design or multimedia course, and is accessible to anyone who has learned the basics of SketchUp.","torrent":{"xt":"urn:btih:a11632d86a3b78bb06b85619bea6f8d81f871604","amp;dn":"SketchUp+2014+for+Architectural+Visualization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a11632d86a3b78bb06b85619bea6f8d81f871604","infoHashBuffer":{"type":"Buffer","data":[161,22,50,216,106,59,120,187,6,184,86,25,190,166,248,216,31,135,22,4]},"announce":[],"urlList":[]}}