{"title":"Rail Atlas - Great Britain &amp; Ireland (Train History).pdf","uid":15789073,"size":19646823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1dc3d6af1a3b87f7e8b83ebb509b88dd1225f90&amp;dn=Rail+Atlas+-+Great+Britain+%26amp%3B+Ireland+%28Train+History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"STBGD","files":1,"time":1473367469,"description":"Rail Atlas: Great Britain &amp; Ireland\r\nIan Allan Publishing | 2005 | 0860935760 | English | 136 pages | PDF | 19 MB\r\n\r\nThere are a number of books that need no real introduction. Mention the word 'Wisden' and every cricket enthusiast will know precisely what is being discussed. Similarly, a classical music lover will react instantly to the mention of the word 'Groves' and the antique collector to the name 'Lyle'. In railway publishing, there is one but one title that is instantly recognisable in these terms. Mention 'Baker' to anyone with a knowledge of the subject, be it as a professional or as an enthusiast, and immediately they will know without doubt the subject of the conversation. Since it was first published in 1977, Stuart Baker's Rail Atlas Great Britain and Ireland has established itself as one of the must-have books on the subject of the contemporary railway industry. Now into its 10th edition, as well as several reprints, the book is probably one of the best-selling railway titles of the time. The ninth edition of the book was published in 2000 and in the four years since that edition was compiled, much has happened to the railway infrastructure of the British Isles. The first section of the country's first purpose-built high-speed line, linking London to the Channel Tunnel, has been completed and work of the West Coast modernisation plan continue apace. Newly electrified routes, such as that from Crewe to Stoke, feature as do the virtually complete Light Rail schemes for Dublin and Nottingham. An essential work of reference for both railway professionals and enthusiasts, the ninth edition quickly sold out and was rapidly reprinted. This new and fully revised 10th edition is certain to sell as well as previous editions","torrent":{"xt":"urn:btih:a1dc3d6af1a3b87f7e8b83ebb509b88dd1225f90","amp;dn":"Rail+Atlas+-+Great+Britain+%26amp%3B+Ireland+%28Train+History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1dc3d6af1a3b87f7e8b83ebb509b88dd1225f90","infoHashBuffer":{"type":"Buffer","data":[161,220,61,106,241,163,184,127,126,139,131,235,181,9,184,141,209,34,95,144]},"announce":[],"urlList":[]}}