{"title":"Brutus of Troy and the Quest for the Ancestry of the British","uid":15796380,"size":6175539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a243f168e3f62d99f77064c489f9963e20839429&amp;dn=Brutus+of+Troy+and+the+Quest+for+the+Ancestry+of+the+British&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"marty14","files":1,"time":1473461714,"description":"Brutus of Troy and the Quest for the Ancestry of the British - Anthony Adolph [epub]\r\n\r\nJust who did the British think they were? For much of the last 1,500 years, when the British looked back to their origins they saw the looming mythological figure of Brutus of Troy. A great-great-grandson of the love goddess Aphrodite through her Trojan son Aeneas (the hero of Virgil's Aeneid), Brutus accidentally killed his father and was exiled to Greece. He liberated the descendants of the Trojans who lived there in slavery and led them on an epic voyage to Britain.\r\n\r\nLanding at Totnes in Devon, Brutus overthrew the giants who lived in Britain, laid the foundations of Oxford University and London and sired a long line of kings, including King Arthur and the ancestors of the present Royal Family.Invented to give Britain a place in the overarching mythologies of the Classical world and the Bible, Brutus's story long underpinned the British identity and played a crucial role in royal propaganda and foreign policy. His story inspired generations of poets and playwrights, including Spenser, Shakespeare, Milton, Pope, Wordsworth, Dickens and Blake, whose hymn 'Jerusalem' was a direct response to the story of Brutus founding London as the New Troy in the west.\r\n\r\nLeading genealogist Anthony Adolph traces Brutus's story from Roman times onwards, charting his immense popularity and subsequent fall from grace, along with his lasting legacy in fiction, pseudo-history and the arcane mythology surrounding some of London's best-known landmarks, in this groundbreaking biography of the mythological founder of Britain","torrent":{"xt":"urn:btih:a243f168e3f62d99f77064c489f9963e20839429","amp;dn":"Brutus+of+Troy+and+the+Quest+for+the+Ancestry+of+the+British","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a243f168e3f62d99f77064c489f9963e20839429","infoHashBuffer":{"type":"Buffer","data":[162,67,241,104,227,246,45,153,247,112,100,196,137,249,150,62,32,131,148,41]},"announce":[],"urlList":[]}}