{"title":"The Sims 2 - University [Multi 16, Includes English &amp; Spanish]","uid":5562615,"size":861594573,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a255dd0bebbb38be29cea482b6c7359b831c14b8&amp;dn=The+Sims+2+-+University+%5BMulti+16%2C+Includes+English+%26+Spanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"Slash701","files":5,"time":1273881229,"description":"Game Title: The Sims 2 - University\nYear: 2005\nLanguages: 16 languages, including Spanish, English, Chinese &amp; Korean.\n\n\n\n\nThe Sims 2: University is the first expansion pack for the strategic life simulation computer game The Sims 2 developed by Maxis and published by Electronic Arts. It was released on March 1, 2005 to mixed reception. The expansion pack allows the player's Sims to become Young Adults and go to University to earn a degree, allowing them to take up any one of four graduate-exclusive careers. The expansion added several key gameplay elements which have been included in all expansions succeeding it. The Sims 2: University has won two Editor's Choice awards from syndicated game review publications.\n\n\nUniversity adds a simple instrument system, composed of the new Guitar, Drum Kit and Bass objects. Multiple Sims can play together. Sims can make money by playing at their homes or at community lots such as music clubs or coffee shops. The Sims can play three different types of musical styles with these instruments and once a Sim begins playing one of the styles, the others who pick up instruments to play join into the same style. Although Sims cannot have actual vocalists, the new action &quot;Freestyle&quot; or &quot;Freestyle For Tips&quot; will allow another Sim to rap along (in Simlish) to the instruments being played or a cappella to have fun and annoy or entertain other Sims nearby. Students also have a variety of new objects centered around college life, including a fruit juice keg , togas, ramen noodles, and a bubble blowing machine.\nUniversity also adds the Young Adult life stage between Teen and Adult. Only Sims at college become Young Adults, and any Sims who do not attend college make the transition directly to adults. The new college towns are linked to a specific neighborhood and preserve the same separation home neighborhoods do. University comes with three pre-packaged college towns: Sim State University, La Fiesta Tech, and AcadÃƒÂ©mie Le Tour. In the towns are three further types of residential: dorms, private housing, and Greek Houses, although there are no Greek Houses in AcadÃƒÂ©mie Le Tour. In communal dorms, NPC Sims fill in the house vacancies. Custom dorms cannot be built without the use of cheat codes. A Sim with enough scholarship money may start out in a private house. Greek Houses function the same as a dormitory, but have increased Relationship and Motive benefits. The premade neighborhoods generally include recreation centers, libraries, and other student centers.\n\n\nThis includes the ORIGINAL SERIAL &amp; THE CRACK (It doesn't have virus)\nif you do not trust me, just ... do not download.\nUPLOADED BY SLASH701 ","torrent":{"xt":"urn:btih:a255dd0bebbb38be29cea482b6c7359b831c14b8","amp;dn":"The+Sims+2+-+University+%5BMulti+16%2C+Includes+English+%26+Spanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a255dd0bebbb38be29cea482b6c7359b831c14b8","infoHashBuffer":{"type":"Buffer","data":[162,85,221,11,235,187,56,190,41,206,164,130,182,199,53,155,131,28,20,184]},"announce":[],"urlList":[]}}