{"title":"American Cake (2016) (Epub) Gooner","uid":15789507,"size":46861211,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a259180bf77acdf02d8e490225a3499beaf7924e&amp;dn=American+Cake+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1473375543,"description":"American Cake - From Colonial Gingerbread to Classic Layer, the Stories and Recipes Behind More Than 125 of Our Best-Loved Cakes (2016) (Epub) Gooner\r\n\r\nPublisher: Rodale Books (13 Oct. 2016)\r\nLanguage: English\r\nISBN-10: 1623365430\r\nISBN-13: 978-1623365431\r\n\r\nCakes in America aren't just about sugar, flour, and frosting. They have a deep, rich history that developed as our country grew. The American people, their home towns, good times, and hard times played a role in creating our country and its new and distinctive cakes. \r\n\r\nIn American Cake, author Anne Byrn takes readers on a journey through American history via cake, beginning with the early colonies and continuing to the present. It is a collection of stories behind well-known cakes such as the Angel Food, Red Velvet, Pineapple Upside-Down, and the Brownie, as well as an introduction to lesser known cakes such as the Burnt Leather, Cold Oven Pound Cake, Tres Leches, and more. The recipes reveal what was happening in our nation's history at the time they were first baked, and have been adapted to the modern kitchen. From the dark, moist gingerbread of New England, to the elegant pound cake of Virginia, to the hard-scrabble apple stack cake of Appalachia, to deep-south Caramel, Hawaiian Chantilly, Alaskan rhubarb, and modern California cakes of orange and olive oil, cake in America is fascinating to the cook, the traveller, the historian, and anyone who loves a good story. And in addition to the stories, American Cake contains more than 100 recipes, colour photographs, and historical photos that help transport the reader back in time","torrent":{"xt":"urn:btih:a259180bf77acdf02d8e490225a3499beaf7924e","amp;dn":"American+Cake+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a259180bf77acdf02d8e490225a3499beaf7924e","infoHashBuffer":{"type":"Buffer","data":[162,89,24,11,247,122,205,240,45,142,73,2,37,163,73,155,234,247,146,78]},"announce":[],"urlList":[]}}