{"title":"When Body Language Goes Bad: A Dilbert Book -Mantesh","uid":8562656,"size":23955549,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2b2ae1ae251f3781afcfe115e7bd81dd91c6100&amp;dn=When+Body+Language+Goes+Bad%3A+A+Dilbert+Book+-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"MANTESH","files":1,"time":1370923805,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/71yTyj9ZpTL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/71yTyj9ZpTL.jpg&lt;/a&gt;\n\n\nWhen Body Language Goes Bad: A Dilbert Book\n\n\nPublisher: Andrews McMeel Publishing\nScott Adams \n2003 \nLanguage: English\nISBN-10: 0740732986\nISBN-13: 978-0740732980\nEPUB \n128 Pages\n23 MB\n\n &quot;Dilbert is easily one of the most clever and consistently funny comics in current circulation. Like all great comic strips, it provides a much-needed daily dose of comedy and, most importantly, keeps its finger firmly planted on the pulse of truth while doing so.&quot; Some might think that the corporate scandals of 2002 could make it difficult to find anything funny about today's business world. But When Body Language Goes Bad proves it will take more than that to slow down the inventive wit of Scott Adams, who clearly is never at a loss for finding hysterical things to mock in corporate life.\n\nThis marks the 21st collection of Adams' wildly popular comic strip, Dilbert, which is featured in more than 2,000 newspapers worldwide. This book updates loyal readers on the so-called careers of Dilbert, Alice, Wally, Asok the intern, and other regulars as they wallow through pointless projects, mismanaged company takeovers, futile team-building exercises, and other inane company initiatives like the &quot;name the rest room&quot; contest.\n\nIn addition to the strips' familiar characters, this collection showcases Adams' masterful ability to create hilarious &quot;guest stars.&quot; There's the network design engineer known as Psycho Hillbilly, who was going for the gentle biker look until he decided it was overdone. Then, there's M. T. Suit, who is merely an empty suit walking the office halls spewing corporatese, such as &quot;promising to enhance core competencies by leveraging platforms.&quot;\n\nAdams says that about 80 percent of his initial ideas come from his 150 million-plus readers. Those worldwide readers are sure to celebrate the humor found in When Body Language Goes Bad, his latest satirical look at the modern workplace.\n\n","torrent":{"xt":"urn:btih:a2b2ae1ae251f3781afcfe115e7bd81dd91c6100","amp;dn":"When+Body+Language+Goes+Bad%3A+A+Dilbert+Book+-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2b2ae1ae251f3781afcfe115e7bd81dd91c6100","infoHashBuffer":{"type":"Buffer","data":[162,178,174,26,226,81,243,120,26,252,254,17,94,123,216,29,217,28,97,0]},"announce":[],"urlList":[]}}