{"title":"Spiderman.Web.of.Shadows-RELOADED 100% working and tested","uid":4471275,"size":8401744724,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a374d6f815502510c10b9dc96333d29bb7f93597&amp;dn=Spiderman.Web.of.Shadows-RELOADED+100%25+working+and+tested&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":10,"uploader":"ictorrents","files":87,"time":1225140335,"description":"nERv\n\nSpider-Man: Web of Shadows (c) Activision\n\n10/2008 :..... RELEASE.DATE .. PROTECTION .......: Safedisc\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\n\nWhen a deadly symbiote invasion devastates the streets of New York City,\nonly Spider-Man can seize control and bring salvation to the city. From the\ngame's direction to Spider-Man's destiny, Spider-Man: Web of Shadows puts\ncontrol in the gamer's hands\n\nOverhauled Combat System Provides Deepest Arsenal Ever: A reengineered\ncombat system fuses Spider-Man's speed and strength to create deadly new\nattacks and combos. For the first time ever in a Spider-Man game, players\ncan take the fight vertically and combat foes on city walls, where only\nSpider-Man holds the advantage\nGamers Control Their Fighting Experience: At a moment's notice, gamers can\nswitch between the agile grace of Spider-Man's Red Suit and the savage\npower of the Black Suit, creating some of the most devastating combos ever\nseen in a Spider-Man game\nPlayers Can Customise Their Ideal Spider-Man: Players earn experience in\nmultiple combat disciplines, allowing them to custom-design their ideal\nSpider-Man. Points awarded during battle can be used across unique paths\nto upgrade the Red Suit and Black Suit, allowing players complete control\nover the style and moves they take into combat\nEvery Choice Counts: Dependant on the gamer's actions and decisions, a\nmorality meter will gauge whether citizens cheer Spider-Man on or run away\nin fear. Spider-Man's actions as hero or vigilante,based on choices at key\npoints in the game, will affect how the fate of New York vs. alien\ninvasion ends\nSide With Marvel's Greatest Heroes and Villains: Luke Cage or Vulture\nWolverine or Electro? Gamers can control who will ultimately aid them in\nthe fight to rid New York of its alien symbiote.Alliances with Marvel's\ngreatest heroes and most notorious villains hold consequences, as heroic\nand vigilante paths hold different destinies. Call upon your allies with\nthe push of a button to combine forces for epic Hero Strikes\nA Living, Breathing New York City Under Siege: Next-generation technology\nprovides gamers with an added dimension of interactivity - destroy store\nfronts, demolish vehicles and grab anything in your path to use as a\nweapon. Devastated by the invasion, New York City is itself transformed\nwith enormous, hanging symbiote hives and infected symbiotes, providing\ngamers with an added dimension of interactivity  destroy store fronts,\ndemolish vehicles and grab anything in your path to use as a weapon\nDevastated by the invasion, New York City is itself transformed with\nenormous, hanging symbiote hives and infected symbiotes, providing gamers\nwith epic never-before seen visuals and enemies\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over crack from the /Crack dir on the disc to your install dir\n5. Play the game","torrent":{"xt":"urn:btih:a374d6f815502510c10b9dc96333d29bb7f93597","amp;dn":"Spiderman.Web.of.Shadows-RELOADED+100%25+working+and+tested","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a374d6f815502510c10b9dc96333d29bb7f93597","infoHashBuffer":{"type":"Buffer","data":[163,116,214,248,21,80,37,16,193,11,157,201,99,51,210,155,183,249,53,151]},"announce":[],"urlList":[]}}