{"title":"Garth Brooks - The Hits 320cbr (Big Papi) 1994","uid":9485026,"size":161148798,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a427b8fa7be5bb8bc092405898695f60e8aa4ff8&amp;dn=Garth+Brooks+-+The+Hits+320cbr+%28Big+Papi%29+1994&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":5,"uploader":"Big-Papi","files":-1,"time":1389872734,"description":"Source: 1994 CD\n\nGarth Brooks - The Hits 320cbr (Big Papi) 1994 Country Music\n\n\n\nBy Peter\nGarth Brooks recorded some great songs many of which are included in this fine collection, which was compiled from his first five albums (Garth Brooks, No fences, Roping the wind, The chase, In pieces). Garth's phenomenal success in his American homeland contrasts sharply with his international profile. He became very popular in some countries (notably Ireland) but conspicuously failed to make more than a limited impact elsewhere, notably Britain, where he had a few hit singles but his chart history is not spectacular, so this review focuses primarily on his American career.\n\nGarth's first single (Much too young) was a great song but the other two hits (If tomorrow never comes, The dances) from his debut album (simply titled Garth Brooks) really set up his career. Irish singer Ronan Keating later had a British number one hit with a cover of If tomorrow never comes. While his debut album provided Garth was a great start to his career, he was at that stage overshadowed by another rising country star, Clint Black. While Clint was never quite able to match the brilliance of his debut album, Garth took country music to a whole new audience.\n\nGarth's second album (No fences) yielded four major hits (Friends in low places, Unanswered prayers, The thunder rolls, Two of a kind working on a full house). Garth co-wrote The thunder rolls before he had a recording contract and Tanya Tucker was the first singer to record hit. Tanya's brilliant version was not released on an album at the time (it later appeared on a 4-CD boxed set in 1994) so Garth recorded it himself. The album eventually sold well over ten million copies in America, reaching out to a pop and rock audience that traditionally ignored country music.\n\nGarth's third album (Roping the wind) consolidated Garth's status as a superstar. No less than six tracks from it can be found here, these being Burning bridges (a hit for Garth in Spain), Shameless (a cover of a Billy Joel song), What she's doing now (co-written by Garth but first recorded by Crystal Gayle), Rodeo, Papa loves Mama and the title track.\n\nGarth's fourth album (The chase) is represented by just two tracks here (We shall be free, That summer). Garth is upset at the controversy generated by We shall be free. He and Stephanie Davis, who co-wrote the song, intended it to be a simple love song but the lyrics can be interpreted differently to make it sound like a political anthem. Listen and judge for yourself.\n\nGarth's fifth album (In pieces) is represented by three tracks here (Ain't going down till the sun comes up, Calling Baton Rouge (a cover of a song first recorded by the New Grass Revival, who back Garth on his version of the song), American honky-tonk bar association). The European edition of this compilation, also long out of print, includes two further tracks from this album (Standing outside the fire, The red strokes).\n\nThis collection fairly represents Garth's classic period. Although he continued to record further albums, he never quite recaptured the magic of his first five albums. This hits collection was released as a limited edition and is long out of print, but the original albums are still in print. If you can't find a used copy, I recommend you begin with No fences, then pick up In pieces, Garth Brooks, Roping the wind and The chase in that order, stopping if you feel you've got as much of Garth as you want. Garth also recorded a Christmas album (Beyond the season) during this period, which is also worth hearing.","torrent":{"xt":"urn:btih:a427b8fa7be5bb8bc092405898695f60e8aa4ff8","amp;dn":"Garth+Brooks+-+The+Hits+320cbr+%28Big+Papi%29+1994","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a427b8fa7be5bb8bc092405898695f60e8aa4ff8","infoHashBuffer":{"type":"Buffer","data":[164,39,184,250,123,229,187,139,192,146,64,88,152,105,95,96,232,170,79,248]},"announce":[],"urlList":[]}}