{"title":"Lonely Planet Central Asia (Travel Guide)[MyebookShelf]","uid":11622782,"size":51389994,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a469639fc4abcf2bc2f538dff5ee060d821544b3&amp;dn=Lonely+Planet+Central+Asia+%28Travel+Guide%29%5BMyebookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"MyeBookShelf","files":-1,"time":1417585931,"description":"Lonely Planet Central Asia (Travel Guide)[MyebookShelf]\nISBN: 1741799538 | 2014 | PDF | 520 pages | 49 MB\n\nLonely Planet: The world's leading travel guide publisher\n\nLonely Planet Central Asia is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Sample lamb kebabs and nan bread from roadside grills, hike through the spectacular canyons of the Kyrgyz Alatau Range, or marvel at Yasaui Mausoleum's beautiful architecture; all with your trusted travel companion. Get to the heart of Central Asia and begin your journey now!\n\nInside Lonely Planet's Central Asia Travel Guide:\n\nColour maps and images throughout\nHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\nInsider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spots\nEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\nHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\nCultural insights give you a richer and more rewarding travel experience - including customs, history, the Silk Road, religion, art, literature, film, music, architecture, landscapes, border crossings, outdoor activities, wildlife, environment, and cuisine\nOver 65 maps\nCoverage of Kazakhstan, Uzbekistan, Kyrgyzstan, Tajikistan, Turkmenistan, Almaty, Taraz, Astana, Tashkent, Khorezm, Karakalpakstan, Bishkek, Tamchy, Naryn, Dushanbe, Khojand, Khorog, Ashgabat, Merv, and more","torrent":{"xt":"urn:btih:a469639fc4abcf2bc2f538dff5ee060d821544b3","amp;dn":"Lonely+Planet+Central+Asia+%28Travel+Guide%29%5BMyebookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a469639fc4abcf2bc2f538dff5ee060d821544b3","infoHashBuffer":{"type":"Buffer","data":[164,105,99,159,196,171,207,43,194,245,56,223,245,238,6,13,130,21,68,179]},"announce":[],"urlList":[]}}