{"title":"Elantris - Sanderson, Brandon.epub","uid":10080484,"size":1722889,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a47224920d9ae35bb6ef1eab487734e94b56b4a9&amp;dn=Elantris+-+Sanderson%2C+Brandon.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"wingohocking","files":1,"time":1398995445,"description":"Elantris by Brandon Sanderson is a rare epic fantasy that is a complete and satisfying story in one volume. Elantris is fleet and fun, full of surprises and characters to care about.\n\nElantris was the capital of Arelon: gigantic, beautiful, literally radiant, filled with benevolent beings who used their powerful magical abilities for the benefit of all. Yet each of these demigods was once an ordinary person until touched by the mysterious transforming power of the Shaod. Ten years ago, without warning, the magic failed. Elantrians became wizened, leper-like, powerless creatures, and Elantris itself dark, filthy, and crumbling.\n\nArelon's new capital, Kae, crouches in the shadow of Elantris. Princess Sarene of Teod arrives for a marriage of state with Crown Prince Raoden, hoping -- based on their correspondence -- to also find love. She finds instead that Raoden has died and she is considered his widow. Both Teod and Arelon are under threat as the last remaining holdouts against the imperial ambitions of the ruthless religious fanatics of Fjordell. So Sarene decides to use her new status to counter the machinations of Hrathen, a Fjordell high priest who has come to Kae to convert Arelon and claim it for his emperor and his god. \n\nBut neither Sarene nor Hrathen suspect the truth about Prince Raoden. Stricken by the same curse that ruined Elantris, Raoden was secretly exiled by his father to the dark city. His struggle to help the wretches trapped there begins a series of events that will bring hope to Arelon, and perhaps reveal the secret of Elantris itself.\n","torrent":{"xt":"urn:btih:a47224920d9ae35bb6ef1eab487734e94b56b4a9","amp;dn":"Elantris+-+Sanderson%2C+Brandon.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a47224920d9ae35bb6ef1eab487734e94b56b4a9","infoHashBuffer":{"type":"Buffer","data":[164,114,36,146,13,154,227,91,182,239,30,171,72,119,52,233,75,86,180,169]},"announce":[],"urlList":[]}}