{"title":"Eric Clapton - The Cream Of Clapton [1994][320 KBPS]","uid":7683629,"size":177851373,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4920e07501e8ed8fdcf1ef78179c276e3661d61&amp;dn=Eric+Clapton+-+The+Cream+Of+Clapton+%5B1994%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":3,"uploader":"LameDuck69","files":22,"time":1348892538,"description":"Eric Clapton - The Cream Of Clapton [1994]\n\n\n\n\n\n01. Layla    \n02. Badge   \n03. I Feel Free   \n04. Sunshine Of Your Love    \n05. Crossroads   \n06. Strange Brew    \n07. White Room    \n08. Bell Bottom Blues    \n09. Cocaine    \n10. I Shot The Sheriff    \n11. After Midnight    \n12. Swing Low Sweet Chariot    \n13. Lay Down Sally   \n14. Knockin' On Heaven's Door    \n15. Wonderful Tonight   \n16. Let It Grow   \n17. Promises   \n18. I Can't Stand It\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\nFrom Wikipedia:\n\n\n\n \nEric Patrick Clapton,(born 30 March 1945) is an English guitarist and singer-songwriter. Clapton is the only three-time inductee to the Rock and Roll Hall of Fame: once as a solo artist, and separately as a member of The Yardbirds and Cream. Clapton has been referred to as one of the most important and influential guitarists of all time. Clapton ranked second in Rolling Stone magazine's list of the &quot;100 Greatest Guitarists of All Time&quot; and fourth in Gibson's Top 50 Guitarists of All Time.\n\nIn the mid 1960s, Clapton departed from the Yardbirds to play blues with John Mayall &amp; the Bluesbreakers. In his one-year stay with Mayall, Clapton gained the nickname &quot;Slowhand&quot;. Immediately after leaving Mayall, Clapton formed Cream, a power trio with drummer Ginger Baker and bassist Jack Bruce in which Clapton played sustained blues improvisations and &quot;arty, blues-based psychedelic pop.&quot; For most of the 1970s, Clapton's output bore the influence of the mellow style of J.J. Cale and the reggae of Bob Marley. His version of Marley's &quot;I Shot the Sheriff&quot; helped reggae reach a mass market. Two of his most popular recordings were &quot;Layla&quot;, recorded by Derek and the Dominos, another band he formed and Robert Johnson's &quot;Crossroads&quot;, recorded by Cream. A recipient of seventeen Grammy Awards, in 2004 Clapton was awarded a CBE at Buckingham Palace for services to music. In 1998, Clapton, a recovering alcoholic and drug addict, founded the Crossroads Centre on Antigua, a medical facility for recovering substance abusers.\n\n-----------------------------------------------------------------------------------\n\nThe Cream of Clapton is an Eric Clapton compilation album released in the US in 1994. It should not be confused with the 1987 Polydor (UK) compilation The Cream of Eric Clapton, which has since been retitled The Best of Eric Clapton.\n\nIn addition to profiling Clapton's solo work, the album also includes Clapton's involvement in the bands Cream, Blind Faith, and Derek and the Dominos. The sole track penned by Clapton on Blind Faith's studio album is the only one included here.\n\n\n\n","torrent":{"xt":"urn:btih:a4920e07501e8ed8fdcf1ef78179c276e3661d61","amp;dn":"Eric+Clapton+-+The+Cream+Of+Clapton+%5B1994%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4920e07501e8ed8fdcf1ef78179c276e3661d61","infoHashBuffer":{"type":"Buffer","data":[164,146,14,7,80,30,142,216,253,207,30,247,129,121,194,118,227,102,29,97]},"announce":[],"urlList":[]}}