{"title":"Art of China, Korea and Japan (Art Ebook).pdf","uid":11543350,"size":54230578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4ab17a22bd8cc6bcb7ce8a28411f3e89a0290d2&amp;dn=Art+of+China%2C+Korea+and+Japan+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"STBGD","files":-1,"time":1416694366,"description":"Art of China, Korea, and Japan\nFrederick A. Praeger, Inc. | 1963 | English | 294 pages | PDF | 51.7 MB\n\n\nFamiliarity with the art of these three Asian countries has for too long been considered a field for experts only. Here is a much needed introduction to the art of all three in a profusely illustrated volume that serves three main purposes. First of all, it is informative and readable and, like all good introductions, makes one want to inquire further into the subject. (Here the extensive bibliography will be of great help). Secondly the 259 plates enticingly cover the best examples of the art of these countries and are closely related to the text. Their beauty itself needs no introduction. Thirdly, and surprisingly for the first time in one volume, the arts of China, Korea and Japan are treated together. Their close relatedness can now be easily appreciated. Naturally, Chinese art dominates and is the major source of inspiration. Chapters: 1. The Beginnings 2. The first Chinese Empire - Beginnings of Korean and Japanese Cultures 3. Disunion in China - Buddhism - Japan enters the Chinese orbit 4. China unites again - The power of Chinese culture in the T'ang Dynasty over Great Sillan Korea and Nara Japan 5. The East divided - The Fujiwara in Japan 6. Three Great Periods: the Sung Dynasty in China, the Koryo Dynasty in Korea, and the Kamakura Dictatorship in Japan 7. China and Korea under Mongol domination 8. The Ming Dynasty: tradition and decoration 9. Japan and Korea c. 1400-1600: the Ashikaga Period and the beginning of the Yi Dynasty 10. The Momoyama Period: Japanese taste 11. The Ch'ing Dynasty, 1644-1911 - The Second Half of the Yi Dynasty in Korea 12. Japan 1600-1868: The Tokugawa Period","torrent":{"xt":"urn:btih:a4ab17a22bd8cc6bcb7ce8a28411f3e89a0290d2","amp;dn":"Art+of+China%2C+Korea+and+Japan+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4ab17a22bd8cc6bcb7ce8a28411f3e89a0290d2","infoHashBuffer":{"type":"Buffer","data":[164,171,23,162,43,216,204,107,203,124,232,162,132,17,243,232,154,2,144,210]},"announce":[],"urlList":[]}}