{"title":"Eric Hoffer - The True Believer: Nature of Mass Movements","uid":9286519,"size":2257999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4b57b32ebeb3769063dd86b81a8f121dcd00eb4&amp;dn=Eric+Hoffer+-+The+True+Believer%3A+Nature+of+Mass+Movements&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"workerbee","files":-1,"time":1386026711,"description":"\nEric Hoffer - The True Believer: Thoughts on the Nature of Mass Movements (Harper Perennial, 2002).\n\nISBN: 9780062029355 | 192 pages | EPUB\n\n\nOriginally published in 1951, THE TRUE BELIEVER is a bestselling landmark in the field of social psychology, and even more relevant today than ever before in history.  Called a &quot;brilliant and original inquiry&quot; and &quot;a genuine contribution to our social thought&quot;, it is mandatory reading for anyone interested in the machinations by which an individual becomes a fanatic.\n\nThe book analyzes and attempts to explain the motives of the various types of personalities that give rise to mass movements; why and how mass movements start, progress and end; and the similarities between them, whether religious, political, radical or reactionary.  Hoffer argues that even when their stated goals or values differ mass movements are interchangeable, that adherents will often flip from one movement to another, and that the motivations for mass movements are interchangeable.  Thus, religious, nationalist and social movements, whether radical or reactionary, tend to attract the same type of followers, behave in the same way and use the same tactics and rhetorical tools.  As examples, the book often refers to Communism, Fascism, National Socialism, Christianity, Protestantism, and Islam.\n\nTHE TRUE BELIEVER earned renewed attention after the terrorist attacks of September 11, 2001, and also following the Tea Party Protests and Occupy Wall Street protests a decade later.\n\n\nReviews\n\n&quot;[Eric Hoffer] is a student of extraordinary perception and insight. The range of his reading and research is vast, amazing.  [The True Believer is] one of the most provocative books of our immediate day.&quot; -- Christian Science Monitor\n\n&quot;[Offers] concise insight into what drives the mind of the fanatic and the dynamics of a mass movement.&quot; -- Wall St. Journal\n\n&quot;Its theme is political fanaticism, with which it deals severely and brilliantly.&quot; -- New Yorker\n","torrent":{"xt":"urn:btih:a4b57b32ebeb3769063dd86b81a8f121dcd00eb4","amp;dn":"Eric+Hoffer+-+The+True+Believer%3A+Nature+of+Mass+Movements","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4b57b32ebeb3769063dd86b81a8f121dcd00eb4","infoHashBuffer":{"type":"Buffer","data":[164,181,123,50,235,235,55,105,6,61,216,107,129,168,241,33,220,208,14,180]},"announce":[],"urlList":[]}}