{"title":"The Nix - Nathan Hill.epub","uid":15719702,"size":5560364,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a606514e50df5291b2cd5a6cf6498c5eae0f7864&amp;dn=The+Nix+-+Nathan+Hill.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"mr_mando","files":1,"time":1472665273,"description":"A Nix can take many forms. In Norwegian folklore, it is a spirit who sometimes appears as a white horse that steals children away. In Nathan Hill’s remarkable first novel, a Nix is anything you love that one day disappears, taking with it a piece of your heart. \r\n\r\nIt’s 2011, and Samuel Andresen-Anderson—college professor, stalled writer—has a Nix of his own: his mother, Faye. He hasn’t seen her in decades, not since she abandoned the family when he was a boy. Now she’s re-appeared, having committed an absurd crime that electrifies the nightly news, beguiles the internet, and inflames a politically divided country. The media paints Faye as a radical hippie with a sordid past, but as far as Samuel knows, his mother was an ordinary girl who married her high-school sweetheart. Which version of his mother is true? Two facts are certain: she’s facing some serious charges, and she needs Samuel’s help. \r\n\r\nTo save her, Samuel will have to embark on his own journey, uncovering long-buried secrets about the woman he thought he knew, secrets that stretch across generations and have their origin all the way back in Norway, home of the mysterious Nix. As he does so, Samuel will confront not only Faye’s losses but also his own lost love, and will relearn everything he thought he knew about his mother, and himself. \r\n\r\nFrom the suburban Midwest to New York City to the 1968 riots that rocked Chicago and beyond, The Nix explores—with sharp humor and a fierce tenderness—the resilience of love and home, even in times of radical change","torrent":{"xt":"urn:btih:a606514e50df5291b2cd5a6cf6498c5eae0f7864","amp;dn":"The+Nix+-+Nathan+Hill.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a606514e50df5291b2cd5a6cf6498c5eae0f7864","infoHashBuffer":{"type":"Buffer","data":[166,6,81,78,80,223,82,145,178,205,90,108,246,73,140,94,174,15,120,100]},"announce":[],"urlList":[]}}