{"title":"Ubuntu Linux Toolbox","uid":9286416,"size":12152215,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a687db7cf06d44e89f5651eb561ecd0ba4f8192a&amp;dn=Ubuntu+Linux+Toolbox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"MucGar","files":-1,"time":1386025202,"description":"Ubuntu Linux Toolbox: 1000+ Commands for Ubuntu and Debian Power Users\n\n\nEnglish | ISBN: 1118183525 | 2013 | EPUB, PDF, MOBI | 368 pages | 12,3 MB\n\n\nThis updated bestseller from Linux guru Chris Negus is packed with an array of new and revised material\nAs a longstanding bestseller, Ubuntu Linux Toolbox has taught you how to get the most out Ubuntu, the world's most popular Linux distribution. With this anticipated new edition, Christopher Negus returns with a host of new and expanded coverage on tools for managing file systems, ways to connect to networks, techniques for securing Ubuntu systems, and a look at the latest Long Term Support (LTS) release of Ubuntu, all aimed at getting you up and running with Ubuntu Linux quickly.\n\nCovers installation, configuration, shell primer, the desktop, administrations, servers, and security\nDelves into coverage of popular applications for the web, productivity suites, and e-mail\nHighlights setting up a server (Apache, Samba, CUPS)\nBoasts a handy trim size so that you can take it with you on the go\n\nUbuntu Linux Toolbox, Second Edition prepares you with a host of updated tools for today's environment, as well as expanded coverage on everything you know to confidently start using Ubuntu today","torrent":{"xt":"urn:btih:a687db7cf06d44e89f5651eb561ecd0ba4f8192a","amp;dn":"Ubuntu+Linux+Toolbox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a687db7cf06d44e89f5651eb561ecd0ba4f8192a","infoHashBuffer":{"type":"Buffer","data":[166,135,219,124,240,109,68,232,159,86,81,235,86,30,205,11,164,248,25,42]},"announce":[],"urlList":[]}}