{"title":"DAZ3D - FM Gym and Pose Sets","uid":15539886,"size":117125321,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a6eb87a41f757cdd70c9e7e08f0e3ff3a1e2e775&amp;dn=DAZ3D+-+FM+Gym+and+Pose+Sets&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"De4lt","files":31,"time":1470913688,"description":"This package contains:\r\n\r\nFM Gym \nhttp://www.daz3d.com/catalog/product/view/id/33651\r\n\r\nDid you ever wonder how Genesis models stay in such good shape? Those fit, muscular bodies don`t come free, they require hard workouts in the Gym! FM Gym is a fitness center with fully functional Workout Stations. The focus is on machines for strength and power training. You can load the the full presets with everything in place, or build your own setting using the &quot;Room Empty&quot; preload and filling it with the included training machines and props (barbells, dumbbells, racks). Everything is offered in a white, red and black version. Colors can quite easily be changed too. All (mechanical) Workout Stations can be posed or animated with a single slider. Where applicable you will also find sliders for specific adjustments, for example the height of a pull-bar, to make it easier to adjust to various characters. You can change the amount of weights to be used with parenting/unparenting or adding/removing. The Dumbbells are included as both normal props and smart-props for Genesis 3 Male and Female. Everything in the set is available for both Iray and 3Delight, both carefully adjusted to play to their respective strength. Altogether FM Gym is a great set for your fitness and bodybuilding themed renders.\r\n\r\n\r\nFM Gym Poses: Workout Stations \nhttp://www.daz3d.com/catalog/product/view/id/33657\r\n\r\nSequential Poses for Genesis 3 Males &amp; Females. FM Gym Poses: Workout Stations is a set of sequential poses for the Workout Stations included with FM Gym. Each sequence goes through an exercise in three poses, starting stage, half-way stage and end-stage. This makes the poses useful for both stills and keyframe animations. The naming of the poses tells you which Workout Station they are for and how to set the Station to fit with Genesis 3. In total it is 28 poses for Genesis 3 Male and 28 poses for Genesis 3 Female, and over 9 sequences/Workout Stations each.\r\n\r\n\r\nFM Gym Poses: Dumbbells &amp; Barbells \nhttp://www.daz3d.com/catalog/product/view/id/33653\r\n\r\nSequential Poses for Genesis 3 Male(s) &amp; Female(s). FM Gym Poses: Dumbbells &amp; Barbells is a set of sequential poses working with the dumbbells, barbells and benches from the FM Gym set. Within limits you can use the poses with similar items from other sets as well.\r\nEach sequence of poses goes through two or three stages of an exercise, useful for both stills and keyframe animations. All poses are included for Genesis 3 Male and Genesis 3 Female. Dumbbell poses are quite easy to use with smart-prop dumbbells like the ones found in the FM gym set. Barbell and Curlbar poses come with an extra pose to position the respective prop correctly for Genesis 3. In total it`s 27 poses (5 mirrors) for Genesis 3 Male and 27 poses (5 mirrors) for Genesis 3 Female, over 8 sequences each","torrent":{"xt":"urn:btih:a6eb87a41f757cdd70c9e7e08f0e3ff3a1e2e775","amp;dn":"DAZ3D+-+FM+Gym+and+Pose+Sets","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6eb87a41f757cdd70c9e7e08f0e3ff3a1e2e775","infoHashBuffer":{"type":"Buffer","data":[166,235,135,164,31,117,124,221,112,201,231,224,143,14,63,243,161,226,231,117]},"announce":[],"urlList":[]}}