{"title":"Ken Cohen - The Essential Qigong Training Course","uid":3800112,"size":2424561523,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a6f3192db729fd92f32dad0852ce59edbd6ae1fa&amp;dn=Ken+Cohen+-+The+Essential+Qigong+Training+Course&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"MasterKush","files":83,"time":1189279912,"description":"In the qigong tradition, serious students commit to a 100-day training retreat to learn this cornerstone Chinese practice for physical, emotional, and spiritual development.\n\nNow, for this first time, qigong training is available in a comprehensive home-study curriculum taught by renowned China scholar and qigong master Ken Cohen. With The Essential Qigong Training Course, you will learn more than 70 qigong practices -- some rarely taught outside of China -- for harnessing the massive power of qi (literally, the &quot;vital&quot; breath,&quot; or energy of the universe) to create vitality, spiritual balance, and physical health.\n\nComplete kit includes:\n\n# A 59-page, weekly workbook of original material that directs you step-by-step on this life-changing course.\n\n# Five-audio-CD training course covers every phase of qigong theory and practice, including 25 rare meditation exercises that balance emotions, boost immunity, increase sexual vitality, and enhance spiritual well-being.\n\n# Qigong DVD workout offers you complete, 80 minute programmable practice. Dozens of demonstrations to learn ancient movements and meditative postures that detoxify, energize, and heal the body.\n\n# Qi healing DVD includes three hours of essential teachings and hands-on exercises for directiong qi energy to others effectively and safely, and more.\n\nLearn More About:\n\n# The fundamentals of qigong philosphy: organs, elements, and &quot;three treasures&quot; (the energy centers known as dan tian)\n\n# How to use qigong to cleanse the body of impurities, pathogens, and toxins\n\n# Exercises for gathering qi to create a reservoir of healing vitality in the body\n\n# Spiritual qigong: visualizations for finding harmony and peace with the universe\n\n# Qi circulation techniques to open blockages or places of stagnation, and distribute qi to areas of distress or disease\n\n# The 12 key benefits of qigong, from improved health and well-being to increased energy and sexual vitality to heightened intuition and creativity\n\n# Qigong history, including a timeline detailing its earliest writings in 500 BC through its evolution to the present day\n\n# A complete training course in qigong as it was meant to be taught -- step-by-step by an expert in a 100-day format that is most effective for mastery\n\nWith The Essential Qigong Training Course, now you will learn the ancient spiritual tradition of qigong through progressive steps in the comfort of your own home.\n\n5 CDs, 3 DVDs, 59-page guidebook, 9 hours\n\nAbout the Author\n\nKen Cohen is a renowned Taoist initiate, China scholar, and qigong master. In 1973, he was one of six students chosen by Alan Watts for private study of Taoism. Ken is the author of the internationally acclaimed DVDs Qi Healing to Heal Others, Qigong: Traditional Chinese Exercises for Healing Body, Mind, and Spirit ,and more than 150 journal articles. He co-authored, with Tu Xin-Shi, China&amp;#039;s gold medal artist, Autumn Leaves: The Wisdom and Art of Chinese Calligraphy. Ken is an adjunct professor at Union Graduate School and presents at universities and conferences throughout the world.","torrent":{"xt":"urn:btih:a6f3192db729fd92f32dad0852ce59edbd6ae1fa","amp;dn":"Ken+Cohen+-+The+Essential+Qigong+Training+Course","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6f3192db729fd92f32dad0852ce59edbd6ae1fa","infoHashBuffer":{"type":"Buffer","data":[166,243,25,45,183,41,253,146,243,45,173,8,82,206,89,237,189,106,225,250]},"announce":[],"urlList":[]}}