{"title":"Assassins.Creed.Rogue.RF.XBOX360-ANGELiCFTP","uid":11385861,"size":8738846791,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:a6fd4d460871a3baeb05f0fde7aeacff48dee17c&amp;dn=Assassins.Creed.Rogue.RF.XBOX360-ANGELiCFTP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":11,"uploader":"CupJoe","files":-1,"time":1415262250,"description":"Title: Assassin's Creed Rogue\nRetail Date: 11/11/14\nPlatform: XBOX360\nRegion: Region Free\nGenre: Action / Adventure\nLanguage: Multi (PT-BR included)\nRelease: Assassins.Creed.Rogue.RF.XBOX360-ANGELiCFTP\n-----------------------------------------------------------------------------------\nNorth America, 18th century. Amid the chaos and violence of the French and Indian War, Shay Patrick Cormac, a fearless young member of the Assassin Brotherhood, undergoes a dark transformation that will forever shape the future of the colonies. After a dangerous mission goes tragically wrong, Shay turns his back on the Assassins who, in response, attempt to end his life. Cast aside by those he once called brothers, Shay sets out on a mission to wipe out all who turned against him and to ultimately become the most feared Assassin hunter in history.\n\nIntroducing Assassin's CreedÂ® Rogue, the darkest chapter in the Assassin's CreedÂ® franchise yet. As Shay, you will experience the slow transformation from Assassin to Assassin hunter. Follow your own creed and set off on an extraordinary journey through New York City, the wild river valley, and far away to the icy cold waters of the North Atlantic in pursuit of your ultimate goal, to bring down the Assassins.\n\nFeatures:\nBecome the Ultimate Assassin Hunter. Experience the Assassin's Creed universe from the perspective of a Templar. Play as Shay, who, in addition to the skills of a Master Assassin, also possesses new abilities, like enhanced eagle vision, and weapons, such as the deadly air rifle and grenade launcher.\nSlowly Descend Into Darkness. Witness Shay's transformation from an adventurous Assassin to a grim and committed Templar willing to hunt down his former brothers. Experience firsthand the events that will lead Shay down a dark path and set him on a course that will forever change the fate of the Assassin Brotherhood.\nNew and Improved Naval Gameplay. Cast off in your ship, the Morrigan, and fight your way through the icy seas of the North Atlantic and the narrow waters of America's river valleys. Assassin's Creed Rogue builds on the award-winning naval experience from Assassin's CreedÂ® IV Black Flag with all-new gameplay, including new weapons and enemy tactics\nVast and Diverse Open World to Explore. Shay's story will allow you to explore three unique environments: the artic North Atlantic, American River Valley, and New York City","torrent":{"xt":"urn:btih:a6fd4d460871a3baeb05f0fde7aeacff48dee17c","amp;dn":"Assassins.Creed.Rogue.RF.XBOX360-ANGELiCFTP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6fd4d460871a3baeb05f0fde7aeacff48dee17c","infoHashBuffer":{"type":"Buffer","data":[166,253,77,70,8,113,163,186,235,5,240,253,231,174,172,255,72,222,225,124]},"announce":[],"urlList":[]}}