{"title":"Aebersold Vol 1 to 106 - workaround","uid":3500568,"size":175266,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a7548a65e7f83a9b753d41628b24f72db0f03633&amp;dn=Aebersold+Vol+1+to+106+-+workaround&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"L_Hammond","files":2,"time":1151951742,"description":"Aebersold Vol 1 to 106 workaround instruction:\n\nThere are currently some problems with the tracker database regarding \n'Jamey Aebersold Jazz Play-A-Long Vol. 1 To Vol. 106.torrent'\nThe error message is:\n'[Database problems] We're experiencing some issues with the database. Please try again soon'\n\nBut you can still file share this Abersold-torrent even if those database problems are not yet sorted out, as you can use the DHT (Distributed Hash Table) function (a.k.a. trackerless torrent). This is the workaround:\n\n1) Download this (Aebersold Vol 1 to 106 workaround).\n\n2) Open the downloaded folder (Aebersold Vol 1 to 106 workaround). Open the torrent file in that folder with your bittorrent client. The file name is 'Jamey Aebersold Jazz Play-A-Long Vol. 1 To Vol. 106.torrent' with a file size of 169 kB.\n\n3) Enable DHT in your bittorrent client. \nIn utorrent (this might differ slightly depending on utorrent version): \nOptions/Preferences/Bittorrent/Enable DHT Network/OK. \nAfter that, right-click the torrent in the column Name and choose Properties. Enable DHT/OK.\n\n4) Your torrent will connect using DHT and the file sharing will begin. \nTotal size 9 GB.\n\nIf your bittorrent client doesn't support DHT, you have to change to a client that supports DHT to get 'Jamey Aebersold Jazz Play-A-Long Vol. 1 To Vol. 106' at the moment. The latest versions of the most popular bittorrent clients all supports DHT. You can use the latest release of utorrent (www.utorrent.com) if you are not shure about your current bittorrent client and DHT.\n\n\n-------------------------------------\n\nJamey Aebersold Jazz Play-A-Long Vol. 1 to Vol. 106\n\n-------------------------------------\n\nThe Jamey Aebersold Jazz Play-A-Longs have revolutionized the way musicians of all levels practice jazz! Often said, 'The Most Widely Used Improvisation Method On The Market'\n\nThere is something for everyone in these book and CD sets, whether you are a young aspiring player, active professional, teacher, or retired professional. The recording provides the professional jazz rhythm section, and YOU provide the melody. Today, Jamey's Play-A-Longs are used and enjoyed by all segments of the musical spectrum from elementary students to pro's such as the Brecker Brothers and Phil Woods.\n\nJamey Aebersold Play-A-Longs include a Stereo CD and a coordinated booklet with notes/sheet music. Choose the song you want to play and the stage is yours! These make excellent practice tools for scat vocalists, too. Meticulously break down a song one chord/scale at a time, or simply relax and play melodies. You can have it your way!\n\nThe special stereo separation technique we use is ideal for rhythm players. The left channel includes bass and drums, while the right channel contains piano (or guitar) and drums. So bass players and pianists/guitarists can play along like normal, or tune out the recorded parts and provide your own!\n\nwww.aebersold.com\n\n-------------------------------------\n\n","torrent":{"xt":"urn:btih:a7548a65e7f83a9b753d41628b24f72db0f03633","amp;dn":"Aebersold+Vol+1+to+106+-+workaround","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7548a65e7f83a9b753d41628b24f72db0f03633","infoHashBuffer":{"type":"Buffer","data":[167,84,138,101,231,248,58,155,117,61,65,98,139,36,247,45,176,240,54,51]},"announce":[],"urlList":[]}}