{"title":"Aladdin's Lamp: How Greek Science Came to Europe","uid":15791716,"size":4069957,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a76c0d9f7c0eec8e5175f06d4a35d0ab084f12bc&amp;dn=Aladdin%27s+Lamp%3A+How+Greek+Science+Came+to+Europe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"marty14","files":1,"time":1473386519,"description":"Aladdin's Lamp: How Greek Science Came to Europe Through the Islamic World - John Freely [epub]\r\n\r\nAladdin’s Lamp is the fascinating story of how ancient Greek philosophy and science began in the sixth century B.C. and, during the next millennium, spread across the Greco-Roman world, producing the remarkable discoveries and theories of Thales, Pythagoras, Hippocrates, Plato, Aristotle, Euclid, Archimedes, Galen, Ptolemy, and many others.\r\n\r\nJohn Freely explains how, as the Dark Ages shrouded Europe, scholars in medieval Baghdad translated the works of these Greek thinkers into Arabic, spreading their ideas throughout the Islamic world from Central Asia to Spain, with many Muslim scientists, most notably Avicenna, Alhazen, and Averroës, adding their own interpretations to the philosophy and science they had inherited. Freely goes on to show how, beginning in the twelfth century, these texts by Islamic scholars were then translated from Arabic into Latin, sparking the emergence of modern science at the dawn of the Renaissance, which climaxed in the Scientific Revolution of the seventeenth century","torrent":{"xt":"urn:btih:a76c0d9f7c0eec8e5175f06d4a35d0ab084f12bc","amp;dn":"Aladdin%27s+Lamp%3A+How+Greek+Science+Came+to+Europe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76c0d9f7c0eec8e5175f06d4a35d0ab084f12bc","infoHashBuffer":{"type":"Buffer","data":[167,108,13,159,124,14,236,142,81,117,240,109,74,53,208,171,8,79,18,188]},"announce":[],"urlList":[]}}