{"title":"The Encyclopedia of Magic and Alchemy ","uid":6841307,"size":11047767,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a77baf997026c24b3cb0c0ac48ba81282ccf1404&amp;dn=+The+Encyclopedia+of+Magic+and+Alchemy+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"freaktorrent07","files":-1,"time":1322172795,"description":"\nThe Encyclopedia of Magic and Alchemy \n\nMagic and the dream of turning base metals into gold have always fascinated people, and this work provides a wide spectrum of information for the curious reader. To appreciate the book, it is best to start with the introduction, which states that &quot;magic is a real and powerful resource.&quot; Once one understands the point of view of the author, this encyclopedia is easier to comprehend.\nArranged in alphabetical order, more than 400 entries range in size from a short paragraph to several pages. Most end with a list of further readings. Black-and-white illustrations, mostly from the author's own collection, are used liberally throughout the work. All the expected terms--Grimoires, Rituals, Runes, etc.--are explained. The volume ends with a comprehensive bibliography and an index with main entries in bold.\n\nAmong the best parts of the work are the biographies of such figures as John Dee, Florence Farr, and Nostradamus. Devotees of Harry Potter will find that one of the characters from the first book, Nicholas Flamel, was a real person. Especially strong are the articles on The Da Vinci Code, Harry Potter, and The Lord of the Rings. The work is marred by a few typos, such as a wrong date in the entry for Count Alessandro Cagliostro. Not having an entry on cats while including one on the horse is curious, and readers will have a hard time finding the reference to cats in the short article entry Familiars since the index has no cats entry.\n\nThe best approach to using this work is to realize it is written from the point of view of a true believer. Skeptics will find the lack of critical examinations annoying. This work will have the strongest appeal to users who already believe but want additional information. Recommended for public and academic libraries that have a high demand for this type of information. Abbie Vestal Landry\n\nPaperback: 370 pages\nPublisher: Checkmark Books; 1 edition (October 2006)\nLanguage: English\nISBN-10: 0816060495\nISBN-13: 978-0816060498","torrent":{"xt":"urn:btih:a77baf997026c24b3cb0c0ac48ba81282ccf1404","amp;dn":"+The+Encyclopedia+of+Magic+and+Alchemy+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a77baf997026c24b3cb0c0ac48ba81282ccf1404","infoHashBuffer":{"type":"Buffer","data":[167,123,175,153,112,38,194,75,60,176,192,172,72,186,129,40,44,207,20,4]},"announce":[],"urlList":[]}}