{"title":"Ultimate Guitar Tabs &amp; Chords v3.5.5 [All Tools + Lessons].a","uid":10393275,"size":11355601,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a7843f84f59e608a0230131e41b2c721d4e9475c&amp;dn=Ultimate+Guitar+Tabs+%26amp%3B+Chords+v3.5.5+%5BAll+Tools+%2B+Lessons%5D.a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"ill420smoker","files":-1,"time":1403225347,"description":"Ultimate Guitar Tabs &amp; Chords is a mobile version of the world's largest catalog of guitar tabs and chords with lyrics, available even offline. Learn how to play your favorite songs on acoustic, electric or bass guitar. Get over 800,000 carefully transcribed tablatures and free daily updates with guitar scores for recent hit songs! A must-have app for guitarist of any skill and level, Ultimate Guitar Tabs has earned praise from both beginners and advanced players for its versatility, ease-of-use and countless guitarist-friendly features.\n\nAnd if that's not enough for you, we've got something special - powerful extensions to make your app the ultimate song-teaching machine:\n\nTab Pro\n\nThe easiest way to learn songs is when you can both read and play tablatures following the chord progression on a virtual fretboard. And Tab Pro gives you that, along with:\n\n- Additional 200,000 interactive tabs with realistic sound playback and intuitive\n  controls\n- Multiple instrument tracks for each tab (guitar, bass, drums etc) to give you\n  the chance to learn every guitar part of the song\n- Playback tempo control and loop to nail down the challenging parts\n\nGuitar Tools\n\nEverything you need to practice your favorite songs with style and comfort:\n\n- Accurate tuner for easy and reliable tuning even in loud environments\n- Precision metronome to keep up with any song's pace\n- Extensive chords library to look up a chord when you need to\n\nTab Tools\n\nThe friendliest way to treat your tabs, Tab Tools add-on allows you to:\n\n- Personalize each tab by changing font style and size\n- Make tabs easier to read on your device with &quot;Fit To Screen&quot; feature\n- Export tabs and chords to Dropbox, send them via email with just one tap\n- Print tabs using any CloudPrint compatible device\n\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.ultimateguitar.tabs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.ultimateguitar.tabs&lt;/a&gt;\n\n\n* All paid content unlocked\n\n\nEnjoy!","torrent":{"xt":"urn:btih:a7843f84f59e608a0230131e41b2c721d4e9475c","amp;dn":"Ultimate+Guitar+Tabs+%26amp%3B+Chords+v3.5.5+%5BAll+Tools+%2B+Lessons%5D.a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7843f84f59e608a0230131e41b2c721d4e9475c","infoHashBuffer":{"type":"Buffer","data":[167,132,63,132,245,158,96,138,2,48,19,30,65,178,199,33,212,233,71,92]},"announce":[],"urlList":[]}}