{"title":"Hacking and Penetration Testing with Low Power Devices (Syngress","uid":11258895,"size":8795065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a836dd9b66eb70b1649383893105ba99fc6a1a45&amp;dn=Hacking+and+Penetration+Testing+with+Low+Power+Devices+%28Syngress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"steelballz","files":-1,"time":1413936071,"description":"Description\nHacking and Penetration Testing with Low Power Devices -[SRG]\nAuthor: Polstra, Philip\nPublished:Sept. 2 2014\nPublisher: Syngress; 1 edition\nISBN: 0128007516\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nimage\n\n\nDESCRIPTION\n\nProduct Description\n\nHacking and Penetration Testing with Low Power Devices shows you how to perform penetration tests using small, low-powered devices that are easily hidden and may be battery-powered. It shows how to use an army of devices, costing less than you might spend on a laptop, from distances of a mile or more.\n\nHacking and Penetration Testing with Low Power Devices shows how to use devices running a version of The Deck, a full-featured penetration testing and forensics Linux distribution, and can run for days or weeks on batteries due to their low power consumption. Author Philip Polstra shows how to use various configurations, including a device the size of a deck of cards that can easily be attached to the back of a computer.\n\nWhile each device running The Deck is a full-featured pen-testing platform, connecting systems together via 802.15.3 networking gives you even more power and flexibility. This reference teaches you how to construct and power these devices, install operating systems, and fill out your toolbox of small low-power devices with hundreds of tools and scripts from the book's companion website. Hacking and Pen Testing with Low Power Devices puts all these tools into your hands and will help keep you at the top of your game performing cutting-edge pen tests from anywhere in the world!\n\n\nUnderstand how to plan and execute an effective penetration test using an army of low-power devices\nLearn how to configure and use open-source tools and easy-to-construct low-power devices\nLeverage IEEE 802.15.4 networking to perform penetration tests from up to a mile away, or use 802.15.4 gateways to perform pen tests from anywhere in the world\nAccess penetration testing operating systems with hundreds of tools and scripts on the book's companion web site\n\nAbout the Author\nDr. Philip Polstra (known to his friends as Dr. Phil) is an internationally recognized hardware hacker. His work has been presented at numerous conferences around the globe including repeat performances at DEFCON, BlackHat, 44CON, GrrCON, MakerFaire, ForenSecure, and other top conferences. Dr. Polstra is a well-known expert on USB forensics and has published several articles on this topic.\n\nDr. Polstra has developed degree programs in digital forensics and ethical hacking while serving as a professor and Hacker in Residence at a private university in the Midwestern United States. He currently teaches computer science and digital forensics at Bloomsburg University of Pennsylvania. In addition to teaching, he provides training and performs penetration tests on a consulting basis. When not working, he has been known to fly, build aircraft, and tinker with electronics. His latest happenings can be found on his blog: http://polstra.org. You can also follow him at @ppolstra on Twitter","torrent":{"xt":"urn:btih:a836dd9b66eb70b1649383893105ba99fc6a1a45","amp;dn":"Hacking+and+Penetration+Testing+with+Low+Power+Devices+%28Syngress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a836dd9b66eb70b1649383893105ba99fc6a1a45","infoHashBuffer":{"type":"Buffer","data":[168,54,221,155,102,235,112,177,100,147,131,137,49,5,186,153,252,106,26,69]},"announce":[],"urlList":[]}}