{"title":"The Way Of The SEAL - Think Like An Elite Warrior To Lead And Su","uid":9570477,"size":2397040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8460fad0e1fcce4e991428d95e281033e2abf59&amp;dn=The+Way+Of+The+SEAL+-+Think+Like+An+Elite+Warrior+To+Lead+And+Su&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391623579,"description":"The Way of the SEAL: Think Like an Elite Warrior to Lead and Succeed\nby Mark Divine, Allyson E. Machate\n\n\nFormat: mobi/epub/azw3\nLength: 208 pages\nGenre: Non-Fiction/Self-Help\nDate: 26 December 2013\n\nIn the Way of the SEAL, ex-Navy Commander Mark Divine reveals exercises, meditations and focusing techniques to train your mind for mental toughness, emotional resilience and uncanny intuition. Along the way you'll reaffirm your ultimate purpose, define your most important goals, and take concrete steps to make them happen. A practical guide for businesspeople or anyone who wants to be an elite operator in life, this book will teach you how to:\n\n* Lead from the front, so that others will want to work for you\n* Practice front-sight focus, the radical ability to focus on one thing until victory is achieved\n* Think offense, all the time, to eradicate fear and indecisiveness\n* Smash the box and be an unconventional thinker so you're never thrown off-guard by chaotic conditions\n* Access your intuition so you can make 'hard right' decisions\n* Achieve twenty times more than you think you can\n* and much more\n\nBlending the tactics he learned from America's elite forces with lessons from the Spartans, samurai, Apache scouts, and other great warrior traditions, Divine has distilled the fundamentals of success into eight powerful principles that will transform you into the leader you always knew you could be.\n\nLearn to think like a SEAL, and take charge of your destiny at work, home and in life. \n\nAuthor:\n\nMark Divine served in the U.S. Navy SEALs for 20 years, retiring as a commander, and holds an MBA from New York University's Leonard N. Stern School of Business. The founder of SEALFIT, NavySeals.com and U.S. CrossFit, he has coached thousands of Navy SEAL and other Special Ops candidates, with a success rate near 90%. The author of 8 Weeks to SEALFIT and Unbeatable Mind, he lives in Encinitas, California with his wife, Sandy and son, Devon.","torrent":{"xt":"urn:btih:a8460fad0e1fcce4e991428d95e281033e2abf59","amp;dn":"The+Way+Of+The+SEAL+-+Think+Like+An+Elite+Warrior+To+Lead+And+Su","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8460fad0e1fcce4e991428d95e281033e2abf59","infoHashBuffer":{"type":"Buffer","data":[168,70,15,173,14,31,204,228,233,145,66,141,149,226,129,3,62,42,191,89]},"announce":[],"urlList":[]}}