{"title":"The Complete Far Side","uid":10663402,"size":1624726570,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a8502a599c0b5020214c60518d16edff9b840b35&amp;dn=The+Complete+Far+Side&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"data9724","files":-1,"time":1406760120,"description":"Time for a classic, The Complete Far Side.\n\nOne of the scanners was nice enough to do the MAMMOTH work of scanning his The Complete Far Side, so everyone can enjoy it. Some of you will now just think &quot;well, it a book, how hard can it be to scan?&quot;. In this case, the answer is HARD!\nThe Complete Far Side is a mammoth book, consisting of a box with two HUGE hardcover books, measuring 14.2 x 10 x 4.2 inches, AND a weight of 19.4 pounds! Now imagine lifting a 9,7 pound oversized book, turning it, scanning a page, lift it, flip page, scan page, and so on, for 1270 pages, and you will see just how much work was put into this scan. So now read this scan on your 1 pound tablet, and think of the poor scanners ruined back :)\n\nSince I am sure that some of you, especially the younger ones amongst you, do not know The Far Side, here is a small intro to one of the funniest newspaper strips ever in syndication:\n\nRevered by its fans as the funniest, most original, most &quot;What the .. ?&quot; inspiring cartoon ever, The Far Side debuted in January 1980 and enjoyed an illustrious 14 years on the worlds comics pages until Gary Larsons retirement in 1994. The Complete Far Side celebrates Garys twisted, irreverent genius in this ultimate Far Side book, a lavish production which takes its place alongside collectors edition art books.\n\nA masterpiece of comic brilliance, The Complete Far Side contains every Far Side cartoon ever syndicated, over 4,000 if you must know,presented in (more or less) chronological order by year of publication, with more than 1,100 that have never before appeared in a book. Also included are additional Far Side cartoons Larson created after his retirement: 13 that appeared in the last Far Side book, Last Chapter and Worse, and six cartoons that periodically ran as a special feature in the New York Times Science Times section as The Far Side of Science. Creator Gary Larson offers a rare glimpse into the mind of The Far Side in quirky and thoughtful introductions to each of the 14 chapters. Complaint letters, fan letters, and queries from puzzled readers appear alongside some of the more provocative or elusive panels. Actor, author, and comedian Steve Martin offers his pithy thoughts in a foreword, and Gary Larsons former editor describes what it was like to be &quot;the guy who could explain every Far Side cartoon.&quot;\n\nDuring its 14 year run, The Far Side was syndicated internationally to over 1,900 daily newspapers. It spawned 22 books and has been translated into a total of 17 different languages.\n &lt;a href=&quot;\nhttp://i.imgbox.com/Goj4JXTO.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgbox.com/Goj4JXTO.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgbox.com/7koAa8L5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgbox.com/7koAa8L5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgbox.com/aYnsYKOD.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgbox.com/aYnsYKOD.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgbox.com/JHK5a2Mw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgbox.com/JHK5a2Mw.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgbox.com/DbTHFgJt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgbox.com/DbTHFgJt.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgbox.com/kRNv7rON.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgbox.com/kRNv7rON.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgbox.com/gugsPrWg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgbox.com/gugsPrWg.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgbox.com/OQD9c4bb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgbox.com/OQD9c4bb.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a8502a599c0b5020214c60518d16edff9b840b35","amp;dn":"The+Complete+Far+Side","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8502a599c0b5020214c60518d16edff9b840b35","infoHashBuffer":{"type":"Buffer","data":[168,80,42,89,156,11,80,32,33,76,96,81,141,22,237,255,155,132,11,53]},"announce":[],"urlList":[]}}