{"title":"Sara Bareilles - Little Voice","uid":4652123,"size":83216914,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a87edfe5199909a2710b18ce66b11f8f4720a498&amp;dn=Sara+Bareilles+-+Little+Voice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Beatlezing","files":12,"time":1232083901,"description":"1. Love Song\n2. Vegas\n3. Bottle It Up\t\n4. One Sweet Love\t\n5. Come Round Soon\n6. Morningside\t\n7. Between The Lines\n8. Love On The Rocks\n9. City\n10. Many the Miles\n11. Fairytale\n12. Gravity\n\nFor many listeners, Little Voice will be their first exposure to this soulful singer/songwriter, but it's actually Sara Bareilles' second record. Her first, the self-released Careful Confessions, led to a deal with Epic. Since then, Bareilles has opened for Marc Broussard and Maroon 5. She's also become a bonafide soundtrack queen with tracks featured in female-centric films Girl Play, Loving Annabelle, and Monster-in-Law. As with her out-of-print debut, the UCLA grad wrote every song on her first major label recording (Little Voice features re-worked versions of several demo numbers). Like the portrait on the back of the CD--Bareilles in strappy black dress and lace-free high-tops--the piano-playing chanteuse combines the sweet with the scruffy. While her jazzy pop melodies are radio-ready, her relationship-oriented lyrics can be unexpectedly salty (&quot;Bottle Up&quot; and &quot;Come Round Soon&quot; wouldn't pass FCC muster). A little profanity here and there, however, doesn't indicate tough-girl attitude--Amy Winehouse can rest easy--so much as a desire to express herself freely. As Bareilles explains in &quot;Love Song,&quot; &quot;I'm trying to let you hear me as I am.&quot; (Not surprisingly, her degree is in communications.) Fans of Sarah McLachlan and Alicia Keyes will find much to like here. --Kathleen C. Fennessy  ","torrent":{"xt":"urn:btih:a87edfe5199909a2710b18ce66b11f8f4720a498","amp;dn":"Sara+Bareilles+-+Little+Voice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a87edfe5199909a2710b18ce66b11f8f4720a498","infoHashBuffer":{"type":"Buffer","data":[168,126,223,229,25,153,9,162,113,11,24,206,102,177,31,143,71,32,164,152]},"announce":[],"urlList":[]}}