{"title":"T.G.British.Bake.Off-S07E06.-.Extra.Slice-S03E06--w.subs-540p","uid":15924699,"size":1101313337,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a8aa7712dac9ae6f159ac2d36a4fece05a47185d&amp;dn=T.G.British.Bake.Off-S07E06.-.Extra.Slice-S03E06--w.subs-540p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":6,"uploader":"uggauga","files":4,"time":1475284200,"description":"\nThe Great British Bake Off - S07E06\r\n&amp;\r\nThe Great British Bake Off: An Extra Slice - S03E06\r\n\r\nBBC (2016)\r\n  \nhttp://www.bbc.co.uk/programmes/b07r2pr0  \nhttp://www.bbc.co.uk/programmes/b07r1ff2\r\n\r\n_______________________________________\r\n\r\n960x540 resolution - MP4 files\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - Enjoy !!\r\n_______________________________________\r\n\r\n\r\nThe Great British Bake Off, Series 7 Episode 6 of 11\r\nBotanical Week\r\nIt's week six of The Great British Bake Off and just seven bakers remain. This week, for the very first time on Bake Off, it's Botanical Week.\r\nThere are three challenges inspired by nature. The bakers can reach for anything that grows to give their bakes maximum botanical taste.\r\nThe bakers start with a signature challenge with a twist, that demands sharp citrus flavours and perfect peaks. Hidden under the gingham cloth is a leafy technical challenge set by Mr Hollywood. And finally, the botanical showstopper is the biggest challenge of the series so far - not one, not two, but three tiers of elaborately decorated cake.\r\nPaul and Mary are looking for beautifully flavoured sponges and to be wowed by stunning floral designs. Three challenges, three chances to win star baker, three chances to avoid leaving the tent.\r\n\r\n\r\nThe Great British Bake Off: An Extra Slice, Series 3\r\nEpisode 6\r\nIt is week six in the Great British Bake Off tent and just seven bakers remain to tackle a Bake Off first - botanical week.\r\nJoining host Jo Brand in the An Extra Slice studio are three celebrity fans including Danny Baker, all eager to chew over the latest goings on in the tent. There is unseen footage from the BBC One show, chat about the latest baking shenanigans and an interview with the latest baker to leave.\r\nJo and her guests celebrate bakes inspired by nature in the An Extra Slice studio, taste the studio audience bakes and look at viewer photos of their creations from home. They also put the citrus signature, Paul's technical and the three-tiered showstopper under the microscope.\r\nThe Great British Bake Off: An Extra Slice - when one helping of Bake Off just isn't enough","torrent":{"xt":"urn:btih:a8aa7712dac9ae6f159ac2d36a4fece05a47185d","amp;dn":"T.G.British.Bake.Off-S07E06.-.Extra.Slice-S03E06--w.subs-540p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8aa7712dac9ae6f159ac2d36a4fece05a47185d","infoHashBuffer":{"type":"Buffer","data":[168,170,119,18,218,201,174,111,21,154,194,211,106,79,236,224,90,71,24,93]},"announce":[],"urlList":[]}}