{"title":"Kinesiology For Dummies [PDF] [StormRG]","uid":10892692,"size":4472462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8cca5a9b8110b373491bfe9037c4899ee82a5b1&amp;dn=Kinesiology+For+Dummies+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"0xmovva","files":2,"time":1409099389,"description":"Author: Steve Glass (Author), Brian Hatzel (Author), Rick Albrecht (Author)\nPaperback: 384 pages\nPublisher: For Dummies; 1 edition (March 17, 2014)\nLanguage: English\nISBN-10: 1118549236\nISBN-13: 978-1118549230\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nMove at your own pace with this kinesiology course guide\nA required course for majors pursuing sports medicine, exercise science, nursing, or sports therapy degrees, kinesiology is central to a variety of fields. Kinesiology For Dummies tracks an introductory course in the science and imparts the basics of human body movement. With this resource, you will learn how physical activity can alleviate chronic illnesses and disabilities, what factors contribute to musculoskeletal injury, and how to reverse those influences. Complete with a 16-page color insert of medical instructions, this book covers the basics of exercise physiology, exercise and health psychology, introductory biomechanics, motor control, history and philosophy of sport and exercise, and mind-body connections.\n\nWritten by experts in exercise science\nAddresses a timely subject as exercise science careers and majors are increasingly popular\nRuns parallel to a kinesiology course with accessible, concise language\nInterested learners, kinesiology students, and health or sports therapy professionals will benefit from this refresher course in the basics.","torrent":{"xt":"urn:btih:a8cca5a9b8110b373491bfe9037c4899ee82a5b1","amp;dn":"Kinesiology+For+Dummies+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8cca5a9b8110b373491bfe9037c4899ee82a5b1","infoHashBuffer":{"type":"Buffer","data":[168,204,165,169,184,17,11,55,52,145,191,233,3,124,72,153,238,130,165,177]},"announce":[],"urlList":[]}}