{"title":"The Dramatic Writer's Companion - Will Dunne","uid":10468027,"size":1182257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8f711a9e077ada2b862f7c269abb1d4a76f1203&amp;dn=+The+Dramatic+Writer%27s+Companion+-+Will+Dunne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1404225240,"description":"The Dramatic Writer's Companion: Tools to Develop Characters, Cause Scenes, and Build Stories (Chicago Guides to Writing, Editing, and Publishing)\n\nMoss Hart once said that you never really learn how to write a play; you only learn how to write this play. Crafted with that adage in mind, &quot;The Dramatic Writer's Companion&quot; is designed to help playwrights and screenwriters explore their own ideas in order to develop the script in front of them. No ordinary guide to plotting, this handbook starts with the principle that character is key. 'The character is not something added to the scene or to the story,' writes author Will Dunne. 'Rather, the character is the scene. The character is the story.' Having spent decades working with dramatists to refine and expand their existing plays and screenplays, Dunne effortlessly blends condensed dramatic theory with specific action steps - over sixty workshop-tested exercises that can be adapted to virtually any individual writing process and dramatic script. Dunne's in-depth method is both instinctual and intellectual, allowing writers to discover new actions for their characters and new directions for their stories. Dunne's own experience is a crucial element of this guide. His plays have been selected by the Eugene O'Neill Theater Center for three U.S. National Playwrights Conferences and have earned numerous honors, including a Charles MacArthur Fellowship, four Bay Area Theatre Critics Circle Awards, and two Drama-Logue Playwriting Awards. Thousands of individuals have already benefited from his workshops, and &quot;The Dramatic Writer's Companion&quot; promises to bring his remarkable creative method to an even wider audience. &quot;The Dramatic Writer's Companion&quot; features: more than sixty of the author's workshop-tested exercises for playwrights and screenwriters; an underlying focus on character as the root of scene and story; a unique, nonlinear format that allows the writer to use exercises in any order and as often as needed to meet individual writing goals; a special troubleshooting section that addresses common script problems; a glossary of key terms; and, examples drawn from well-known plays and films, including both contemporary and classical masterworks.","torrent":{"xt":"urn:btih:a8f711a9e077ada2b862f7c269abb1d4a76f1203","amp;dn":"+The+Dramatic+Writer%27s+Companion+-+Will+Dunne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8f711a9e077ada2b862f7c269abb1d4a76f1203","infoHashBuffer":{"type":"Buffer","data":[168,247,17,169,224,119,173,162,184,98,247,194,105,171,177,212,167,111,18,3]},"announce":[],"urlList":[]}}