{"title":"Whatever Happened To Baby Jane (1962)","uid":5535502,"size":732173124,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a9410bc50516245a469faeb23307db475e128d9b&amp;dn=Whatever+Happened+To+Baby+Jane+%281962%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"nightissuchproximity","files":1,"time":1273059451,"description":".avi\n\n\nWhatever Happened to Baby Jane\nRobert Aldrich, USA, 1962, 132 minutes \n\nRobert Aldrich's famous black comedy lives up to its reputation of being far-fetched yet fascinating and thoroughly entertaining. It stars two legitimate all-time screen greats, Bette Davis and Joan Crawford, both of whom had been stars for over 30 years, as elderly sisters sharing a house is sixties America. Both play former movie stars; Blanche Hudson (Crawford) is crippled and confined to a wheelchair, and Baby Jane Hudson (Davis) is completely demented. \n\nThe film starts with a prologue, set in the 20's, where the Hudson sisters' father is eagerly promoting the talents of young &quot;Baby Jane&quot;, a Shirley Temple-type singer and actress. Blanche can only look on jealously, and vow to be famous one day. The scene then shifts to the 1930's. Baby Jane has had a run of success as a child, but now grown up is washed and forgotten by her fans. Blanche is really popular as movie star, having lived up to her vow. Then there is mysterious car accident... \n\nThe scene shifts again to &quot;Yesterday&quot;, where cripple Blanche lives with Jane, who is still trying to regain her fame. Resentful of her sister, Jane embarks on a series of psychological and physical tortures, such as feeding her rats and throwing her down stairs. Gradually, Jane gets worse and worse as Blanche's efforts to calm her fail, until she eventually goes too far... \n\nThis film fuelled rumours about the feud between Crawford and Davis (&quot;I wouldn't piss on Crawford if she was on fire&quot;) which stretched way back to the 30's. Some of the slaps and kicks were supposedly real; either way the actresses mutual hate made them both give excellent performances. \n\nReview by Martin Hunt\nTaken from EUFS Programme 1992-93 \n\n---------------------------------------------------------------------------------\n\n\n\nWhatever happened to Baby Jane? There was nobody quite like her. A massively popular child star, she grew up into a second rate actress, overshadowed by the beautiful sister on whom she came to depend for financial support. Now it's 1962, her sister has been crippled in a car accident, it's Jane's turn to support her, and Jane is gradually losing her mind.\n\nThere's nothing quite like Whatever Happened To Baby Jane? With towering performances from two of the 20th century's greatest stars, a mercilessly witty script and direction which pulls no punches, it's quite simply the greatest melodrama of its era. Coming across on the surface like a brutal pantomime, it's underscored with bitter criticism of the cult of celebrity and of society's expectations of women. It's gleefully OTT on its depiction of suffering and madness, yet both central characters retain a degree of humanity which is genuinely touching. They don't make 'em like this any more.\n\n \n&quot;Joan Crawford and I have never been warm friends. We are not simpatico. I admire her, and yet I feel uncomfortable with her. To me, she is the personification of the movie star,&quot; said Bette Davis of her co-star - the woman whom, in a less generous mood, she was to accuse of having slept with every male star at MGM except Lassie. The famous rivalry between the two actresses gave this film an onscreen chemistry rarely matched. &quot;Working with Bette Davis was my greatest challenge and I mean that kindly. She liked to scream and yell. I just sit and knit,&quot; said Crawford, yet her quiet Blanche is gradually revealed as no more saintly than her sister, and in this understated role Crawford simmers spectacularly.\n\nIf you see just one film starring either of these actresses, see this one. &quot;I hope they have been exhibited and withdrawn and are never heard from again,&quot; said Crawford of the films she made afterwards. This was the apex of both their careers and it's an unforgettable ride.\n\n","torrent":{"xt":"urn:btih:a9410bc50516245a469faeb23307db475e128d9b","amp;dn":"Whatever+Happened+To+Baby+Jane+%281962%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9410bc50516245a469faeb23307db475e128d9b","infoHashBuffer":{"type":"Buffer","data":[169,65,11,197,5,22,36,90,70,159,174,178,51,7,219,71,94,18,141,155]},"announce":[],"urlList":[]}}