{"title":"(Rare) Marketing Warfare - Al Ries Jack Trout [Qwerty80]","uid":7875647,"size":11182752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9c68928f121abd02dc690aeff1161056b40f3f2&amp;dn=%28Rare%29+Marketing+Warfare+-+Al+Ries+Jack+Trout+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"KatQwerty","files":1,"time":1354332813,"description":"You've got your hands on one of the greatest marketing manuals ever writtenÂ­Â­the classic that defines the strategies, plans, and campaigns of today's marketing battlefield. Marketing is war. To triumph over the competition, it's not enough to target customers. Marketers must take aim at their competitorsÂ­Â­and be prepared to defend their own turf from would-be attackers at all times. This indispensable guide gives smart fighters the best tacticsÂ­Â­defensive, offensive, flanking, and guerrilla. It's the book that wrote the new rules!\n\nPraise For Marketing Warfare:\n\n&quot;By far the most valuable and exiting business book to come along in years.&quot;Â­Â­Glamour\n\n&quot;Had Coca-Cola only listened to Trout and Ries, it would have known that to tamper with the Real Thing would be to court disaster.&quot;Â­Â­New York\n\n&quot;Chock-a-block with examples of successful and failed marketing campaigns. . .Makes for a very interesing and relevant read.&quot;Â­Â­USA Today\n\n--This text refers to the Paperback edition.\nAbout the Author\nAl Ries is Chairman of Ries &amp; Ries, an Atlanta-based marketing strategy firm. He is a legendary marketing strategist and the bestselling author/coauthor of eleven books on marketing. Ries writes a monthly marketing column for AdAge.com, and he is frequently quoted in major publications.\n\nJack Trout is President of Trout &amp; Partners Ltd., where he supervises a global network of experts that apply his concepts and develop his methodology around the world. Trout is recognized as the world's foremost marketing strategist; his concept of &quot;positioning&quot; has become the world's #1 business strategy. Trout writes a bimonthly column for Forbes.com.\n\nRies and Trout are also the authors of the marketing classic Positioning.","torrent":{"xt":"urn:btih:a9c68928f121abd02dc690aeff1161056b40f3f2","amp;dn":"%28Rare%29+Marketing+Warfare+-+Al+Ries+Jack+Trout+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9c68928f121abd02dc690aeff1161056b40f3f2","infoHashBuffer":{"type":"Buffer","data":[169,198,137,40,241,33,171,208,45,198,144,174,255,17,97,5,107,64,243,242]},"announce":[],"urlList":[]}}