{"title":"Michael Breen - NLP Times -- Emotional Mastery (State Control)","uid":8546834,"size":40553667,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a9d2acbbafea766c458cde78c52366add5dab63e&amp;dn=Michael+Breen+-+NLP+Times+--+Emotional+Mastery+%28State+Control%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"yTSa6","files":9,"time":1370545172,"description":"Michael Breen - NLP Times -- Emotional Mastery (State Control)\n\n2 hours, 20 minutes of audio and a pdf transcript as well as an assignment pdf.\n\n\nOf all the ways the person can use the technology of NLP to better their life,\nlearning to better manage your emotions is surely one of the highest leverage\npractices you can do. Everything starts and ends with state; with the right\nemotions all kinds of things become possible, and in the wrong state certain\nresources are blocked. Therefore tonight, Michael is going to review some of the fundamentals of state mastery, and share with you the strategies and insights on how you can become highly effective with managing your state, no matter what seems to be going on in your external environment. So, welcome Michael.\n\n...\n\nOne of the most common things that people bring up, first and foremost, when\nwe're talking about emotions and states from an NLP point of view, a state\u0010\u0010\nremember\u0010\u0010is the combination of the stuff that's going on on the inside\u0010\u0010the kindof pictures that you're making, the kind of way that you're talking to yourself, and all the other internal representational things\u0010\u0010plus what you're doing with your body. That includes everything from how you're using your body, the posture, the kinds of gestures, the quality of that irrelative tension in the muscles, how you use your voice, your breathing, all those other aspects. Those two things together are what we're talking about when we're talking about state.\n\n...\n\nSo, the triggers and the reactions are not in the environment; they're in each of us. And this will become important later on when we start talking about ways and means of modifying your state, changing your state, and then dealing with habituated emotions. And emotions are just like any other behaviors, they can become habituated. You can develop a nasty habit of being easy to arouse, you know, easy to wind up. And &quot;bad emotions&quot;, or good emotions are habitual just like any other thing. You can work with them, you can cultivate them, you can end certain kinds of emotional responses, and you can deal with the kinds of things that come up unexpectedly, but those are matters of preparation or practice. And we'll talk about those in a little while.\n\nI suppose the final thing that I should say about that is that quite often when you read about, or when you hear emotions talked about, there's a lot of metaphor, analogy, imagery diffused, in talking about the emotions. So, for example, in the NLP world there are some people who talk about what they call meta\u0010states. These are states about states; being afraid of your fear. Unfortunately, the way that our nervous system and the meat\u0010body is hooked up, we don't have facility to actually have a separate area for a state that's about another state. There's nothing in the neurology or in the physiology that would hold a meta\u0010state. Meta\u0010states are a way of talking about, rather than actually how a human being works.\n\nIn the same way, like in the name, Neuro\u0010linguistic programming, this notion of\nprogramming, of systemic and systematic process, which can be mapped out, it's an image, it's a metaphor. The notion of computer programming, which\nsometimes people try and bring to NLP, you know, push a button emotions, and push button other people, it's an idea and a concept, and not how things are.\n","torrent":{"xt":"urn:btih:a9d2acbbafea766c458cde78c52366add5dab63e","amp;dn":"Michael+Breen+-+NLP+Times+--+Emotional+Mastery+%28State+Control%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d2acbbafea766c458cde78c52366add5dab63e","infoHashBuffer":{"type":"Buffer","data":[169,210,172,187,175,234,118,108,69,140,222,120,197,35,102,173,213,218,182,62]},"announce":[],"urlList":[]}}