{"title":"Democracy 3: Africa (2.2.0.3) (GOG)","uid":14326353,"size":191465891,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aa20371dfaddc559b132659e11011363ac83faf4&amp;dn=Democracy+3%3A+Africa+%282.2.0.3%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"mercs215","files":2,"time":1460660360,"description":"Install instructions:\r\n- Run &quot;setup_democracy3_africa_2.2.0.3.exe&quot;\r\n- Play\r\nCredits: this release was made possible by Swapware Games Network!\r\nIf you like this game, support the developers and BUY IT!\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\n\r\nTitle: DEMOCRACY 3: AFRICA\r\nGenre: Strategy - Simulation - Managerial\r\nWorks on: Windows (XP, Vista, 7, 8, 10) and Mac OS X (10.9.0+)\r\nLanguages: Audio and text: English. Text only: Deutsch, français\r\nFeatures: single-player - achievements\r\nReleased: April 12, 2016\r\nSize: 182.6 MB\r\nCompany: Positech Games / Positech Games\r\nStore page: https://www.gog.com/game/democracy_3_africa\r\n \r\nAbout:\r\nWelcome to Africa\r\nHave you ever wanted to be president or prime-minister? Convinced you could do a better job of running the country? Let's face it, you could hardly do a worse job than our current political leaders.\r\nTake Control of African Politics\r\nDemocracy 3: Africa is the new standalone 're-imagining' of the hit political strategy game 'Democracy 3'. Set entirely in countries on the continent of Africa, D3:A puts you in charge of these countries and challenges you to stay in power whilst fixing each country's problems, improving the quality of life for your electorate, and steering them towards greater prosperity.\r\nThis turn-based political strategy game uses a unique icon-driven interface to help you navigate the most complex political and economic simulation ever seen in a computer game, custom-built on its own proprietary neural network. Democracy 3: Africa simulates the myriad interactions between voters, policies, economic and political variables, political parties and the various situations that develop over time.\r\nDemocracy 3: Africa uses the base design and gameplay from the original game but the diversity of social and economic situations in Africa presents you with new challenges and opportunities. Foreign aid and investment takes on a new meaning and often comes with strings attached. Serious issues like malnutrition and access to clean water could be a matter of life and death for the poorest. This new game will let you try your hand at governing the diverse democracies of Nigeria, Egypt, South Africa, Kenya, Ghana, Zambia, Senegal, Tunisia, Botswana and Mauritius.When you step down, will your country be in a better state than when you took up office?\r\nAlthough it builds on the existing game, Democracy 3: Africa has completely new artwork, music and a series of new events and dilemmas tuned to the issues and situations that are relevant in contemporary Africa.\r\nCan you turn your country into an economic powerhouse that competes with the strongest world economies? Is this the vision you have for your country, or are you aiming for a socialist haven? Can you improve health and education for all your people? Does a little corruption help oil the wheels of power? And can you do this whilst keeping the competing demands of the people under control?","torrent":{"xt":"urn:btih:aa20371dfaddc559b132659e11011363ac83faf4","amp;dn":"Democracy+3%3A+Africa+%282.2.0.3%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa20371dfaddc559b132659e11011363ac83faf4","infoHashBuffer":{"type":"Buffer","data":[170,32,55,29,250,221,197,89,177,50,101,158,17,1,19,99,172,131,250,244]},"announce":[],"urlList":[]}}