{"title":"Harold: The Last Anglo-Saxon King","uid":15848054,"size":1169652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa2ff8b34efd290175af06cb5d39e10b8a8ba9b9&amp;dn=Harold%3A+The+Last+Anglo-Saxon+King&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"marty14","files":1,"time":1474129709,"description":"Harold: The Last Anglo-Saxon King - Ian W. Walker [epub]\r\n\r\nKing Harold Godwineson (c.1022-66) is one of history's shadowy figures, known mainly for his defeat and death at the Battle of Hastings. His true status and achievements have been overshadowed by the events of 1066 and the bias imposed by the Norman victory. This text aims to correct the common view of Harold, presenting an argument for being one of England's greatest rulers. The book presents Harold's life in its proper context, offering a critical study of his career in the years leading up to 1066.\r\n\r\nIt begins with an account of Harold's father, Earl Godwine and his rise to power, and goes on to discuss how Harold too rose to power through service to the childless King Edward and eventually being named as Edward's successor. The text offers a thorough consideration of Harold's short but extremely eventful reign, detailing a series of attacks by Harold's vengeful brother and two full-scale invasions from Norway and Normandy.\r\n\r\nIan Walker presents a critique of the sources of this information and attempts to reconcile the distortions in the divergent &quot;English&quot; and &quot;Norman&quot; accounts available to modern commentators, allowing the reader to make a realistic assessment of both Harold and his rival William","torrent":{"xt":"urn:btih:aa2ff8b34efd290175af06cb5d39e10b8a8ba9b9","amp;dn":"Harold%3A+The+Last+Anglo-Saxon+King","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa2ff8b34efd290175af06cb5d39e10b8a8ba9b9","infoHashBuffer":{"type":"Buffer","data":[170,47,248,179,78,253,41,1,117,175,6,203,93,57,225,11,138,139,169,185]},"announce":[],"urlList":[]}}