{"title":"On China (2011) Kissinger  -epub","uid":6438042,"size":953316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa36c15c5e562bf3416e72756ff7d961df530022&amp;dn=On+China+%282011%29+Kissinger++-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"bookzilla","files":1,"time":1306865311,"description":"&quot;Nobody living can claim greater credit than Mr. Kissinger for America's 1971 opening to Beijing, after more than two decades of estrangement, and for China's subsequent opening to the world. So it's fitting that Mr. Kissinger has now written On China, a fluent, fascinating...book that is part history, part memoir and above all an examination of the premises, methods and aims of Chinese foreign policy.&quot; \n-The Wall Street Journal \n\n&quot;Fascinating, shrewd... [The book's] portrait of China is informed by Mr. Kissinger's intimate firsthand knowledge of several generations of Chinese leaders. The book deftly traces the rhythms and patterns in Chinese history...even as it explicates the philosophical differences that separate it from the United States.&quot; \n-Michiko Kakutani, The New York Times \n\n&quot;Henry Kissinger was not only the first official American emissary to Communist China, he persisted in his brokerage with more than 50 trips over four decades, spanning the careers of seven leaders on both sides. Diplomatically speaking, he owns the franchise; and with On China, as he approaches 88, he reflects on his remarkable run. To the degree that Washington and Beijing now know each other, it is in good measure because Kissinger has been assiduously translating for both sides.&quot; \n-Max Frankel, The New York Times Book Review \n\n&quot;Fascinating... In On China, statesman Henry Kissinger draws on historical records and 40 years of direct interaction with four generations of Chinese leaders to analyze the link between China's ancient past and its present day trajectory. In doing so, the man who helped shape modern East-West relations presents an often unsettling, occasionally hopeful and always compelling accounting of what we're up against.&quot; \n-The Chicago Sun-Times \n\n&quot;From the eminent elder statesman, an astute appraisal on Chinese diplomacy from ancient times to the fraught present &quot;strategic trust&quot; with the United States. Former Secretary of State Kissinger brings his considerable scholarly knowledge and professional expertise to this chronicle of the complicated evolution and precarious future of Chinese diplomacy with the West. ... Sage words and critical perspective lent by a significant participant in historical events.&quot; \n-Kirkus Reviews (starred review) \nProduct Description\nIn this sweeping and insightful history, Henry Kissinger turns for the first time at book-length to a country he has known intimately for decades, and whose modern relations with the West he helped shape. Drawing on historical records as well as his conversations with Chinese leaders over the past forty years, Kissinger examines how China has approached diplomacy, strategy, and negotiation throughout its history, and reflects on the consequences for the global balance of power in the 21st century. \n\nSince no other country can claim a more powerful link to its ancient past and classical principles, any attempt to understand China's future world role must begin with an appreciation of its long history. For centuries, China rarely encountered other societies of comparable size and sophistication; it was the &quot;Middle Kingdom,&quot; treating the peoples on its periphery as vassal states. At the same time, Chinese statesmen-facing threats of invasion from without, and the contests of competing factions within-developed a canon of strategic thought that prized the virtues of subtlety, patience, and indirection over feats of martial prowess. \n\nIn On China, Kissinger examines key episodes in Chinese foreign policy from the classical era to the present day, with a particular emphasis on the decades since the rise of Mao Zedong. He illuminates the inner workings of Chinese diplomacy during such pivotal events as the initial encounters between China and modern European powers, the formation and breakdown of the Sino-Soviet alliance, the Korean War, Richard Nixon's historic trip to Beijing, and three crises in the Taiwan Straits. Drawing on his extensive personal experience with four generation of Chinese leaders, he brings to life towering figures such as Mao, Zhou Enlai, and Deng Xiaoping, revealing how their different visions have shaped China's modern destiny. \n\nWith his singular vantage on U.S.-China relations, Kissinger traces the evolution of this fraught but crucial relationship over the past 60 years, following its dramatic course from estrangement to strategic partnership to economic interdependence, and toward an uncertain future. With a final chapter on the emerging superpower's 21st-century world role, On China provides an intimate historical perspective on Chinese foreign affairs from one of the premier statesmen of the 20th century. \n\nHardcover: 608 pages \nPublisher: Penguin Press HC, The; 1 edition (May 17, 2011) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:aa36c15c5e562bf3416e72756ff7d961df530022","amp;dn":"On+China+%282011%29+Kissinger++-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa36c15c5e562bf3416e72756ff7d961df530022","infoHashBuffer":{"type":"Buffer","data":[170,54,193,92,94,86,43,243,65,110,114,117,111,247,217,97,223,83,0,34]},"announce":[],"urlList":[]}}