{"title":"Encyclopedia of the Neurological Sciences [1st &amp; 2nd ed.]","uid":15578500,"size":296657103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa9957fd82708540b6fdb76a2194eaa3558db2b3&amp;dn=Encyclopedia+of+the+Neurological+Sciences+%5B1st+%26amp%3B+2nd+ed.%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"clouderone","files":2,"time":1471371208,"description":"The Encyclopedia of the Neurological Sciences, Second Edition develops from the first edition, covering all areas of neurological sciences through over 1000 entries focused on a wide variety of topics in neurology, neurosurgery, psychiatry and other related areas of neuroscience. The contributing authors represent all aspects of neurology from many viewpoints and disciplines to provide a complete overview of the field. Entries are designed to be understandable without detailed background knowledge in the subject matter, and cross-referencing and suggested further reading lead the reader from a basic knowledge of the subject to more advanced understanding.\r\n\r\nThe easy-to-use 'encyclopedic-dictionary' format of the Encyclopedia of the Neurological Sciences, Second Edition features alphabetic entries, extensive cross-referencing, and a thorough index for quick reference. The wealth of information provided by these four volumes makes this reference work a trusted source of valuable information for a wide range of researchers, from undergraduate students to academic researchers.\r\n\r\n\r\n\r\nProvides comprehensive coverage of the field of neurological science in over 1,000 entries in 4 volumes\r\n&quot;Encyclopedic-dictionary&quot; format provides for concise, readable entries and easy searching\r\nPresents complete, up-to-date information on 32 separate areas of neurology\r\nEntries are supplemented with extensive cross-referencing, useful references to primary research articles, and an extensive index","torrent":{"xt":"urn:btih:aa9957fd82708540b6fdb76a2194eaa3558db2b3","amp;dn":"Encyclopedia+of+the+Neurological+Sciences+%5B1st+%26amp%3B+2nd+ed.%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9957fd82708540b6fdb76a2194eaa3558db2b3","infoHashBuffer":{"type":"Buffer","data":[170,153,87,253,130,112,133,64,182,253,183,106,33,148,234,163,85,141,178,179]},"announce":[],"urlList":[]}}