{"title":"Start with Why: How Great Leaders Inspire Everyone to Take Actio","uid":9670446,"size":1489023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aaaf2e1b6862abdcca07e1cd3552c94713f1ffc0&amp;dn=Start+with+Why%3A+How+Great+Leaders+Inspire+Everyone+to+Take+Actio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"xXGalaxyXx","files":-1,"time":1393449902,"description":"----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nAuthor(s): Simon Sinek\nPublisher: Portfolio Hardcover\nDate : 2009\nPages : 256\nFormat : PDF\nLanguage : English\nISBN-10 : 1591842808\nISBN-13 : 978-1591842804\nSize : 1.41 MB\n\n----------------------------------------------------------------------------------\nDescription:\n----------------------------------------------------------------------------------\n\nWhy do you do what you do? Why are some people and organizations more innovative, more influential, and moer profitable than others? Why do some command greater loyalty from customers and employees alike? Even among the successful, why are so few able to repeat their success over and over?\n\nPeople like Martin Luther King Jr., Steve Jobs, and the Wright Brothers might have little in common, but they all started with why. It was their natural ability to start with why that enabled them to inspire those around them and to achieve remarkable things.\n\nIn studying the leaders who've had the greatest influence in the world, Simon Sinek discovered that they all think, act, and communicate in the exact same way -- and it's the complete opposite of what everyone else does. Sinek calls this powerful idea The Golden Circle, and it provides a framework upon which organizations can be built, movements can be lead, and people can be inspired. And it all starts with WHY.\n\nAny organization can explain what it does; some can explain how they do it; but very few can clearly articulate why. WHY is not money or profit-- those are always results. WHY does your organization exist? WHY does it do the things it does? WHY do customers really buy from one company or another? WHY are people loyal to some leaders, but not others?\n\nStarting with WHY works in big business and small business, in the nonprofit world and in politics. Those who start with WHY never manipulate, they inspire. And the people who follow them don't do so because they have to; they follow because they want to.\n\nDrawing on a wide range of real-life stories, Sinek weaves together a clear vision of what it truly takes to lead and inspire. This book is for anyone who wants to inspire others or who wants to find someone to inspire them. \n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:aaaf2e1b6862abdcca07e1cd3552c94713f1ffc0","amp;dn":"Start+with+Why%3A+How+Great+Leaders+Inspire+Everyone+to+Take+Actio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaaf2e1b6862abdcca07e1cd3552c94713f1ffc0","infoHashBuffer":{"type":"Buffer","data":[170,175,46,27,104,98,171,220,202,7,225,205,53,82,201,71,19,241,255,192]},"announce":[],"urlList":[]}}