{"title":"[SoM]Grosso guaio a Chinatown[DvdRip-Divx-Ita-AC3]","uid":5302108,"size":1468729344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aab7d021259519a872d5ee9989c2f9755a474a5d&amp;dn=%5BSoM%5DGrosso+guaio+a+Chinatown%5BDvdRip-Divx-Ita-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"misafor","files":1,"time":1264258097,"description":"\n\nDue amici, l'americano Jack Burton e il cinese Wang-Chi (il primo conducente di autotreno l'altro proprietario di un ristorante) si recano all'aeroporto di S. Francisco a ricevere - in arrivo da Pechino - la bella Suzee Pai, fidanzata di Wang-Chi, che intende sposarla. Ma questa ragazza dagli occhi verdi viene rapita per conto del misterioso Lo Pan da una banda di scalmanati, alla quale inutilmente tentano di resistere i due amici, che perÃƒÂ² li inseguono fino a Chinatown, trovandosi implicati in spettacolari avventure a colpi di &quot;kung-fu&quot;. Qui Lo Pan, condannato dal primo imperatore cinese addirittura anni prima di Cristo a un'esistenza a un'esistenza apparente, deve trovare e sposare la &quot;Vergine dagli occhi verdi&quot; per riprendere consistenza. Per liberare la ragazza, Jack e Wang affrontano i fantasmagorici sotterranei di Chinatown, pieni di sorprese e di imprevisti, si incontrano con esseri ora mostruosi ora dotati di forze misteriose e violente, tra incredibili avventure. Alla fine la bella ÃƒÂ¨ liberata e sposa Wang, mentre Jack si rimette alla guida del suo autotreno per le strade della California.\n","torrent":{"xt":"urn:btih:aab7d021259519a872d5ee9989c2f9755a474a5d","amp;dn":"%5BSoM%5DGrosso+guaio+a+Chinatown%5BDvdRip-Divx-Ita-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aab7d021259519a872d5ee9989c2f9755a474a5d","infoHashBuffer":{"type":"Buffer","data":[170,183,208,33,37,149,25,168,114,213,238,153,137,194,249,117,90,71,74,93]},"announce":[],"urlList":[]}}