{"title":"Hardtied--Predicament   Kel Bowie High","uid":15785750,"size":2449516448,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ab51e1c2fcabd3a2f0c28991ace90a2d7c709a14&amp;dn=Hardtied--Predicament+++Kel+Bowie+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":4,"uploader":"merzedes","files":1,"time":1473320678,"description":"Predicament  | Kel Bowie\r\n\r\nSeptember 7, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBondage Slut in Powerful Predicament \r\n \r\nSome people find their way into bondage through friends, some through significant others, and some through sheer chance. Kel Bowie never had to find her way into it at all. As far as she's concerned, and as far as we can tell, Kel was born for bondage. She thinks about it all the time and always has. In the beginning of her session, in fact, she mentions the first time she was ever tied up at the fresh young age of nine. It's no wonder she found her way to our dungeon.\r\n\r\nKel has her arms tied back in a brutal strappado and her legs tied at the ankles to spread them as wide as they can go. As O.T. ties her neck rope to the ceiling she gets curious and wants to watch to see what he's doing. O.T. doesn't feel the need to humor this slut enough to look her in the face and tells her not to look at him unless he says otherwise. Kel does her best but she can't seem to keep her eyes off of his hands as he sets her up for her torment. It looks like O.T. is going to have to teach her a lesson in listening to simple, basic instructions.\r\n\r\nHe cuts holes in her tight little dress so that he can attach some nipple clamps and canes all over her feet and legs. Her neck rope is so tightly tied to the ceiling that each time she squirms with discomfort, it chokes her a little tighter. O.T. moves her around the room as he sees fit to more uncomfortable and intense positions, but she never loses the rope around her neck. She must have done a pretty bad job of listening, because pretty soon she is well acquainted with not just the feeling of the cane on her legs, but also barbecue skewers on her feet, and a flogger on her sensitive pussy. \r\n \r\nScreens \nhttp://www.hardtied.com/hogtied/bondage/trailer.php?y=2016&amp;p=09_07kbowie2&amp;u=Hardtied-Kel-Bowie-Predicament-\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:ab51e1c2fcabd3a2f0c28991ace90a2d7c709a14","amp;dn":"Hardtied--Predicament+++Kel+Bowie+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab51e1c2fcabd3a2f0c28991ace90a2d7c709a14","infoHashBuffer":{"type":"Buffer","data":[171,81,225,194,252,171,211,162,240,194,137,145,172,233,10,45,124,112,154,20]},"announce":[],"urlList":[]}}