{"title":"[FSX] PMDG 777 Official Liveries (Rip)","uid":10630958,"size":1617726868,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ab74b8645c35a1720c15417529ecc966de508f27&amp;dn=%5BFSX%5D+PMDG+777+Official+Liveries+%28Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"leopard87","files":-1,"time":1406313313,"description":"Recently, some of the pirates around here have been requesting for ripped versions of official liveries for PMDG 777 as they think there are hidden bombs in the official PMDG 777 liveries. While I think any possible bomb is probably hidden in the Operations Center itself rather than the liveries themselves, I still decided to rip ALL the official liveries for PMDG 777-200LRF and 777-300ER for you.\n\nThese liveries have been ripped from a clean installation of PMDG 777-200LRF SP1 &amp; 777-300ER. You'll have to install them manually, but at least they should be 100% bomb-free. Install them in a &quot;clean&quot; (not hijacked by Operations Center or anything else from PMDG) PMDG 777 installation and see if they work you. Under normal conditions, they should work perfectly. If they still do not work, your computer or PMDG 777 installation have probably been fucked up by PMDG and you need to clean their shit from your computer before you proceed.\n\nInstallation instructions and aircraft configuration files are included in each livery.\n\nThis package was complete and up-to-date at the time I uploaded this here at TPB.\n\nUsers who don't have any problem downloading the liveries through the Operations Centers do NOT need to download this.\n\nI don't need this package as downloading liveries through OC works just fine for me; I created it only for those who have problems when they download liveries from OC. As such, I don't want to seed this forever. Please SEED if you like this package.\n\nEnjoy!","torrent":{"xt":"urn:btih:ab74b8645c35a1720c15417529ecc966de508f27","amp;dn":"%5BFSX%5D+PMDG+777+Official+Liveries+%28Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab74b8645c35a1720c15417529ecc966de508f27","infoHashBuffer":{"type":"Buffer","data":[171,116,184,100,92,53,161,114,12,21,65,117,41,236,201,102,222,80,143,39]},"announce":[],"urlList":[]}}