{"title":"[MommysGirl] Lisa Ann, Cassidy Klein (Mommy's Meditation / 03.28","uid":11780381,"size":316695441,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ac5e1c35597f3a7a3a901bb82e9190b4f71a3b77&amp;dn=%5BMommysGirl%5D+Lisa+Ann%2C+Cassidy+Klein+%28Mommy%27s+Meditation+%2F+03.28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"chkm8te","files":1,"time":1427551953,"description":"[MommysGirl] Lisa Ann, Cassidy Klein (Mommy's Meditation / 03.28.2015)\n\nCassidy Klein's friend Lola is a bad influence on her! Cassidy wants to respect her step-mom Lisa Ann's privacy during meditation time -- especially since her step-mom happens to meditate NAKED -- but Lola keeps putting these ideas in her head! First she insists she and Cassidy go and interrupt the meditation session, and then what's with all that weird stuff about Cassidy being lucky to have a mom that meditates in her birthday suit? And did Lola just call her mom hot?! Lola swears she didn't but Cassidy knows what she heard. And she'd never think of her mom that way... although, now that she thinks of it, her mom does have a great body for her age, especially those huge, natural tits of hers, and it's hard not to notice when they're right out there for all to see.\nMaybe this kind of curiosity is natural, Cassidy thinks to herself, and maybe she's more curious about her mom's meditation techniques than about her body. So she asks for some instruction, and they sit down to begin some breathing exercises. Lisa Ann's gentle hand on Cassidy's thigh definitely gets her in a more relaxed state, and her mom's soft voice takes Cassidy deeper into the meditation mood. Cassidy wants to get the full experience, so she follows in her mom's footsteps and removes her top to let her energy flow freely.\nThe stars align, and Cassidy can see it clearly now. She does have a desire, a yearning for her step-mother's touch, and she realizes it might not be as bad as she feared. Lisa Ann takes her into a deep kiss, and guides her step-daughter in learning other positions and exercises that can lead to a happy and relaxed state. First Lisa Ann gently kisses her step-daughter's pussy, then teaches Cassidy how to pleasure a woman with her own lips and tongue. It's a wonderful session for the both of them, that leaves them feeling blissful and fulfilled by the end of it.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=mhgw8g5b6x1nj28ysz26.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=mhgw8g5b6x1nj28ysz26.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=yqif85wumv6ofb0ava05.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=yqif85wumv6ofb0ava05.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ac5e1c35597f3a7a3a901bb82e9190b4f71a3b77","amp;dn":"%5BMommysGirl%5D+Lisa+Ann%2C+Cassidy+Klein+%28Mommy%27s+Meditation+%2F+03.28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac5e1c35597f3a7a3a901bb82e9190b4f71a3b77","infoHashBuffer":{"type":"Buffer","data":[172,94,28,53,89,127,58,122,58,144,27,184,46,145,144,180,247,26,59,119]},"announce":[],"urlList":[]}}