{"title":"LucisArt 3.05 ED  SE plugin Photoshop (32-64 bit) [ChingLiu]","uid":7903784,"size":12128984,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ad8651521e00dca1d053ffd5fe730653713467de&amp;dn=LucisArt+3.05+ED++SE+plugin+Photoshop+%2832-64+bit%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"Ching_Liu","files":4,"time":1355032833,"description":"LucisArt 3 Benefits:\n\nReveal incredible image detail by moving one slider. Image detail is revealed in the bright, dark and mid-range areas of your image simultaneously.\n\nCreativity: Quickly and easily explore the creative potential of your image. Play a little. LucisArt reveals numerous possible versions of your image. Use LucisArt multiple times to even further expand the variety of artistic effects. \n\nTime savings: Professional photographers need to quickly repair images and create salable artistic effects. Create artistic effects in a few minutes that would take much longer to even approximately achieve with other image processing methods (if those artistic effects could be achieved at all). This could save hours of image-processing time.\n\nEffectively no learning curve: The LucisArt controls are intuitive and easy to use. There is no manual. Create your first LucisArt image in as little as 5 minutes.\n\nValue: Professional photographers are looking to differentiate themselves from their primary competition - their customers. In addition to the time savings, professional photographers could charge for adding LucisArt special effects and secure artistic image sales from customers no longer interested in purchasing realistic photography.\n\nLucisArt 3 ED provides the ability to fine-tune how you enhance detail. LucisArt 3 ED provides a slider that you can alter in increments of 2 intensity levels. That is 125 settings for an 8-bit image. \n\nLucisArt 3 SE gives you the Special Effects Watercolor (the Smooth Detail slider), Sculpture, and Plaid. Sculpture enhances contrast patterns in the image, and Plaid also enhances contrast patterns but adds texture (radial lines).\n\nSystem Requirements \n\n32-bit and 64-bit software provided. It works in Adobe Photoshop CS-CS6 and Photoshop Elements 6-11.\n\nOn a 64-bit Windows 7 or XP or Vista computer, Photoshop CS3 is always 32-bit software. Photoshop CS4-CS6 can be installed either as 32-bit software (under Program Files x86) or 64-bit software (under Program Files).\n\nLanguage : English\n\nHomepage : http://www.lucisart.com/index.htm","torrent":{"xt":"urn:btih:ad8651521e00dca1d053ffd5fe730653713467de","amp;dn":"LucisArt+3.05+ED++SE+plugin+Photoshop+%2832-64+bit%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad8651521e00dca1d053ffd5fe730653713467de","infoHashBuffer":{"type":"Buffer","data":[173,134,81,82,30,0,220,161,208,83,255,213,254,115,6,83,113,52,103,222]},"announce":[],"urlList":[]}}