{"title":"Diamonds, Gold and War: The British, The Boers and ...","uid":15861548,"size":952180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ade28eed2cc35222581885e5643a8c4475e34c85&amp;dn=Diamonds%2C+Gold+and+War%3A+The+British%2C+The+Boers+and+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"marty14","files":1,"time":1474304146,"description":"Diamonds, Gold and War: The British, The Boers and the Making of South Africa - Martin Meredith [epub]\r\n\r\nSouthern Africa was once regarded as a worthless jumble of British colonies, Boer republics, and African chiefdoms, a troublesome region of little interest to the outside world. But then prospectors chanced first upon the world's richest deposits of diamonds, and then upon its richest deposits of gold. What followed was a titanic struggle between the British and the Boers for control of the land, culminating in the costliest, bloodiest, and most humiliating war that Britain had waged in nearly a century, and in the devastation of the Boer republics.\r\n\r\nMartin Meredith's magisterial account of those years portrays the great wealth and raw power, the deceit, corruption, and racism that lay behind Britain's empire-building in southern Africa. Based on significant new research and filled with atmospheric detail, it focuses on the fascinating rivalry between diamond titan Cecil Rhodes and Paul Kruger, the Boer leader whose only education was the Bible, who believed the earth was flat, yet who defied Britain's prime ministers and generals for nearly a quarter of a century. Diamonds, Gold and War makes palpable the cost of western greed to Africa's native peoples, and explains the rise of the virulent Afrikaner nationalism that eventually took hold in South Africa, with repercussions lasting nearly a century","torrent":{"xt":"urn:btih:ade28eed2cc35222581885e5643a8c4475e34c85","amp;dn":"Diamonds%2C+Gold+and+War%3A+The+British%2C+The+Boers+and+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ade28eed2cc35222581885e5643a8c4475e34c85","infoHashBuffer":{"type":"Buffer","data":[173,226,142,237,44,195,82,34,88,24,133,229,100,58,140,68,117,227,76,133]},"announce":[],"urlList":[]}}