{"title":"Understanding Qi Gong - Part 3","uid":5499746,"size":370968011,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ae5cad9252040e02889faa6278bc1cca74ed2993&amp;dn=Understanding+Qi+Gong+-+Part+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"Porkka666","files":3,"time":1271467514,"description":"In Understanding Qigong DVD 3, renowned Qigong (chi kung) expert and author Dr. Yang, Jwing-Ming teaches the theory and practice of embryonic breathing. Also known as ÃƒÂ«back to childhood breathingÃƒÂ­, this qigong meditation technique is the foundation of internal cultivation and advanced practice. Embryonic breathing develops excellent wellbeing and increases your sensitivity and awareness.\n\nThis multi-language program is captured in High Definition, and builds on the fundamental theory taught in DVDs 1 &amp; 2. Dr. Yang's systematic approach to teaching offers deep insight into the ancient art of Qigong with modern scientific data to support his theory from both an Eastern and Western perspective.\n\nDrawing on his 35 years of training in Qigong and his Western scientific background as a Physics professor and Ph.D in Mechanical Engineering, Dr. Yang presents a clear and fascinating explanation of his Qigong theory in a home seminar you won't want to miss. This program is a must for Qigong practitioners, acupuncturists, meditators, and anyone interested in understanding exactly of how and why Qigong works.\n\n* Learn to conserve and store your Qi to abundant levels\n* Develop excellent health and vitality and enjoy deep relaxation\n* Establish the root of spiritual enlightenment","torrent":{"xt":"urn:btih:ae5cad9252040e02889faa6278bc1cca74ed2993","amp;dn":"Understanding+Qi+Gong+-+Part+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae5cad9252040e02889faa6278bc1cca74ed2993","infoHashBuffer":{"type":"Buffer","data":[174,92,173,146,82,4,14,2,136,159,170,98,120,188,28,202,116,237,41,147]},"announce":[],"urlList":[]}}