{"title":"Weeds (The Complete Series) [1080p] [Multi-Sub]","uid":9464842,"size":65752900051,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:af071bfa47ad38af296225a76d39fdc8a0d0aac5&amp;dn=Weeds+%28The+Complete+Series%29+%5B1080p%5D+%5BMulti-Sub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":58,"uploader":"devlin85","files":-1,"time":1389440620,"description":"[SHOW INFO]\n\nWeeds is an American dark comedy-drama series created by Jenji Kohan and produced by Tilted Productions in association with Lionsgate Television. The central character is Nancy Botwin (Mary-Louise Parker), a widowed mother of two boys who begins selling cannabis to support her family after her husband dies suddenly of a heart attack. Over the course of the show, she and her family become increasingly entangled in illegal activities.\n\nThe first three seasons take place primarily in the fictional town of Agrestic, California. During seasons four and five, the Botwins reside in the fictional beach side town of Ren Mar in San Diego County, California. In the sixth season, the family relocates to Seattle, Washington, and then Dearborn, Michigan. In between seasons six and seven, Nancy serves a prison sentence in Connecticut while her sons and brother-in-law live in Copenhagen, Denmark. At the beginning of season seven, Nancy moves into a halfway house in New York City where she reunites with her family. They live in Manhattan for the duration of the season, but relocate to Connecticut in the season seven finale and throughout season eight.\n\nThe show debuted on the Showtime cable network on August 7, 2005, earning the channel's highest ratings. The series ended with the eighth and final season on September 16, 2012. In 2012, TV Guide Network bought the airing rights, providing an edited version of the show free of charge. The show has received numerous awards, including two Satellite Awards, one Golden Globe Award, a Writers Guild of America Award, a Young Artist Award, and 2 Emmy Awards.\n\n[TECHNICAL DETAILS]\n\nSource: [BD], I cleaned the video up as best I could to reduce low light artifacts, general screen noise, and other HD generation one glitches.\n\nFile Container: MP4\nVideo Format: h.264/Mpeg4\nVideo Resolution: 1920x1080\n\nAudio Type: English 6 Channel Surround\nAudio Format: AAC\n\nSubtitle Language: English, Chinese, French, German, Italian, Hindi, Japanese, Korean, Russian, Spanish, and Swedish!\n","torrent":{"xt":"urn:btih:af071bfa47ad38af296225a76d39fdc8a0d0aac5","amp;dn":"Weeds+%28The+Complete+Series%29+%5B1080p%5D+%5BMulti-Sub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af071bfa47ad38af296225a76d39fdc8a0d0aac5","infoHashBuffer":{"type":"Buffer","data":[175,7,27,250,71,173,56,175,41,98,37,167,109,57,253,200,160,208,170,197]},"announce":[],"urlList":[]}}