{"title":"Scar Symmetry -The Singularity(Phase I-Neohumanity)(2014)320k","uid":11150212,"size":104918809,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:af37fea39eeaa2c28218da3885e477977e755c80&amp;dn=+Scar+Symmetry+-The+Singularity%28Phase+I-Neohumanity%29%282014%29320k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"analogkid6103","files":8,"time":1412331563,"description":"MP3  320kbps\nJust when you think a genre has exhausted its possibilities, when a certain style of metal has hit the wall of mediocrity, along comes a band to jolt life back into it. Hailing from Sweden a mecca for melodic death metal and on a quest to pioneer their own form of that well-established genre, SCAR SYMMETRY proved to be an exceptional gathering of talents able to produce an eccentric mixture of metal that can only be described as an intoxicating, modern hybrid of melodic death metal. Encapsulating everything each band member loves about metal harmony, melody, brutality, exceptional songwriting, complex instrumentation - this union of Yin/Yang elements lent itself to SCAR SYMMETRYs blueprint of amalgamation in their quest to make unbridled music devoid of borders.\nimage\nThe bands name thought into existence by drummer Ohlsson denotes a peculiar balance. A combination of a hard word (scar), and a soft word (symmetry), it symbolizes the emotional scars everyone harvests from living a human life and the symmetry we share with each other as a result. For Jonas Kjellgren (Carnal Forge, Centinex, World Below), Henrik Ohlsson (Altered Aeon, Theory In Practice, Mutant), Per Nilsson (Altered Aeon), Christian lvestam (Unmoored, Incapacity, Torchbearer), and Kenneth Seil, the symmetry existed in spades. There was an instant click between these musicians hailing from different regions of Sweden, and difficult as it is to believe, the band sent the Stockholm-based Cold Records their one-track (!) demo, Seeds Of Rebellion, and landed a deal in mid-2004.\n\nFor their debut album, SCAR SYMMETRY entered Kjellgrens own Black Lounge Studio to record and self-produce Symmetric In Design in three months. Featuring artwork by Pr Johansson, the lyrics tackled mystical &amp; cosmic themes such as astral projection, reincarnation, and dark prophecies of a dystopian future. Showcasing ambient vocal harmonies, striking &amp; intricate transitions, and a deeply rooted spirit of experimentation in all twelve tracks, SCAR SYMMETRY created one of 2005s buried treasures, as Symmetric In Design went on to place in multiple end-of-the-year lists among the metal press under various categories: Best Debut Album, Best of 2005, and Bands You Should Know. Vocalist Christian lvestam demonstrated all the signs of multiple personality disorder with his Mikael kerfeldt-styled guttural death growls, his higher, sadistic register similar to Hypocrisys Peter Tgtgren, and ultimately unleashing an emotionally clean voice bordering on the likes of AOR-styled rock. A standout first effort, hailed AllMusic.com, while Outburn Magazine praised: Complete with amazing guitar work, dark symphonic synthetic ambience, and bone-crushing thrash-heavy grooves, SCAR SYMMETRY reaches into little-charted territory to capture the imagination.\n\nWith less than eight months between releases, SCAR SYMMETRYs ambition seeks to flex its muscular and melodic aggression once again with Pitch Black Progress. Featuring the same stellar cast from their debut album, this sophomore effort proves they have created a dominion of inherent diversity where THEY control the extremes. Re-entering Black Lounge Studio (owned and run by Kjellgren, who comes from a family lineage of professional musicians) with their no-holds-barred approach to music making, SCAR SYMMETRY dive deep into their collective subconscious and resurface to unveil another sonic tapestry of astoundingly versatile textures. With the aim to resurrect the awe in their listeners, The Illusionist, Slaves To The Subliminal, The Kaleidoscopic God, Calculate The Apocalypse, and Retaliator all exemplify lvestams extreme range (which takes you between fearsome death growls &amp; blissfully clean vocals and back again), Kjellgren &amp; Nilssons tricky fretwork &amp; heroic, prog-infused guitar solos, Seils precise bass lines, and Ohlssons exacting drum work. Every track converges into a pinnacle of raw talent that flourishes with its expression.\n\nThe genre of melodic death has received another mighty gift from Sweden by way of Pitch Black Progress. Featuring artwork by Anthony Clarkson (Hypocrisy, Exodus) and encompassing the viciousness of Edge Of Sanity, the melody of Soilwork, the intricacies of Into Eternity, and the experimentation of Voivod, SCAR SYMMETRY successfully merges seemingly incongruous extremities to exude a sonic vision of continual expansion. While its true that no one goes unscathed when dealing with the cruelties in this world, misery does indeed enjoy company!\n\n\n\n\nLine-up:\n\nRoberth Karlsson - vocals\nLars Palmqvist - vocals\nKenneth Seil - bass\nHenrik Ohlsson - drums\nPer Nilsson - guitar\n\n\nScar Symmetry - The Singularity (Phase I - Neohumanity) (2014)\n\n\n\n\nCBR @ 320kbps\n\n\n\nTracklist:\n\n\n01. The Shape Of Things To Come\n02. Neohuman\n03. Limits To Infinity\n04. Cryonic Harvest\n05. The Spiral Timeshift\n06. Children Of The Integrated Circuit\n07. Neuromancers\n08. Technocalyptic Cybergeddon\n\nGenre: Death\nSubgenre: Melodic death metal\nBitrate: 320 k\nSize: 100.06 MB\nShow/Hide Files:\n8 files ","torrent":{"xt":"urn:btih:af37fea39eeaa2c28218da3885e477977e755c80","amp;dn":"+Scar+Symmetry+-The+Singularity%28Phase+I-Neohumanity%29%282014%29320k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af37fea39eeaa2c28218da3885e477977e755c80","infoHashBuffer":{"type":"Buffer","data":[175,55,254,163,158,234,162,194,130,24,218,56,133,228,119,151,126,117,92,128]},"announce":[],"urlList":[]}}