{"title":"Unsolved Mysteries - The UFO Files  (Complete Series)","uid":6073775,"size":2931383064,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:afcfdcacd529c79a7e2ec286dbd1b2fedf5a7db7&amp;dn=Unsolved+Mysteries+-+The+UFO+Files++%28Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"Lucy1948","files":6,"time":1293738767,"description":"Episode Listing\n\nDisc 1:\nBentwaters UFO\nAllagash Abductions\nCrop Circles\nPhoenix UFO\nNazca Lines\nMexico UFO\nVancouver Lights\n\nDisc 2:\nRoswell\nRoswell/Area 51 Connection\nHudson Valley UFO\nBelgian UFO\nFalcon Lake UFO\nUFO Healing\n\nDisc 3:\nAustrailian UFO\nMissing Time\nSocorro Close Encounter\nKecksburg UFO\nTexas UFO\nFace On Mars\n\nDisc 4:\nMen In Black\nCanadian UFO\nWheatfields Visitations\nLife On Mars\nInterceptors\nThe Blob\nUFO Odyssey\n\n\n\nWould it surprise you to know that Unsolved Mysteries is one of the longest running television series of all time?\n\nFrom 1987 until his death in 2003, Robert Stack (probably best known as the original Eliot Ness in the 1950s TV series, The Untouchables) hosted this show that explored the paranormal - one part documentary, one part investigative report, and another part re-enactment drama. Although the show continues on and has added murder investigation to its genre coverage, a number of Unsolved Mysteries segments, which were hosted by Robert Stack, are now available on DVD, grouped by paranormal genre.\n\nTwo box sets ? The UFO Files and Scariest Ghost Stories - are now available with a third box set ? Miracles ? coming in November. Psychics, Bizarre Murders and Legends will be available in 2005. Each DVD contains numerous 10-minute segments, each of which outlining a paranormal event.\n\nThe UFO Files ? though Unsolved Mysteries has endured since 1987, the producers were savvy enough to update the show making sure that UFO segments had an X-Files-esque feel to them. Robert Stack, clad in a trademark trench coat, introduces each segment with semi-serious gravity, as if he were revealing a government secret to Mulder and Sculley.\n\nEach UFO segment plays like a mini-documentary. There are interviews with the eyewitnesses, analysis from experts in the field, some occasional footage and a re-enactment drama with low-budget special effects. The overall effect is quite earnest ? the audience will be intrigued by the interviews and the sightings with photographic evidence are always fascinating.\n\nAdding to the feeling of an unbiased documentary, the experts - both sceptics and believers - explain their positions while witnesses are run through lie detector tests or are corroborated with the local police chief or reverend. The end result is that the viewer is left with compelling evidence, credible witnesses but asked to draw their own conclusions.\n\nWORTH IT? Absolutely! The UFO Files works well as a great starting point for library research as all segments are based on celebrated cases of UFO sightings or encounters.\n\nRECOMMENDATION: If you want a briskly paced video overview of some interesting UFO cases, The UFO Files is a must-see. ","torrent":{"xt":"urn:btih:afcfdcacd529c79a7e2ec286dbd1b2fedf5a7db7","amp;dn":"Unsolved+Mysteries+-+The+UFO+Files++%28Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afcfdcacd529c79a7e2ec286dbd1b2fedf5a7db7","infoHashBuffer":{"type":"Buffer","data":[175,207,220,172,213,41,199,154,126,46,194,134,219,209,178,254,223,90,125,183]},"announce":[],"urlList":[]}}