{"title":"Boys on Film 11 (2014) DVD RIP ","uid":9885189,"size":2253264646,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:afd810ea7d45ed63846249fd1579b8d373ff778f&amp;dn=Boys+on+Film+11+%282014%29+DVD+RIP+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":5,"uploader":"jmanwf","files":8,"time":1396581409,"description":"Description\n\nhere is some info on it it isnt on the imdb database yet\n &lt;a href=&quot;\nhttp://www.amazon.co.uk/Boys-Film-11-DVD-Various/dp/B00GO5I084/ref=sr_1_1?s=dvd&amp;ie=UTF8&amp;qid=1396573333&amp;sr=1-1&amp;keywords=boys+on+film+11&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/Boys-Film-11-DVD-Various/dp/B00GO5I084/ref=sr_1_1?s=dvd&amp;ie=UTF8&amp;qid=1396573333&amp;sr=1-1&amp;keywords=boys+on+film+11&lt;/a&gt;\n\nhis diverse and daring compilation tells stories ranging from the whimsical, heart-rendering and poignant to the unflinchingly bold and provocative. Latent ambitions are vibrantly brought to life in a remote part of Alaska, a forbidden lust is explored in Denmark, a friendship is tested to dangerous limits and a devoted father is faced with his teenage son s budding sexuality.\n\nWe Are Animals - dir. Dominic Haxton (USA) 13mins\nThis beautifully filmed, bold and daring alternate historical fable is set during the 1980s AIDS crisis. When a closeted young man finds himself in the midst of an anti-government coup, he joins in the fight against the strict regime that is being enforced upon them.\n\nBurger - dir. Magnus Mork (UK/Norway) 11mins\nSet on location in Cardiff, Burger is an observational study looking at the variety of customers that a late night burger bar attracts. Norwegian filmmaker Magnus Mork has painted a beautiful portrait of both gay and straight couples. It is the fourth short film to be produced by the Iris Prize, the world's largest lesbian and gay short film prize valued at Â£25,000, after Mork won the short film prize in 2010 for The Samaritan. Winner of Sundance Short Film Special Jury Award for Direction and Ensemble Acting 2014.\n\nAlaska is a Drag - dir. Shaz Bennett (USA) 14mins\nThe unique Leo stands out from the crowd. This isn t ideal when working in a small fish cannery in Alaska. His dreams of leaving this small town appear impossible, until a new boy joins and sees Leo for the superstar he was destined to be.\n\nThree Summers- dir. Carlos Augusto de Oliveira (Denmark) 28mins\nAs poignant as it is daring, Three Summers charts an unlikely friendship between a middle aged divorcee and a teenage boy. As lines are blurred and secrets are shared, a closeness develops in a way they never would have expected.\n\nThe Last Time I Saw Richard- dir. Nicholas Verso (Australia) 23mins\nSet in a teen mental health clinic, we meet lone wolf Jonah who is forced to share a room with the newly admitted Richard. The boys form a connection based on mutual respect and some common demons; though Jonah soon discovers that not everybody wants to be saved.\n\nLittle Man- dir. Eldar Rapaport (UK/Israel) 24mins\nFacing thirty, Elliott realises he has jeopardised every relationship that has come his way. The weekend his brother shows up on his doorstep and a bizarre neighbour begins spying on him; Elliott is driven to the edge in this uneasy psychological tale of obsession. Directed by the winner of the 2011 Iris Prize, Eldar Rapaport, who has since gone on to direct feature films, including the beautiful August.\n\nFor Dorian- dir. Rodrigo Barriuso (Canada) 16mins\nFor Dorian deals with a sensitive and vastly under-represented issue: the sexual awakening of teenagers with disabilities. Told from the moving perspective of a devoted father of a boy with Down Syndrome, it challenges the ways in which the disabled are frequently asexualised.\n\nSpooners - dir. Bryan Horch (USA) 14mins\nIn this hilarious, inventive and pleasingly whimsical comedy, a gay couple s ridiculous quest for a comfortable mattress transforms into a journey of acceptance and public openness with their sexuality.\n","torrent":{"xt":"urn:btih:afd810ea7d45ed63846249fd1579b8d373ff778f","amp;dn":"Boys+on+Film+11+%282014%29+DVD+RIP+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afd810ea7d45ed63846249fd1579b8d373ff778f","infoHashBuffer":{"type":"Buffer","data":[175,216,16,234,125,69,237,99,132,98,73,253,21,121,184,211,115,255,119,143]},"announce":[],"urlList":[]}}