{"title":"The Origin Mystery trilogy by A.G. Riddle [complete] {dwg}","uid":10969781,"size":11242068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0032291b5600afeb63341f0bf3745c8a3295152&amp;dn=The+Origin+Mystery+trilogy+by+A.G.+Riddle+%5Bcomplete%5D+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"gratefuldawg77","files":18,"time":1409784389,"description":"THE GREATEST MYSTERY OF ALL TIME... \nTHE HISTORY OF HUMAN ORIGINS... \nWILL BE REVEALED.\n_______________________________\n70,000 years ago, the human race almost went extinct.\nWe survived, but no one knows how.\nUntil now.\nThe countdown to the next stage of human evolution is about to begin, and humanity may not survive this time.\n_______________________________\nThe Immari are good at keeping secrets. For 2,000 years, they've hidden the truth about human evolution. They've also searched for an ancient enemy - a threat that could wipe out the human race. Now the search is over.\nOff the coast of Antarctica, a research vessel discovers a mysterious structure buried deep in an iceberg. It has been there for thousands of years, and something is guarding it. As the Immari rush to execute their plan, a brilliant geneticist makes a discovery that could change everything.\nDr. Kate Warner moved to Jakarta, Indonesia to escape her past. She hasn't recovered from what happened to her, but she has made an incredible breakthrough: a cure for autism. Or so she thinks. What she has found is far more dangerous - for her and the entire human race. In the hands of the Immari, it would mean the end of humanity as we know it.\nAgent David Vale has spent ten years trying to stop the Immari. Now he's out of time. His informant is dead. His organization has been infiltrated. His enemy is hunting him. But when David receives a coded message related to the Immari attack, he risks everything to save the one person that can help him solve it: Dr. Kate Warner.\nTogether, Kate and David must race to unravel a global conspiracy and learn the truth about the Atlantis Gene... and human origins. Their journey takes them to the far corners of the globe and into the secrets of their pasts. The Immari are close on their heels and will stop at nothing to obtain Kate's research and force the next stage of human evolution - even if it means killing 99.9% of the world's population. David and Kate can stop them... if they can trust each other. And stay alive.\n\n\nA PANDEMIC 70,000 YEARS IN THE MAKING...\nWILL CHANGE HUMANITY...\nFOREVER.\n________________________________________\nIn Marbella, Spain, Dr. Kate Warner awakens to a horrifying reality: the human race stands on the brink of extinction. A pandemic unlike any before it has swept the globe. Nearly a billion people are dead--and those the Atlantis Plague doesn't kill, it transforms at the genetic level. A few rapidly evolve. The remainder devolve.\nAs the world slips into chaos, radical solutions emerge. Industrialized nations offer a miracle drug, Orchid, which they mass produce and distribute to refugee camps around the world. But Orchid is merely a way to buy time. It treats the symptoms of the plague but never actually cures the disease.\nImmari International offers a different approach: do nothing. Let the plague run its course. The Immari envision a world populated by the genetically superior survivors--a new human race, ready to fulfill its destiny.\nWith control of the world population hanging in the balance, the Orchid Alliance and the Immari descend into open warfare. Now humanity's last hope is to find a cure, and Kate alone holds the key to unraveling the mystery surrounding the Atlantis Plague. The answer may lie in understanding pivotal events in human history--events when the human genome mysteriously changed. Kate's journey takes her across the barren wastelands of Europe and northern Africa, but it's her research into the past that takes her where she never expected to go. She soon discovers that the history of human evolution is not what it seems--and setting it right may require a sacrifice she never imagined.\n\n\nWith humanity's back against the wall... \nA signal from space could be the key to saving the human race... \nAs the clock ticks down, a team of scientists will risk it all to unravel the secrets of the Atlantis World. \n__________________________________________________ \nNorthern Morocco: Dr. Kate Warner cured a global pandemic, and she thought she could cure herself. She was wrong. And she was wrong about the scope of the Atlantis conspiracy. Humanity faces a new threat, an enemy beyond imagination. With her own time running out and the utter collapse of human civilization looming, a new hope arrives: a signal from a potential ally. \nArecibo Observatory: Mary Caldwell has spent her life waiting, watching the stars, looking for signs of intelligent life beyond our world. When that day comes, Mary finds herself in the middle of a struggle older than the human race, with far greater stakes. She must decide who to trust, because there's nowhere to hide. \nAntarctica: In the wake of the Atlantis Plague, Dorian Sloane finds himself a puppet to Ares' mysterious agenda. As Dorian prepares to take control of the situation, Ares unleashes a cataclysm that changes everything. As the catastrophe circles the globe, Ares reveals the true nature of the threat to humanity, and Dorian agrees to one last mission: find and kill David Vale and Kate Warner. There will be no prisoners this time. The orders are seek and destroy, and Dorian has been promised that his own answers and salvation lie on the other side. \nWith Dorian in pursuit, Kate, David, and their team race through the ruins of the Atlantean ship left on Earth, across Atlantean science stations throughout the galaxy, and into the past of a mysterious culture whose secrets could save humanity in its darkest hour. With their own lives on the line and time slipping away, Kate, David and Dorian are put to the ultimate test.","torrent":{"xt":"urn:btih:b0032291b5600afeb63341f0bf3745c8a3295152","amp;dn":"The+Origin+Mystery+trilogy+by+A.G.+Riddle+%5Bcomplete%5D+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0032291b5600afeb63341f0bf3745c8a3295152","infoHashBuffer":{"type":"Buffer","data":[176,3,34,145,181,96,10,254,182,51,65,240,191,55,69,200,163,41,81,82]},"announce":[],"urlList":[]}}