{"title":"Proof: The Science of Booze - Adam Rogers - Audiobook MP3","uid":10428318,"size":253134860,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b0260ce701075054ed81faa1851823410c50d790&amp;dn=Proof%3A+The+Science+of+Booze+-+Adam+Rogers+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1403773177,"description":"** The last two seconds of audio on each of the nine MP3 segments is cut off. Not my fault, I didn't rip it. **\n\nMP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nProof: The Science of Booze\n\nWritten by: Adam Rogers\nNarrated by: Sean Runnette\nLength: 8 hrs and 45 mins\nFormat: Unabridged\nRelease Date:05-27-14\nProgram Type: Audiobook\n\nA spirited narrative on the fascinating art and science of alcohol, sure to inspire cocktail party chats on making booze, tasting it, and its effects on our bodies and brains.\n\nDrinking gets a lot more interesting when you know what's actually inside your glass of microbrewed ale, single-malt whisky, or Napa Cabernet Sauvignon. All of them begin with fermentation, where a fungus called yeast binges on sugar molecules and poops out ethanol. Humans have been drinking the results for 10,000 years. Distillation is a 2,000-year-old technology - invented by a woman - that we're still perfecting today. And the molecular codes of alcoholic flavors remain a mystery pursued by scientists with high-tech laboratories and serious funding.\n\nIn Proof, Adam Rogers reveals alcohol as a miracle of science, going deep into the pleasures of making and drinking booze - and the effects of the latter. The people who make and sell alcohol may talk about history and tradition, but alcohol production is really powered by physics, molecular biology, organic chemistry, and a bit of metallurgy - and our taste for those products is a melding of psychology and neurobiology.\n\nProof takes readers from the whisky-making mecca of the Scottish highlands to the oenology labs at UC Davis, from Kentucky bourbon country to the most sophisticated gene-sequencing labs in the world - and to more than one bar - bringing to life the motley characters and evolving science behind the latest developments in boozy technology.\n\n\n** The last two seconds of audio on each of the nine MP3 segments is cut off. Not my fault, I didn't rip it. **","torrent":{"xt":"urn:btih:b0260ce701075054ed81faa1851823410c50d790","amp;dn":"Proof%3A+The+Science+of+Booze+-+Adam+Rogers+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0260ce701075054ed81faa1851823410c50d790","infoHashBuffer":{"type":"Buffer","data":[176,38,12,231,1,7,80,84,237,129,250,161,133,24,35,65,12,80,215,144]},"announce":[],"urlList":[]}}