{"title":"Brain Mapping - An Encyclopedic Reference","uid":15593285,"size":466654541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b09fe0f9210eca5025c6111e2d259c503a8b62f8&amp;dn=Brain+Mapping+-+An+Encyclopedic+Reference&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"clouderone","files":1,"time":1471536910,"description":"Brain Mapping - An Encyclopedic Reference - Arthur W. Toga (AP, 2015).pdf\r\n\r\nBrain Mapping: A Comprehensive Reference offers foundational information for students and researchers across neuroscience. With over 300 articles and a media rich environment, this resource provides exhaustive coverage of the methods and systems involved in brain mapping, fully links the data to disease (presenting side by side maps of healthy and diseased brains for direct comparisons), and offers data sets and fully annotated color images. Each entry is built on a layered approach of the content – basic information for those new to the area and more detailed material for experienced readers. Edited and authored by the leading experts in the field, this work offers the most reputable, easily searchable content with cross referencing across articles, a one-stop reference for students, researchers and teaching faculty.\r\n\r\nBroad overview of neuroimaging concepts with applications across the neurosciences and biomedical research\r\nFully annotated color images and videos for best comprehension of concepts\r\nLayered content for readers of different levels of expertise\r\nEasily searchable entries for quick access of reputable information\r\nLive reference links to ScienceDirect, Scopus and PubMed","torrent":{"xt":"urn:btih:b09fe0f9210eca5025c6111e2d259c503a8b62f8","amp;dn":"Brain+Mapping+-+An+Encyclopedic+Reference","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b09fe0f9210eca5025c6111e2d259c503a8b62f8","infoHashBuffer":{"type":"Buffer","data":[176,159,224,249,33,14,202,80,37,198,17,30,45,37,156,80,58,139,98,248]},"announce":[],"urlList":[]}}