{"title":"Dishonored.The.Brigmore.Witches.DLC-RELOADED","uid":8809578,"size":7047488419,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b249890a199f76449f0e554f1599ba6a9b4efb7d&amp;dn=Dishonored.The.Brigmore.Witches.DLC-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":14,"uploader":"Mr.Stifmeister","files":2,"time":1376424760,"description":"\nnERv\n\nDishonored: The Brigmore Witches DLC (c) Bethesda Softworks\n\n08/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\n\nNote: Only the initial Dishonored release is required for this addon release\nto work. All previous updates and DLCs are included. We decided to pack\nthe release this way instead of several seperate dox releases, because of\nthe size of the DLC, and the fact that the update it requires updates the\nother DLCs. Enjoy\n\nContinue your journey as the legendary assassin, Daud, in Dishonored:\nThe Brigmore Witches. Access Daud's weapons, gadgets, allies and\nsupernatural abilities once more, and bring his twisted narrative that\nbegan with The Knife of Dunwall to a close.\n\nAfter discovering the identity and intentions of Delilah, the leader of\nthe Brigmore Witch coven, you set out to disrupt her from completing a\npowerful ritual that will spell your doom. Having already been betrayed\nby your lieutenant, Billie Lurk, you must rely on feuding gang\nfactions - the Dead Eels and the Hatters - to negotiate your way through\npreviously unseen districts of Dunwall en route to Delilah's stronghold.\nRegardless of the way you reach your destination, one thing is for\ncertain - you will finally answer for your treacherous actions and fall\nbefore the mercy, or punishment, of the Royal Bodyguard and Assassin,\nCorvo Attano.\n\n1. Unrar.\n2. Install this addon into the dir where you installed the game.\n3. Copy over the crack to your game installBinariesWin32 directory.\n4. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:b249890a199f76449f0e554f1599ba6a9b4efb7d","amp;dn":"Dishonored.The.Brigmore.Witches.DLC-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b249890a199f76449f0e554f1599ba6a9b4efb7d","infoHashBuffer":{"type":"Buffer","data":[178,73,137,10,25,159,118,68,159,14,85,79,21,153,186,106,155,78,251,125]},"announce":[],"urlList":[]}}