{"title":"Motors for Makers by  Matthew Scarpino [2015, 1st Ed.]","uid":15800473,"size":6896592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b27513947dceca8b7fa0110ee30f3e4c4335b874&amp;dn=Motors+for+Makers+by++Matthew+Scarpino+%5B2015%2C+1st+Ed.%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":null,"files":3,"time":1473494433,"description":"Motors for Makers: A Guide to Steppers, Servos, and Other Electrical Machines\r\n\r\n\r\nThe First Maker-Friendly Guide to Electric Motors!\r\n\r\nMakers can do amazing things with motors. Yes, they’re more complicated than some other circuit elements, but with this book, you can completely master them. Once you do, incredible new projects become possible.\r\n\r\nUnlike other books, Motors for Makers is 100% focused on what you can do. Not theory. Making.\r\n\r\nFirst, Matthew Scarpino explains how electric motors work and what you need to know about each major type: stepper, servo, induction, and linear motors. Next, he presents detailed instructions and working code for interfacing with and controlling servomotors with Arduino Mega, Raspberry Pi, and BeagleBone Black. All source code and design files are available for you to download from motorsformakers.com.\r\n\r\nFrom start to finish, you’ll learn through practical examples, crystal-clear explanations, and photos. If you’ve ever dreamed of what you could do with electric motors, stop dreaming...and start making!\r\n\r\n    Understand why electric motors are so versatile and how they work\r\n    Choose the right motor for any project\r\n    Build the circuits needed to control each type of motor\r\n    Program motor control with Arduino Mega, Raspberry Pi, or BeagleBone Black\r\n    Use gearmotors to get the right amount of torque\r\n    Use linear motors to improve speed and precision\r\n    Design a fully functional electronic speed control (ESC) circuit\r\n    Design your own quadcopter\r\n    Discover how electric motors work in modern electric vehicles--with a fascinating inside look at Tesla’s patents for motor design and control!","torrent":{"xt":"urn:btih:b27513947dceca8b7fa0110ee30f3e4c4335b874","amp;dn":"Motors+for+Makers+by++Matthew+Scarpino+%5B2015%2C+1st+Ed.%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b27513947dceca8b7fa0110ee30f3e4c4335b874","infoHashBuffer":{"type":"Buffer","data":[178,117,19,148,125,206,202,139,127,160,17,14,227,15,62,76,67,53,184,116]},"announce":[],"urlList":[]}}