{"title":"Shakira - Laundry Service (2001)  [CDRip] 320 vtwin88cube","uid":6228009,"size":123712706,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b2978c9b63018271257553c1c0767bbd30b6e8f5&amp;dn=Shakira+-+Laundry+Service+%282001%29++%5BCDRip%5D+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1299544954,"description":"Shakira\nLaundry Service (2001)\n\n\nAfter achieving superstardom throughout Latin America, Colombian-born Shakira became Latin pop's biggest female crossover artist since Jennifer Lopez. Noted for her aggressive, rock-influenced approach, Shakira maintained an extraordinary degree of creative control over her music, especially for a female artist; she wrote or co-wrote nearly all of her own material, and in the process gained a reputation as one of Latin music's most ambitiously poetic lyricists. When she released her first English material in late 2001, she became an instant pop sensation, thanks to her quirky poetic sense and a sexy video image built on her hip-shaking belly dance moves.\n\nShakira Mebarak (full name: Shakira Isabel Mebarak Ripoll) was born February 2, 1977, in Barranquilla, Colombia, into a poor family. Her mother was a native Colombian and her father was of Lebanese descent, and so as a child Shakira soaked up music from both cultures; she also listened heavily to English-language rock &amp; roll, listing her favorite bands in later interviews as Led Zeppelin, the Beatles, the Police, the Cure, and Nirvana. Shakira wrote her first song at age eight, began entering (and winning) talent competitions at age ten, and started learning the guitar at age 11 (one story runs that around this age, she was kicked out of her school choir for singing too forcefully). In 1990, at age 13, Shakira moved to BogotÃƒÂ¡ in hopes of pursuing a modeling career, but wound up signing a record deal with Sony's Colombian division instead. Her 1991 debut album, Magia, was comprised of songs she'd written over the past five or six years, including some of her earliest efforts. Although it didn't break internationally, the record started to make a name for her in her home country. Dissatisfied with the pop inclinations of the follow-up, 1993's Peligro, Shakira changed direction for a time, joining the cast of the Colombian soap opera El Oasis in 1994.\n\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nGrabber:\t\tdBpoweramp Release 14\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tPop\t\nSource:\t\t\tRetail CD\nLabel:\t\t\tSony\n\n\nTrack List:\n\n01.Objection (Tango)\n02.Underneath Your Clothes\n03.Whenever, Wherever\n04.Rules\n05.The One\n06.Ready For The Good Times\n07.Fool\n08.Te Dejo Madrid\n09.Poem To A Horse\n10.Que Me Quedes TÃƒÂº\n11.Eyes Like Yours (Ojos Asi)\n12.Suerte (Whenever, Wherever)\n13.Te Aviso, Te Anuncio (Tango)\n\n\nThanks to only1joe for his previous upload!\n\n\n\nCheers!","torrent":{"xt":"urn:btih:b2978c9b63018271257553c1c0767bbd30b6e8f5","amp;dn":"Shakira+-+Laundry+Service+%282001%29++%5BCDRip%5D+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2978c9b63018271257553c1c0767bbd30b6e8f5","infoHashBuffer":{"type":"Buffer","data":[178,151,140,155,99,1,130,113,37,117,83,193,192,118,123,189,48,182,232,245]},"announce":[],"urlList":[]}}