{"title":"The Permaculture Handbook: Garden Farming for Town and Country ","uid":8112281,"size":62954381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b29e0b3c6ce06300b52a852cf429073c5afb275c&amp;dn=The+Permaculture+Handbook%3A+Garden+Farming+for+Town+and+Country+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"DaRule762","files":1,"time":1360219128,"description":"The urban landscape has swallowed vast swaths of prime farmland across North America. Imagine how much more self-reliant our communities would be if thirty million acres of lawns were made productive again. Permaculture is a practical way to apply ecological design principles to food, housing, and energy systems, making growing fruits, vegetables, and livestock easier and more sustainable.\n\nThe Permaculture Handbook is a step-by-step, beautifully illustrated guide to creating resilient and prosperous households and neighborhoods, complemented by extensive case studies of three successful farmsteads and market gardens. This comprehensive manual casts garden farming as both an economic opportunity and a strategy for living well with less money. It shows how, by mimicking the intelligence of nature and applying appropriate technologies such as solar and environmental design, permaculture can:\n\n    Create an abundance of fresh, nourishing local produce\n    Reduce dependence on expensive, polluting fossil fuels\n    Drought-proof our cities and countryside\n    Convert waste into wealth\n\nPermaculture is about working with the earth and with each other to repair the damage of industrial overreach and to enrich the living world that sustains us. The Permaculture Handbook is the definitive practical North American guide to this revolutionary practice, and is a must-read for anyone concerned about creating food security, resilience, and a legacy of abundance rather than depletion.","torrent":{"xt":"urn:btih:b29e0b3c6ce06300b52a852cf429073c5afb275c","amp;dn":"The+Permaculture+Handbook%3A+Garden+Farming+for+Town+and+Country+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b29e0b3c6ce06300b52a852cf429073c5afb275c","infoHashBuffer":{"type":"Buffer","data":[178,158,11,60,108,224,99,0,181,42,133,44,244,41,7,60,90,251,39,92]},"announce":[],"urlList":[]}}