{"title":"Weezer - Discography 1994-2010 [FLAC]","uid":8158082,"size":4460744889,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b354342615ed71021b9d3a13919658717391c817&amp;dn=Weezer+-+Discography+1994-2010+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":7,"uploader":"rudown78","files":299,"time":1361197546,"description":"Weezer - Discography 1994-2010 [FLAC]\n\n\nAs one of the most popular groups to emerge in the post-grunge alternative rock aftermath, Weezer received equal amounts of criticism and praise for their hook-heavy guitar pop. Drawing from the heavy power pop of arena rockers like Cheap Trick and the angular guitar leads of the Pixies, Weezer leavened their melodies with doses of '70s metal learned from bands like Kiss. What truly set the band apart, though, was their geekiness. None of the members of Weezer, especially leader Rivers Cuomo, were conventional rockers: they were kids who holed up in their garage, playing along with their favorite records when they weren't studying or watching TV.\n\nAs a result, their music was infused with a quirky sense of humor and an endearing awkwardness that made songs from their debut Weezer (aka the blue album) like &quot;Undone (The Sweater Song),&quot; &quot;Buddy Holly,&quot; and &quot;Say It Ain't So&quot; into big modern rock hits during the mid-'90s. All the singles were helped immeasurably by clever videos, which may have made the songs into hits, but they also made many critics believe that the band was a one-hit wonder. Perversely, Cuomo began to feel the same way, and decided that the band would not rely on any visual gimmicks for its second album, 1996's Pinkerton. Simultaneously, Cuomo took control of the band, making it into a vehicle for his songwriting. While the album didn't sell as well as their 1994 eponymous debut, it did earn stronger reviews than its predecessor and paved the way for Weezer's long career.\n\n\nWeezer (Blue Album) [1994]\nPinkerton (1996)\nWeezer (Green Album) [2001]\nMaladroit (2002)\nWeezer (Blue Album) (Deluxe Edition) [2004]\nMake Believe (2005)\nWeezer (Red Album) [2008]\nRaditude (Deluxe Edtion) [2009]\nHurley (Deluxe Edition) [2010]\nDeath to False Metal [2010]\nPinkerton (Deluxe Edition) [2010]\n\n\nEnjoy!!!","torrent":{"xt":"urn:btih:b354342615ed71021b9d3a13919658717391c817","amp;dn":"Weezer+-+Discography+1994-2010+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b354342615ed71021b9d3a13919658717391c817","infoHashBuffer":{"type":"Buffer","data":[179,84,52,38,21,237,113,2,27,157,58,19,145,150,88,113,115,145,200,23]},"announce":[],"urlList":[]}}