{"title":"Practical 3D Printers The Science and Art of 3D Printing","uid":11555995,"size":20457618,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3accd4a102d6f7fa25b49bd33c7e07a073d85ca&amp;dn=Practical+3D+Printers+The+Science+and+Art+of+3D+Printing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1416827720,"description":"\nPractical 3D Printers: The Science and Art of 3D Printing (2012)\n\n\nSo what is a 3D printer? It's a device you can either buy or build to make parts, toys, art, and even 3D images captured by a sensor or modeled in software. Maybe you have one, or maybe you're thinking about buying or building one, but once you have one, what can you do with it?\n\nPractical 3D Printers takes you beyond building the printer to calibrating it, customizing it, and creating amazing models with it, including 3D printed text, a warship model, a robot body, windup toys, and arcade-inspired alien invaders.\n\nFirst you'll learn about the different types of popular 3D printer models and the similarities and differences among them. \n\nYou'll see how the MakerBot works, and how it's different from RepRap printers like the Huxley and Mendel as well as the whiteAnt RepStrap printer featured in the Apress book Printing in Plastic. \n\nYou'll then learn how to find and create 3D models, and even how to create a 3D model from a 2D image. \n\nNext, you'll walk through building multi-part models with a steampunk warship example, working with meshes to build your own action heroes, and creating an autonomous robot chassis. Finally, you'll find all sorts of bonus projects to build, including wind-up walkers, faceted vases for the home, and a handful of useful upgrades to improve your 3D printer.\n\nIn Practical 3D Printers, Brian Evans, the author of Beginning Arduino Programming, takes this topic deeper than any other 3D printing book with an discussion of various types of popular 3D printers, how to customize and calibrate them, and how to design and create models to put your printer to work. \n\nWhether you have the MakerBot, the Mendel, the whiteAnt, or any other 3D printer, with Practical 3D Printers, you'll be able to create amazing things with your printer.\n\nWhat you'll learn\n\nThe various types of 3D printers, what they have in common, and what sets each one apart\n\nThe printer toolchain, including controllers and printer interfaces\n\nThe art of calibrating your printer\n\nHow to find and create 3D models to print, including using Google Sketchup\n\nHow to create multipart models and meshes\n\nHow to upgrade both the mechanical and electronic parts in your printer","torrent":{"xt":"urn:btih:b3accd4a102d6f7fa25b49bd33c7e07a073d85ca","amp;dn":"Practical+3D+Printers+The+Science+and+Art+of+3D+Printing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3accd4a102d6f7fa25b49bd33c7e07a073d85ca","infoHashBuffer":{"type":"Buffer","data":[179,172,205,74,16,45,111,127,162,91,73,189,51,199,224,122,7,61,133,202]},"announce":[],"urlList":[]}}