{"title":"Words of Radiance - Brandon Sanderson [Unabridged]","uid":9711083,"size":1218909773,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b41097986621ab2bec9db43f8abc14885be3e35d&amp;dn=Words+of+Radiance+-+Brandon+Sanderson+%5BUnabridged%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"thetabpirate","files":6,"time":1394113181,"description":"----------------------------------------------------------------------------------\nI know there already are a torrent of this audiobook up\nhere. But since people were so bad att seeding it pissed\nme of and i uploaded this one instead. Its the same audio-\nbook but smaller in size and more importantly\n[I WILL SEED]\n----------------------------------------------------------------------------------\n\nWords of Radiance is the second book of The Stormlight Archive epic fantasy series written by American author Brandon Sanderson. It was published by Tor Books and released on March 4, 2014.\n\nYears ago a hireling of the Parshendi assassinated the Alethi king, Gavilar, escalating in the Vengeance Pact among the highprinces of Alethkar and the War of Reckoning against the Parshendi. Now the Assassin in White is active again, using powers that were long thought lost, and tries to kill Highprince Dalinar, widely considered the power behind the Alethi throne.\n\nKaladin, once a slave and bridgemen on the Shattered Plains, is given command of the royal bodyguards, trying to protect the king and Dalinar from perils and the threat of the Assassin. Meanwhile he struggles to master the powers of a Windrunner, that are somehow linked to his honorspren, Syl.\n\nShallan, together with her mentor Jasnah, tries to prevent the return of the legendary Voidbringers and their civilization-ending Desolation. The secret to this task can be found at the Shattered Plains, but arriving there is more difficult than she could ever imagine.","torrent":{"xt":"urn:btih:b41097986621ab2bec9db43f8abc14885be3e35d","amp;dn":"Words+of+Radiance+-+Brandon+Sanderson+%5BUnabridged%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b41097986621ab2bec9db43f8abc14885be3e35d","infoHashBuffer":{"type":"Buffer","data":[180,16,151,152,102,33,171,43,236,157,180,63,138,188,20,136,91,227,227,93]},"announce":[],"urlList":[]}}