{"title":"[Clips4Sale / PrimalFetish] Riley Reid (Making My Sweet, Horny","uid":13507963,"size":561794678,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b422d235fc05f3002424dc2570b01af37db90a95&amp;dn=+%5BClips4Sale+%2F+PrimalFetish%5D+Riley+Reid+%28Making+My+Sweet%2C+Horny+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1455257472,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/G2f\r\n \nhttp://imgsnaps.com/image/G2I\r\n\r\n\r\nPART ONE: Brother's Sexting Deception - My sister is actually pretty sweet, most of the time. But that's probably because she almost always gets everything she wants. I know she is about the horniest girl on the planet, and I cant stand having such a hot whore right down the hall and never getting any. I know she is dying to fuck this dumbass in her class names Robbie, but I also know she doesn't have his number. So I get an extra phone number for my old phone, and SNAP! Robbie is texting her. She totally goes for it, and we start trading dirty texts and pictures. She LOVES my dick pic, and she wants it, so Once she invites Robbie over for some pussy, I walk right into her room. She is really pissed, but I totally have her. I can tell everyone. I don't care, I am not the one that has to go to school every day with everyone knowing I sent pussy pics to my brother. I make her do all the things she promised in her texts!\r\n\r\nPART TWO: Not a Private Moment - My sister loves using mom and dads shower. She uses the massager to make herself cum until there isn't any fucking hot water in the house. I sneak in and record her private moment then I let her know I am there. It looks like we have some things to negotiate. She is furious, but, I get what I want, and being such a horny slut she gets totally into to once I have my dick deep in her. Love that she tells me she doesn't want it and then ends up cumming all over my dick!\r\n\r\nPART THREE: A Massage to Say I Am Sorry - My sister has been a super bitch since I have gave her no choice but to fuck me. Now she wont even talk to me. Its bullshit. She came harder than I did both times. But whatever. I know she loves having her back rubbed so I politely knock and tell her I am sorry, blah blah. She is such a slut! She is totally turned on when I am massaging her, I get her totally naked, massaging up next to her pussy, she moans and squirms, I work my way into finger fucking her, she loves it, but she says its an apology, so just she gets to cum. Right. I take her and fuck that pussy harder than ever! And she acts like she didn't want it, up until she is screaming and cumming","torrent":{"xt":"urn:btih:b422d235fc05f3002424dc2570b01af37db90a95","amp;dn":"+%5BClips4Sale+%2F+PrimalFetish%5D+Riley+Reid+%28Making+My+Sweet%2C+Horny+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b422d235fc05f3002424dc2570b01af37db90a95","infoHashBuffer":{"type":"Buffer","data":[180,34,210,53,252,5,243,0,36,36,220,37,112,176,26,243,125,185,10,149]},"announce":[],"urlList":[]}}