{"title":"Strict Restraint - STRR - Jul 10, 2016 - Faye Runaway","uid":16008651,"size":991062406,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b4a4bf67675326ecdcd79cb6db75d2a0461a12bb&amp;dn=Strict+Restraint+-+STRR+-+Jul+10%2C+2016+-+Faye+Runaway&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":8,"uploader":"merzedes","files":246,"time":1476208275,"description":"&quot;Getting Strict with Faye&quot; \r\nStrict Restraint : Redux\r\n Faye Runaway\r\n\r\nMp4 + Pics. \r\n\r\nRestrained in her stocks Faye struggles for freedom. Her hopes are soon dashed when her Master arrives. As he makes his inspection he strips her body bare and spanks her bare ass as Faye whimpers in submission. The nipple clamps are cold as they are applied to red hot nipples... The flogger cracks as it hits her naked back and she thanks her Master for his attention to detail. The wand is a welcome salve and she hypnotically thrusts in time as it brings her to a drooling volcanic orgasm... The scent of leather is strong in Faye's nostrils. The head harness is tight and chained to a steel pole. Her arms are shackled behind her back, further reducing her mobility. In her Master's hand lies the Violet Wand which sizzles and snaps as it arcs it's way across her smooth, naked flesh. She stands high on her tiptoes as she tries to escape it... Again the vibrator is employed as her Master holds her tight. Her body twitches as she is brought tantalizingly close. And then she is left alone in the cold dungeon cell...Then restrained tightly in stocks on the rolling rack, Faye braces for the storm. Her Master clamps her nipples and spanks her ass to a dark shade of red. The flogger rains down on her naked body then, the cane tatters her pussy and thighs. As Faye cries out the magic wand is forced against her clit as her Master works a rubber dong in and out of her cunt. In her state of restraint, Faye groans as she cums forcefully... Gagging on the dildo, Faye has her pussy lips clamped with clothespins and squeals in anguish as her Master pours hot wax on her naked torso. After she is coated in wax, she is once again coaxed to cum... Bound to the chair in leather straps, Faye has her legs spread wide. Her Master places electric clamps tightly on her nipples and feeds them a massive pulse of power. Writhing and struggling, Faye then has a pole mounted vibrator tied to her pussy. Her Master turns on the power to full blast and leaves the Dungeon. In her state of solitude and denial, Faye is brought to a saliva drenched final orgasm\r\n\r\nScreens \r\n     \nhttp://www.dungeoncorp.com/updates16/SRD/FAY_101507/index.php\r\n\r\nUploaded by Merzedes and Shallow2 \r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect. \r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:) \r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!! \r\n\r\nAny Questions ?? Read our FAQ!! \r\n     \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg \r\n     \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg \r\n\r\nCheers :-) \r\n\r\nKAT RIP","torrent":{"xt":"urn:btih:b4a4bf67675326ecdcd79cb6db75d2a0461a12bb","amp;dn":"Strict+Restraint+-+STRR+-+Jul+10%2C+2016+-+Faye+Runaway","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4a4bf67675326ecdcd79cb6db75d2a0461a12bb","infoHashBuffer":{"type":"Buffer","data":[180,164,191,103,103,83,38,236,220,215,156,182,219,117,210,160,70,26,18,187]},"announce":[],"urlList":[]}}