{"title":"The New Pornographers - Brill Bruisers (2014) [FLAC]","uid":10822322,"size":319088252,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b4eb34ab8ca45f017721585e055d378e36a27eff&amp;dn=The+New+Pornographers+-+Brill+Bruisers+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"politux","files":-1,"time":1408546891,"description":"\n  The New Pornographers - Brill Bruisers (2014) [FLAC]\n\n  Genre: Rock\n  Style: Indie\n  Source: CD (log + cue) \n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n\n  01 Brill Bruisers \n  02 Champions of Red Wine \n  03 Fantasy Fools \n  04 War On the East Coast \n  05 Backstairs \n  06 Marching Orders \n  07 Another Drug Deal of the Heart \n  08 Born With a Sound \n  09 Wide Eyes \n  10 Dancehall Domine\n  11 Spidyr\n  12 Hi-Rise \n  13 You Tell Me Where\n\n The Vancouver indie rock supergroup the New Pornographers features the talents of Zumpano's Carl Newman, the Evaporators' John Collins, Destroyer's Dan Bejar, cartoonist/filmmaker Blaine Thurier, drummer Fisher Rose, and guest vocalist Neko Case. Newman began the band in 1996 as a lark after releasing Zumpano's Goin' Through Changes; one by one, the other members joined the fold, and the New Pornographers' first official rehearsal took place in 1997. By the following year, the group had completed four songs, but then Case left Vancouver for Chicago, Thurier began work on his film Low Self Esteem Girl, and the other members attended to their other bands and projects. Rose left in 1999, and Limblifter/Age of Electric drummer Kurt Dahle and guitarist Todd Fancey joined the Canadian supergroup. With a solid lineup in tow, the New Pornographers reunited and began recording again in early 2000, completing their debut album, Mass Romantic, in time for a fall release and critical acclaim. Ray Davies joined the band at SXSW in fall 2001, performing the Kinks classic &quot;Starstruck&quot; for the first time ever. After a brief North American tour, each member returned to their respective projects by 2002. Bejar recorded with Destroyer, and Case headed out on the road with Nick Cave &amp; the Bad Seeds in support of her second solo album, Blacklisted. Nobody strayed too far, however, for the New Pornographers headed back into the studio before the year's end to work on a follow-up to Mass Romantic. \n\n  The pop-powered Electric Version, which appeared in spring 2003, marked their first for Matador. Twin Cinema followed in 2005 and garnered a good deal of critical praise, receiving near-perfect rankings from such influential outlets as Rolling Stone and Pitchfork. Bolstered by such a positive reception -- as well as the success of Neko Case's Fox Confessor Brings the Flood in 2006 -- the group went in a mellower direction with 2007's Challengers. In 2009, they contributed the song &quot;Hey, Snow White&quot; to the AIDS Benefit album Dark Was The Night. Shortly after, they released their fifth studio album Together which included collaborations with the likes of St.Vincent, Will Sheff and Zach Condon. After a two-year break, they were included on the Fleetwood Mac tribute compilation album with the track &quot;Just Tell Me That You Want Me&quot;. It would take another two years for them to announced details of new material. In early 2014, they group released details of their sixth studio album. Entitled Brill Bruisers, it was slated for release in August that year.","torrent":{"xt":"urn:btih:b4eb34ab8ca45f017721585e055d378e36a27eff","amp;dn":"The+New+Pornographers+-+Brill+Bruisers+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4eb34ab8ca45f017721585e055d378e36a27eff","infoHashBuffer":{"type":"Buffer","data":[180,235,52,171,140,164,95,1,119,33,88,94,5,93,55,142,54,162,126,255]},"announce":[],"urlList":[]}}