{"title":"Korg M1 Legacy synthesizer Mega Sound Pack (sysex bank dumps, ma","uid":4181384,"size":20254095,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b55ad0ff352fadb2740c4faf8ac204bfb185ab2a&amp;dn=Korg+M1+Legacy+synthesizer+Mega+Sound+Pack+%28sysex+bank+dumps%2C+ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"funkymonkeypie","files":1,"time":1210426034,"description":"\nThis is a vast improvement over my previous upload of similar data sets.\n\nAll duplicate banks have been sorted out at the bit level, even differently named banks with the same data have been pulled.\n\nPrintable program/combi lists for the banks have been included when available.\n\nThere are manuals, service manuals, reviews of some of the expansion card data sets,tips, instructions on how to change the battery and calibrate the aftertouch sensitivity. \n\nAlso included are SysEx utilities for both Win-XP and Mac OSX for getting the sysex dumps in and out of the M1 via a midi equiped computer. \n\nThere are thousands of patches in here, many of them from cards that are no longer available.\n\nOf special note there are all the factory expansion card sound sets, so if you just have a PCM card you can load the original program/combi data for that card.\n  \nThe Factory Preload is included, as well as a General MIDI setup.\n\nThis kit is primarily for owners of the actual hardware version, but all the banks can be loaded into the software version as well.\n\nOver 1/4 million M1 synths were sold, it has the biggest user base of any synth ever.  You will be old and deaf before you get through all these patches.\n\n\n\nRock On\n\n\nFunkyMonkeyPiE","torrent":{"xt":"urn:btih:b55ad0ff352fadb2740c4faf8ac204bfb185ab2a","amp;dn":"Korg+M1+Legacy+synthesizer+Mega+Sound+Pack+%28sysex+bank+dumps%2C+ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b55ad0ff352fadb2740c4faf8ac204bfb185ab2a","infoHashBuffer":{"type":"Buffer","data":[181,90,208,255,53,47,173,178,116,12,79,175,138,194,4,191,177,133,171,42]},"announce":[],"urlList":[]}}