{"title":"Gaiam - Yoga Conditioning for Weight Loss","uid":8278742,"size":732816370,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b5e1de888480f6c9c6c4194de1224c85f48fd357&amp;dn=Gaiam+-+Yoga+Conditioning+for+Weight+Loss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"acer47x","files":1,"time":1363785399,"description":"XVID | English | 640x480 | AVI | 29.970 fps 1985 kbps | MP3 128 kbps | 699 MB\nGenre: eLearning\nDescription:\nIn addition to stretching, meditation and stress reduction, yoga has many therapeutic benefits?including the power to help you naturally lose weight and keep it off. Led by acclaimed yoga instructor Suzanne Deason, Yoga Conditioning for Weight Loss accommodates all levels of fitness and flexibility by offering four levels of modification.\nSuzanne Deason's specially designed session incorporates a 10-minute warm-up to loosen the muscles, a core segment which works out the muscles and creates awareness of the body and a toning, relaxing cool down.\n\n\nAlthough pitched toward a weight loss clientele, this video also serves the general population as an excellent multi-level yoga class, taught by respected Iyengar instructor Suzanne Deason. Three students, representing three different ability levels, participate in the class, set on a gorgeous Southwestern mesa. Deason demonstrates each posture, thereby modeling a fourth, more advanced, level. Her instructions are clear and delivered in a calm and nurturing voice that resounds with encouragement. Deason covers standing poses, seated poses and twists. Postures flagged with a &quot;personal instructor&quot; on-screen icon are explored in more depth in the bonus features. A multi-angle feature allows viewers to observe the entire class and all its participants, or to toggle from one ability level to the next. This flexibility in viewing creates a program that remains relevant and challenging as viewers advance in their practice. Includes a 15-page guide to exercise and nutrition.\n\n","torrent":{"xt":"urn:btih:b5e1de888480f6c9c6c4194de1224c85f48fd357","amp;dn":"Gaiam+-+Yoga+Conditioning+for+Weight+Loss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5e1de888480f6c9c6c4194de1224c85f48fd357","infoHashBuffer":{"type":"Buffer","data":[181,225,222,136,132,128,246,201,198,196,25,77,225,34,76,133,244,143,211,87]},"announce":[],"urlList":[]}}