{"title":"Fleetwood Mac - Rumours [1977][320 KBPS]","uid":7562350,"size":110531879,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5e4394f9d02023a0ca4de8a58cd734021b09045&amp;dn=Fleetwood+Mac+-+Rumours+%5B1977%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"LameDuck69","files":15,"time":1345772882,"description":"Fleetwood Mac - Rumours [1977]\n\n\n\n\n\n01. Second Hand News               \n02. Dreams               \n03. Never Going Back Again                \n04. Don't Stop                \n05. Go Your Own Way               \n06. Songbird   \n07. The Chain               \n08. You Make Loving Fun              \n09. I Don't Want To Know               \n10. Oh Daddy               \n11. Gold Dust Woman\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nRumours is the eleventh studio album by British-American rock band Fleetwood Mac. Largely recorded in California during 1976, it was produced by the band with Ken Caillat and Richard Dashut and was released on 4 February 1977 by Warner Bros. Records. The record peaked at the top of both the main United States Billboard chart and the United Kingdom Albums Chart. &quot;Go Your Own Way&quot;, &quot;Don't Stop&quot;, &quot;Dreams&quot;, and &quot;You Make Loving Fun&quot; were released as singles. A Grammy Award winner, Rumours is Fleetwood Mac's most successful release with sales of over 40 million copies worldwide.\n\nThe band wanted to expand on the commercial success of the 1975 record Fleetwood Mac, but struggled with relationship breakups before recording started. The Rumours studio sessions were marked by hedonistic behaviour and interpersonal strife between Fleetwood Mac members; these experiences informed the album's lyrics. Influenced by pop music, the record's tracks were recorded using a combination of acoustic and electric instruments. The mixing process delayed the completion of Rumours, but was finished by the end of 1976. Following the album's release in 1977, Fleetwood Mac undertook worldwide promotional tours.\n\nRumours garnered widespread critical acclaim. Praise centred on its production quality and harmonies, which frequently relied on the interplay among three vocalists. The record has inspired the work of musical acts in different genres. Often considered Fleetwood Mac's best release, it has featured in several publications' lists of the best albums of the 1970s and the best albums of all time. In 2004, Rumours was remastered and reissued with the addition of an extra track and a bonus CD of outtakes from the recording sessions.\n\n","torrent":{"xt":"urn:btih:b5e4394f9d02023a0ca4de8a58cd734021b09045","amp;dn":"Fleetwood+Mac+-+Rumours+%5B1977%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5e4394f9d02023a0ca4de8a58cd734021b09045","infoHashBuffer":{"type":"Buffer","data":[181,228,57,79,157,2,2,58,12,164,222,138,88,205,115,64,33,176,144,69]},"announce":[],"urlList":[]}}