{"title":"Easy - Tammara Webber","uid":7825649,"size":266335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b642e65bcca954893ae1156dfaf9f35eb4d01929&amp;dn=Easy+-+Tammara+Webber&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"acidr0p","files":1,"time":1352921081,"description":"Epub format\n\nA girl who believes trust can be misplaced, promises are made to be broken, and loyalty is an illusion. A boy who believes truth is relative, lies can mask unbearable pain, and guilt is eternal. Will what they find in each other validate their conclusions, or disprove them all?\n\nWhen Jacqueline follows her longtime boyfriend to the college of his choice, the last thing she expects is a breakup two months into sophomore year. After two weeks in shock, she wakes up to her new reality: she's single, attending a state university instead of a music conservatory, ignored by her former circle of friends, and failing a class for the first time in her life.\n\nLeaving a party alone, Jacqueline is assaulted by her ex's frat brother. Rescued by a stranger who seems to be in the right place at the right time, she wants nothing more than to forget the attack and that night--but her savior, Lucas, sits on the back row of her econ class, sketching in a notebook and staring at her. Her friends nominate him to be the perfect rebound.\n\nWhen her attacker turns stalker, Jacqueline has a choice: crumple in defeat or learn to fight back. Lucas remains protective, but he's hiding secrets of his own. Suddenly appearances are everything, and knowing who to trust is anything but easy.","torrent":{"xt":"urn:btih:b642e65bcca954893ae1156dfaf9f35eb4d01929","amp;dn":"Easy+-+Tammara+Webber","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b642e65bcca954893ae1156dfaf9f35eb4d01929","infoHashBuffer":{"type":"Buffer","data":[182,66,230,91,204,169,84,137,58,225,21,109,250,249,243,94,180,208,25,41]},"announce":[],"urlList":[]}}