{"title":"Paint net  v.3.5.5.","uid":5556333,"size":3657529,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b6a65479f2c9a1157d0308aca8ee2923ebbaa0be&amp;dn=Paint+net++v.3.5.5.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"ContraX","files":-1,"time":1273696500,"description":"If all you want is a quick image retouch, Photoshop is overkill. Paint.NET, on the other hand, is an open-source freeware editor with all the essentials, including tools to crop, rotate, and resize images, adjust colors, and create collages. It supports common image formats--JPEG, PNG, GIF, TIFF, and others--but not high-resolution RAW files. There are enough basic and intermediate effects and features to keep image-tweakers happy, including a red-eye removal tool that has seen dramatic improvements. Unlike most free image editors, Paint.NET supports layers, history, and has an actions manager. The pleasing interface boasts semitransparent windows for ease of use.\n\nVersion 3.5 addresses many performance quibbles and offers some interface tweaks for the Aero-theme users, but fans of the &quot;dancing ants&quot; may not like the gray-overlay changes made to the selection tools. The useful tools under Effects on the menu bar have seen many additions since version 3, including surface blurs, dents, and crystalize.\n\nThe new version automatically downloads and installs the program's prerequisites, including the latest Microsoft .Net version and Windows Installer. It will update in the background now, too, so you can continue to use the program until it's ready to restart. Longtime users should notice that the program starts up about 20 percent faster, according to the publisher. Regardless of minor problems, Paint.NET is far more advanced than Microsoft Paint, and given its free price, it's a must-have for anyone needing to fix images.","torrent":{"xt":"urn:btih:b6a65479f2c9a1157d0308aca8ee2923ebbaa0be","amp;dn":"Paint+net++v.3.5.5.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6a65479f2c9a1157d0308aca8ee2923ebbaa0be","infoHashBuffer":{"type":"Buffer","data":[182,166,84,121,242,201,161,21,125,3,8,172,168,238,41,35,235,186,160,190]},"announce":[],"urlList":[]}}