{"title":"LiveLessons CCNP Routing and Switching SWITCH 300-115","uid":13892794,"size":1614464276,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:b79ecdf877bd723c9bf8a2802221807c2ecf5813&amp;dn=LiveLessons+CCNP+Routing+and+Switching+SWITCH+300-115&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"FNGghost","files":133,"time":1458221654,"description":"CCNP Routing and Switching SWITCH 300-115 Complete Video Course  is a comprehensive training course that brings Cisco CCNP R&amp;S SWITCH exam topics to life through the use of real-world demonstrations, animations,  live instruction, and configurations, making learning these foundational networking topics easy and fun.\r\n\r\nBest-selling author, expert instructor, and double CCIE Kevin Wallace walks you through the full range of topics on the CCNP Routing and Switching SWITCH 300-115  exam, including Cisco Catalyst switch features, VLANs and trunking, Spanning Tree Protocol (STP), EtherChannel technologies, first hop redundancy protocols, and securing Cisco Catalyst switches. This unique product contains multiple types of video presentations, including live instructor whiteboarding, real world demonstrations, animations of network activity, dynamic KeyNote presentations, doodle videos, and hands-on router and switch CLI configuration and troubleshooting in real lab environments, allowing you to both learn the concepts and the hands-on application.\r\n\r\nThe 65+ videos contained in this product provide you more than 8 hours of instruction. Modules are divided into easy to digest lessons and conclude with summaries and interactive module and glossary quizzes to help assess your knowledge. In addition to the review quizzes, the product also contains interactive exercises to help you truly learn the topics in each module. The product concludes with a series of lessons that give you valuable advice to help prepare for the actual exam.\r\n\r\nDesigned to take you inside CCNP switching concepts in a unique and interactive way, CCNP Routing and Switching  SWITCH 300-115 Complete Video Course  is guaranteed to help you master the foundational networking topics that will help you succeed on the exam and on the job","torrent":{"xt":"urn:btih:b79ecdf877bd723c9bf8a2802221807c2ecf5813","amp;dn":"LiveLessons+CCNP+Routing+and+Switching+SWITCH+300-115","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b79ecdf877bd723c9bf8a2802221807c2ecf5813","infoHashBuffer":{"type":"Buffer","data":[183,158,205,248,119,189,114,60,155,248,162,128,34,33,128,124,46,207,88,19]},"announce":[],"urlList":[]}}