{"title":"Carl Sagan - Cosmos (1980) [Full Color Illustrated]","uid":9647810,"size":102382733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7d04f298320cdaccd0a9aa0b1992b4c9db57f35&amp;dn=Carl+Sagan+-+Cosmos+%281980%29+%5BFull+Color+Illustrated%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"Arrrrrrrrrr","files":2,"time":1393032830,"description":"Cosmos\nBy Carl Sagan, 1980\nISBN-10: 0345331354\nISBN-13: 978-0345331359\nLanguage: English\nSize: 77.7MB (full sized images), 19.8MB (downsampled images to 150DPI), 380 pages\n\n&quot;The best-selling science book ever published in the English language, Cosmos is a magnificent overview of the past, present, and future of science. Brilliant and provocative, it traces today's knowledge and scientific methods to their historical roots, blending science and philosophy in a wholly energetic and irresistible way.&quot;\n\nSomehow I feel that all of the e-books I have done prior have been preludes to this one, which I discovered with great joy at a young age. May it light the wonder and love of science and our amazing universe in many others.\n\nNotes: \n\n- This e-book is not a repost of an available commercial PDF. Instead, it was lovingly scanned from the original book, OCR'ed, proofread, spellchecked, formatted and PDF'ed by me, which took a couple of weeks. This is because, as far as I know, it has never been available as an eBook in the original full-color illustrated hardback edition.\n\n- The formatting and wording was kept identical to the original edition, so photo captions may indicate directions (ie right, left) that no longer reflect the layout as a vertical PDF. About a dozen typos and misspellings in the original text were corrected, however.\n\n- Of course, Cosmos has been been posted here before, but as above only as the black-and-white edition with no colour photos.\n\n- Sorry... I had a cover image for this torrent entry, but unfortunately bayimg is down again.\n\n- There's only a PDF as I find it a pain to convert to other formats... sorry. Feel free of course!","torrent":{"xt":"urn:btih:b7d04f298320cdaccd0a9aa0b1992b4c9db57f35","amp;dn":"Carl+Sagan+-+Cosmos+%281980%29+%5BFull+Color+Illustrated%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7d04f298320cdaccd0a9aa0b1992b4c9db57f35","infoHashBuffer":{"type":"Buffer","data":[183,208,79,41,131,32,205,172,205,10,154,160,177,153,43,76,157,181,127,53]},"announce":[],"urlList":[]}}