{"title":"The Best of the Digital Photography Book Series (2015) Gooner","uid":13786722,"size":20812309,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b87a3739ee26dafde81a7748c63850988804e2fa&amp;dn=The+Best+of+the+Digital+Photography+Book+Series+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1457367715,"description":"The Best of the Digital Photography Book Series - The Step-by-Step Secrets for How to Make Your Photos Look Like the Pros'! (2015).epub Gooner\r\n\r\nPublisher: Peachpit Press (30 Sept. 2015)\r\nLanguage: English\r\nISBN-10: 0134385128\r\nISBN-13: 978-0134385129\r\n\r\nWhat could top the #1 best-selling photography book of all time?\r\n\r\nWe’re talking about the award-winning, worldwide smash hit, written by Scott Kelby, that’s been translated into dozens of different languages, because it’s the one book that really shows you how to take professional-quality shots using the same tricks today’s top digital pros use.\r\n\r\nWell, what if you took that book, created four more just like it but with even more tips, plucked out only the best tips from all five of THOSE books, updated the images, referenced all-new gear, and added a completely new chapter on how to make the transition from shooting photos with your phone to making photographs with your new DSLR?\r\n\r\nIn The Best of The Digital Photography Book, you’ll find all of Scott’s favorite tips and techniques curated and updated from The Digital Photography Book, Parts 1-5, along with a brand new chapter on transitioning from your phone to a full-fledged DSLR. You’ll find everything that made the first five titles a success: Scott answering questions, giving out advice, and sharing the secrets he’s learned just like he would with a friend–without all the technical explanations and techie photo speak. This book will help you shoot dramatically better-looking, sharper, more colorful, more professional-looking photos every time","torrent":{"xt":"urn:btih:b87a3739ee26dafde81a7748c63850988804e2fa","amp;dn":"The+Best+of+the+Digital+Photography+Book+Series+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b87a3739ee26dafde81a7748c63850988804e2fa","infoHashBuffer":{"type":"Buffer","data":[184,122,55,57,238,38,218,253,232,26,119,72,198,56,80,152,136,4,226,250]},"announce":[],"urlList":[]}}