{"title":"Thomas R. Quackenbush - Relearning to See. Improve Your Eyesight","uid":8960645,"size":23857743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8ac3ca3cf7386b01f96d80a25b9838c494042e6&amp;dn=Thomas+R.+Quackenbush+-+Relearning+to+See.+Improve+Your+Eyesight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"acer47x","files":-1,"time":1380102713,"description":"Year : 2000 \nAuthor : Thomas R. Quackenbush. \nPublisher : North Atlantic Books. \nFormat : PDF + DOC. \nNumber of pages : 514 \nLanguage Book : English + Russian translation PROMT. \n\nDescription : \n\nBasing his work on the journals of William H. Bates, Tom Quackenbush outlines a method for restoring eyesight by using the mind and body to improve vision. He debunks Conventional theories That Assert the need for corrective Lenses, arguing That the Key to eyesight Improvement lies in relearning the correct habits of vision. From the Author In writing relearning to See over an Eight Year period, I wanted to Produce the Largest, Most comprehensive, historical, scientific, convincing and thoroughly researched book ever written on this topic. Drawing on my 16 years of fulltime teaching I wanted to give to the world the finest information available. I have included Nearly one hundred of My Own Students Testimonials and references to Natural eyesight improvements by Thousands of Other Natural Eyesight Improvement Students. One of the Most Important messages in this book is the clarification of the misconception That Natural Eyesight Improvement and the Bates Method involves &quot;eye exercises.&quot; If a person does eye exercises without relearning correct, natural vision habits all day long, he or she will not succeed. Dr. Bates taught his students to relearn natural vision habits all day long-not eye exercises for twenty minutes each day. Many people who study the Bates method, and even many Bates method teachers, are not aware of this fact. When a Natural Eyesight Improvement student is given the correct understanding of the Bates educational method, success is far more likely. Basing his work on the diaries of William Bates, Thomas Quackenbush method leads to recovery of using mind and body. He dispels the classical theory, claiming the need for corrective lenses, arguing that the key to the improvement of vision is through &quot;re-education&quot; of the right habits. From the author of When I spent eight years writing &quot;retraining see,&quot; I wanted to create the greatest detail, equipped with scientific and historical facts, persuasive and thoroughly researched work ever written on the subject. Describing 16 years of teaching, I wanted to give the world the best quality and accessible information. I have included reviews about hundreds of students and their links to show an improvement of between a few hundred undergraduate courses of natural vision improvement. One of the most important messages of this book is to explain the misunderstanding that natural vision improvement and the Bates method include only the &quot;eye exercises.&quot; If a person does exercises all day without learning a natural visual habits, it will not work. Dr. Bates taught his students to re-learn the natural visual habits throughout the day, rather than exercise for twenty minutes a day. Many who have studied the Bates Method, and even many of the teachers of this method, do not know about that. If the student's natural vision improvement will be taught proper understanding of Bates, success is much more likely","torrent":{"xt":"urn:btih:b8ac3ca3cf7386b01f96d80a25b9838c494042e6","amp;dn":"Thomas+R.+Quackenbush+-+Relearning+to+See.+Improve+Your+Eyesight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ac3ca3cf7386b01f96d80a25b9838c494042e6","infoHashBuffer":{"type":"Buffer","data":[184,172,60,163,207,115,134,176,31,150,216,10,37,185,131,140,73,64,66,230]},"announce":[],"urlList":[]}}