{"title":"Mixamo Fuse Universal Character Creator 1.3 Windows","uid":11645742,"size":2176455220,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b9563aea334b959dfd97d9e19c052fb71182b802&amp;dn=Mixamo+Fuse+Universal+Character+Creator+1.3+Windows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":2,"uploader":"jxoesneon","files":-1,"time":1417822509,"description":"Fuse Universal Character Creator Steam Edition v1 2-THH | 1.71 GB\n\nFuse is a data-driven, modular 3D character creation tool that comes packaged with 60+ body parts, 100+ clothing meshes, 42 dynamic texturing substances, and 2 free Auto-Rigs for Fuse characters per week. The new Advanced Character Customization allows you unlimited creativity when crafting your unique character!\n\n\n\n\nFuse Universal Character Creator Steam Edition v1 2-THH\n\nFeature List\nPackaged content includes 18 heads, 12 body types, 12 legs, 12 arms, 52 clothing meshes, 18 hair meshes, 20 shoe meshes, and 22 accessories ranging from Generic figures to Zombies and Fantasy styles, and also includes 23 additional parts from The Scout, The Sniper, and The Spy from TF2.\nNew - Massive look improvements with 2K skin texture maps for higher resolution characters,\nambient occlusion, and Physically Based Rendering for realistic look and shadows\nNew - Facial Animation Blendshapes automatically generates 50 embedded facial blendshapes upon upload for rigging at Mixamo.com (FBX format only)\nNew - Virtual Assets allow you to create unlimited character and clothing presets to customize your library and accelerate your workflow\nNew - Advanced Skin Substance with 3x number of customization options\nAdvanced Character Customization - Over 280 customization shapes per character\nImport Custom Content &lt;a href=&quot;\nhttps://www.mixamo.com/fuse/import&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.mixamo.com/fuse/import&lt;/a&gt;\nDynamic character texturing with 42 Smart Texture substances, powered by\nAllegorithmic?s Substance technology &lt;a href=&quot;\nhttp://store.steampowered.com/app/238710/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/238710/&lt;/a&gt;\nGet 2 free Auto-Rigs off-the-bat when you create a Mixamo account, and 2 additional free Auto-Rigs for Fuse characters per week\nExcellent topology for project-ready characters, previs, or to use as your base models\nExport characters as OBJ files with diffuse, normal and specular maps\nDownload autorigged characters from Mixamo as FBX, FBX for Unity, Collada or BVH\nAnimations are provided through paid Mixamo service, with an Basic Locomotion pack and 10 other animations available for free for the users of Fuse\n\n\nAbout This Software\nFuse is a data-driven, modular 3D character creation tool that comes packaged with 60+ body parts, 100+ clothing meshes, 42 dynamic texturing substances, and 2 free Auto-Rigs for Fuse characters per week. The new Advanced Character Customization allows you unlimited creativity when crafting your unique character! Workflows are available for Gmod, SFM and Source.\n\nFuse was developed in collaboration between Mixamo and Vladlen Koltun?s research group at Stanford University, with Siddhartha Chaudhuri as chief architect and programmer. With the last beta release, Fuse integrates Allegorithmic?s Substance technology for a complete character modeling solution. Fuse offers an unprecedented approach to high quality 3D character creation. Users can browse through a vast number of mesh and texture choices to get custom built characters in a matter of minutes.\n\nFuse Product Roadmap\nNew in v1.2!:\n\nVirtual Assets - Create character and clothing presets, customize your library! Make a character, hit the Star button at the top, and watch as that character is turned into a Fusible asset!\n2k Skin Textures - Hi-res for your pleasure! By default textures are set to 1k for speed, enable 2k in the substance menu\nAdvanced Skin Substance - Increased quality and 3x the number of customization options! Get crazy!\nRealistic lighting and PBR shading - Just makes stuff look goooooood\nFacial Animation Blendshapes - When you upload your character to Mixamo to be Autorigged, you can now have 50 facial animation blendshapes generated automatically!\n17 New Substances!\n\nOther features coming soon:\nA space to share or sell your custom user-made models and clothing\n\nNew in v1.1:\nFace and Body customization! Customize your character with over 280 possible adjustment shapes. You can click and drag on UI controllers or use old-school sliders in a new workspace, &quot;Customize&quot;\nFace and Body customization for imported characters! If you import a character that is based on the Fuse template or has matching UVs, those 280 customization shapes will be generated automatically\nNow you can search your content library\nBetter scaling options\nTexture packing options to reduce the total maps created on export and output a 2k or 4k map\nInstant color picker - now selecting colors gives instant feedback on the character\nAdd a full set of matching body parts with a new right-click menu, or shift+click\n30 New pieces of content, including Fantasy items, alpha mustaches, and beards\n\nNew in v1.0:\nImport custom content!\nHigher quality characters, default 1k resolution, improved topology\nFemale models and textures now have nipples\nNew clothing\nAn additional free autorig per week\nMemory optimizations\nSave substance defaults for clothing\nDynamic textured thumbnails\nGlobal preferences menu for exports\n\nUpdated in January:\nNew clothing!\nImport external Allegorithmic?s Substance technology files (.sbsar)\nCopy/Paste substances and parameter settings! Crazy fast!\nExport option to include the occluded character body geometry\nSubstance Expansion pack permanently reduced to $19.99\n\nUpdated in December:\nNew heads, hats, glasses, and polygon strip hair\nSave and Open your character to continue working\nExport your character as quads or triangles\nOptimized 1-click Texture workspace\nVisible poly-count info in the workspace\n\nSystem Requirements\n\nPC\nMINIMUM:\nOS: Windows 7\nProcessor: 64-bit\nMemory: 4 GB RAM\nNetwork: Broadband Internet connection\nHard Drive: 2 GB available space\n\n\n\n===================================================================================\n\n                         INSTALLATION\n===================================================================================\n\n1.UNRAR FILE\n2.RUN .EXE\n3.DONE... NO SERIAL OR CRACK NEEDED","torrent":{"xt":"urn:btih:b9563aea334b959dfd97d9e19c052fb71182b802","amp;dn":"Mixamo+Fuse+Universal+Character+Creator+1.3+Windows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9563aea334b959dfd97d9e19c052fb71182b802","infoHashBuffer":{"type":"Buffer","data":[185,86,58,234,51,75,149,157,253,151,217,225,156,5,47,183,17,130,184,2]},"announce":[],"urlList":[]}}