{"title":"Pete Seeger - The Essential Pete Seeger (2005) [FLAC]","uid":9535261,"size":262856966,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b970e1de14c002f671efd00d4c5e07a80c4cbbe2&amp;dn=Pete+Seeger+-+The+Essential+Pete+Seeger+%282005%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"politux","files":-1,"time":1390918431,"description":"\n  Pete Seeger - The Essential Pete Seeger (2005) [FLAC]\n\n  Genre: Folk\n  Styles: Political Folk, Traditional Folk\n  Source: CD\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 If I Had a Hammer\n  02 Goodnight Irene\n  03 Barbara Allen\n  04 Talking Union\n  05 Wimoweh (Mbube)\n  06 John Henry\n  07 Little Boxes\n  08 Michael Row the Boat Ashore\n  09 This Land Is Your Land\n  10 Guantanamera\n  11 Where Have All the Flowers Gone?\n  12 Turn! Turn! Turn! (To Everything There Is a Season)\n  13 The Bells of Rhymney\n  14 Waist Deep in the Big Muddy\n  15 We Shall Overcome\n\n  Pete Seeger is the sort of person who has become the stuff of legend for all the best reasons. As a musicologist, he's been a passionate archivist of folk songs of all sorts from around the world for most of his life, and thousands of people (perhaps millions) would not have heard songs such as &quot;Goodnight Irene,&quot; &quot;This Land Is Your Land&quot; and &quot;Wimoweh&quot; (aka &quot;The Lion Sleeps Tonight&quot;) had he not championed them. As a songwriter, any man with &quot;If I Had a Hammer,&quot; &quot;Where Have All the Flowers Gone,&quot; &quot;I Come and Stand at Every Door&quot; and &quot;Turn, Turn Turn&quot; in his catalog (among many, many others) has created a truly impressive repertoire. As a musician, it's hard to count how many people picked up the guitar or banjo from his example, and he's always been a pithy and compelling player. And as an activist, Seeger has bravely put his ideals of peace, justice and equality ahead of his career in a manner few musicians of any stature have ever dared or even imagined. However, since Seeger is as influential as any figure in the history of American folk music, and has been recording since the 1940s, the question is -- can this man's life in music be accurately summed up on a single CD?\n\n  That more than anything is the rub with The Essential Pete Seeger, a compilation which focuses primarily on Seeger's recordings for Columbia from the 1950s and '60s. Assembled by Nedra Olds-Neal, The Essential Pete Seeger does make some important gestures towards being career-inclusive -- it includes the 1950 hit recording of &quot;Goodnight Irene&quot; with the Weavers, as well as Seeger's 1941 version of &quot;Talking Union&quot; and a few other tracks licensed from Smithsonian Folkways (who issued the majority of Seeger's catalog). Many of the songs most closely associated with Seeger are included (if not always in their definitive recordings), and all these performances (especially the ones recorded before a live audience) are impassioned, powerful and direct from the heart, especially &quot;Guantanamera&quot; and &quot;We Shall Overcome&quot; (the understated force of the latter is still remarkably moving more than forty years after it was recorded). But this man has made far too much important music for a single disc to hold all that is &quot;essential.&quot; The Essential Pete Seeger is a fine introduction to his work as a musician, and includes an excellent liner essay by Dave Marsh, as well as testimonials from Joan Baez, Billy Bragg, Roger McGuinn, Bruce Cockburn and many others on the lasting importance of these songs and this artist. But isn't it high time Pete Seeger got the full box-set treatment that his body of work deserves and demands? Or at the very least a two-disc entry in Legacy's Essential series?","torrent":{"xt":"urn:btih:b970e1de14c002f671efd00d4c5e07a80c4cbbe2","amp;dn":"Pete+Seeger+-+The+Essential+Pete+Seeger+%282005%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b970e1de14c002f671efd00d4c5e07a80c4cbbe2","infoHashBuffer":{"type":"Buffer","data":[185,112,225,222,20,192,2,246,113,239,208,13,76,94,7,168,12,76,187,226]},"announce":[],"urlList":[]}}