{"title":"Swimming Anatomy (gnv64)","uid":7169532,"size":30529726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9701ae6b8fcd4812502bf8d53346dc57ed69911&amp;dn=Swimming+Anatomy+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"gnv65","files":-1,"time":1333913084,"description":"Swimming Anatomy\nby Ian McLeod\nHuman Kinetics | October 2009 | ISBN-10: 0736075712 | ePUB/PDF | 5.21/23.9 mb &lt;a href=&quot;\nhttp://www.amazon.com/Swimming-Anatomy-Ian-McLeod/dp/0736075712&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Swimming-Anatomy-Ian-McLeod/dp/0736075712&lt;/a&gt;\nPDF conversion is mine\n\nSee how to achieve stronger starts, more explosive turns, and faster times! Swimming Anatomy will show you how to improve your performance by increasing muscle strength and optimizing the efficiency of every stroke.\nSwimming Anatomy includes 74 of the most effective swimming exercises, each with step-by-step descriptions and full-color anatomical illustrations highlighting the primary muscles in action.\nSwimming Anatomy goes beyond exercises by placing you on the starting block, in the water, and into the throes of competition. Illustrations of the active muscles for starts, turns, and the four competitive strokes (freestyle, breaststroke, butterfly, and backstroke) show you how each exercise is fundamentally linked to swimming performance.\nYou'll also learn how exercises can be modified to target specific areas, improve your form in the water, and minimize common swimming injuries. Best of all, you'll learn how to put it all together to develop a training program based on your individual needs and goals.\nWhether you are training for a 50-meter freestyle race or the open-water stage of a triathlon, Swimming Anatomy will ensure you enter the water prepared to achieve every performance goal.\n\nAbout the Author\nUSA Swimming, the largest swimming organization in the world, specifically recommended Ian McLeod as the author of Swimming Anatomy. McLeod has extensive experience working with world-class athletes, particularly swimmers. A certified athletic trainer and certified massage therapist, he was a member of the U.S. team's medical staff at the 2008 Summer Olympic Games in Beijing. He has also worked extensively as an athletic trainer with the sports programs at the University of Virginia and Arizona State University.\nMcLeod remains deeply involved with USA Swimming's High Performance Network, a group of volunteer health professionals who support U.S. swimmers at national and international meets. He has been given the organization's highest honor, the Gold Standard Award. McLeod also served as massage therapist to the Egyptian national swim team during the 2004 Olympic Games in Athens. He has provided athletic training and sport massage to swimming stars such as Ed Moses, Kaitlin Sandeno, Natalie Coughlin, and Jason Lezak.\nMcLeod lives in Tempe, Arizona, with his wife and two children.","torrent":{"xt":"urn:btih:b9701ae6b8fcd4812502bf8d53346dc57ed69911","amp;dn":"Swimming+Anatomy+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9701ae6b8fcd4812502bf8d53346dc57ed69911","infoHashBuffer":{"type":"Buffer","data":[185,112,26,230,184,252,212,129,37,2,191,141,83,52,109,197,126,214,153,17]},"announce":[],"urlList":[]}}