{"title":"TeacherFucksTeens - Joseline Kelly, Tali Dova (Students Caught B","uid":15951735,"size":442700361,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b979f9d88b48af4412ebe53cacfd38c3b022f7d0&amp;dn=TeacherFucksTeens+-+Joseline+Kelly%2C+Tali+Dova+%28Students+Caught+B&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":13,"uploader":"xxxlavalxxx","files":2,"time":1475575603,"description":"Joseline Kelly is getting double teamed by Chad White and Brad Sterling when the trio is caught by their teacher Tali Dova! Tali handles her discovery well, and soon she allows herself to be seduced by Chad. Joseline isn't crazy about watching Chad pull Tali's miniskirt up and landing panties aside to fondle her landing strip pussy, but when Tali invites Joseline to join them with Brad she decides she can get into it.That's all the coaxing Joseline needs to kick off a crazy hardcore fuck fest! She and Tali each have their own personal stud to keep their landing strip twats satisfied, but they can't seem to keep their mouths off of one another either! When they decide to switch things up so that Chad is eating out Tali's pussy while Joseline returns to her initial position of sucking one guy off while getting her puss pounded by the other, Tali knows she's made the right choice to get involved!Now that they've gotten started, nothing will keep these four from getting every last drop of pleasure from their time together. Chad and Brad take care of their girls first, making sure they have as many orgasms as they can handle. By the time the girls are spent, it's all that the guys can do to pull out and deliver a mutual facial that leaves Joseline and Tali both covered in a cum shower.\r\nTags: Medium Boobs, Brunette, Long hair, Panties, Hardcore, High Heels, Glasses, Blowjob, Girl-Girl-Boy-Boy, Facial, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=14966261002434596843.jpg\r\n \nhttp://imgdone.com/viewer.php?file=45115411257702967328.jpg","torrent":{"xt":"urn:btih:b979f9d88b48af4412ebe53cacfd38c3b022f7d0","amp;dn":"TeacherFucksTeens+-+Joseline+Kelly%2C+Tali+Dova+%28Students+Caught+B","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b979f9d88b48af4412ebe53cacfd38c3b022f7d0","infoHashBuffer":{"type":"Buffer","data":[185,121,249,216,139,72,175,68,18,235,229,60,172,253,56,195,176,34,247,208]},"announce":[],"urlList":[]}}