{"title":"Ninja Blade-SKIDROW","uid":15833431,"size":4049682079,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b9e63e0e0ebceeb1aeb91a8406eab7b93f199e4e&amp;dn=Ninja+Blade-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":14,"uploader":"dauphong","files":5,"time":1473944551,"description":"Ninja Blade is an action adventure game set within modern day Tokyo. Parasites known as alpha-worms have mysteriously appeared, unleashing a wave of human destruction as they rapidly spread east, reaching the shores of Tokyo. With the future of humankind hanging in the balance, an exclusive and elite team possessing highly specialized skills is formed to eliminate the enemy onslaught, and ultimately save mankind from complete obliteration.\r\n\r\nFeatures\r\n   -  Unique ninja abilities: Use your Ninja Vision to detect and analyze potential enemy weak points, secret paths, and hidden information within the environment, but be careful, as you are susceptible to extra damage while using your vision. And perform the todomé attack to destroy an enemy's core (heart), by dealing a fatal wound. Balanced and calculated use of both these abilities will be critical to progressing through the game.\r\n   -  Variety of weapons, tools, and Ninjutsu: Specialized ninja powers offer an enticing array of options. Varied environments force players to think strategically about which set of weapons and tools will be most effective at conquering the different levels. From dual wielding swords to grapple wire hooks to grenades, every item has distinctive features and characteristics, so choose wisely! Ninjutsu is a special power that results in an explosive electrical force to either stun enemies or protect oneself from attack. Only true Ninja Masters can achieve this technique.\r\n   -  Interactive quick-time events: Scattered throughout integral parts of the storyline, characters come across various quick-time events providing the opportunity to directly interact with in-game cutscenes. Quick reflexes are rewarded during the intense battles.\r\n   -  Modern realism: Ninja Blade offers a fresh twist to the classic ninja saga by basing all 3-D gaming maps directly from the actual skyscrapers and building tops in modern day Tokyo.\r\n\r\nPublisher: N/A\r\nDeveloper: From Software \r\nGenre: Adventure (PC)  \r\nTheme(s): Asiatic, Sci-Fi\r\nPerspective(s): Third Person\r\n             ____________\r\n\r\nProcessor :  Intel Pentium 4 at 3.2 GHz / Athlon XP 2500+\r\nVideo Card : 256 MB DirectX 9.0c Compatible video card With Shader Model 3.0 support (Nvidia Geforce 7300 or better / ATI Radeon 9250 or better )\r\nMemory : 1 GB\r\nHard Disk : 5 GB of free Hard Drive Space\r\nOperating System : Microsoft Windows XP / Windows Vista\r\nSound Card : DirectX 9.0 Compatible\r\nDirect X : 9.0c\r\nInstallation : DVD-ROM Drive\r\n             ____________\r\n\r\nRELEASE DATE : 20-11-2009           PROTECTION : StarForce\r\nGAME TYPE    : Action               DISKS      : 1 DVD\r\n\r\nInstall Notes:\r\n\r\n1. Unpack Release\r\n2. Mount/Burn Image\r\n3. Install Game\r\n4. Copy the content from the SKIDROW directory on the DVD to\r\nyour installation directory and overwrite\r\n5. Play the game","torrent":{"xt":"urn:btih:b9e63e0e0ebceeb1aeb91a8406eab7b93f199e4e","amp;dn":"Ninja+Blade-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e63e0e0ebceeb1aeb91a8406eab7b93f199e4e","infoHashBuffer":{"type":"Buffer","data":[185,230,62,14,14,188,238,177,174,185,26,132,6,234,183,185,63,25,158,78]},"announce":[],"urlList":[]}}