{"title":"50 Cent - 21 Questions","uid":7321162,"size":2757657,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ba2effc8e67de9df23063aeaa1e198a3dafdc5b5&amp;dn=50+Cent+-+21+Questions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"Music-Upload","files":1,"time":1338626260,"description":"To Download a pack of 50 Cent songs search this:\n\n50 Cent - 14 song Pack\n\n\n\nTo View some more of my music uploads click this:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Music-Upload&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Music-Upload&lt;/a&gt;\n\n\n\n50 Cent - 21 Questions Lyrics\n\n\n\nI just wanna chill and twist a lot\nCatch suns in my 7-45\nYou drive me crazy shorty I\nNeed to see you and feel you next to me\nI provide everything you need and I\nLike your smile I don't wanna see you cry\nGot some questions that I got to ask and I\nHope you can come up with the answers babe\n\n[Chorus: Nate Dogg]\nGirl, It's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\nGirl, It's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\nGirl\n\n[50 Cent]\nIf I fell off tomorrow would you still love me?\nIf I didn't smell so good would you still hug me?\nIf I got locked up and sentenced to a quarter century,\nCould I count on you to be there to support me mentally?\nIf I went back to a hoopty from a Benz, would you poof and disappear like \nSome of my friends?\nIf I was hit and I was hurt would you be by my side?\nIf it was time to put in work would you be down to ride?\nI'd get out and peel a ***** cap and chill and drive\nI'm asking questions to find out how you feel inside\nIf I ain't rap 'cause I flipped burgers at Burger King\nWould you be ashamed to tell your friends you feelin' me?\nIn the bed if I used my tongue would you like that?\nIf I wrote you a love letter would you write back?\nNow we can have a lil' drink you know a nightcap\nAnd we could go do what you like, I know you like that\n\n[Chorus]\n\n[50 Cent]\nNow would you leave me if you're father found out I was thuggin'?\nDo you believe me when I tell you, you the one I'm loving?\nAre you mad 'cause I'm asking you 21 questions?\nAre you my soul mate? 'Cause if so, girl you a blessing\nDo you trust me enough, to tell me your dreams?\nI'm staring at ya' trying to figure how you got in them jeans\nIf I was down would you say things to make me smile?\nI treat you how you want to be treated just teach me how\nIf I was with some other chick and someone happened to see?\nAnd when you asked me about it I said it wasn't me\nWould you believe me? Or up and leave me?\nHow deep is our bond if that's all it takes for you to be gone?\nWe only humans girl we make mistakes, to make it up I do whatever it take\nI love you like a fat kid love cake\nYou know my style I say anything to make you smile\n\n[Chorus]\n\nCould you love me in a Bentley?\nCould you love me on a bus?\nI'll ask 21 questions, and they all about us\nCould you love me in a Bentley?\nCould you love me on a bus?\nI'll ask 21 questions, and they all about us","torrent":{"xt":"urn:btih:ba2effc8e67de9df23063aeaa1e198a3dafdc5b5","amp;dn":"50+Cent+-+21+Questions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba2effc8e67de9df23063aeaa1e198a3dafdc5b5","infoHashBuffer":{"type":"Buffer","data":[186,46,255,200,230,125,233,223,35,6,58,234,161,225,152,163,218,253,197,181]},"announce":[],"urlList":[]}}