{"title":"Professional Test-Driven Development With C# [PDF]","uid":9277133,"size":47021799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba74145be5eddfd61d905697ca354475f9a198d1&amp;dn=Professional+Test-Driven+Development+With+C%23+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"F1restorm","files":-1,"time":1385881271,"description":"Professional Test Driven Development with C#: Developing Real-World Applications with TDD\nAuthors: James Bender and Jeff McWherter\nPublished: 2011\nPublisher: Wrox\nISBN: 9780470643204 \nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nTested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n__________________________________________________________________________________\n\nStart working with test driven development processes to build better applications!\nIf you want to write robust software that is simple to implement and maintain, you need to use Test Driven Development (TDD). This hands-on guide shows you how, providing invaluable insight for creating effective TDD processes. With the help of source code and examples featured in C#, the authors walk you through the TDD methodology and show you how to apply it to a real-world application. You'll explore the application as it's built from scratch and follow each step involved in development, including problems that arise and the solutions to apply. Within no time, you'll be designing your own successful TDD processes.\n\nProfessional Test Driven Development with C#:\n-Describes common software problems and provides refactoring practices that resolve them\n-Shows patterns that can be used to test WPF and Silverlight applications\n-Helps you ensure that when a defect is fixed it stays fixed without causing unexpected side effects\n-Shows how to structure your MVC application for testability\n-Shares the easy steps that can be taken to test WCF services\n-Explains how to run integration tests to ensure that everything works as planned\n-Uncovers best practices for writing good tests that are readable and maintainable\n\nWrox Professional guides are planned and written by working programmers to meet the real-world needs of programmers, developers, and IT professionals. Focused and relevant, they address the issues technology professionals face every day. They provide examples, practical solutions, and expert education in new technologies, all designed to help programmers do a better job.","torrent":{"xt":"urn:btih:ba74145be5eddfd61d905697ca354475f9a198d1","amp;dn":"Professional+Test-Driven+Development+With+C%23+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba74145be5eddfd61d905697ca354475f9a198d1","infoHashBuffer":{"type":"Buffer","data":[186,116,20,91,229,237,223,214,29,144,86,151,202,53,68,117,249,161,152,209]},"announce":[],"urlList":[]}}