{"title":"Albert Camus - The Stranger (pdf)","uid":8604168,"size":928645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba779db42ffe074a01c1e032ba7ebf54af8bff40&amp;dn=Albert+Camus+-+The+Stranger+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"pharmakate","files":-1,"time":1371960173,"description":"Albert Camus (Matthew Ward, trans.) - The Stranger (Vintage, 1988).\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nOther versions of The Stranger are available here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8590574&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8590574&lt;/a&gt;\n\nBut I wasn't satisfied with them, hence this new scan.\n\n\ndescription:\n\nThrough the story of an ordinary man unwittingly drawn into a senseless murder on an Algerian beach, Camus explored what he termed &quot;the nakedness of man faced with the absurd.&quot; First published in 1946; now in a new translation by Matthew Ward.\n\nReview\n\nThe Stranger is not merely one of the most widely read novels of the 20th century, but one of the books likely to outlive it. Written in 1946, Camus's compelling and troubling tale of a disaffected, apparently amoral young man has earned a durable popularity (and remains a staple of U.S. high school literature courses) in part because it reveals so vividly the anxieties of its time. Alienation, the fear of anonymity, spiritual doubt--all could have been given a purely modern inflection in the hands of a lesser talent than Camus, who won the Nobel Prize in 1957 and was noted for his existentialist aesthetic. The remarkable trick of The Stranger, however, is that it's not mired in period philosophy.\n\nThe plot is simple. A young Algerian, Meursault, afflicted with a sort of aimless inertia, becomes embroiled in the petty intrigues of a local pimp and, somewhat inexplicably, ends up killing a man. Once he's imprisoned and eventually brought to trial, his crime, it becomes apparent, is not so much the arguably defensible murder he has committed as it is his deficient character. The trial's proceedings are absurd, a parsing of incidental trivialities--that Meursault, for instance, seemed unmoved by his own mother's death and then attended a comic movie the evening after her funeral are two ostensibly damning facts--so that the eventual sentence the jury issues is both ridiculous and inevitable.\n\nMeursault remains a cipher nearly to the story's end--dispassionate, clinical, disengaged from his own emotions. &quot;She wanted to know if I loved her,&quot; he says of his girlfriend. &quot;I answered the same way I had the last time, that it didn't mean anything but that I probably didn't.&quot; There's a latent ominousness in such observations, a sense that devotion is nothing more than self-delusion. It's undoubtedly true that Meursault exhibits an extreme of resignation; however, his confrontation with &quot;the gentle indifference of the world&quot; remains as compelling as it was when Camus first recounted it. --Ben Guterson\n\n","torrent":{"xt":"urn:btih:ba779db42ffe074a01c1e032ba7ebf54af8bff40","amp;dn":"Albert+Camus+-+The+Stranger+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba779db42ffe074a01c1e032ba7ebf54af8bff40","infoHashBuffer":{"type":"Buffer","data":[186,119,157,180,47,254,7,74,1,193,224,50,186,126,191,84,175,139,255,64]},"announce":[],"urlList":[]}}