{"title":"Raspberry Pi for Secret Agents","uid":8911671,"size":9732417,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba7b4b6340968ed5fb97f70daabf555296a8f1ba&amp;dn=Raspberry+Pi+for+Secret+Agents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1379042535,"description":"Raspberry Pi for Secret Agents\n\nBook Details:\n\nPages: 152\nPublisher: Packt Publishing (April 2013)\nLanguage: English\nISBN-10: 1849695784\nISBN-13: 978-1849695787\nFormat: PDF, EPUB\n\nBook Description:\n\nEver wished you could play around with all the neat gadgets your favorite spies use (like James Bond or Michael Westen)? With the introduction of the remarkable Raspberry Pi and a few USB accessories, anybody can now join in on the action.\n\nDiscover how to turn your Raspberry Pi into a multipurpose secret agent tool! Through a series of fun, easy-to-follow projects you will learn how to set up audio/video surveillance, explore your Wi-Fi network, play pranks on your friends, and even learn how to free your Raspberry Pi from the constraints of the wall socket.\n\nRaspberry Pi for Secret Agents starts out with the initial setup of your Raspberry Pi, guides you through a number of pranks and secret agent techniques, and then shows you how to apply what you have learned out in the real world.\n\nLearn how to configure your operating system for maximum mischief and start exploring the audio, video, and Wi-Fi projects. Learn how to record, listen, or talk to people from a distance and how to distort your voice. You can even plug in your webcam and set up a motion detector with an alarm, or find out what the other computers on your Wi-Fi network are up to. Once you have mastered the techniques, combine them with a battery pack and GPS for the ultimate off-road spy kit.\n\nWhat you will learn from this book:\n\nInstall and configure Raspbian OS for maximum mischief\nSchedule a prank to happen when your foe least expects it\nListen in or talk to people from a distance\nDetect an intruder with motion detection and set off an alarm\nDistort your voice in weird and wonderful ways\nPush unexpected images into browser windows\nKnock all visitors off your Wi-Fi network\nControl the Pi with your smartphone\nKeep your data secret with encryption\n\nApproach:\n\nA playful, informal approach to using the Raspberry Pi for mischief!\n\nWho this book is for?:\n\nRaspberry Pi for Secret Agents is for all mischievous Raspberry Pi owners who would like to see their computer transform into a neat spy gadget to be used in a series of practical pranks and projects. No previous skills are required to follow along and if you are completely new to Linux, you will pick up much of the basics for free.\n\nApart from the Raspberry Pi board itself, a USB microphone and/or a webcam is required for most of the audio/video topics and a Wi-Fi dongle is recommended for the networking examples. A Windows/Mac OS X/Linux computer (or second Raspberry Pi) is also recommended for remote network access.\n","torrent":{"xt":"urn:btih:ba7b4b6340968ed5fb97f70daabf555296a8f1ba","amp;dn":"Raspberry+Pi+for+Secret+Agents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba7b4b6340968ed5fb97f70daabf555296a8f1ba","infoHashBuffer":{"type":"Buffer","data":[186,123,75,99,64,150,142,213,251,151,247,13,170,191,85,82,150,168,241,186]},"announce":[],"urlList":[]}}