{"title":"Perv: The Sexual Deviant in All of Us","uid":11226684,"size":515657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:baf682aa85fbdac4ec3799ee5cc743b2a002825c&amp;dn=Perv%3A+The+Sexual+Deviant+in+All+of+Us&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Jallentino","files":-1,"time":1413457204,"description":"Jesse Bering, &quot;Perv: The Sexual Deviant in All of Us&quot;\nEnglish | ISBN: 0374534837, 0857520407 | 2014 | 265 pages | MOBI | 0.5 MB\n\nIn this eye-opening book, psychologist Jesse Bering argues that we are all sexual deviants on one level or another. He introduces us to the young woman who falls madly in love with the Eiffel Tower, a young man addicted to seductive sneezes, and a pair of deeply affectionate identical twins, among others. He challenges us to move beyond our attitudes towards 'deviant' sex and consider the alternative: what would happen if we rise above our fears and revulsions and accept our true natures? With his signature wit and irreverent style, Bering pulls back the curtains on the history of perversions, the biological reasons behind our distaste for unusual sexual proclivities and the latest research on desire. Armed with reason, science and an insatiable appetite for knowledge, he humanises deviants while asking some provocative questions about the nature of hypocrisy, prejudice and when sexual desire can lead to harm. A groundbreaking look at our complex relationship with our carnal urges and the ways in which we disguise, deny and shame the sexual deviant in all of us, Perv brings hidden desires into the spotlight","torrent":{"xt":"urn:btih:baf682aa85fbdac4ec3799ee5cc743b2a002825c","amp;dn":"Perv%3A+The+Sexual+Deviant+in+All+of+Us","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baf682aa85fbdac4ec3799ee5cc743b2a002825c","infoHashBuffer":{"type":"Buffer","data":[186,246,130,170,133,251,218,196,236,55,153,238,92,199,67,178,160,2,130,92]},"announce":[],"urlList":[]}}