{"title":"RR CDG+MP3 Karaoke Collection Vol 4 (20 GB RAR Archive)","uid":15437570,"size":22028856665,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bb9c90ba409f2ef1f979fc9c04d3daecb9dda68d&amp;dn=RR+CDG%2BMP3+Karaoke+Collection+Vol+4+%2820+GB+RAR+Archive%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":20,"uploader":"rigmar_radio","files":22,"time":1469781256,"description":"Please do NOT download more than 1 Vol in this series at a time!  You know that makes sense.  Overloading your bit torrent client with too many active torrents KILLS download speeds!!!!\r\n\r\nPor favor, no descargue más de 1 Vol en esta serie a la vez! Usted sabe que tiene sentido. Sobrecargar su cliente bit torrent con demasiados torrents activos MATA velocidades de descarga !!!!\r\n\r\nS'il vous plaît ne pas télécharger plus de 1 vol dans cette série à la fois! Vous savez cela fait sens. Surcharger votre client bit torrent avec trop de torrents actifs TUE vitesses de téléchargement !!!!\r\n\r\nVänligen hämta inte mer än en volym i denna serie på en gång! Du vet att vettigt. Överbelastning din bit torrent klient med alltför många aktiva torrents DÖDAR nedladdningshastigheter !!!!\r\n\r\nAgain and again I see the same peers on all 3 previous torrents downloading at dial up speeds.  You should be able to download 20GB in less than 24 hours with ease.\r\n\r\nIt gets very annoying when 6 peers can not take all my upload speed between them grrr...\r\n\r\nCDG+MP3 Karaoke, 500 songs to a single RAR Archive, 5000 songs to a torrent.  10000 files in total.  Collection is 65 thousand songs, requires a 500 GB hard drive to store it on and features multiple karaoke label choice on the more popular Songs.\r\n\r\nAll songs have had the original file names altered to follow standard notation for the naming of computer music files for easy import into the professional playout software of your choice.   All songs can be played on WinAmp or VLC media players once the CDG filetype is changed to open with that software.\r\n\r\nThis collection can be used at home for learning new songs following the above advice","torrent":{"xt":"urn:btih:bb9c90ba409f2ef1f979fc9c04d3daecb9dda68d","amp;dn":"RR+CDG%2BMP3+Karaoke+Collection+Vol+4+%2820+GB+RAR+Archive%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb9c90ba409f2ef1f979fc9c04d3daecb9dda68d","infoHashBuffer":{"type":"Buffer","data":[187,156,144,186,64,159,46,241,249,121,252,156,4,211,218,236,185,221,166,141]},"announce":[],"urlList":[]}}