{"title":"Walk The Line - Soundtrack 2006 Joaquin Phoenix","uid":9502842,"size":101027366,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bc155ccb2c1b3f30bf2e944cab9853dd453ab97a&amp;dn=Walk+The+Line+-+Soundtrack+2006+Joaquin+Phoenix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1390256520,"description":"Source: 2006 CD\n\nWalk The Line - Original Motion Picture Soundtrack 320cbr (Big Papi) 2006 Joaquin Phoenix Reese Witherspoon\n\n\n\n\n\nBy M. Carter\nOh, wait. Joaquin Phoenix and Reese Witherspoon aren't trying to impersonate Johnny Cash and June Carter. Director James Mangold himself said, &quot;If people want to hear Johnny Cash, they can buy one of his CDs.&quot; So stop calling the actors mindless impersonators; they're not copying Cash and Carter, they're trying to capture the essence of their sound.\n\nNow, with that sermon preached, let's give this soundtrack the disgustingly positive review it deserves. Phoenix's voice is nothing short of astounding. Not only does he sound remarkably like Cash, he pours enough emotion into the tunes to make them believable. There's the opening &quot;Get Rhythm,&quot; a toe-tapping ode to rock-n-roll. Better still is &quot;I Walk the Line,&quot; where's Phoenix's voice doesn't miss a single note (listen to his impressively low register). He shines on uptempo numbers like &quot;Cry Cry Cry,&quot; &quot;Ring of Fire&quot;--perhaps his finest performance--and the swaggering &quot;Cocaine Blues.&quot;\n\nAnd don't forget Reese Witherspoon. There's no denying her talent; she's got a nicely-twangy voice she's obviously been keeping under wraps. &quot;Wildwood Flower&quot; lacks some of the original's emotion, but Witherspoon is new and does a decent job. She mimics Carter's firecracker spirit on &quot;Juke Box Blues,&quot; a twang-tinged delight, and &quot;Jackson,&quot; a first-rate duet with Phoenix. Her back-up vocals on &quot;It Ain't Me, Babe&quot; also are impressive.\n\nTunes from other players are commendable if slightly less heartfelt. Tyler Hilton ably covers &quot;That's All Right&quot; and &quot;Milk Cow Blues Boogie,&quot; and Waylon Malloy Payne scores a hit with the rollicking &quot;Lewis Boogie.&quot; Shooter Jennings offers a fine country performance of &quot;I'm A Long Way from Home.&quot;\n\nIs this an album of cover tunes? In one way, the answer's a resounding yes. But every performer does well with the difficult task of interpreting the tunes to make them sound fresh.\n\nAnd The Man in Black was nothing if not fearless when it came to his music.","torrent":{"xt":"urn:btih:bc155ccb2c1b3f30bf2e944cab9853dd453ab97a","amp;dn":"Walk+The+Line+-+Soundtrack+2006+Joaquin+Phoenix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc155ccb2c1b3f30bf2e944cab9853dd453ab97a","infoHashBuffer":{"type":"Buffer","data":[188,21,92,203,44,27,63,48,191,46,148,76,171,152,83,221,69,58,185,122]},"announce":[],"urlList":[]}}