{"title":"Here Be Dragons - Quest for Extraterrestrial Life (gnv64)","uid":11787228,"size":17107561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc23aa0f7eb94cbfe0d0de5559b9c7291f82d067&amp;dn=Here+Be+Dragons+-+Quest+for+Extraterrestrial+Life+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"gnv65","files":4,"time":1427795787,"description":"Here Be Dragons: The Scientific Quest for Extraterrestrial Life\nby David Koerner and Simon LeVay\nOxford University Press | November 2001 | ISBN-10: 019514600X | PDF | 280 pages | 16.2 mb\n\nIn Here Be Dragons, astronomer David Koerner and neurobiologist Simon LeVay offer a scientifically compelling and colorful account of the search for life beyond Earth.\nThe authors survey the work of biologists, cosmologists, computer theorists, NASA engineers, SETI researchers, roboticists, and UFO enthusiasts and debunkers as they attempt to answer the greatest remaining question facing humankind: Are we alone? From their &quot;safe haven of skepticism&quot; the authors venture into the &quot;rough seas of speculation,&quot; where theory and evidence run the gamut from hard science to hocus pocus. Arguing that the universe is spectacularly suited for the evolution of living creatures, Koerner and LeVay give us ringside seats at the great debates of Big Science. The contentious arguments about what really happens in evolution, the acrimonious UFO controversy, and the debate over intelligence versus artificial intelligence shed new light on the wildly divergent claims about the universe and life's place in it.\n\nAbout the Authors\nSimon LeVay is a British-born neuroscientist turned writer. He is best known for a 1991 study, published in Science, which reported on a difference in brain structure between gay and straight men. He has served on the faculties of Harvard Medical School and the Salk Institute in San Diego, but he now lives in Los Angeles. Among his 12 published books are several on sex. His most recent book is a historical novel. \nDavid Koerner is an Assistant Professor of Astronomy at the University of Pennsylvania\n\nCONTENTS\nAcknowledgments \t\nIntroduction \t1\n1 Origins: How Life on Earth Began \t11\n2 Going to Extremes: The Habitats and Requirements for Life \t39\n3 The Incredible Shrinking Martians: Searching for Life in the Solar System \t63\n4 The Death and Life of Stars: Organic Molecules and the Evolution of Solar Systems \t91\n5 The Planet Finders: Searching for Life Beyond the Sun \t109\n6 What Happens in Evolution? Chance and Necessity in the Origin of Biological Complexity \t131\n7 SETI: The Search for Extraterrestrial Intelligence \t159\n8 Dreamland: The Science and Religion of UFOs \t183\n9 Exotica: Life as We Don't Know It \t195\n10 Many Worlds: Cosmology and the Anthropic Principle \t219\nConclusions \t237\nNotes \t247\nIndex \t257","torrent":{"xt":"urn:btih:bc23aa0f7eb94cbfe0d0de5559b9c7291f82d067","amp;dn":"Here+Be+Dragons+-+Quest+for+Extraterrestrial+Life+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc23aa0f7eb94cbfe0d0de5559b9c7291f82d067","infoHashBuffer":{"type":"Buffer","data":[188,35,170,15,126,185,76,191,224,208,222,85,89,185,199,41,31,130,208,103]},"announce":[],"urlList":[]}}