{"title":"Lonely Planet - Discover New Zealand - 2nd Ed (2012).epub Gooner","uid":13644135,"size":91945377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bcb81ec1e2ca175eab05ed02eaa5192fe4fcdc5e&amp;dn=Lonely+Planet+-+Discover+New+Zealand+-+2nd+Ed+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1456150169,"description":"Lonely Planet - Discover New Zealand (Travel Guide) - 2nd Edition (2012).epub Gooner\r\n\r\nPublisher: Lonely Planet; 2 edition (November 1, 2012)\r\nLanguage: English\r\nISBN-10: 1742201202\r\nISBN-13: 978-1742201207\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Discover New Zealand is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Behold Rotorua's bubbling geysers, hike past aquamarine bays and sparkling glaciers, or try abalone and other Maori favorites while overlooking Auckland's waterfront; all with your trusted travel companion. Discover the best of New Zealand and begin your journey now!\r\n\r\nInside Lonely Planet Discover New Zealand:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\r\n\r\n* Insider tips save you time and money and help you get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\r\n\r\n* Honest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer and more rewarding travel experience - including Maori customs, history, environment, active pursuits, landscapes, wildlife, cuisine, and wine\r\n\r\n* Free, convenient pull-out New Zealand map (included in print version), plus over 35 regional or neighbourhood maps\r\n\r\n* Useful features - including Month-by-Month (annual festival calendar), Travel with Kids, and What's New\r\n\r\n* Coverage of Auckland, Rotorua, Wellington, Lower North Island, Marlborough, Nelson, Christchurch, Central South, Queenstown, The South, and more\r\n\r\nThe Perfect Choice: Lonely Planet Discover New Zealand, our easy-to-use guide, is perfect for travellers who seek the most popular attractions a destination has to offer. Filled with inspiring and colourful photos, this guide focuses on the best of the best.\r\n\r\n* Looking for more coverage? Check out Lonely Planet's New Zealand guide for a comprehensive look at what the whole country has to offer.\r\n\r\n* Looking for a guide focused on just the North or South islands of New Zealand? Check out Lonely Planet's New Zealand's South Island guide or New Zealand'sNorth Island guide for a comprehensive look at all that each of these islands has to offer.\r\n\r\nAuthors: Written and researched by Lonely Planet, Charles Rawlings-Way, Brett Atkinson, Peter Dragicevich, Sarah Bennett, Lee Slater, Professor James Belich, John Huria, and Vaughan Yarwood.\r\n\r\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places they find themselves in","torrent":{"xt":"urn:btih:bcb81ec1e2ca175eab05ed02eaa5192fe4fcdc5e","amp;dn":"Lonely+Planet+-+Discover+New+Zealand+-+2nd+Ed+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb81ec1e2ca175eab05ed02eaa5192fe4fcdc5e","infoHashBuffer":{"type":"Buffer","data":[188,184,30,193,226,202,23,94,171,5,237,2,234,165,25,47,228,252,220,94]},"announce":[],"urlList":[]}}