{"title":"T3 India - October 2016 (gnv64)","uid":16013517,"size":34161272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd00c9ec07134e4f984b2d18f35044daef75940a&amp;dn=T3+India+-+October+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"gnv65","files":4,"time":1476264741,"description":"T3 India - October 2016\r\nEnglish | 116 Pages | True PDF | 32.5 mb\r\n\r\nFEATURES\r\n047 GADGET GURU - This month, our wizened tech talisman has advice on kitchen gadgets, high-end headphones and, er, watch allergies\r\n049 AGENDA - Seven new adventures you can enjoy with tech. This month, work out with the world’s first true AI personal trainer, relive your gaming youth with Nintendo, and much more\r\n068 STATE OF THE ART - What could be more enjoyable than driving around in a sports car with the top down? T3 tests three of\r\n\r\nHYPE\r\n014 FIRST LOOK Microsoft’s HoloLens is almost upon us – here’s the lowdown\r\n018 PREVIEW Showcasing the hottest new tech. This month, the new iPhones, the Suunto Spartan Ultra, the Alienware 13 OLED Notebook and more\r\n040 PEOPLE Jason Bourne is back to kick some ass. He’s gonna need some new toys\r\n041 STYLE The North Face’s Access Pack is the bag you need for your tech\r\n042 WE CAN BUILD YOU… T3 reveals the essential gadgets for the perfect man-cave\r\n046 OPINION This month, that miserable sod Duncan Bell is bored shitless with technology\r\n\r\nSELECT\r\n080 ZENFONE 3 Asus’ latest Zenfone 3 is a gorgeous looking phone. But are looks enough for anyone to sway from the competition? We take a look\r\n089 SMACKDOWN Two of the smartest drones battle for supremacy, not in the skies but in the pages of T3\r\n090 SELECT SIX Classic meets contemporary in these ‘analogue’ smartwatches\r\n092 GAMES Sherlock Holmes is back in his most exciting adventure yet\r\n096 APPS What you should be filling your phone or tablet with this month\r\n\r\nELITE\r\n105 INTRODUCING THE BEST BUYER’S GUIDE KNOWN TO MAN From phones to tablets, and camera to cars, our selection of the very best tells you what to buy\r\n\r\nESSENTIALS\r\n005 GAMECHANGER\r\n037 SUBSCRIPTIONS\r\n114 MONEY NO OBJECT\r\n \nhttps://s10.postimg.org/3v75iwdgp/T3_India_October_2016.jpg","torrent":{"xt":"urn:btih:bd00c9ec07134e4f984b2d18f35044daef75940a","amp;dn":"T3+India+-+October+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd00c9ec07134e4f984b2d18f35044daef75940a","infoHashBuffer":{"type":"Buffer","data":[189,0,201,236,7,19,78,79,152,75,45,24,243,80,68,218,239,117,148,10]},"announce":[],"urlList":[]}}