{"title":"James Vincent McMorrow... Early In The Morning(2011)[FLAC]","uid":6447984,"size":305182056,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bd1c61a05c31c5c7727155b9087fde6a86e3383e&amp;dn=James+Vincent+McMorrow...+Early+In+The+Morning%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"dickspic","files":17,"time":1307333632,"description":"[img]http://image.allmusic.com/00/amg/cov200/dro000/o072/o07217n2xpk.jpg[/img]\n[color=Green]2010 CD Burning Rope Records FACTD08 [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n 1  If I Had a Boat -McMorrow 4:08 \n  2  Hear the Noise That Moves soSoft and Low -McMorrow 4:01 \n  3  Sparrow &amp; the Wolf -McMorrow 3:43 \n  4  Breaking Hearts -McMorrow 4:51 \n  5  We Don't Eat -McMorrow 4:55 \n  6  This Old Dark Machine -McMorrow 4:16 \n  7  Follow You Down to the Red Oak Tree -McMorrow 3:28 \n  8  Down the Burning Ropes -McMorrow 5:02 \n  9  From the Woods!! -McMorrow 4:00 \n  10  And If My Heart Should Somehow Stop -McMorrow 4:36 \n  11  Early in the Morning, I'll Come Calling -McMorrow 2:37 \n\nEarly in the Morning is Irish singer/songwrtiter James Vincent McMorrow's debut. He cut it himself over five months in a cottage by the sea. It was released to acclaim in Great Britain in March of 2010, and worldwide in January, 2011. McMorrow claims his influences as Joni Mitchell, Band of Horses, and Sufjan Stevens, but one need listen no further than &quot;If I Had a Boat&quot; -- the set's opener and first single -- to clearly hear Bon Iver and Fleet Foxes in the mix as well. McMorrow's brand of folkish pop is chock-full of tight hooks and arrangements, with his high-pitched falsetto amid lush five-part harmonies. &quot;If I Had a Boat&quot; begins sparsely with his multi-tracked vocals singing a cappella with a hint of reverb before an organ, an electric slide guitar line, a snare, and a kick drum announce the rest of his instruments. It's a pleading love song that begins with frail vulnerability before gaining confidence and momentum as it builds to a crescendo as a banjo authoritatively guides his words toward the transcendent. &quot;Sparrow &amp; the Wolf,&quot; with its skittering double-timed rhythmic thrust (courtesy of a relentless snare drum) is reminiscent of skiffle, but the echoes of Stevens' quirky song structures anchor it in present-day indie rock. &quot;This Old Dark Machine&quot; has more than a bit of Mitchell's &quot;Woodstock&quot; melody in it. It begins as a moper, but quickly picks up its tempo and becomes dynamic, with layered harmonies and acoustic guitars warmly yet forcefully propelling it. There are some weepers in the mix, too, as evidenced by the spare, haunting, &quot;Follow You Down to the Red Oak Tree&quot; and &quot;Breaking Hearts,&quot; the latter with a strolling piano, mandolin, guitar, and banjo. McMorrow has a way of taking even these, his darkest, most yearning lyrics, and setting them inside melodies and arrangements that break their barriers with catchy refrains, reaching codas and lush textures. &quot;And If My Heart Should Somehow Stop,&quot; with its whinnying steel guitar, waltz-time acoustic guitars, and a key change that signals the arrival of his soulful falsetto, is the second to last track, and it's the most triumphal and memorable tune here next to the single. He should have closed with it. Tighter editing (cutting two songs) would have made this set stronger, but it's a small complaint. Early in the Morning is a very promising debut by a sophisticated yet developing singer/songwriter. \n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2011/03/02/james-vincent-mcmorrow/[/url]","torrent":{"xt":"urn:btih:bd1c61a05c31c5c7727155b9087fde6a86e3383e","amp;dn":"James+Vincent+McMorrow...+Early+In+The+Morning%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd1c61a05c31c5c7727155b9087fde6a86e3383e","infoHashBuffer":{"type":"Buffer","data":[189,28,97,160,92,49,197,199,114,113,85,185,8,127,222,106,134,227,56,62]},"announce":[],"urlList":[]}}