{"title":"Backtrack - Testing Wireless Network Security (2013)","uid":9016482,"size":16089990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd524e23889446b7184acb5f27ba34eba24fcd0d&amp;dn=Backtrack+-+Testing+Wireless+Network+Security+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1381200724,"description":"Backtrack - Testing Wireless Network Security\n\nBook Details:\n\nLanguage : English\n108 pages \nRelease Date : June 2013\nISBN : 1782164065\nISBN 13 : 9781782164067\nAuthor(s) : Kevin Cardwell\n\nWireless networks are everywhere. You have probably set one up yourself, but have you ever wondered just how safe you are while browsing online? In the majority of cases, the default settings for your networks are not enough to protect you. With your data being transferred over the air, it can be easily plucked and used by anyone who knows how. Don not let it happen to you.\n\nBackTrack - Testing Wireless Network Security will help you secure your wireless networks and keep your personal data safe. With this book, you will learn how to configure your hardware for optimum security, find network security holes, and fix them.\n\nBackTrack - Testing Wireless Network Security looks at what tools hackers use and shows you how to defend yourself against them. Taking you from no prior knowledge all the way to a fully secure environment, this guide provides useful tips every step of the way. Learn how to select a wireless card to work with the Backtrack tools, run spectrum analysis scans using kismet, set up test networks, and perform attacks against wireless networks. Use the tools aircrack-ng and airodump-ng to crack the wireless encryption used on the network.\n\nYou will learn everything you need to know to set up your wireless network for use within Backtrack and also how to defend yourself against the included attack tools.","torrent":{"xt":"urn:btih:bd524e23889446b7184acb5f27ba34eba24fcd0d","amp;dn":"Backtrack+-+Testing+Wireless+Network+Security+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd524e23889446b7184acb5f27ba34eba24fcd0d","infoHashBuffer":{"type":"Buffer","data":[189,82,78,35,136,148,70,183,24,74,203,95,39,186,52,235,162,79,205,13]},"announce":[],"urlList":[]}}