{"title":"Steven Pinker - The Blank Slate [epub]","uid":9017995,"size":1354819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd70500916199674577a67adc93d9feba5443242&amp;dn=Steven+Pinker+-+The+Blank+Slate+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"epub_888","files":-1,"time":1381229041,"description":"The Blank Slate: The Modern Denial of Human Nature\n\nIn his last outing, How the Mind Works, the author of the well-received The Language Instinct made a case for evolutionary psychology or the view that human beings have a hard-wired nature that evolved over time. This book returns to that still-controversial territory in order to shore it up in the public sphere. Drawing on decades of research in the &quot;sciences of human nature,&quot; Pinker, a chaired professor of psychology at MIT, attacks the notion that an infant's mind is a blank slate, arguing instead that human beings have an inherited universal structure shaped by the demands made upon the species for survival, albeit with plenty of room for cultural and individual variation. For those who have been following the sciences in question including cognitive science, neuroscience, behavioral genetics and evolutionary psychology much of the evidence will be familiar, yet Pinker's clear and witty presentation, complete with comic strips and allusions to writers from Woody Allen to Emily Dickinson, keeps the material fresh. What might amaze is the persistent, often vitriolic resistance to these findings Pinker presents and systematically takes apart, decrying the hold of the &quot;blank slate&quot; and other orthodoxies on intellectual life. He goes on to tour what science currently claims to know about human nature, including its cognitive, intuitive and emotional faculties, and shows what light this research can shed on such thorny topics as gender inequality, child-rearing and modern art. Pinker's synthesizing of many fields is impressive but uneven, especially when he ventures into moral philosophy and religion; examples like &quot;Even Hitler thought he was carrying out the will of God&quot; violate Pinker's own principle that one should not exploit Nazism &quot;for rhetorical clout.&quot; For the most part, however, the book is persuasive and illuminating.","torrent":{"xt":"urn:btih:bd70500916199674577a67adc93d9feba5443242","amp;dn":"Steven+Pinker+-+The+Blank+Slate+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd70500916199674577a67adc93d9feba5443242","infoHashBuffer":{"type":"Buffer","data":[189,112,80,9,22,25,150,116,87,122,103,173,201,61,159,235,165,68,50,66]},"announce":[],"urlList":[]}}