{"title":"Walt Whitman - Leaves of Grass &amp; other works (5 books)","uid":10028976,"size":13641221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bdb2e7b5e8ee9bfd435cd7eff97745d4c5cf04e6&amp;dn=Walt+Whitman+-+Leaves+of+Grass+%26amp%3B+other+works+%285+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"workerbee","files":-1,"time":1398307378,"description":"\nWALT WHITMAN (1819-1892) was an American poet, essayist and journalist, and ranks among the most influential writers in the American canon.  A humanist, he was a part of the transition between transcendentalism and realism, incorporating both views in his works.\n\nHis work was very controversial in its time, particularly his poetry collection LEAVES OF GRASS, which was described as obscene for its overt sexuality.  Though the first edition was published in 1855, Whitman spent his entire life writing and re-writing the collection, revising it in several editions until his death.  This resulted in vastly different editions over four decades -- the first a small book of twelve poems and the last a compilation of over 400 poems.\n\nTHE PORTABLE WALT WHITMAN presents a rich cross-section of his work, including poems from throughout Whitman's lifetime as published on his deathbed edition of 1891, short stories, his prefaces to the many editions of LEAVES OF GRASS, and a variety of prose selections, including &quot;Democratic Vistas&quot;, &quot;Specimen Days&quot;, and &quot;Slang in America&quot;.\n\nWritten in the aftermath of the American Civil War during the ferment of national Reconstruction, DEMOCRATIC VISTAS remains one of the most penetrating analyses of democracy ever written.  Diagnosing democracy's failures as well as laying out its vast possibilities, Whitman offers an unflinching assessment of the ongoing social experiment known as the United States.  In the facsimile of the original 1870-1871 edition, with an introduction and annotations by noted Whitman scholar Ed Folsom that illuminate the essay's historical and cultural contexts, this searing analysis of American culture offers readers today the opportunity to argue with Whitman over the nature of democracy and the future of the nation.\n\nHorace Traubel, Whitman's loyal and hardworking assistant, began to record his almost daily conversations with the great poet in 1888.  The result was eventually published in nine volumes.  In INTIMATE WITH WALT, Gary Schmidgall condenses Traubel's nearly 5,000 pages into one manageable volume featuring the many self-revealing, humorous, nostalgic, and often curmudgeonly words of Whitman.\n\n\nThe following books are in PDF format unless otherwise indicated:\n\n* DEMOCRATIC VISTAS: The Original Edition in Facsimile (University of Iowa Press, 2010).  Edited by Ed Folsom.\n\n* INTIMATE WITH WALT: Selections from Whitman's Conversations with Horace Traubel, 1888-1892 (University of Iowa Press, 2001).  Edited by Gary Schmidgall.\n\n* LEAVES OF GRASS: First and &quot;Death-Bed&quot; Editions (Barnes &amp; Noble Classics, 2004).  Edited with an Introduction and Notes by Karen Karbiener. -- ePUB\n\n* THE PORTABLE WALT WHITMAN (Penguin Classics, 2004).  Edited with an Introduction by Michael Warner.\n\n* WALT WHITMAN: THE CORRESPONDENCE, Vol. VII (University of Iowa Press, 2004).  Edited by Ted Genoways.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:bdb2e7b5e8ee9bfd435cd7eff97745d4c5cf04e6","amp;dn":"Walt+Whitman+-+Leaves+of+Grass+%26amp%3B+other+works+%285+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdb2e7b5e8ee9bfd435cd7eff97745d4c5cf04e6","infoHashBuffer":{"type":"Buffer","data":[189,178,231,181,232,238,155,253,67,92,215,239,249,119,69,212,197,207,4,230]},"announce":[],"urlList":[]}}