{"title":"The 33 Strategies Of War - Audiobook 192kbps - JackDilla","uid":3854580,"size":816919173,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bdcbcf06819c2a9487f8a57fd5e225eea890c86b&amp;dn=The+33+Strategies+Of+War+-+Audiobook+192kbps+-+JackDilla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Jackdilla1","files":3,"time":1193118209,"description":"I&amp;#039;m uploading this due to a couple of requests that i received. Same high quality as my 48 Laws of Power Release. Enjoy It people.\n\nFrom Amazon.com:\nQuote:\nAs in his bestselling The 48 Laws of Power, Greene puts a modern spin on wisdom that has stood the test of history, only this time his role model is Sun Tzu rather than Machiavelli. The argument is fairly\nstandard: despite our most noble intentions, &quot;aggressive impulses that are impossible to ignore or repress&quot; make military combat a fitting metaphor for getting ahead in life. Greene&amp;#039;s advice covers everything from steeling one&amp;#039;s mind for battle to specific defensive and offensive tactics?notably, the final section on &quot;dirty&quot; warfare is one of the book&amp;#039;s longest. Historical lessons are outlined and interpreted, with amplifying quotations crammed into the margins. Not all of the examples are drawn from the battlefield; in one section, Greene skips nimbly from Lyndon Johnson&amp;#039;s tenacity to Julius Caesar&amp;#039;s decisiveness, from Joan Crawford&amp;#039;s refusal to compromise to Ted Williams&amp;#039;s competitive drive. Alfred Hitchcock, he says, embodies &quot;the detached-Buddha tactic&quot; of appearing uninvolved while remaining in total control. The diversity of subject matter compensates for occasional lapses into stilted warriorese (&quot;arm yourself with prudence, and never completely lay down your arms, not even for friends&quot;). For those willing to embrace its martial conceit, Greene&amp;#039;s compendium offers inspiration and entertainment in equal measure.\n\n\n_Jackdilla","torrent":{"xt":"urn:btih:bdcbcf06819c2a9487f8a57fd5e225eea890c86b","amp;dn":"The+33+Strategies+Of+War+-+Audiobook+192kbps+-+JackDilla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdcbcf06819c2a9487f8a57fd5e225eea890c86b","infoHashBuffer":{"type":"Buffer","data":[189,203,207,6,129,156,42,148,135,248,165,127,213,226,37,238,168,144,200,107]},"announce":[],"urlList":[]}}