{"title":"Squirrels AirParrot 2 v2.6.1.250","uid":15870368,"size":98182985,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bef0160a18f9f55929c2ce188ac20208befa836a&amp;dn=Squirrels+AirParrot+2+v2.6.1.250&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"LxByte","files":2,"time":1474418758,"description":"Squirrels AirParrot 2 v2.6.1.250\r\n\r\nWirelessly share content from any device.\r\n\r\nAirParrot allows you to wirelessly beam your screen or media files to a variety of media receivers. AirParrot quickly discovers available receivers on your network, and uses Quick Connect® to connect directly to a device running Reflector 2™. Easily share your screen, videos, audio, presentations and so much more.\r\n\r\n\r\nUse AirParrot with multiple receivers.\r\n\r\nAirParrot is designed to send content to a number of media receivers, even simultaneously. Broadcast to multiple devices like Apple TV and Chromecast, or share audio around the house to AirPlay-enabled speakers. Use AirParrot in combination with Reflector to create a seamless mirroring experience to any computer or device. Never worry about compatibility issues again; share from any device, to any device!\r\n\r\n\r\nNo adapters required.\r\n\r\nShare wirelessly with everyone in the room without the need for cables and adapters. AirParrot gives anyone the ability to share and engage the classroom, boardroom or beyond. Focus on what matters most and send content from any device to a receiver connected to a television or projector. Our patent-pending Quick Connect technology and Bluetooth discovery* allows you to quickly discover and connect to devices, even when network configurations prevent it.\r\n\r\n\r\nThe big screen is your screen.\r\n\r\nBeam a movie or your favorite video game to a receiver, and enjoy the big screen experience. AirParrot streams media files in 5.1 surround sound, without quality loss. Create the ultimate entertainment solution and add unlimited content and possibilities to any TV. \r\n\r\n\r\nOfficial Website: http://www.airsquirrels.com/airparrot/","torrent":{"xt":"urn:btih:bef0160a18f9f55929c2ce188ac20208befa836a","amp;dn":"Squirrels+AirParrot+2+v2.6.1.250","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bef0160a18f9f55929c2ce188ac20208befa836a","infoHashBuffer":{"type":"Buffer","data":[190,240,22,10,24,249,245,89,41,194,206,24,138,194,2,8,190,250,131,106]},"announce":[],"urlList":[]}}