{"title":"Active File Recovery 13.0.15 + Crack","uid":11019235,"size":46419559,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bf2a4e88a6429d2570884c3d64766598e26e7309&amp;dn=Active+File+Recovery+13.0.15+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"poyolx55","files":-1,"time":1410544476,"description":"Active File Recovery 13.0.15 x64 \nActive@ File Recovery for Windows provides the ability to effectively detect and recover files and disks lost due to accidental deletion, disk formatting, virus and other reasons. Active@ File Recovery Professional package also includes integrated Disk Editor (HEX Viewer) - utility for low-level data inspection, Active@ Partition Recovery - tool used to recover deleted or damaged volumes, and Active@ File Organizer - utility to organize/rename files after a catastrophic data loss.\n\n\nFeatures:\n\n* Support for exFAT, Unix UFS, Apple HFS+ and Linux Ext2/Ext3/Ext4fs file systems\n* Support for 4096 byte sector size HDDs\n* Support for RAW-Compressed images and RAW images manually composed from several chunks\n* Support for VMWARE &amp; VirtualPC HDD images: open and work as with regular HDDs\n* New built-in signatures supported (Adobe *.pdf, RAR archives *.rar, Flash *.swf, QuickTime *.m4). User-defined signatures can be created and loaded\n* Support for multi-tasking: user can QuickScan found volumes and recover data while SuperScan is in progress\n* SuperScan progress: displays a map of scanned sectors and found meta-data while scanning\n* Configuration parameters stored locally and re-loaded upon next use\n* Recovers from virtually connected volumes, like TrueCrypt encrypted disks\n* Improved SuperScan algorithms - detects more deleted partitions and reveals more files for recovery\n* Scan speed increased 2 to 4 times, with significant reduction in system memory consumption\n* Keyboard shortcuts added - many operations can be performed without use of a mouse\n* Integrated Active@ Disk Editor (HEX Viewer) and Active@ Organizer utilities\n* Search results displayed with full path and support hierarchical structure\n* SuperScan process displays various details, including sector info, time elapsed and time remaining, as well as found meta-data\n* Advanced filtering of volumes found by SuperScan\n* Full support for multi-language character sets (Unicode), recovers files and folders having names containing non-English characters (ex. Spanish, Chinese, Korean, etc.)\n* Reconstructs and recovers severely damaged MFT records on NTFS\n\nOS : Windows 8, 7, Vista, Server 2012, Server 2008, Server 2003, XP","torrent":{"xt":"urn:btih:bf2a4e88a6429d2570884c3d64766598e26e7309","amp;dn":"Active+File+Recovery+13.0.15+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf2a4e88a6429d2570884c3d64766598e26e7309","infoHashBuffer":{"type":"Buffer","data":[191,42,78,136,166,66,157,37,112,136,76,61,100,118,101,152,226,110,115,9]},"announce":[],"urlList":[]}}