{"title":"How to Win Friends &amp; Influence People, by Home Comforts","uid":15962324,"size":14900316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfdc5891ca01a3e027363c95f5557608436ea1e6&amp;dn=How+to+Win+Friends+%26amp%3B+Influence+People%2C+by+Home+Comforts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"freshg2","files":1,"time":1475681687,"description":"This grandfather of all people-skills books was first published in 1937. It was an\r\novernight hit, eventually selling 15 million copies. How to Win Friends and Influence\r\nPeople is just as useful today as it was when it was first published, because Dale\r\nCarnegie had an understanding of human nature that will never be outdated.\r\nFinancial success, Carnegie believed, is due 15 percent to professional knowledge\r\nand 85 percent to &quot;the ability to express ideas, to assume leadership, and to arouse\r\nenthusiasm among people.&quot; He teaches these skills through underlying principles of\r\ndealing with people so that they feel important and appreciated. He also\r\nemphasizes fundamental techniques for handling people without making them feel\r\nmanipulated. Carnegie says you can make someone want to do what you want\r\nthem to by seeing the situation from the other person's point of view and &quot;arousing\r\nin the other person an eager want.&quot; You learn how to make people like you, win\r\npeople over to your way of thinking, and change people without causing offense or\r\narousing resentment. For instance, &quot;let the other person feel that the idea is his or\r\nhers,&quot; and &quot;talk about your own mistakes before criticizing the other person.&quot;\r\nCarnegie illustrates his points with anecdotes of historical figures, leaders of the\r\nbusiness world, and everyday folks. --Joan Price --This text refers to an out of print\r\nor unavailable edition of this title","torrent":{"xt":"urn:btih:bfdc5891ca01a3e027363c95f5557608436ea1e6","amp;dn":"How+to+Win+Friends+%26amp%3B+Influence+People%2C+by+Home+Comforts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfdc5891ca01a3e027363c95f5557608436ea1e6","infoHashBuffer":{"type":"Buffer","data":[191,220,88,145,202,1,163,224,39,54,60,149,245,85,118,8,67,110,161,230]},"announce":[],"urlList":[]}}