{"title":"Flashpoint - Complete Season 2 [HDTV]","uid":6158845,"size":8076112469,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c0681e23418b1918af90c2c359405a9e14a0b7db&amp;dn=Flashpoint+-+Complete+Season+2+%5BHDTV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":19,"leechers":11,"uploader":"manOtor","files":-1,"time":1297138552,"description":"                                     Flashpoint\n                               +++ HDTV (XviD/MP3) +++\n                                The Complete Season 2\n\n\nFlashpoint is about an elite tactical unit, called the Strategic Response Unit (SRU), within a Canadian metropolitan police force (styled on the Toronto Police Emergency Task Force). The SRU are tasked to resolve extreme situations that regular officers are not trained to handle including hostage-taking, bomb threats and heavily armed criminals. Equipped with high-tech tools and a cache of weapons and explosives, members use negotiation tactics and intuition to try to avoid the use of force.\n\n\nEpiosde order\n\nThe order of episodes seems to be a kind of confusing matter - so I post the link to the current episode order listed by CTV on their site at present.\n\nCTV's List of Episodes:\n &lt;a href=&quot; http://shows.ctv.ca/FlashPoint/Episodes.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://shows.ctv.ca/FlashPoint/Episodes.aspx&lt;/a&gt;\n\n\nThe Complete Season 3 in HDTV\n &lt;a href=&quot; https://thepiratebay.se/torrent/6158516&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/6158516&lt;/a&gt;\n\n\nFormat :\t\tXviD\nFile size:  \t\t349MiB avg per episode\nDuration : \t\t42min avg. per episode\nWidth : \t\t624 pixels\nHeight : \t\t352 pixels\nAspect ratio : \t16:9\nFrame rate : \t23.976fps\nAudio: \t\tMP3\nNr. of Files:\t\t22 + 1 TitlePic\n\n\nAll files properly named.\nThis pack wouldn't have been possible without you, we worship you,\n\n+++eztv+++TvTeam+++VTV+++scenebalance+++TorrentDay+++eztv+++\n\nAfter 24 hours initial seeding there should be enough seeders to get the whole thing with decent speed in a decent time.\n\n##################  You like your show in one pack?  ##################\n########################  Here you go!  ########################\n &lt;a href=&quot; https://thepiratebay.se/user/man-o-tor/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/man-o-tor/&lt;/a&gt;\n\nFor questions,requests,comments feel free to PM me on SuprBay\n &lt;a href=&quot; http://forum.suprbay.org/member.php?action=profile&amp;uid=123771&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.suprbay.org/member.php?action=profile&amp;uid=123771&lt;/a&gt;\n\n\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-\nList of Episodes:\n\nS02E01 -Eagle Two -\nThe SRU is handling a routine VIP protection shift when a bomb goes off. Realizing the bomb was a distraction tactic so that the VIP's wife could be kidnapped, the SRU attempts to find her. The kidnapping turns to horror when the wife is found alive - with a remote-controlled collar bomb around her neck.\n\n\nS02E02 -Backwards Day -\nA distraught wife holds a woman she suspects is having an affair with her husband hostage at knifepoint in the couple's suburban house. The woman swears she isn't involved with the husband, but the wife doesn't believe her and demands she tell her everything. Tension mounts on the team, too, when Parker orders Ed to run the command post from the truck, rather than be in the field, because he believes Ed's exhaustion is causing him to lose focus. The mission gets more difficult, however, when the woman admits she is pregnant. \n\n\nS02E03 -Haunting the Barn -\nAn SRU veteran locks himself in a room at SRU Headquarters to commit suicide. Ed is called in to talk the man down when it is discovered that the man is Ed's former teacher. \n\n\nS02E04 -Between Heartbeats -\nPetar Tomasic, the son of the man Ed shot at First York Plaza and a war-trained sniper in his own right, is determined to get revenge for the 'murder' of his father. He takes control of city hall, and a team member struggles to stay alive after being caught in his line of fire. \n\n\nS02E05 -Business as Usual -\nAfter a mortgage scheme goes bad, the CEO of the society is taken hostage by three desperate foreclosed men. The team is called in to resolve the situation.\n\n\nS02E06 -The Fortress -\nThe SRU is shocked when they arrive at a household where a hostage situation takes place to find the situation is completely different than they first realized. \n\n\nS02E07 -Clean Hands -\nThe SRU has a tough case where they must protect a serial killer during his return to Canada. Sam has to make sure a victim's father sees that taking the law in his own hands won't help anyone.\n\n\n\nS02E08 -Aisle 13 -\nA teen goes too far in his anger over his friend moving away.\n\n\nS02E09 -The Perfect Family -\nA couple steals the baby they gave up for adoption. \n\n\nS02E10 -Remote Control -\nA man whose pregnant wife is taken hostage by a ruthless gang is persuaded by his brother to electronically rob a bank and transfer $500,000 into the thugs' account. If the money isn't wired, the gang will kill the wife on camera. \n\n\nS02E11 -Perfect Storm -\nA student (Calum Worthy) brings a gun to school to carry out revenge against some bullies who pushed him too far. Parker leads the SRU's efforts to calm the boy and defuse the volatile situation with some unexpected help. \n\n\nS02E12 -Last Dance -\nWhen a woman (Kathleen Munroe) finds out that she has a brain disease she teams up with her fiancÃƒÂ© (Luke Kirby) and they begin leaving a trail of criminal activity behind them. The SRU team catches up with them at a ballroom where the two plan on killing themselves after sharing one last dance. \n\n\nS02E13 -Exit Wounds -\nWhen a standoff between a gang and a man (K.C. Collins) protecting his brother takes over a hospital the SRU team is sent in. \n\n\nS02E14 -One Wrong Move -\nThe SRU team must face a series of bomb threats all around the city as a team member puts his life on the line. \n\n\nS02E15 -Never Let You Down -\nThe SRU unit must rescue a young woman (Joanna Douglas) from a delusional man (Brian Markinson) who insists she is his missing daughter. \n\n\nS02E16 -Just a Man -\nA prison riot begins during a parole hearing where a man convicted for murder (Roger R. Cross) is once again humiliated by his victim's daughter (Sarena Parmar). The SRU is summoned to quell it. Ed finds out that the prisoner was someone from his past as a non-SRU police officer. \n\n\nS02E17 -Custody -\nA man (Alan Van Sprang) is arrested after he attempts to kill the lawyer of his wife (Kathleen Robertson). The man tells the SRU he's not the culprit in the kidnapping and hiding of his children. This leads the SRU to realize the wife was responsible for kidnapping them. \n\n\nS02E18 -Coming to You Live -\nA radio talkshow host is hunted down by the SRU when he takes a politician hostage at gunpoint.\n\n\nS02E19 -The Farm -\nPolice arrest a woman for robbing a rural convenience store. The SRU, however, has her released when she tells them she ran away from a small community known as The Farm after hearing plans of an attempt to commit murder on its residents. \n\n\nS02E20 -You Think You Know Someone -\nParker is lured into a trap and confronted with a deadly choice: reveal a dark secret from his past or lose his life. \n\n\nS02E21 -The Good Citizen -\nA vigilante, out for blood, goes too far when he takes the law into his own hands. \n\n\nS02E22 -Behind the Blue Line -\nA shooter inside a historic arena leaves Sam questioning his place on the team.","torrent":{"xt":"urn:btih:c0681e23418b1918af90c2c359405a9e14a0b7db","amp;dn":"Flashpoint+-+Complete+Season+2+%5BHDTV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0681e23418b1918af90c2c359405a9e14a0b7db","infoHashBuffer":{"type":"Buffer","data":[192,104,30,35,65,139,25,24,175,144,194,195,89,64,90,158,20,160,183,219]},"announce":[],"urlList":[]}}