{"title":"Beyond Oil and Gas - The Methanol Economy 2nd ed","uid":15981605,"size":4846948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0fe501f97d17d42dcb7fe30ac8992bc6f330059&amp;dn=Beyond+Oil+and+Gas+-+The+Methanol+Economy+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"clouderone","files":1,"time":1475903851,"description":"Beyond Oil and Gas - The Methanol Economy 2nd ed - George A. Olah et al. (Wiley-VCH, 2009).pdf\r\n\r\nThe world is currently consuming about 85 million barrels of oil a day, and about two–thirds as much natural gas equivalent, both derived from non–renewable natural sources. In the foreseeable future, our energy needs will come from any available alternate source. Methanol is one such viable alternative, and also offers a convenient solution for efficient energy storage on a large scale.\r\n\r\nIn this updated and enlarged edition, renowned chemists discuss in a clear and readily accessible manner the pros and cons of humankind′s current main energy sources, while providing new ways to overcome obstacles.\r\n\r\nFollowing an introduction, the authors look at the interrelationship of fuels and energy, and at the extent of our non–renewable fossil fuels. They also discuss the hydrogen economy and its significant shortcomings. The main focus is on the conversion of CO2 from industrial as well as natural sources into liquid methanol and related DME, a diesel fuel substitute that can replace LNG and LPG. The book is rounded off with an optimistic look at future possibilities. \r\n\r\nA forward–looking and inspiring work that vividly illustrates potential solutions to our energy and environmental problems","torrent":{"xt":"urn:btih:c0fe501f97d17d42dcb7fe30ac8992bc6f330059","amp;dn":"Beyond+Oil+and+Gas+-+The+Methanol+Economy+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0fe501f97d17d42dcb7fe30ac8992bc6f330059","infoHashBuffer":{"type":"Buffer","data":[192,254,80,31,151,209,125,66,220,183,254,48,172,137,146,188,111,51,0,89]},"announce":[],"urlList":[]}}