{"title":"GAME OF THRONES Season 3 Episode 1 (Xvid_v2)","uid":8331640,"size":661770082,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c14ca47838fb1e4e2d42dc209892cdb8b8d52f57&amp;dn=GAME+OF+THRONES+Season+3+Episode+1+%28Xvid_v2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"jksADIDAS","files":1,"time":1364902410,"description":"GAME OF THRONES Season3 Episode 1 -Title: Valar Dohaeris Directed by: Daniel Minahan Written by: David Benioff &amp; D. B. Weiss Original air date: March 31, 2013 U.S viewer (millions): 4.40\n.\nThe third season of the epic fantasy drama television series Game of Thrones premiered in the United States and Canada on March 31, 2013 on HBO. HBO renewed the series for a third season on April 10, 2012, nine days after the second season's premiere. Production began in July 2012.\n.\nLike the other seasons, the third season will consist of ten episodes. It is based roughly on the first half of A Storm of Swords, the third of the A Song of Ice and Fire novels by George R. R. Martin, of which the series is an adaptation.\n.\nSome Night's Watch men, Samwell Tarly and Lord Commander Mormont among them, survive the White Walkers' attack and pledge to return to the Wall to warn the Seven Kingdoms. Jon Snow is brought before Mance Rayder, the &quot;King beyond the Wall&quot;, and pledges his loyalty to the Wildlings. A disgraced Tyrion Lannister unsuccessfully solicits recognition by his father Tywin, the new Hand of the King. Margaery Tyrell engages in charity work with the orphans of King's Landing. Ser Davos Seaworth is rescued by Salladhor Saan after the Battle of the Blackwater and returned to Dragonstone. There, he unsuccessfully tries to kill Melisandre so as to break her hold on Stannis Baratheon, and is imprisoned. Across the Narrow Sea, Daenerys Targaryen arrives in the city of Astapor to buy an army of brutally-trained slave soldiers, the &quot;Unsullied&quot;. She is saved from an assassination attempt by the warlocks of Qarth by Ser Barristan Selmy, the former Kingsguard commander, who pledges his loyalty.\n.\nIMDb: http://www.imdb.com/title/tt0944947/\nWiki: http://en.wikipedia.org/wiki/Game_of_Thrones\nOfficial: http://www.hbo.com/game-of-thrones/index.html","torrent":{"xt":"urn:btih:c14ca47838fb1e4e2d42dc209892cdb8b8d52f57","amp;dn":"GAME+OF+THRONES+Season+3+Episode+1+%28Xvid_v2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c14ca47838fb1e4e2d42dc209892cdb8b8d52f57","infoHashBuffer":{"type":"Buffer","data":[193,76,164,120,56,251,30,78,45,66,220,32,152,146,205,184,184,213,47,87]},"announce":[],"urlList":[]}}