{"title":"Anos incriveis Dublado Completo Portugues (Wonder Years)","uid":4738682,"size":9330371915,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c182220cfcf0f0a38e55d364c30faa97341d5b80&amp;dn=Anos+incriveis+Dublado+Completo+Portugues+%28Wonder+Years%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":5,"uploader":"cleber152005","files":116,"time":1235430992,"description":"Anos incrÃƒÂ­veis (em inglÃƒÂªs: The Wonder Years) foi uma sÃƒÂ©rie americana de televisÃƒÂ£o criada por Carol Black e Neal Marlens. Durou seis temporadas na rede americana ABC, de 1988 a 1993. No Brasil, o programa jÃƒÂ¡ foi exibido pela TV Cultura, TV Bandeirantes, Multishow e Rede 21, atÃƒÂ© voltar ÃƒÂ  TV Cultura.\n\nAnos incrÃƒÂ­veis apresentou as questÃƒÂµes sociais e os eventos histÃƒÂ³ricos do final dos anos 60 e inÃƒÂ­cio dos anos 70 atravÃƒÂ©s dos olhos do protagonista Kevin Arnold, que tambÃƒÂ©m vive os assuntos da adolescÃƒÂªncia (principalmente com seu grande amigo Paul e sua paquera, Winnie Cooper), problemas familiares e outros. Enquanto se passam as histÃƒÂ³rias, os acontecimentos sÃƒÂ£o narrados por um Kevin mais velho e experiente, que descreve o que acontece e conta o que aprendeu de suas experiÃƒÂªncias. Esta tÃƒÂ©cnica serviu de inspiraÃƒÂ§ÃƒÂ£o a outras sÃƒÂ©ries.\n\nA mÃƒÂºsica de abertura ÃƒÂ© uma versÃƒÂ£o de Joe Cocker da mÃƒÂºsica dos Beatles With a Little Help from My Friends.\n\n\nPersonagens principais\n\n    * Kevin Arnold (Fred Savage) - Um estudante americano tÃƒÂ­pico freqÃƒÂ¼entando a escola secundÃƒÂ¡ria no final dos anos 60 e inÃƒÂ­cio dos anos 70.\n\n    * Gwendolyn &quot;Winnie&quot; Cooper (Danica McKellar) - Interesse amoroso principal de Kevin. Vive no mesmo quarteirÃƒÂ£o que ele. O primeiro beijo de ambos e a morte de seu (dela) irmÃƒÂ£o mais velho no VietnÃƒÂ£ tÃƒÂªm importante papel no episÃƒÂ³dio-piloto. Em um dos episÃƒÂ³dios seus pais decidem se divorciar, como resultado da tristeza pela morte do filho.\n\n    * Paul Pfeiffer (Josh Saviano) - Melhor amigo de Kevin. Extremamente inteligente e excelente estudante. Ele ÃƒÂ© alÃƒÂ©rgico a quase tudo.\n\n    * Jack Arnold (Dan Lauria) - O pai de Kevin, veterano da Guerra da CorÃƒÂ©ia. Inicialmente, trabalhava na Norcom, uma empresa grande, mas em uma posiÃƒÂ§ÃƒÂ£o mediana de gerÃƒÂªncia que ele detestava. Mais tarde, comeÃƒÂ§a seu prÃƒÂ³prio negÃƒÂ³cio construindo e vendendo mobÃƒÂ­lia feita a mÃƒÂ£o.\n\n    * Norma Gustavson Arnold (Alley Mills) - MÃƒÂ£e de Kevin e dona-de-casa. Conheceu Jack quando era caloura na faculdade. Quando ele terminou o curso, ela se mudou com ele e nÃƒÂ£o terminou o curso.\n\n    * Karen Arnold (Olivia d'Abo) - IrmÃƒÂ£ hippie mais velha de Kevin. Ela se casa e se muda para o Alasca. Faz uma participaÃƒÂ§ÃƒÂ£o especial no ÃƒÂºltimo episÃƒÂ³dio.\n\n    * Wayne Arnold (Jason Hervey) - IrmÃƒÂ£o mais velho de Kevin, diverte-se atormentando fÃƒÂ­sica e psicologicamente Kevin e Paul.\n","torrent":{"xt":"urn:btih:c182220cfcf0f0a38e55d364c30faa97341d5b80","amp;dn":"Anos+incriveis+Dublado+Completo+Portugues+%28Wonder+Years%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c182220cfcf0f0a38e55d364c30faa97341d5b80","infoHashBuffer":{"type":"Buffer","data":[193,130,34,12,252,240,240,163,142,85,211,100,195,15,170,151,52,29,91,128]},"announce":[],"urlList":[]}}