{"title":"A-Serious-Man{2009.DVDrip}vice","uid":5274261,"size":714152746,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c19bc6c00f809565f724bcd98d5ae2fe95702541&amp;dn=A-Serious-Man%7B2009.DVDrip%7Dvice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"vicerock","files":-1,"time":1263324740,"description":"A SERIOUS MAN 2009 LIMITED DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 780x480[wide screen]\nrun-time 01:45:22\nvideo bitrate 768\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nMichael Stuhlbarg\nRichard Kind\nSari Wagner Lennick\nFred Melamed\nAaron Wolff\n\nPlot\n\nThe film opens with a frame story set in a 19th-century Eastern European shtetl. In the scene, filmed entirely in Yiddish, an unnamed man (Allen Lewis Rickman) comes home during a snowstorm and tells his wife (Yelena Shmulenson) that he had been helped along his way by an acquaintance of hers, Reb Groshkover (Fyvush Finkel), whom he has invited in for soup. However, the wife insists that the Reb is dead, and that this visitor must be a dybbuk, an undead being of Jewish folklore. The guest laughs off this suggestion, but eventually she stabs him, and he goes back out to the snow, leaving the mystery unresolved.\n\nThe remainder of the story takes place in the Twin Cities in 1967, where Jewish professor of physics and family man, Larry Gopnik (Michael Stuhlbarg) lives with his troubled family. His son Danny (Aaron Wolff) habitually smokes marijuana. Larry's wife Judith (Sari Lennick) wants a divorce so she can be with family friend and widower, Sy Ableman (Fred Melamed). Daughter Sarah (Jessica McManus) appears to be stealing money from her father to get a nose job, and his brother Arthur (Richard Kind) has been crashing on their couch for several months writing a dense numerological treatise. At Judith and Sy's insistence, Larry and Arthur move to a nearby motel, after which Judith empties their joint financial accounts, leaving Larry penniless. One of Larry's students, Clive, claims his exams are unfair; after he leaves, Larry finds an envelope stuffed with thousands of dollars, and is furious that Clive would try to bribe him. Larry is up for tenure, but the committee has received anonymous defamatory letters about him.\n\nJudith insists that Larry seek advice from three rabbis to cope with his troubles. The first, a very young rabbi, fumbles through platitudes about maintaining fresh perspectives in order to see God. The second, his regular rabbi, recounts a tale of a Jewish dentist who turned to him for advice after discovering the Hebrew phrase &quot;Help Me&quot; engraved on the back of an unaware gentile patient's teeth. When the rabbi finishes his story, Larry asks if the dentist ever found out why the writing was there, and asks what became of the patient. The rabbi responds, &quot;Who cares?&quot; The third, Rabbi Marshak is an elderly senior rabbi and a highly respected figure who no longer does pastoral work. He limits his appearances to congratulating individuals completing their bar mitzvahs. Unable to gain an audience with the rabbi after numerous attempts, Larry is finally turned away by his secretary.\n &lt;a href=&quot;\nhttp://amazon.imdb.com/title/tt1019452/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amazon.imdb.com/title/tt1019452/&lt;/a&gt;\n\n\nPLEASE SEED AND ENJOY THANKS\n\nscreens\n &lt;a href=&quot;\nhttp://img682.imageshack.us/img682/729/vlcsnap2010011217h10m42.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img682.imageshack.us/img682/729/vlcsnap2010011217h10m42.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img251.imageshack.us/img251/6104/vlcsnap2010011217h10m47.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img251.imageshack.us/img251/6104/vlcsnap2010011217h10m47.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img682.imageshack.us/img682/2418/vlcsnap2010011217h10m52.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img682.imageshack.us/img682/2418/vlcsnap2010011217h10m52.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img705.imageshack.us/img705/6/vlcsnap2010011217h11m13.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img705.imageshack.us/img705/6/vlcsnap2010011217h11m13.png&lt;/a&gt;","torrent":{"xt":"urn:btih:c19bc6c00f809565f724bcd98d5ae2fe95702541","amp;dn":"A-Serious-Man%7B2009.DVDrip%7Dvice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c19bc6c00f809565f724bcd98d5ae2fe95702541","infoHashBuffer":{"type":"Buffer","data":[193,155,198,192,15,128,149,101,247,36,188,217,141,90,226,254,149,112,37,65]},"announce":[],"urlList":[]}}