{"title":"Shovel.Knight-TiNYiSO","uid":10511867,"size":272674925,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c2a0608d84dd109be44ce37d7d7c358d10adb74b&amp;dn=Shovel.Knight-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"Mr.Stifmeister","files":3,"time":1404854831,"description":"\n                         -=- Proudly Presents -=-\n\n                     Shovel Knight (c) Yacht Club Games\t\n\n\nRelease On   : 8 july 2014              Disk Amount/Format : 1 DVD ISO\nType of Game : Action                   Media Protection   : Steam\n\n\nShovel Knight is a sweeping classic action adventure game with awesome\ngameplay, memorable characters, and an 8-bit retro aesthetic. Its a hot\nmashup of new and old! You play as the eponymous Shovel Knight, a small\nknight with a huge quest. Shovel Knight has come to this land with two\ngoals: to defeat the evil Enchantress and quest for his lost beloved. He\nwields a Shovel Blade: a multipurpose weapon whose techniques have now\nbeen lost to the ages. Always honest and helpful, Shovel Knight is a\nshining example of the code of Shovelry: Slash Mercilessly and Dig\nTirelessly!\n\nBut, between Shovel Knight and his beloved stands a cadre of villainous\nknights. These terrible foes, known as The Order of No Quarter, have\nbeen dispatched to prevent Shovel Knight from reaching the Enchantress,\nand will pursue their mission at any cost. If you love games with\nperfect platforming, beautiful art, infectious music, crazy bosses,\nhumor and levity, and real heart  Shovel Knight is for you!\n\nFeatures:\n\nShovel Knight s beautifully authentic style bridges the gap between\nyesterday and today. Design, art, and audio hearken back to the days\nof 8-bit.\n\nThe systems of today also give Shovel Knight modern touches: detailed\nanimation, multilayered parallax backgrounds, and evolved game design.\n\nPerfect your platforming skills as you take down each of the knights\nof the Order of No Quarter.\n\nFlip enemies! Leap over gaps! Duel with foes! Dig up treasure! Find\nSecrets! Upgrade! Shovel Knight is simple to learn and play, but\nchallenge lies everywhere.\n\nAwesome soundtrack by Jake &quot;Virt&quot; Kaufman with additional songs by\nManami Matsumae!\n\nMaster an array of magical Relic subweapons.\n\nAmass riches to upgrade your armor and weapons.\n\nDetailed, living background and animation! Big, beautiful pixels!\n\nCrazy bosses and lovable characters.\n\nBalanced gameplay is a warm welcome to newcomers, and an old embrace\nfor experts.\n\nA light touch to narrative with humor, levity, and heart.\n\nOverworld Map allows your quest unfold in a unique order!\n\n\nBurn/mount, install, copy crack, play!\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n\n                                                                  (C) E/dfs\n                         &quot; SIZE DOES NOT MATTER! &quot;\n","torrent":{"xt":"urn:btih:c2a0608d84dd109be44ce37d7d7c358d10adb74b","amp;dn":"Shovel.Knight-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a0608d84dd109be44ce37d7d7c358d10adb74b","infoHashBuffer":{"type":"Buffer","data":[194,160,96,141,132,221,16,155,228,76,227,125,125,124,53,141,16,173,183,75]},"announce":[],"urlList":[]}}