{"title":"Chopin Complete Edition [Deutsche Grammophon]","uid":10474455,"size":3952075775,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c2a09d135f2076bf1ab04e80306dc1ea1634e9af&amp;dn=Chopin+Complete+Edition+%5BDeutsche+Grammophon%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":2,"uploader":"magneez","files":268,"time":1404313039,"description":"To have in one box such wonders as Zimerman's Ballades, Pollini's Etudes, Pires's Nocturnes, Ashkenazy's Mazurkas and Waltzes, and the Cello Sonata incandescently performed by Rostropovich and Argerich is a treat indeed and could scarcely be bettered. DG has a back catalogue like Aladdin's Cave, and they have made the most of it. Pollini is represented strongly with magisterial accounts of the Sonatas and Polonaises, his Scherzos as diamond-tipped as his Etudes . . . There are some fresh and exciting choices to revisit. Claudio Arrau is a wise and gutsy soloist in the rare pieces for piano and orchestra . . . The Concertos are Zimerman's second recording . . . is gorgeously romantic, with every string slide cherished and each note turned like wrought gold . . . full marks to DG for choosing an interpretation that nails its colours to such a strong mast, rather than one-size-fits-all blandness . . . Lilya Zilberstein does her very musical best with the early Sonata No. 1, among other works, and there's some fleet-fingered beauty from Anatol Ugorsky . . . in the &quot;Trois Nouvelle Etudes and Ecossaises. The songs are sung with freshness and ardour by the lively-voiced soprano Elzbieta Szmytka . . . Of younger contributors, Rafal Blechacz plays the Preludes mellifluously, with classic poise, a lovely tone quality and some personal, imaginative touches; Yundi Li is delicate and pleasant in the Impromptus . . . The pieces are sensibly arranged through the CDs, the repertoire and performers made clear at most turns, and the booklet is equipped with a substantial and superb contribution by Chopin expert Jeremy Siepmann. This is a set to treasure: when you can have all of these delights in one go, why would you want anything else?\nRecord Review / Jessica Duchen, BBC Music Magazine (London) / 01. February 2010\n\n","torrent":{"xt":"urn:btih:c2a09d135f2076bf1ab04e80306dc1ea1634e9af","amp;dn":"Chopin+Complete+Edition+%5BDeutsche+Grammophon%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a09d135f2076bf1ab04e80306dc1ea1634e9af","infoHashBuffer":{"type":"Buffer","data":[194,160,157,19,95,32,118,191,26,176,78,128,48,109,193,234,22,52,233,175]},"announce":[],"urlList":[]}}