{"title":"Sword.of.the.Stars.The.Pit.Gold.Edition-TiNYiSO","uid":9164379,"size":1125490617,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c2d3296d3a2734d19ddaaccf7489f0bae7013c47&amp;dn=Sword.of.the.Stars.The.Pit.Gold.Edition-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"Mr.Stifmeister","files":2,"time":1383941079,"description":"\n                         -=- Proudly Presents -=-\n\n     Sword of the Stars The Pit Gold Edition (c) Kerberos Productions\t\t\t\n\n\nRelease On   : 13 October 2013           Disk Amount/Format : 1 DVD ISO\nType of Game : RPG/Strategy              Media Protection   : Nothing\n\n\nSince its first demo was released in the Fall of 2012, The Pit has become\nan indie hit with its blend of Roguelike action and sci-fi depth! Players\nwere challenged to survive 30 floors of The Pit using one of three\ncharacters   the Marine, the Engineer, and the Scout   then in The Pit:\nMindGames players were given two new characters   the Psion and the alien\nTarka Ranger   and ten more floors to survive through, as well as a\nwealth of new items, recipes, weapons, and nasty creatures to fight!\n\nTo celebrate the success of the series, we re releasing this Gold edition,\nwhich not only gives you the game, the expansion, and all the free content\nwe added along the way, but we re adding three new playable characters\nThe Hiver Warrior, the Liir Seeker, and the Morrigi Striker! Now you can\ntest yourself against The Pit using all the major races from the Sword of\nthe Stars universe!\n\nThe Story:\nA deadly plague ravages your world. Your last hope: a legendary alien\nfacility dug deep into the Feldspar Mountains...a massive Pit, built by\nthe ancient Suulka. If The Pit really exists, there might be something\nleft. Something that will give your doctors a fighting chance at the\ncure. All you know for sure is that every expedition into those mountains\nhas failed to return...\n\nAnd Nothing Sows Death Like the Suulka.\n\nFeatures:\n\n8 Characters from 5 different Sword of the Stars races to play as...\nMarine, Scout, Engineer, Psion, Ranger, Warrior, Seeker, and Striker!\n\n40 Levels of ancient evil science between you and the cure, not to\nmention unique side areas, known as biomes!\n\nImprove your character and increase your skills as you try and find a\nway to survive the depths.\n\nOver 160 enemies drawn from the Sword of the Stars universe!\n\nOver 110 weapons and over 45 armors with a variety of special effects\nincluding flamethrowers, rocket launchers, plasma cannons and powered\nBrawler armor!\n\nOver 250 items, devices, and ingredients to find, ranging from the\nfamiliar to ancient exotic tech. Use stuff  found around each level or\non your enemies to craft together more than 100 new items!\n\nRandomized augmentation effects (for your equipment... and for you!)\nmake each game unique.\n\nDevelop 28 unique Psionic powers to better hold off opponents.\n\n5 levels of difficulty, from Easy to Seriously? and three special\nmodes; Infinite, where there is no end, Quick, which reduces the number\nof rooms per floor, and Fast, which skips every second floor!\n\nDozens of room types containing a host of exotic devices to help - or\nmaybe hinder - your progress.\n\nDiscover and decipher hundreds of hidden messages, crafting recipes,\nand pieces of Sword of the Stars lore!\n\nMany fiendish ways to die including poisoning, disease, traps,\ndisintegration, radiation, dehydration, starvation and of course...\nMONSTERS.\n\nPlus 1 hidden character, which you can unlock to help you out when\nthings get tough!\n\n\nBurn/mount, install, play!\n\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n\n                                                                  (C) E/dfs\n                         &quot; SIZE DOES NOT MATTER! &quot;\n","torrent":{"xt":"urn:btih:c2d3296d3a2734d19ddaaccf7489f0bae7013c47","amp;dn":"Sword.of.the.Stars.The.Pit.Gold.Edition-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2d3296d3a2734d19ddaaccf7489f0bae7013c47","infoHashBuffer":{"type":"Buffer","data":[194,211,41,109,58,39,52,209,157,218,172,207,116,137,240,186,231,1,60,71]},"announce":[],"urlList":[]}}