{"title":"GirlsWay: Samantha Rone, Hillary Scott (Transmission) 09.26.16","uid":15897387,"size":578783809,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:c31fe1df0fc5b559b725673e6936ad9b227a2bcd&amp;dn=GirlsWay%3A+Samantha+Rone%2C+Hillary+Scott+%28Transmission%29+09.26.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":23,"uploader":"EndYou","files":1,"time":1474973944,"description":"... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57ea34ac71b7a.html  \nhttp://imgpremium.com/img-57ea34acefe2c.html \r\n\r\nHillary Scott has always been kind of a crackpot, but her girlfriend Samantha Rone doesn't mind, as long as she's home for supper on time, and does whatever makes her happy. Hillary has been looking deep into the heavens trying to spearhead communication between alien planets for as long as they can both remember, but Samantha's attitude about their practical life still happens to come first, proven by her brushing off of her crazy lesbian girlfriend's illustrious work. Hillary is always watching the stars, and waiting for the right moment, and the right information to be transmitted throughout the galaxies. Tonight just so happens to be that night. Upon returning home to her girlfriend, Hillary checks the recording on her computer, and notices something a little different. Samantha gives her the wise idea that it must be similar to encrypted binary code made into an audio message! Luckily Hillary's lesbian genius helps her convert the audio into an image that proves alien lifeforms are communicating with earth; with her, and Samantha ... specifically. Upon understanding the gravity of this discovery, Samantha suggests they tell the press, but Hillary is set on thanking Samantha with a long needed release. She takes off Samantha's clothes, and licks her supple nipples, eventually feeding her girlfriend's her tight wet pussy. They take what might be their very last chance to share and express their love, by making each other's hungry lesbian pussies cum, squirting their love juices over each other in lesbian bliss. But how will their discovery change the world we know? Are they watching us?\r\n\r\nMPEG4 Video (H264) 960x544","torrent":{"xt":"urn:btih:c31fe1df0fc5b559b725673e6936ad9b227a2bcd","amp;dn":"GirlsWay%3A+Samantha+Rone%2C+Hillary+Scott+%28Transmission%29+09.26.16","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c31fe1df0fc5b559b725673e6936ad9b227a2bcd","infoHashBuffer":{"type":"Buffer","data":[195,31,225,223,15,197,181,89,183,37,103,62,105,54,173,155,34,122,43,205]},"announce":[],"urlList":[]}}