{"title":"The Grouch and Eligh - The Tortoise and The Crow (2014) 3in1 Mp3","uid":9685000,"size":369578736,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c3203c72b920fbeb0e67334a32c7e1ecd17d8ef7&amp;dn=The+Grouch+and+Eligh+-+The+Tortoise+and+The+Crow+%282014%29+3in1+Mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"jhoffa82","files":41,"time":1393747663,"description":"At the pinnacle of the independent hip-hop movement, Oakland's The Grouch and Los Angeles' Eligh formed the duo G&amp;E. Hailing from the Living Legends collective, the pair first forged a brotherhood that led to music. The first day I met this guy, he wanted to get in the studio and create; I had some equipment. We ended up back in my basement sampling vinyl and recording songs. I don t do that with just anybody, recalls The Grouch, who has worked with legions of artists as an MC and producer. Fast forward many years later, The Grouch &amp; Eligh have cemented themselves as salient artists who have maintained legions of loyal fans across the globe while consistently releasing music that stays true to their roots, yet remains relevant in today s ever-evolving landscape.\n\nFebruary 18, 2014 marks the triumphant return of this classic duo with their TRIPLE-DISC album, entitled, The Tortoise and The Crow . The album consists of one BRAND NEW solo ablum from The Grouch, one BRAND NEW solo album from Eligh, and one BRAND NEW collaborative G&amp;E album, which is a format that has never been done before by a rap duo. The album features heavyweight features from Slightly Stoopid, Pretty Lights, Ant of Atmosphere, Zion I, Kreayshawn, Blu &amp; Exile, and more.\n\nSeed and enjoy :D ","torrent":{"xt":"urn:btih:c3203c72b920fbeb0e67334a32c7e1ecd17d8ef7","amp;dn":"The+Grouch+and+Eligh+-+The+Tortoise+and+The+Crow+%282014%29+3in1+Mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3203c72b920fbeb0e67334a32c7e1ecd17d8ef7","infoHashBuffer":{"type":"Buffer","data":[195,32,60,114,185,32,251,235,14,103,51,74,50,199,225,236,209,125,142,247]},"announce":[],"urlList":[]}}