{"title":"The Book of Negroes by Lawrence Hill (Epub/Mobi)","uid":9498572,"size":3499513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3268310671064488806673a84521f2910344e43&amp;dn=The+Book+of+Negroes+by+Lawrence+Hill+%28Epub%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"7","files":-1,"time":1390165143,"description":"Overview:\n\nReaders will follow the story of Aminata, an unforgettable heroine who cut a swath through an 18th-century world hostile to her colour and her sex. Abducted as an eleven-year-old child from her village in West Africa and put to work on an indigo plantation on the sea islands of South Carolina, Aminata survives by using midwifery skills learned at her mother? s side, and by drawing on a strength of character inherited from both parents. Eventually, she has the chance to register her name in the ? Book of Negroes,? a historic British military ledger allowing 3,000 Black Loyalists passage on ships sailing from Manhattan to Nova Scotia.\n\nThis remarkable novel transports the reader from an African village to a plantation in the southern United States, from a soured refuge in Nova Scotia to the coast of Sierra Leone, in a back-to-Africa odyssey of 1,200 former slaves. Bringing vividly to life one of the strongest female characters in recent fiction, Lawrence Hill? s remarkable novel has become a Canadian classic.\n\nGenre: Historical fiction\n","torrent":{"xt":"urn:btih:c3268310671064488806673a84521f2910344e43","amp;dn":"The+Book+of+Negroes+by+Lawrence+Hill+%28Epub%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3268310671064488806673a84521f2910344e43","infoHashBuffer":{"type":"Buffer","data":[195,38,131,16,103,16,100,72,136,6,103,58,132,82,31,41,16,52,78,67]},"announce":[],"urlList":[]}}