{"title":"Virtual Families 2 - Our Dream House - full PreCracked - Foxy Ga","uid":8385533,"size":91972380,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c37211979ddba44117accc65fc4546e4942e4238&amp;dn=Virtual+Families+2+-+Our+Dream+House+-+full+PreCracked+-+Foxy+Ga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"redfoxygames","files":-1,"time":1366283848,"description":"There is a hidden world in your computer. Adopt a little person from the thousands of choices of little people who live inside your computer. Help them choose a mate, and start a family! Encourage them to work in their chosen career to earn money for necessities and luxuries. Expand and renovate the house. Make it your Dream House and shop for tons of items: make a nursery, a music room or even a game room! Help your little person get through the challenges of life and shape their personalities with all sorts of upgrades, from boarding school to career counseling and many more! Along the way, there will be many different random events to respond to, all of them adding unexpected elements to the daily routine of life.\n\n\nA Game About Life - In All of its Drama and Glory\nJust Added:\nPETS! Pets for your virtual pets! Adopt a little flurry companion for your virtual people!\nNew Features:\nNEW! Expand and renovate the house.\nNEW! Customize each room and build your dream house.\nNEW! Shop from tons of items in the store .\nNEW! Upgrades for your little people: psychotherapy, career counseling, hire a maid and many more!\nNew graphics! New little people!\nNew Random Events.\nNew Collectibles.\nNew Trophies.\nNew Beautiful, full high-fidelity SoundTrack.\nAll your favorite features from VF1:\nReal-time game play, like all LDW games.\nUnique and fascinating adoptees from thousands of combinations\nFully trainable people: shape and adapt their personalities through praising and scolding!\nDynamic illness system. Play Doctor!\nWeather, as well as day/night cycles that are synchronized to the player's system clock, so it is nighttime in the game when it is nighttime where you are!\nUses the technology behind Virtual Villagers for an accessible and stable player experience","torrent":{"xt":"urn:btih:c37211979ddba44117accc65fc4546e4942e4238","amp;dn":"Virtual+Families+2+-+Our+Dream+House+-+full+PreCracked+-+Foxy+Ga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c37211979ddba44117accc65fc4546e4942e4238","infoHashBuffer":{"type":"Buffer","data":[195,114,17,151,157,219,164,65,23,172,204,101,252,69,70,228,148,46,66,56]},"announce":[],"urlList":[]}}