{"title":"Escaping the Delta: Robert Johnson and the Invention o/t Blues","uid":15861636,"size":538956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c38638326d820ff89744a16135ca5908ad993b78&amp;dn=Escaping+the+Delta%3A+Robert+Johnson+and+the+Invention+o%2Ft+Blues&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"marty14","files":1,"time":1474305703,"description":"Escaping the Delta: Robert Johnson and the Invention of the Blues - Elijah Wald [epub]\r\n\r\nIn this combination history of blues music and biography of Robert Johnson, Wald, a blues musician himself (and author of Narcorrido), explores Johnson's rise from a little known guitarist who died in 1938 to one of the most influential artists in rock and roll. From the blues' meager beginning in the early 1900s to its '30s heyday and its 1960s revival, Wald gives a revisionist history of the music, which he feels, in many instances, has been mislabeled and misjudged. Though his writing sometimes reads like a textbook, and he occasionally gets bogged down in arcane musical references, Wald's academic precision aids him in his quest to re-analyze America's perception of the blues as well as in trying to decipher the music's murky true origins and history.\r\n\r\nUsing a lengthy comparison of how white Americans and black Americans define the blues, Wald demonstrates how Johnson fit into the gray area between the two. Wald combines a short bio of Johnson with detailed analysis of his songs and the mysterious tales that are associated with him, giving a thorough account of Johnson's life, music and legend. The chapter on how white guitarists like Eric Clapton and Keith Richards interpreted who Johnson was and what he played really shows why he is not one of the many forgotten early 20th-century bluesmen. Wald's theories will no doubt cause passionate discussions among true blues aficionados, but the technical and obscure nature of much of his writing will make the book more of a useful reference resource","torrent":{"xt":"urn:btih:c38638326d820ff89744a16135ca5908ad993b78","amp;dn":"Escaping+the+Delta%3A+Robert+Johnson+and+the+Invention+o%2Ft+Blues","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c38638326d820ff89744a16135ca5908ad993b78","infoHashBuffer":{"type":"Buffer","data":[195,134,56,50,109,130,15,248,151,68,161,97,53,202,89,8,173,153,59,120]},"announce":[],"urlList":[]}}