{"title":"Make It Stick: The Science of Successful Learning","uid":10667317,"size":213272436,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c3af52563a376bf4728a9cb11e173e49716b449d&amp;dn=Make+It+Stick%3A+The+Science+of+Successful+Learning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"postgrad","files":1,"time":1406824120,"description":"To most of us, learning something &quot;the hard way&quot; implies wasted time and effort. Good teaching, we believe, should be creatively tailored to the different learning styles of students and should use strategies that make learning easier. Make It Stick turns fashionable ideas like these on their head. Drawing on recent discoveries in cognitive psychology and other disciplines, the authors offer concrete techniques for becoming more productive learners.\n\nMemory plays a central role in our ability to carry out complex cognitive tasks, such as applying knowledge to problems never before encountered and drawing inferences from facts already known. New insights into how memory is encoded, consolidated, and later retrieved have led to a better understanding of how we learn. Grappling with the impediments that make learning challenging leads both to more complex mastery and better retention of what was learned.\n\nMany common study habits and practice routines turn out to be counterproductive. Underlining and highlighting, rereading, cramming, and single-minded repetition of new skills create the illusion of mastery, but gains fade quickly. More complex and durable learning come from self-testing, introducing certain difficulties in practice, waiting to re-study new material until a little forgetting has set in, and interleaving the practice of one skill or topic with another. Speaking most urgently to students, teachers, trainers, and athletes, Make It Stick will appeal to all those interested in the challenge of lifelong learning and self-improvement.","torrent":{"xt":"urn:btih:c3af52563a376bf4728a9cb11e173e49716b449d","amp;dn":"Make+It+Stick%3A+The+Science+of+Successful+Learning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3af52563a376bf4728a9cb11e173e49716b449d","infoHashBuffer":{"type":"Buffer","data":[195,175,82,86,58,55,107,244,114,138,156,177,30,23,62,73,113,107,68,157]},"announce":[],"urlList":[]}}