{"title":"Aperiodic Crystals - Siegbert Schmid et al.","uid":15869061,"size":20209213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3ceb7a43032ce5e8116fda8c6c2a07242fcdae7&amp;dn=Aperiodic+Crystals+-+Siegbert+Schmid+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"clouderone","files":1,"time":1474409775,"description":"Aperiodic Crystals - Siegbert Schmid et al. (Springer, 2013).pdf\r\n\r\nAperiodic Crystals collects 37 selected papers from the scientific contributions presented at Aperiodic 2012 - the Seventh International Conference on Aperiodic Crystalsheld held in Cairns, Australia, 2-7 of September 2012.\r\n\r\nThe volume discusses state-of-the-art discoveries, new trends and applications of aperiodic crystals - including incommensurately modulated crystals, composite crystals, and quasicrystals - from a wide range of different perspectives. Starting with a general historical introduction to aperiodic crystals, the book proceeds to examine the complex mathematics of aperiodic long-range order, as well as the theoretical approaches aimed at understanding some of the unique properties and mechanisms underlying the existence of aperiodic crystals. The book then explores in detail such topics as complex metallic alloys, modulated structures, quasicrystals and their approximants, dynamics, disorder and defects in quasicrystals. It concludes with an analysis of quasicrystal surfaces and their properties.\r\n\r\nBy describing the latest research and the progress made on the structure determination of aperiodic crystals and the influence of this unique structure on their physical properties, this book represents a valuable resource to mathematicians, crystallographers, physicists, chemists, materials and surface scientists, and even architects and artists, interested in the fascinating nature of aperiodic crystals","torrent":{"xt":"urn:btih:c3ceb7a43032ce5e8116fda8c6c2a07242fcdae7","amp;dn":"Aperiodic+Crystals+-+Siegbert+Schmid+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3ceb7a43032ce5e8116fda8c6c2a07242fcdae7","infoHashBuffer":{"type":"Buffer","data":[195,206,183,164,48,50,206,94,129,22,253,168,198,194,160,114,66,252,218,231]},"announce":[],"urlList":[]}}