{"title":"Not So Different - Finding Human Nature in Animals (2016) Gooner","uid":15690452,"size":4917970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3e78f5c1cda80ffc39d3f76b57b8c480c47bd5a&amp;dn=Not+So+Different+-+Finding+Human+Nature+in+Animals+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1472397480,"description":"Not So Different - Finding Human Nature in Animals (2016) (Pdf) Gooner\r\n\r\nPublisher: Columbia University Press (3 Jun. 2016)\r\nLanguage: English\r\nISBN-10: 0231178328\r\nISBN-13: 978-0231178327\r\n\r\nAnimals fall in love, establish rules for fair play, exchange valued goods and services, hold &quot;funerals&quot; for fallen comrades, deploy sex as a weapon, and communicate with one another using rich vocabularies. Animals also get jealous and violent or greedy and callous and develop irrational phobias, just like us. Monkeys address inequality, wolves miss each other, elephants grieve for their dead, and prairie dogs name the humans they encounter. Human and animal behavior is not as different as once believed. \r\n\r\nIn Not So Different, the biologist Nathan H. Lents argues that the same evolutionary forces of cooperation and competition have shaped both humans and animals. Identical emotional and instinctual drives govern our actions. By acknowledging this shared programming, the human experience no longer seems unique, but in that loss we gain a fuller appreciation of such phenomena as sibling rivalry and the biological basis of grief, helping us lead more grounded, moral lives among animals, our closest kin. \r\n\r\nThrough a mix of colorful reporting and rigorous scientific research, Lents describes the exciting strides scientists have made in decoding animal behavior and bringing the evolutionary paths of humans and animals closer together. He marshals evidence from psychology, evolutionary biology, cognitive science, anthropology, and ethology to further advance this work and to drive home the truth that we are distinguished from animals only in degree, not in kind","torrent":{"xt":"urn:btih:c3e78f5c1cda80ffc39d3f76b57b8c480c47bd5a","amp;dn":"Not+So+Different+-+Finding+Human+Nature+in+Animals+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3e78f5c1cda80ffc39d3f76b57b8c480c47bd5a","infoHashBuffer":{"type":"Buffer","data":[195,231,143,92,28,218,128,255,195,157,63,118,181,123,140,72,12,71,189,90]},"announce":[],"urlList":[]}}