{"title":"The Sagara Family (Hentai)","uid":3355041,"size":1167880335,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c477c68837b938bc153287ce2d01cfe0ddcafed5&amp;dn=The+Sagara+Family+%28Hentai%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"Felgard","files":5,"time":1121122431,"description":"NAME\tThe Sagara Family\t\nSystem\tWindows 98, Me, 2000, XP\nPentium 200 mhz or faster recommended\t\nMemory\t64 MB or greater\t\nImages\tFull CD music, original Japanese voices\t\nLanguage\tEnglish\t\n\nFans of Japan's dating-sims, get ready to meet The Sagara Family.\n\nYou are Yusuke, a Japanese youth about to enter college in Tokyo. When your father suggested that you live with the family of a friend of his while you attend school, you didn't really have an opinion one way or the other. Until, that is, you found out that the Sagara Family is comprised of nothing but women: four beautiful daughters and their sexy widowed mother!\n\nOf course you don't mind the prospect of living in a house full of beautiful women -- you are a man, after all. The trouble is, they're not used to having men around, so they don't know how to act around one. This will no doubt cause any number of interesting situations to pop up as you get used to living with these beautiful women. \n\nThe Sagara Family is a multi-scenario love-sim game for Windows. You play the interactive game by moving through the story and making choices that affect the outcome, allowing for many different potential endings and excellent replay value. The game features the original Japanese voices along with an accurate English translation. This game is 100% uncensored.\n\nNote: by customer request, we are happy to announce that we'll be removing the VirtualMate online registration system on CD-ROM based G-Collections games, which will enable customers to play the games without an Internet connection at launchtime. We plan to make the patch available within a couple months. Currently the system still requires registration but this requirement will be removed once the patch is ready. \n\n(C)2005 G-Collections, by ZyX.\n\nImages and full description can be found here:\n\nhttp://www.peachprincess.com/Merchant2/merchant.mv?Screen=PROD&amp;Store_Code=PP&amp;Product_Code=GC026&amp;Category_Code=BG2","torrent":{"xt":"urn:btih:c477c68837b938bc153287ce2d01cfe0ddcafed5","amp;dn":"The+Sagara+Family+%28Hentai%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c477c68837b938bc153287ce2d01cfe0ddcafed5","infoHashBuffer":{"type":"Buffer","data":[196,119,198,136,55,185,56,188,21,50,135,206,45,1,207,224,221,202,254,213]},"announce":[],"urlList":[]}}