{"title":"Rainbeau Mars - BeFit Yoga 10 Minute Daily Yoga Fix DVDRip","uid":10521723,"size":1575549708,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c4f803303620e6c62a0ebaae70c41e74cc3cc6f1&amp;dn=Rainbeau+Mars+-+BeFit+Yoga+10+Minute+Daily+Yoga+Fix+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"acer47x","files":-1,"time":1404989776,"description":"Reshape and rejuvenate your body with the integrated power of yoga, breath and mindful movement, and experience unparalleled weight loss and wellness. In just 10 minutes a day, world-renowned yoga expert Rainbeau Mars leads a bodytransforming journey designed to strengthen, lengthen and beautify every body from beginner to advanced. Create the program that fits your lifestyle and goals, and reveal your most beautiful self.&quot;\n\nWORKOUT SEGMENT DEscriptIONS:\n01 - ra'yoKa AM Yoga (00:10:15): Ignite your internal light and fat-burning potential with this morning series of fluid and focused yoga poses.\n\n02 - ra'yoKa PM Yoga (00:10:08): Release the day's stress with martial arts-inspired yoga moves that reshape the butt, legs, abs and arms.\n\n03 - Tantalizing Tummy (00:09:27): Refine and define your core with intense, ab-focused yoga that target-tones a lean, sexy, fat-free midsection.\n\n04 - Bootylicious Buns &amp; Lean Legs (00:07:59): Turn heads with this fat-burning series of yoga movements that slim and shape the legs, hips, thighs and butt while improving balance.\n\n05 - Yoga Lean &amp; Relax (00:10:15): Renew your system with gentle, detoxifying poses to open your hips, massage your organs, and lengthen muscles.\n\n06 - Ashtanga Yoga (00:10:14): powerful, 10-minute, Yoga series that focuses on linking movement to breath to strengthen the core, lengthen and align the spine, and tone the arms, legs, butt, abs, shoulders, chest, and back through a flowing, modern-day sequence that honors a classical Yoga form. Increase flexibility and feel the power of Ashtanga Yoga with World-Renowned Yoga Expert, Author, and Actress, Rainbeau Mars as she focuses your breathing from one progressive pose to the next to allow you to generate internal heat to detoxify your muscles &amp; organs, improve circulation &amp; balance, and burn calories with this mind-calming segment.\n\n07 - Detox Workout (00:10:28): unique detoxifying Yoga exercise that is designed to release toxins, enhance circulation, and tone the arms, legs, abs, chest and butt through a series of effective stretching and toning poses.\n\n08 - Energy Flow (00:11:08): energy-boosting Yoga workout that is designed to burn major calories by jump-starting the heart rate, increase flexibility, and strengthen the core through a series of flowing, total body-toning poses.\n\n09 - Yoga for Beauty (00:10:21): beautifying Yoga workout that is designed to burn fat and tone the entire body while increasing strength, flexibility, grace, and balance. Sculpt tight abs, legs, buns, arms, and shoulders as you lift your chest and tone your back through this flowing combination of core-strengthening poses\n\n10 - Yoga for Arms (00:01:53): short but powerful upper body-sculpting routine that employs 3 key Yoga moves to tone the arms, chest, back, shoulders, and abs. Strengthen the core, burn fat, and tone the biceps, triceps, and forearms with World-Renowned Yoga Expert &amp; Author, Rainbeau Mars as she demonstrates 3 of her favorite arm-toning exercises in this 2 minute Power Yoga\n\n11 - Yoga for the Office &amp; Busy Moms- Power Yoga Minute (00:02:24): soothing, stress-relieving Yoga stretching series that can be done at home, the office, or even while watching your children at the park. This simple but effective set of exercises is designed open the chest, lengthen the neck, and alleviate tensions that can build in the wrists, hands, face, feet, back, and shoulders due to constant exposure to the stresses of work or parenting.\n\n12 - Yoga For Runners (00:03:14): short Yoga stretching sequence that is designed to use before or after a run to align your hips, release muscle tightness in the knees, quads, and hamstrings, lift the chest, and focus your breathing to increase stamina.\n\n13 - Advanced Crazy Show-Off Move (00:00:45): intense Yoga pose that is designed for the more advanced practitioner to challenge the core, increase balance, and strengthen the arms, shoulders, chest, and abs.\n\n\nVideo: 720x400 (1.80:1), 25 fps, XviD ~1997 kbps, 0.28 bit/pixel\nAudio: 48 kHz, MPEG Layer 3, 2 ch, ~128.00 kbps","torrent":{"xt":"urn:btih:c4f803303620e6c62a0ebaae70c41e74cc3cc6f1","amp;dn":"Rainbeau+Mars+-+BeFit+Yoga+10+Minute+Daily+Yoga+Fix+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4f803303620e6c62a0ebaae70c41e74cc3cc6f1","infoHashBuffer":{"type":"Buffer","data":[196,248,3,48,54,32,230,198,42,14,186,174,112,196,30,116,204,60,198,241]},"announce":[],"urlList":[]}}