{"title":"The Oxford Illustrated History of Medieval Europe - George Holme","uid":10614951,"size":13504249,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c516758f51da5ef61f814facc1131599f2762293&amp;dn=The+Oxford+Illustrated+History+of+Medieval+Europe+-+George+Holme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"PusInBoots","files":1,"time":1406095507,"description":"From the fall of the Roman Empire to the dawn of the Renaissance, the thousand years forming the medieval period were a time of tremendous change and turmoil--a millennium that witnessed the creation of Western civilization. This beautiful volume--the fourth in a superb series of Oxford Illustrated Histories--offers a lively and authoritative account of life in medieval Europe and the Mediterranean.\nThe great monasteries and cathedrals, the ambitions of the Crusades, chivalric knights and heroic romance, the realism of the new arts, economic and social growth, the catastrophe of plague, the growth of towns and cities, the development of commerce and banking--all of these form the substance of this history. The six chapters of the book are divided between the Mediterranean world and northern Europe, illustrating how the center of political and cultural life moved gradually northward as the centuries progressed.\nWritten by a team of expert scholars and incorporating the findings of the latest research, the volume features more than 200 illustrations, 24 of them in color, all carefully chosen to amplify the text. Other features of the book include maps, genealogies and a chronology. There is no Bibliography or Index.","torrent":{"xt":"urn:btih:c516758f51da5ef61f814facc1131599f2762293","amp;dn":"The+Oxford+Illustrated+History+of+Medieval+Europe+-+George+Holme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c516758f51da5ef61f814facc1131599f2762293","infoHashBuffer":{"type":"Buffer","data":[197,22,117,143,81,218,94,246,31,129,79,172,193,19,21,153,242,118,34,147]},"announce":[],"urlList":[]}}