{"title":"Leading from the Front: An Autobiography","uid":15932390,"size":8144949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5a5adebcba937690aa14fdb295b9a9d9e654436&amp;dn=Leading+from+the+Front%3A+An+Autobiography&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"marty14","files":1,"time":1475368125,"description":"Leading from the Front: An Autobiography - Gen. Richard Dannatt [epub]\r\n\r\nGeneral Sir Richard Dannatt's distinguished career in the army has spanned thirty-eight years and seen him serve in many different theatres of conflict, from Northern Ireland (where he was awarded the Military Cross) to Bosnia and Kosovo, Iraq and Afghanistan. His experiences have forged an unwavering loyalty to the fighting British soldier.\r\n\r\nAs Chief of the General Staff, he was given overall command of the British army at a time when the fighting was fiercest in Afghanistan. But from his very first day in the job, General Dannatt proved himself a courageous leader and a forceful advocate for his men, never shying from controversy to tell the truth as he found it.\r\n\r\nMore than any leader in recent times, Dannatt has used his position of command to get a better deal for the British soldier - the right equipment, the right conditions, the right reward - to do the job we ask of them. His leadership and example have shaped the debate about the role of the professional army in modern warfare. &quot;Leading from the Front&quot; is General Sir Richard Dannatt's reflections on a life of military service which offers a characteristically frank analysis of whether Britain's defence strategy is fit to deal with the numerous threats we will face in the 21st century","torrent":{"xt":"urn:btih:c5a5adebcba937690aa14fdb295b9a9d9e654436","amp;dn":"Leading+from+the+Front%3A+An+Autobiography","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5a5adebcba937690aa14fdb295b9a9d9e654436","infoHashBuffer":{"type":"Buffer","data":[197,165,173,235,203,169,55,105,10,161,79,219,41,91,154,157,158,101,68,54]},"announce":[],"urlList":[]}}