{"title":"Jussi Adler-Olsen - 6 boeken (ebook)NLtoppers","uid":7276080,"size":3896967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c76aaf636c7a99cc5659a418bcaec658c8a9be69&amp;dn=Jussi+Adler-Olsen+-+6+boeken+%28ebook%29NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"ChickieChicken","files":-1,"time":1337286805,"description":"Omschrijving:\nJussi Adler-Olsen - 6 boeken waaronder de serie Afdeling Q\n\n\nHet Alfabethuis:\n\nIn januari 1944 worden twee Engelse piloten, James en Bryan, tijdens een verkenningsvlucht boven Duitsland neergeschoten. Omdat ze geen uniform dragen, zullen ze als spionnen worden terechtgesteld als zij in handen van de Duitsers vallen. Maar de twee slagen erin op een trein te springen. Dit blijkt een ziekentransport te zijn dat op de terugweg is van het Oostfront. In de hoop dat ze op een later tijdstip de kans krijgen te vluchten, gooien James en Bryan resoluut twee gewonde soldaten uit de trein en nemen hun plaatsen in...\nHet ziekentransport eindigt in het Alfabethuis, een psychiatrisch ziekenhuis,midden in het vijandige Duitsland. Terwijl buiten de oorlog in volle hevigheid woedt, ontdekken James en Bryan dat zij de identiteit hebben aangenomen van twee hooggeplaatste SS-officieren. Ze beseffen dat ze in hun rol moeten blijven om te overleven. Maar kun je maandenlang een geestesziekte simuleren, zonder daadwerkelijk geestelijk ziek te worden? En zijn zij de enigen in het Alfabethuis die doen alsof?\n\nHet Washingtondecreet:\n\nBij een brute moordaanslag op de avond van de Amerikaanse presidentsverkiezingen komt de vrouw van de Democratische kandidaat en uiteindelijke winnaar Bruce Jansen om het leven. De verbitterde nieuwe president vaardigt onmiddellijk een decreet uit om de rust en orde in de Verenigde Staten te herstellen.\nDoggie Rogers, medewerkster van Jansen, is getuige van de maatschappelijke woede die ontstaat als de Amerikanen beseffen wat er aan de hand is: de grenzen worden gesloten, de avondklok wordt ingevoerd, en het land staat binnen de kortste keren op de rand van een burgeroorlog. Bovendien wordt Doggies vader ter dood veroordeeld, omdat iedereen hem ziet als de moordenaar van de presidentsvrouw.\nDoggie voelt zich machteloos, maar besluit toch om zich met een kleine groep geestverwanten in te zetten voor de democratie, en om het complot te ontsluieren waaraan de Amerikaanse samenleving is blootgesteld.\n\nSerie: Afdeling Q\n\nDe vrouw in de kooi:\n\nOp een prachtige winterdag verdwijnt de jonge linkse politica Merete Lynggaard zonder een spoor achter te laten. De media duiken op het verhaal en suggereren van alles: van moord en zelfmoord tot een geplande vrijwillige verdwijning. De politie wordt gesommeerd de verdwijning grootscheeps aan te pakken, maar Merete is van de aardbodem verdwenen.\nBrigadier Carl Mork,hoofd van de Afdeling 'onopgeloste zaken' Q, forceert na enkele jaren een grote doorbraak in het onderzoek. Samen met zijn assistent Assad is hij een roekeloze crimineel op het spoor die wordt gedreven door haat. Wraak blijkt een cruciale factor in de krankzinnige plot. ","torrent":{"xt":"urn:btih:c76aaf636c7a99cc5659a418bcaec658c8a9be69","amp;dn":"Jussi+Adler-Olsen+-+6+boeken+%28ebook%29NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c76aaf636c7a99cc5659a418bcaec658c8a9be69","infoHashBuffer":{"type":"Buffer","data":[199,106,175,99,108,122,153,204,86,89,164,24,188,174,198,88,200,169,190,105]},"announce":[],"urlList":[]}}