{"title":"Rob Base and DJ E-Z Rock - It Takes Two 1988 [FLAC] - Kitlope","uid":4775834,"size":259708180,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c82eab16a6b8352db810d88f23c58b5cd7b3a71e&amp;dn=Rob+Base+and+DJ+E-Z+Rock+-+It+Takes+Two+1988+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":6,"uploader":"Kitlope","files":14,"time":1237211476,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: C82EAB16A6B8352DB810D88F23C58B5CD7B3A71E\nFile Size: 247.67 Mb\nYear: 1988\nLabel: Profile Records\nCatalog #: 834 777-2\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nRob Base and DJ E-Z Rock is a hip-hop duo from Harlem, New York who are best known for their hit &quot;It Takes Two.&quot; The duo consists of Rob Base (Robert Ginyard, born May 18, 1967) and DJ E-Z Rock (Rodney &quot;Skip&quot; Bryce).\n\n\nTheir first U.S. single and release was &quot;DJ Interview,&quot; appeared on World to World, which later got them a recording contract with Profile Records in 1987.\n\nThe first Profile release was &quot;It Takes Two&quot;. It uses multiple samples from the James Brown and Lyn Collins 1972 song &quot;Think (About It).&quot; The track first became a regional hit and then slowly climbed the Hot 100, eventually peaking at #36 and picking up a platinum single certification. The song also peaked at #3 on the Hot Dance Music/Club Play chart.\n\nAn album, also called It Takes Two, was quickly put together and it produced a significant follow-up hit, &quot;Joy and Pain,&quot; which sampled a song of the same name by Maze featuring Frankie Beverly, as well as &quot;Put The Music Where Your Mouth Is&quot; by the Olympic Runners. It also hit the Top 10 on the dance chart and climbed to #58 on the Hot 100. &quot;Get On the Dance Floor,&quot; a track released to clubs in between the two singles, hit #1 on the Hot Dance Music/Club Play chart in 1989. Boosted by those singles the It Takes Two album went platinum. However, vicious rumors started to circulate that Rob Base had legal problems for using samples from Maze's Frankie Beverly for the hit &quot;Joy and Pain&quot;, and he had his own personal problems. DJ E-Z Rock also was forced to leave the group due to his own personal issues, so Rob Base was left to be a solo artist.\n\nHe responded in 1989 with The Incredible Base, his debut solo album. It wasn't as successful as It Takes Two. One song from the album hit the dance chart in late 1989: &quot;Turn It Out (Go Base),&quot; credited only to Rob Base.\n\nRob Base and DJ E-Z Rock had a reunion album in 1994 with Break of Dawn, however the album didn't do well critically or commercially.\n\nIn 2008, their song &quot;It Takes Two&quot; was ranked number 37 on VH1's 100 greatest songs of hip hop also on the same show it is revealed that they are still active today.\n\nThe duo recently performed in Boston with C+C Music Factory\n\n\n\nIt Takes Two \n\n\n\nIt Takes Two is the debut album released by hip hop duo, Rob Base and DJ E-Z Rock. It was released in 1988 for Profile Records and featured production from DJ E-Z Rock, Rob Base, Donald &quot;O&quot; Bowden and Thomas Dean. The singles that were released were &quot;Joy and Pain&quot;, &quot;Get on the Dance Floor&quot; and the duo's signature song &quot;It Takes Two&quot;.\n\n\n\nTracks: \n\n1.\t&quot;It Takes Two&quot;- 5:00 \n2.\t&quot;Joy and Pain&quot;- 3:45 \n3.\t&quot;Don't Sleep On It&quot;- 4:00 \n4.\t&quot;Check This Out&quot;- 2:59 \n5.\t&quot;Crush&quot;- 5:29 \n6.\t&quot;Get On the Dance Floor&quot;- 4:23 \n7.\t&quot;Times Are Gettin' Ill&quot;- 3:38 \n8.\t&quot;Keep It Going Now&quot;- 3:50 \n9.\t&quot;Make It Hot&quot;- 4:19 \n10.\t&quot;Creativity&quot;- 3:48 \n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:c82eab16a6b8352db810d88f23c58b5cd7b3a71e","amp;dn":"Rob+Base+and+DJ+E-Z+Rock+-+It+Takes+Two+1988+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c82eab16a6b8352db810d88f23c58b5cd7b3a71e","infoHashBuffer":{"type":"Buffer","data":[200,46,171,22,166,184,53,45,184,16,216,143,35,197,139,92,215,179,167,30]},"announce":[],"urlList":[]}}