{"title":"DAZ3D - SimTenero Shape Reprojector","uid":15853310,"size":4104116,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c86121bf7a13190960e97f0519f7a88b4ba5e7b9&amp;dn=DAZ3D+-+SimTenero+Shape+Reprojector&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"De4lt","files":11,"time":1474188324,"description":"SimTenero Shape Reprojector\r\n---------------------------\r\n \nhttps://cdn.pximg.xyz/eb3a51dc57cfd27bc65686d69a24b270.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/33193\r\n\r\nWhat do you get when you cross a man with a rhinoceros? You get a new morph to play with! With SimTenero Shape Reprojector, you can combine objects in your library to create new morphs, subtle or wild!\r\n\r\nShape Projection, sometimes called &quot;shrink-wrapping&quot;, translates the shape of one object onto another. The result is brand new morphs without ever having to leave Daz Studio! Shape Reprojector uses a variety of projection and smoothing algorithms to generate new morphs for any object based on the shape of another. Round out a figure by adding a sphere, flatten an object onto a cube, or go nuts and start throwing random props and figures at each other to see what you can create!\r\n \r\nSimTenero Shape Reprojector is an advanced utility and, while it requires no experience in 3D modeling, it is recommended for users who are comfortable manipulating objects in 3D space and experimenting with advanced parameters. Some great results are only a few clicks away, while others results will require experimentation and practice. So this is one for all the dial spinners, model tweakers, and mad scientists of geometry out there!\r\n \r\nFour different projection algorithms and four smoothing algorithms are at your disposal. Every option and parameter value is exposed for your experimentation! When you've got your settings dialed in, you can easily save and reload presets so you don't lose that perfect setup. To help you on your way, a detailed user guide is included which contains a step-by-step tutorial guiding you through your first projection morph.\r\n \r\nMix, morph, tweak, spin, mangle, finesse, and have fun!","torrent":{"xt":"urn:btih:c86121bf7a13190960e97f0519f7a88b4ba5e7b9","amp;dn":"DAZ3D+-+SimTenero+Shape+Reprojector","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c86121bf7a13190960e97f0519f7a88b4ba5e7b9","infoHashBuffer":{"type":"Buffer","data":[200,97,33,191,122,19,25,9,96,233,127,5,25,247,168,139,75,165,231,185]},"announce":[],"urlList":[]}}