{"title":"Building PHP Applications with Symfony, CakePHP, and Zend Framew","uid":9797634,"size":9211639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8d7a3f4652143800d4333c51fb6586438f69afa&amp;dn=Building+PHP+Applications+with+Symfony%2C+CakePHP%2C+and+Zend+Framew&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"xXGalaxyXx","files":-1,"time":1395339099,"description":"Building PHP Applications with Symfony, CakePHP, and Zend Framework\n\n2011 |ISBN-10: 0470887346 | English | PDF | 528 Pages | 8.78 Mb\n\nThe first detailed, unbiased comparison of the three leading PHP frameworks\nWeb developers have been eager for an impartial comparison of leading PHP frameworks so they can make educated decisions about the most effective tool for their needs. This guide uses Symfony, CakePHP, and Zend Framework to solve key problems, providing source code examples and comparisons for each. It explains the approach and reviews the similarities and differences in the three frameworks, providing reliable information on which to base your decisions.\n--Symfony, CakePHP, and Zend Framework are considered the leading PHP frameworks; developers need an unbiased comparison to choose which one works best for their individual situations\n--This guide uses each framework to solve the same problems, illustrating the solutions with source code examples and working applications\n--Covers wide range of topics, from installation and configuration to most advanced features like AJAX, web services and automated testing.\n--Includes an appendix of new PHP frameworks, including CodeIgniter, Lithium, and Agavi\n--Bestselling PHP author Elizabeth Naramore serves as technical editor\nComparison of PHP Web Frameworks provides the impartial, side-by-side comparison that developers have been looking for.","torrent":{"xt":"urn:btih:c8d7a3f4652143800d4333c51fb6586438f69afa","amp;dn":"Building+PHP+Applications+with+Symfony%2C+CakePHP%2C+and+Zend+Framew","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8d7a3f4652143800d4333c51fb6586438f69afa","infoHashBuffer":{"type":"Buffer","data":[200,215,163,244,101,33,67,128,13,67,51,197,31,182,88,100,56,246,154,250]},"announce":[],"urlList":[]}}