{"title":"PrettyDirty: Kristen Scott (In Love With Daddy Part One) 09.11","uid":15807580,"size":648985631,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c8ea0d24270b4b8dcd7f8f5d6aa94df464d84529&amp;dn=PrettyDirty%3A+Kristen+Scott+%28In+Love+With+Daddy+Part+One%29+09.11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":4,"uploader":"EndYou","files":1,"time":1473580303,"description":"... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57d4f0b888fc1.html  \nhttp://imgpremium.com/img-57d4f0b913004.html \r\n\r\nTonight's the night Kristen Scott has to decide where to go to university. Home or out of state? Trouble is, she's a Daddy's Girl who loves her stepfather Tommy Pistol. She's having a hard time rationalizing leaving the guy who's always been there for her. He taught her how to drive, and helped her with homework. But now that she's a woman, she sees that he looks at her differently. And she has persistent sexual thoughts about him. She masturbates to the thought of them being together, but that only seems to make her fall harder in love.\r\n\r\nWhen she finally makes up her mind about school, she hops onto his lap and excitedly tells him she chooses to be with him. He begins to understand that the teen is deliberately grinding her crotch into his pelvis, and it's making his cock respond with an erection. \r\n\r\nTommy is very aware of her open mouth, close enough to kiss, and the hot breath tickling his neck. He has trouble resisting her, but when she whips out his cock and starts sucking, she makes it impossible for him to do the right thing. He fingers her dripping vagina, as she strokes his big cock, telling him she's been thinking about fucking him for months. He eats her pussy till she cums in Daddy's mouth. Now she wants to cum on Daddy's dick, so she lowers herself onto it, and Tommy obligingly fucks the teen pussy, pounding her like a bobblehead doll, until she cums again. Then he penetrates her pussy from behind, releasing more of her orgasms, fucking her harder and faster, till he jerks his load right into her mouth. Lucky for him, she won't tell Mommy!\r\n\r\nMPEG4 Video (H264) 960x544","torrent":{"xt":"urn:btih:c8ea0d24270b4b8dcd7f8f5d6aa94df464d84529","amp;dn":"PrettyDirty%3A+Kristen+Scott+%28In+Love+With+Daddy+Part+One%29+09.11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8ea0d24270b4b8dcd7f8f5d6aa94df464d84529","infoHashBuffer":{"type":"Buffer","data":[200,234,13,36,39,11,75,141,205,127,143,93,106,169,77,244,100,216,69,41]},"announce":[],"urlList":[]}}