{"title":"Executing the Rosenbergs: Death and Diplomacy in a Cold War ...","uid":16044696,"size":2232715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c97486a6664c6078e0587e0521c7d6cb276726ab&amp;dn=Executing+the+Rosenbergs%3A+Death+and+Diplomacy+in+a+Cold+War+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":4,"uploader":"marty14","files":1,"time":1476551217,"description":"Executing the Rosenbergs: Death and Diplomacy in a Cold War World - Lori Clune [epub]\r\n\r\nIn 1950, Julius and Ethel Rosenberg were arrested for allegedly passing information about the atomic bomb to the Soviet Union, an affair FBI Director J. Edgar Hoover labeled the &quot;crime of the century.&quot; Their case became an international sensation, inspiring petitions, letters of support, newspaper editorials, and protests in countries around the world. Nevertheless, the Rosenbergs were executed after years of appeals, making them the only civilians ever put to death for conspiracy-related activities. Yet even after their executions, protests continued. The Rosenberg case quickly transformed into legend, while the media spotlight shifted to their two orphaned sons. \r\n\r\nIn Executing the Rosenbergs, Lori Clune demonstrates that the Rosenberg case played a pivotal role in the world's perception of the United States. Based on newly discovered documents from the State Department, Clune narrates the widespread dissent against the Rosenberg decision in 80 cities and 48 countries. Even as the Truman and Eisenhower administrations attempted to turn the case into pro-democracy propaganda, U.S. allies and potential allies questioned whether the United States had the moral authority to win the Cold War. Meanwhile, the death of Stalin in 1953 also raised the stakes of the executions; without a clear hero and villain, the struggle between democracy and communism shifted into morally ambiguous terrain. \r\n\r\nTranscending questions of guilt or innocence, Clune weaves the case -and its aftermath -into the fabric of the Cold War, revealing its far-reaching global effects. An original approach to one of the most fascinating episodes in Cold War history, Executing the Rosenbergs broadens a quintessentially American story into a global one","torrent":{"xt":"urn:btih:c97486a6664c6078e0587e0521c7d6cb276726ab","amp;dn":"Executing+the+Rosenbergs%3A+Death+and+Diplomacy+in+a+Cold+War+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c97486a6664c6078e0587e0521c7d6cb276726ab","infoHashBuffer":{"type":"Buffer","data":[201,116,134,166,102,76,96,120,224,88,126,5,33,199,214,203,39,103,38,171]},"announce":[],"urlList":[]}}