{"title":"The Son of Neptune by Rick Riordan (Heroes of Olympus 2)","uid":7691937,"size":2589032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca36f8001cc20d36231d1c2550af284214768683&amp;dn=The+Son+of+Neptune+by+Rick+Riordan+%28Heroes+of+Olympus+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"azizex666","files":-1,"time":1349225143,"description":"Seven half-bloods shall answer the call,\nTo storm or fire the world must fall.\nAn oath to keep with a final breath,\nAnd foes bear arms to the Doors of Death.\n\nPercy is confused. When he awoke from his long sleep, he didn't know much more than his name. His brain fuzz is lingering, even after the wolf Lupa told him he is a demigod and trained him to fight with the pen/sword in his pocket. Somehow Percy manages to make it to a camp for half-bloods, despite the fact that he has to keep killing monsters along the way. But the camp doesn't ring any bells with him. The only thing he can recall from his past is another name: Annabeth[/color]\n\n[color=green]Hazel is supposed to be dead. When she lived before, she didn't do a very good job of it. Sure, she was an obedient daughter, even when her mother was possessed by greed. But that was the problem - when the Voice took over her mother and commanded Hazel to use her &quot;gift&quot; for and evil purpose, Hazel couldn't say no. Now because of her mistake, the future of the world is at risk. Hazel wished she could ride away from it all on the stallion that appears in her dreams.[/color]\n\n[color=blue]Frank is a klutz. His grandmother says he is descended from heroes and can be anything he wants to be, but he doesn't see it. He doesn't even know who his father is. He keeps hoping Apollo will claim him, because the only thing he is good at is archery - although not good enough to win camp war games. His bulky physique makes him feel like an ox, especially infront of Hazel, his closest friend at camp. He trusts her completely - enough to share the secret he holds close to his heart.[/color]\n\n[color=gold]Beginning at the &quot;other&quot; camp for half-bloods and extending as far as the land beyond the gods, this breathtaking second installment of the Heroes of Olympus series introduces new demigods, revives fearsome monsters, and features other remarkable creatures, all destined to play a part in the Prophesy of Seven\n\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n\n             **Support Your Favorite Authors By Buying Their Books**\n\n                 Check out all my Magazine and ebook uploads here.\n\n                   &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:ca36f8001cc20d36231d1c2550af284214768683","amp;dn":"The+Son+of+Neptune+by+Rick+Riordan+%28Heroes+of+Olympus+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca36f8001cc20d36231d1c2550af284214768683","infoHashBuffer":{"type":"Buffer","data":[202,54,248,0,28,194,13,54,35,29,28,37,80,175,40,66,20,118,134,131]},"announce":[],"urlList":[]}}