{"title":"Sports Nutrition, Enhancing Athletic Performance- Campbell [PDF]","uid":11262041,"size":21026399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cad48aa88bfde06f57cd8abdb9a2602661b35a32&amp;dn=Sports+Nutrition%2C+Enhancing+Athletic+Performance-+Campbell+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"0xmovva","files":2,"time":1413937851,"description":"TITLE/EDITIONSports Nutrition: Enhancing Athletic Performance\nAuthor: Bill Campbell\nHardcover: 338 pages\nPublisher: CRC Press; 1 edition (November 19, 2013)\nLanguage: English\nISBN-10: 1466513586\nISBN-13: 978-1466513587\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nWith the constant flow of information related to sports nutrition coming from scholarly journals, it is difficult to sift through it all and determine what is relevant. Sports Nutrition: Enhancing Athletic Performance helps in this endeavor, with more than 1,000 references from top academic journals, offering critical knowledge concerning nutrient ingestion for enhancing exercise and sports performance. This book offers a clear focus on scientifically based sports nutrition advice to maximize performance. It also addresses exercise metabolism, which governs how nutrients exert physiologic effects that lead to increased athletic potential.\n\nThe book examines the three key macronutrients: fat, carbohydrate, and protein. It discusses various aspects of macronutrient metabolism, including differences between a body at rest and during high-intensity exercise. Topics covered in the text include the following:\n\nNutrient timing\nLeucine threshold to optimize muscle protein synthesis\nCarbohydrate manipulations for better endurance- and resistance-exercise performance\nDietary fat intake recommendations for improving performance\nCarbohydrate loading strategies\nOptimal amounts of protein to ingest on a meal-by-meal basis\nPre-exercise dietary fat intake strategies\nComparison of high-quality proteins\nIn addition to enhancing performance, the book describes how to improve body composition, presenting a scientifically based strategy for losing body fat while maintaining precious lean muscle mass. Four principles of fat loss are set forth that are integral for success in optimizing body composition. This book presents both performance nutrition principles and exercise biochemistry, addressing the key questions of what, when, and how much to ingest for improved performance and training recovery","torrent":{"xt":"urn:btih:cad48aa88bfde06f57cd8abdb9a2602661b35a32","amp;dn":"Sports+Nutrition%2C+Enhancing+Athletic+Performance-+Campbell+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cad48aa88bfde06f57cd8abdb9a2602661b35a32","infoHashBuffer":{"type":"Buffer","data":[202,212,138,168,139,253,224,111,87,205,138,189,185,162,96,38,97,179,90,50]},"announce":[],"urlList":[]}}