{"title":"The Skinny Rules Wokout 5 DVD Series with Bob Harper [MP4]","uid":11823418,"size":4993619217,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cb36d58c773abe3a2677c49a22064f61ff9a57c7&amp;dn=The+Skinny+Rules+Wokout+5+DVD+Series+with+Bob+Harper+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":4,"uploader":"elessedilgirl","files":20,"time":1429375584,"description":"Bob Harper's Brand New &quot;The Skinny Rules&quot; This five-DVD workout series is designed to help you lose weight and build strength while improving endurance and flexibility.\n\nBob designed these DVDs to improve your strength, endurance and flexibility, combining some of the most effective exercises into circuit routines that can be done anywhere and fit into any schedule. These workouts are fit for beginners as well as athletes, and will give you the energy AND body you have always wanted. This set comes with a 28 day wall calendar to help motive and keep you track.\n\nThe best thing about the Skinny Rules workouts is their simplicity. Each workout involves only two to three whole body exercises. At the start of each workout, Bob breaks down each movement and provides expert cues for good form and safety.\n\nAfter the intro, you put the movements together into a short, intense exercise segment that lasts about 15 minutes. The sessions are called Workout of the Day (WOD) and are similar in style to a Crossfit or bootcamp style workout. You can expect to work extremely hard, burn more calories, and feel exhausted at the end of each segment.\n\nThere is no complex choreography or fancy footwork to follow. This is key to the Skinny Rules Workout success. Sometimes, exercisers spend too much mental energy trying to figure out complex steps and not enough physical energy burning fat. There is no chance of that happening with these tough but straightforward moves.\n\nBob Harper is the ultimate authority on health and wellness, motivating millions of people to make better choices by aggressively pushing one mentally and physically further than anyone else has. After successfully coaching 15 seasons of contestants to reach their extreme weight loss goals through the hit show, The Biggest Loser, Bob know what it takes to get results!\n\nVideo; x264; 720*576 (16:9); 1818 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:cb36d58c773abe3a2677c49a22064f61ff9a57c7","amp;dn":"The+Skinny+Rules+Wokout+5+DVD+Series+with+Bob+Harper+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb36d58c773abe3a2677c49a22064f61ff9a57c7","infoHashBuffer":{"type":"Buffer","data":[203,54,213,140,119,58,190,58,38,119,196,154,34,6,79,97,255,154,87,199]},"announce":[],"urlList":[]}}