{"title":"Gas.Guzzlers.Extreme-RELOADED","uid":9019150,"size":6318470432,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cbd310d84a9baeb140b222d7830cda99095accb5&amp;dn=Gas.Guzzlers.Extreme-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"Mr.Stifmeister","files":2,"time":1381259269,"description":"\nnERv\n\nGas Guzzlers Extreme (c) Iceberg Interactive\n\n10/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action, Indie\nRacing\n\nGas Guzzlers Extreme is a fast, furious, armed-to-the-teeth, trigger-happy\nshooter,shifted into top gear Take a white knuckle ride in this crazily\naddictive combat racing game that features a ton of vehicles, weapons,\nupgrades, on-track bonuses and environments. Gas Guzzlers Extreme is an\nexciting new twist on the car combat experience with the addition of furious\nteam/clan combat battles.\n\nPlayers start out with low performance vehicles and soon work their way up to\nhigh-performance models, by earning money in a series of hi-octane races and\narena battles. New game modes, tracks and vehicles are unlocked as players\nprogress through the game. Along with developing their driving and fighting\nskills, players can spend their hard-fought cash, customizing their vehicle\nto match their clan members or pimping their ride for the road to glory\n\nKey features:\nCombat racing at its best, featuring a blood pumping single player campaign\nwith over 12 hours of gameplay.\nFast-as-lightning multiplayer tournaments with 7 different modes (classic\nrace, power race, battle race, knockout, deathmatch, last man standing and\ncapture the flag) with up to 4 teams available in team play mode.\n350 miles of road across 40 tracks, 8 arenas and 7 different environments.\n12 unique weapons, on-track bonuses and power ups.\n18 customizable cars (12 upgrades, color, rims, stickers, etc.).\nMulti-path tracks and sponsored events.\nInstant play with vicious AI Bots populating your multiplayer match while\nother players begin to join in on the fun.\nBeautifully displayed high definition visuals with extensive vehicle\ndamage, motion blur effects and custom paint jobs.\nFull force feedback controller support as well as keyboards, joy pads,\njoysticks and racing wheels.\nPacked with tons of unique humor and personality.\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game installBin32 directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:cbd310d84a9baeb140b222d7830cda99095accb5","amp;dn":"Gas.Guzzlers.Extreme-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbd310d84a9baeb140b222d7830cda99095accb5","infoHashBuffer":{"type":"Buffer","data":[203,211,16,216,74,155,174,177,64,178,34,215,131,12,218,153,9,90,204,181]},"announce":[],"urlList":[]}}