{"title":"The Pop Group - Y (1979)","uid":5483215,"size":63066626,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cc5c19062cb4f5ab6d7954745416dbb3f9ae59da&amp;dn=The+Pop+Group+-+Y+%281979%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"artpepper","files":-1,"time":1270559867,"description":"The Pop Group - &quot;Y&quot; (Radar Records, 1979)\n\n\n\nTracklist:\n\n1. She Is Beyond Good And Evil\n2. Thief Of Fire\n3. Snow Girl\n4. Blood Money\n5. We Are Time\n6. Savage Sea\n7. Words Disobey Me\n8. Don't Call Me Pain\n9. The Boys From Brazil\n10.Don't Sell Your Dreams\n\nWhen The Pop Group first came onto the scene in late 1978 they were being hailed in the UK press as one of the saviours of rock and roll, and with good reason as the group's music made almost everything being created at the time seem old hat over night. \n\nThe Pop Group's debut single &quot;She Is Beyond Good and Evil&quot; released in 1979 was an instant classic and one of the landmark recordings of the 1970's, it was a seething tense piece of aggressive funk/punk/dub/free jazz that demanded attention. It sounded like nothing in the world at the time of it's release and gave me the same feeling as when I heard Public Image Ltd.'s first single, it seemed to hint at endless possibilties for rock and roll. The B side &quot;3:38&quot; should also mentioned this was a pulverizing dose of mind-numbing dub that seemed to look ahead to Pop Group lead singer Mark Stewart's trailblazing work in the 80's with Mafia. A CD re-issue of &quot;Y&quot; in 1996 strangely omitted this great track from the release, WHY?\n\n\nThe original release of &quot;Y&quot; opened with the explosive &quot;Thief of Fire&quot; which was the group at it's best, this is a blistering ride through the bushes of Viet-Nam highlighted by Simon Underwood's funk/dub bass playing, the twin Beefheart guitar attack of Gareth Sager and John Waddington, and Mark Stewart's shrieking &quot;my face is on fire&quot; vocals, Sager also provides some squealing saxophone in the song's mid section. I remember a Melody Maker piece on the group around the time of the release of this album where the band admitted to listening to loads of King Tubby and Ornette Coleman's &quot;Free Jazz&quot; while they recorded the album, which makes perfect sense.\n\n\nThe next track on the album is a very experimental piece called &quot;Snow Girl&quot; which is driven by some Cecil Taylor type piano, shotgun blasts of guitar from Waddington and Sager and bass slaps by Underwood, Stewart provides a bizarre but strangely catchy vocal. The next track is the frightening &quot;Blood Money&quot; a nightmare soundscape wherein Stewart screams bloody murder in the background, he seems to be screaming about spiders being all over his chest, he sounds like Damo Suzuki on that track on Can's &quot;Tago Mago&quot; where Damo seems like he's being tortured. Gareth Sager plays some sax lines that sound like the bagpipe wizard Rufus Harley.\n\n\nIn &quot;We Are Time&quot; singer Stewart sounds like he is coming out of his own skin. The group then throws you a big league curveball called &quot;The Savage Sea&quot; this one opens with an almost melodic piano and it could almost be a Pop Group ballad.\n\n\n&quot;Words Disobey Me&quot; is another experimental piece in the style of &quot;Blood Money&quot;. &quot;Don't Call Me Pain&quot; opens with a sax riff that sounds like it is being played by Traffic's Chris Wood, on this one Stewart screams &quot;Don't Call Me Pain, My Name Is Mystery&quot;. With &quot;The Boys From Brazil&quot; it's back to free jazz territory, again Sager's sax reminds one of Chris Wood while Underwood plays a great funky bass riff.\n\nThe record finishes with a stripped down dirge called &quot;Don't Sell Your Dreams&quot; where Stewart sounds totally spent and on the verge of collapse, the musical backing is full of space and it reminds me of the Pharoah Sanders group on &quot;Upper Egypt and Lower Egypt&quot; the guitar playing is full on Sonny Sharrock. \n\nAfter playing &quot;Y&quot; you wonder how the group ever hoped to top it: in fact, they never did, but their second album was fine as well--just not as good as &quot;Y&quot;: few albums are. The Pop Group finished in 1981 and splintered into groups like Rip, Rig and Panic, The New Age Steppers and most importantly Mark Stewart and Mafia, Stewart really carried the flame from the original Pop Group and much of his work with Mafia is on par with the best of The Pop Group yet his records have been totally ignored.\n\n\n&quot;Y&quot; is the best place to start to get to know the music of Mark Stewart and company.","torrent":{"xt":"urn:btih:cc5c19062cb4f5ab6d7954745416dbb3f9ae59da","amp;dn":"The+Pop+Group+-+Y+%281979%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc5c19062cb4f5ab6d7954745416dbb3f9ae59da","infoHashBuffer":{"type":"Buffer","data":[204,92,25,6,44,180,245,171,109,121,84,116,84,22,219,179,249,174,89,218]},"announce":[],"urlList":[]}}