{"title":"Karen Armstrong - Fields of Blood: Religion and Violence (2014)","uid":11292458,"size":2750177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccc8dc50f85c93eb492fbbe4978dc02e71970dcd&amp;dn=Karen+Armstrong+-+Fields+of+Blood%3A+Religion+and+Violence+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"workerbee","files":-1,"time":1414351995,"description":"\n* Karen Armstrong - FIELDS OF BLOOD: Religion and the History of Violence (Knopf, 2014).  528 pp. -- ePUB\n\n\nFrom the renowned and best-selling author of A HISTORY OF GOD, a sweeping exploration of religion and the history of human violence.\n\nFor the first time, religious self-identification is on the decline in American.  Some analysts have cited as cause a post-9/11perception: that faith in general is a source of aggression, intolerance, and divisiveness -- something bad for society.  But how accurate is that view?  With deep learning and sympathetic understanding, Karen Armstrong sets out to discover the truth about religion and violence in each of the world's great traditions, taking us on an astonishing journey from prehistoric times to the present.\n\nWhile many historians have looked at violence in connection with particular religious manifestations (jihad in Islam or Christianity's Crusades), Armstrong looks at each faith -- not only Christianity and Islam, but also Buddhism, Hinduism, Confucianism, Daoism, and Judaism -- in its totality over time.  As she describes, each arose in an agrarian society with plenty powerful landowners brutalizing peasants while also warring among themselves over land, then the only real source of wealth.  In this world, religion was not the discrete and personal matter it would become for us but rather something that permeated all aspects of society.  And so it was that agrarian aggression, and the warrior ethos it begot, became bound up with observances of the sacred.\n\nIn each tradition, however, a counterbalance to the warrior code also developed.  Around sages, prophets, and mystics there grew up communities protesting the injustice and bloodshed endemic to agrarian society, the violence to which religion had become heir.  And so by the time the great confessional faiths came of age, all understood themselves as ultimately devoted to peace, equality, and reconciliation, whatever the acts of violence perpetrated in their name.\n\nIndustrialization and modernity have ushered in an epoch of spectacular and unexampled violence, although, as Armstrong explains, relatively little of it can be ascribed directly to religion. Nevertheless, she shows us how and in what measure religions, in their relative maturity, came to absorb modern belligerence -- and what hope there might be for peace among believers of different creeds in our time.\n\nAt a moment of rising geopolitical chaos, the imperative of mutual understanding between nations and faith communities has never been more urgent, the dangers of action based on misunderstanding never greater.  Informed by Armstrong's sweeping erudition and personal commitment to the promotion of compassion, FIELDS OF BLOOD makes vividly clear that religion is not the problem.\n\n\n** NOTE: For more works by Karen Armstrong, please see http://thepiratebay.se/torrent/10643832/  \n\n\nReviews\n\n&quot;A timely work. . . This passionately argued book is certain to provoke heated debate against the background of the ISIS atrocities and many other acts of violence perpetrated around the world today in the name of religion.&quot; -- John Cornwell, Financial Times\n \n&quot;Detailed and often riveting . . .  Armstrong can be relied on to have done her homework and she has the anthropologist's respect for the 'otherness' of other cultures. . . [Her] oeuvre is extensive, bringing a rare mix of cool-headed scholarship and impassioned concern for humanity to bear on the vexed topic of religion.&quot; -- Salley Vickers, The Guardian (UK)\n \n&quot;[Armstrong] ranges across the great empires and leading faiths of the world.  Fields of Blood is never less than absorbing and most of the time as convincing as it is lucid and robust . . . [This] wonderful book certainly cleanses the mind. It may even do a little repair work on the heart.&quot; -- Ferdinand Mount, The Spectator (UK)\n\n&quot;From Gilgamesh to bin Laden, [Armstrong covers] almost five millennia of human experience . . . Supplying the context of what may look like religiously motivated episodes of violence, in order to show that religion as such was not the prime cause . . . She is no doubt right to say that the aggression of a modern jihadist does not represent some timeless essence of religion, and that other political, economic and cultural factors loom large in the stories of how and why individuals become radicalized.&quot; -- Noel Malcolm, The Telegraph (UK)\n\n_____________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                               &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:ccc8dc50f85c93eb492fbbe4978dc02e71970dcd","amp;dn":"Karen+Armstrong+-+Fields+of+Blood%3A+Religion+and+Violence+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccc8dc50f85c93eb492fbbe4978dc02e71970dcd","infoHashBuffer":{"type":"Buffer","data":[204,200,220,80,248,92,147,235,73,47,187,228,151,141,192,46,113,151,13,205]},"announce":[],"urlList":[]}}