{"title":"Memoirs of Hitler from Those Who Knew Him","uid":16033391,"size":343039,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd024a7229dfc7bd9e973bf42d36ce80fd0822b7&amp;dn=Memoirs+of+Hitler+from+Those+Who+Knew+Him&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"marty14","files":1,"time":1476451264,"description":"Hitler: Personal Recollections, Memoirs of Hitler from Those Who Knew Him - Heinz A. Heinz [epub]\r\n\r\nHeinz A. Heinz was the only writer authorized by the Nazi Party to draw a biography of the Führer for publication in the English speaking world. The result was the 1938 authorized biography of Adolf Hitler entitled Germany’s Hitler.\r\n\r\nThe book was based on interviews supplied first hand by those friends, helpers and comrades who had believed in him from the beginning of his political career. Heinz A. Heinz was a professional journalist and author, he interviewed Hitler’s old school friends, army colleagues, landlords, his jailer, and early party comrades including an invaluable interview with Anton Drexler to produce an unprecedented insight into Adolf Hitler as viewed by his acquaintances during the inter-war period.\r\n\r\nThese remarkable interviews were given by those who had stood by him in his darkest days, and who lived to see one of the most astounding political achievements in history. Included are vivid and unique descriptions of Hitler at school, his First World War battlefield experiences, the early political struggles, the full story behind the 9th November Beer Hall Putsch, Hitler in prison, and the struggle to power from 1926 to 1933.\r\n\r\nFeaturing a new introduction by Emmy Award winning writer and historian Bob Carruthers, this book is a vital primary source reference work for anyone interested in understanding how and why Hitler won the total adulation and support of such a large section of the German people","torrent":{"xt":"urn:btih:cd024a7229dfc7bd9e973bf42d36ce80fd0822b7","amp;dn":"Memoirs+of+Hitler+from+Those+Who+Knew+Him","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd024a7229dfc7bd9e973bf42d36ce80fd0822b7","infoHashBuffer":{"type":"Buffer","data":[205,2,74,114,41,223,199,189,158,151,59,244,45,54,206,128,253,8,34,183]},"announce":[],"urlList":[]}}