{"title":"Dollhouse - Season 1 720p BRRip","uid":9504640,"size":16117067554,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:cd3a707f5eac6c3f8e6366f0e7979f6abd1adb97&amp;dn=Dollhouse+-+Season+1+720p+BRRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":9,"uploader":"rachelstoolbox","files":14,"time":1390293456,"description":"All 14 episodes of Dollhouse, Season 1 in 720p BRRips. Includes both episode 13 and the unaired pilot. I made these for myself and decided to share them due to the lack of sources.\n\nA futuristic laboratory assigns different tasks to its various residents, who then have their memories erased upon the completion of their assignments.\n\n01x00 - Echo\nFBI Agent Paul Ballard searches for Caroline, a missing person, who may be connected to a Dollhouse. A place that people say doesn't exist.\n\n01x01 - Ghost\nA wealthy backer asks the Dollhouse for help when his daughter is kidnapped. They send Echo to negotiate the release. One of the memory imprints used to prepare Echo for the mission causes some complications.\n\n01x02 - The Target\nA man requests Echo as his companion on a camping trip, but his true intentions are far more deadly. More back story on the Dollhouse, Alpha, and Boyd's first encounter with Echo.\n\n01x03 - Stage Fright\nPop star Rayna is in need of protection due to death threats, so Echo is programmed as a backup singer/bodyguard for her. Sierra serves as additional protection. Paul's investigation into the Dollhouse might cost him his life.\n\n01x04 - Gray Hour\nEcho's engagement to steal some art starts to go bad when she and others in her crew get locked in the vault. When Echo is wiped remotely, the Dollhouse must figure a way to get her out.\n\n01x05 - True Believer\nEcho is programed to go under cover as a blind woman at religious cult in Arizona after a corrupt senator recruits Dollhouse to assist the ATF in the breakup of the cult. But with Boyd watching from a distance, he soon learns that the Jonas Sparrow cult may be more difficult to handle, and the ATF agent in charge has an ulterior motive... as does Dominic when the situation takes a turn for the worse. Meanwhile, Agent Ballard continues his relentless quest to look for Echo while his neighbor, Mellie, continues to harbor a crush on him. Also, Topher and Dr. Saunders monitor Victor when he begins exhibiting primordial behavior whenever he's around Sierra.\n\n01x06 - Man on the Street\nBallard gets a lead on a possible Dollhouse client and he finds more than he expected. Meanwhile at the Dollhouse, an active is being abused, possibly by another active.\n\n01x07 - Echoes\nRossum Corporation asks the Dollhouse to send a large contingent of actives to a college campus to retrieve an experimental memory drug. The drug brings out suppressed memories which affect everyone, including the actives. Echo's origins are revealed.\n\n01x08 - Needs\nThe Dollhouse's worst fears are realized as several actives awaken and remember some of their past lives and try to escape from the Dollhouse.\n\n01x09 - A Spy in the House of Love\nDeWitt leaves Dominic in charge of the Dollhouse when she has to leave for a short period. Topher finds a chip in the imprint chair which has been used by other agencies to alter the programming on the actives. As the Dollhouse looks for the spy within, Ballard learns more about the Dollhouse.\n\n01x10 - Haunted\nEcho is imprinted with the memories of a deceased person, who wants to solve her own murder. Ballard digs deeper into Mellie's past. Topher needs an active to help him with his security check.\n\n01x11 - Briar Rose\nEcho helps a troubled youth. Ballard finally locates the Dollhouse. He locates someone who designed the Dollhouse, now he's closer than ever to rescuing Caroline.\n\n01x12 - Omega\nAlpha has taken Echo. More secrets of the Dollhouse are revealed. Ballard must work with the Dollhouse to stop Alpha, if he wants to save Caroline.\n\n01x13 - Epitaph One\nIn the future, the imprinting technology is rampant. A few people stumble on the Dollhouse. ","torrent":{"xt":"urn:btih:cd3a707f5eac6c3f8e6366f0e7979f6abd1adb97","amp;dn":"Dollhouse+-+Season+1+720p+BRRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3a707f5eac6c3f8e6366f0e7979f6abd1adb97","infoHashBuffer":{"type":"Buffer","data":[205,58,112,127,94,172,108,63,142,99,102,240,231,151,159,106,189,26,219,151]},"announce":[],"urlList":[]}}