{"title":"And Then She Was GONE - Christopher Greyson [EN EPUB MOBI AZW3]","uid":15936737,"size":1542782,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdd6f7a123ed5fadfa04cbc17fd9feaf86c0d767&amp;dn=And+Then+She+Was+GONE+-+Christopher+Greyson+%5BEN+EPUB+MOBI+AZW3%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"perfect_stan","files":5,"time":1475408807,"description":"And Then She Was GONE: A riveting new suspense novel that keeps you guessing until the end by Christopher Greyson\r\nEnglish | 2016 | Thriller &amp; Suspense | 1.5 MB\r\n\r\n\r\nWhat’s done in the dark will be brought to the light…\r\n\r\nThe silhouette stood at the edge of the woods like a spider watching a fly enter its carefully crafted web. Only a few more steps and she’d be within its grasp.\r\nStacy Shaw has her whole life ahead of her. New job, new house and now a baby on the way—everything she’s ever hoped for is finally coming true. But on a warm summer night on the way home from work, she vanishes. The police race to find her, but the clues don’t add up. Conflicting facts emerge as her story twists and turns, sending the trail spiraling in all directions.\r\nA hometown hero with a heart of gold, Jack Stratton was raised in a whorehouse by his prostitute mother. Jack seemed destined to become another statistic, but now his life has taken a turn for the better. Determined to escape his past, he’s headed for a career in law enforcement. When his foster mother asks him to look into the girl’s disappearance, Jack quickly gets drawn into a baffling mystery. As Jack digs deeper, everyone becomes a suspect—including himself. Caught between the criminals and the cops, can Jack discover the truth in time to save the girl? Or will he become the next victim?\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:cdd6f7a123ed5fadfa04cbc17fd9feaf86c0d767","amp;dn":"And+Then+She+Was+GONE+-+Christopher+Greyson+%5BEN+EPUB+MOBI+AZW3%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdd6f7a123ed5fadfa04cbc17fd9feaf86c0d767","infoHashBuffer":{"type":"Buffer","data":[205,214,247,161,35,237,95,173,250,4,203,193,127,217,254,175,134,192,215,103]},"announce":[],"urlList":[]}}