{"title":"Dungeon of Cum - DoC - Jun 14, 2016 -  Sabrina Sparx","uid":16000377,"size":608780228,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cdf930ce7bf3c181e4044bdc56825434ffb9ed22&amp;dn=Dungeon+of+Cum+-+DoC+-+Jun+14%2C+2016+-++Sabrina+Sparx&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":46,"uploader":"merzedes","files":334,"time":1476118917,"description":"&quot;His Girlfriend's Best Friend&quot; \r\nDungeon of Cum : Redux \r\n Sabrina Sparx \r\n\r\nMp4 480p + Pics. \r\n\r\nJames Deen has been wanting to fuck Sabrina Sparx for some time. James has a very beautiful girlfriend and Sabrina has been her friend for years. You know how it is when you have a relationship with a woman and she has a cute little girlfriend. It's practically impossible not to wonder what it may be like to fuck her, and that has been James's situation for quite some time with Sabrina. So, when we book Sabrina at the Dungeon for some bound sex, we book James to be her Dom. To say the least, they are both pleasantly pleased to be fucking each other, all with the permission and in the know of James's woman. And Sabrina knows James. She has heard the stories of his sexual tendencies for a long time. So we hang her upside down by her ankles and can only wonder what she may be thinking as James enters the scene to have his way with her. He begins with a crop, slapping and taunting her with it. Then he pulls out his cock and dickwhips her face. He reddens her ass before removing her gag to fuck her mouth as her holds a magic wand on her pussy. Sabrina makes the mistake of pulling her head away. James is a serious dom and she learns through spit and slapping that she should de whatever James says, and only what he says. And pulling his cock out of her mouth is not acceptable. To say the least, James is a natural born dom. In the next scene, Sabrina is tied on a sofa. James fucks her from behind, then pulls her on top of him, then bends her over for more pounding. He rests her head on the armrest of the sofa as he fucks her face. Then he leaves her there gagged, bound and spent. We lay Sabrina on her back and pull her feet into the air. James goes back and forth between fucking her hard, and ramming his cock in her mouth. He makes her lick his balls as he jams fingers into her cunt. In the end, James cums on her face, then removes her gag, and smears the cum all over and into her mouth where she licks it from his hand \r\n\r\nScreens \r\n \nhttp://www.dungeoncorp.com/updates16/DRE/SAB_050907/index.php \r\n\r\nUploaded by Merzedes and Shallow2 \r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect. \r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:) \r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!! \r\n\r\nAny Questions ?? Read our FAQ!! \r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg \r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg \r\n\r\nCheers :-) \r\n\r\nKAT RIP","torrent":{"xt":"urn:btih:cdf930ce7bf3c181e4044bdc56825434ffb9ed22","amp;dn":"Dungeon+of+Cum+-+DoC+-+Jun+14%2C+2016+-++Sabrina+Sparx","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdf930ce7bf3c181e4044bdc56825434ffb9ed22","infoHashBuffer":{"type":"Buffer","data":[205,249,48,206,123,243,193,129,228,4,75,220,86,130,84,52,255,185,237,34]},"announce":[],"urlList":[]}}