{"title":"Rocksmith 2014 Custom DLC folder with over 500 CDLC","uid":9404103,"size":3758961047,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ce7f4f0437ac5ee410c84a27f61747af626320ac&amp;dn=Rocksmith+2014+Custom+DLC+folder+with+over+500+CDLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"jd2k5","files":-1,"time":1388119011,"description":"Title doesn't begin to describe this collection. I have personally downloaded each of the custom songs in this package from http://forums.smithyanvil.com/index.php . I found this site a year ago for the first Rocksmith and they are still at it for this one. I love this place and recommend it to everyone. Anyway on to the package. \n\nTHIS IS FOR ROCKSMITH 2014 PLAYERS WHO HAVE A SKIDROW CRACKED VERSION OF THE GAME ONLY!!!\n\nNow that that's out the way here is what follows. This is a collection of over 500 CDLC from smithyanvil members who contribute their time to making these available for free. Smithyanvil does not support the cracked version of the game so no asking for help in that matter. This also contains the original rocksmith 2012 Official DLC and the songs that were originally included in Rocksmith 2012. This also contains All of the current up to the MUSE pack and Golden Bomber pack just a few weeks ago. Unfortunately there was no Christmas pack this year.... \n\nInstall Instructions\n\nCopy Contents of Rocksmith 2014 Custom DLC folder into your Root Rocksmith 2014 folder Overwriting any files that need to be overwritten. \n\nThis pack contains such artists as \n\nLinkin Park\nLimp Bizkit\nCoheed and Cambria\nNirvana\nMetallica\n\nand many many more... Way to many to list here. \n\nThis SKIDROW.ini file is updated to include all of the official songs that have been released up until 12/26/2013","torrent":{"xt":"urn:btih:ce7f4f0437ac5ee410c84a27f61747af626320ac","amp;dn":"Rocksmith+2014+Custom+DLC+folder+with+over+500+CDLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce7f4f0437ac5ee410c84a27f61747af626320ac","infoHashBuffer":{"type":"Buffer","data":[206,127,79,4,55,172,94,228,16,200,74,39,246,23,71,175,98,99,32,172]},"announce":[],"urlList":[]}}