{"title":"Socom 3 U.S. Navy Seals (NTSC) PS2","uid":6474684,"size":2891468615,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:cef861ec268dd0d03708665db9e1a8f973c046eb&amp;dn=Socom+3+U.S.+Navy+Seals+%28NTSC%29+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":11,"uploader":"Big_dude","files":-1,"time":1308275531,"description":"Socom 3 U.S. Navy Seals for the Ps2                                 Rel. 10/11/2005\n\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action, Strategy\nRating:        Mature\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\n\nRelease Notes:  If you wanna play this game online it seems you need the original\n                game using an unmodded ps2, Until this has been defeated we don't \n                know. The DNAS has been patched though. Tested fine and working on\n                a mod-chipped PS2 burned on disc (Not including online play). \n                Includes Emulator &amp; FMCB/esr if you need it to run your copies.\n\n\n\n\nGame Description:\n\nProtect America from enemy forces in urban and rural warfare throughout the world in SOCOM 3: U.S. NAVY SEALs, exclusively for the PlayStationÃ‚Â®2 computer entertainment system. For the first time in the SOCOM series, land and water vehicles play a central role in the gameplay experience. Vehicles are drivable by both players and AI and cover a range of military and civilian vehicles including tactical turret-equipped pickups and the SEAL-team configured military Humvee and SOC-R Assault Boat. \n\nThe innovative new weapon customization system in SOCOM 3 allows players to use more than 30 different weapons and attachments, resulting in nearly1,000 different weapon combinations. The new Team Command Actions (TCA) allows you to quickly give your teammates context sensitive commands such as move to, breach, and more, simply by pointing at the location and pressing a single button. Combined with more complex team and enemy AI behavior, SOCOM 3 presents a fully immersive and more intense tactical experience than ever before.\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\n\nBurn at 8x or 4x Speed.\n\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:cef861ec268dd0d03708665db9e1a8f973c046eb","amp;dn":"Socom+3+U.S.+Navy+Seals+%28NTSC%29+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef861ec268dd0d03708665db9e1a8f973c046eb","infoHashBuffer":{"type":"Buffer","data":[206,248,97,236,38,141,208,208,55,8,102,93,185,225,168,249,115,192,70,235]},"announce":[],"urlList":[]}}