{"title":"Wayne Barrett - Grand Illusion - The Untold Story of Rudy Giulia","uid":15876529,"size":1436594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf1bdc6e5b94e1b19cd947e66f6f3161e488d79a&amp;dn=Wayne+Barrett+-+Grand+Illusion+-+The+Untold+Story+of+Rudy+Giulia&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1474519483,"description":"http://boltimg.com/images/YFKZI.jpg\r\n\r\nWayne Barrett - Grand Illusion - The Untold Story of Rudy Giuliani and 911 - pdf\r\n\r\nRudy Giuliani emerged from the smoke of 9/11 as the unquestioned hero of the day: America's Mayor, the father figure we could all rely on to be tough, to be wise, to do the right thing. In that uncertain time, it was a comfort to know that he was on the scene and in control, making the best of a dire situation.\r\n\r\nBut was he really?\r\n\r\nGrand Illusion is the definitive report on Rudy Giuliani's role in 9/11—the true story of what happened that day and the first clear-eyed evaluation of Giuliani's role before, during, and after the disaster.\r\n\r\nWhile the pictures of a soot-covered Giuliani making his way through the streets became very much a part of his personal mythology, they were also a symbol of one of his greatest failures. The mayor's performance, though marked by personal courage and grace under fire, followed two terms in office pursuing an utterly wrongheaded approach to the city's security against terrorism. Turning the mythology on its head, Grand Illusion reveals how Giuliani has revised his own history, casting himself as prescient terror hawk when in fact he ran his administration as if terrorist threats simply did not exist, too distracted by pet projects and turf wars to attend to vital precautions.\r\n\r\nAuthors Wayne Barrett and Dan Collins also provide the first authoritative view of the aftermath of the 9/11 attacks, recounting the triumphs and missteps of the city's efforts to heal itself. With surprising new reporting about the victims, the villains, and the heroes, this is an eye-opening reassessment of one of the pivotal events—and politicians—of our time","torrent":{"xt":"urn:btih:cf1bdc6e5b94e1b19cd947e66f6f3161e488d79a","amp;dn":"Wayne+Barrett+-+Grand+Illusion+-+The+Untold+Story+of+Rudy+Giulia","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf1bdc6e5b94e1b19cd947e66f6f3161e488d79a","infoHashBuffer":{"type":"Buffer","data":[207,27,220,110,91,148,225,177,156,217,71,230,111,111,49,97,228,136,215,154]},"announce":[],"urlList":[]}}