{"title":"Exercise TV - The Butt Bible (Pauline Nordine)","uid":8808781,"size":2339567616,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cf2ab5184727f9951946038f246eb9893def5a25&amp;dn=Exercise+TV+-+The+Butt+Bible+%28Pauline+Nordine%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"acer47x","files":-1,"time":1376404338,"description":"Production year : 2011 \nCountry : USA \nGenre : Fitness \nLanguage : English \nTranslation: None \nLength : 2:11:44\n\n\n\n\nDescription:\n\nThe program includes three training sessions on the upper body and abs in addition to the three trainings on the lower part of the body (which is why it does not just work on the buttocks). Training in ascending levels of difficulty - you start with an introductory training and then will move on to the more advanced. All the exercises for the most part are well known - from sit-ups, leg lifts and lunges, push-up, pull dumbbells in the slope and twists to the press. Part of the exercise will be repeated from level to level, while others will be presented in a more complicated variations (for example, on one leg squats or push-ups with a narrow formulation of the hands.) \nYou will need: weights from 1.5 to 2.5 kg, and in bodibar training intermediate / advanced levels of difficulty.\n\nLevel : Intermediate\nQuality: DVDRip \nFormat: AVI \nVideo: XviD Build 64, 688x384 (1.79:1), 1644 - 1843 Kbps, 25.00 fps, 0-24-0.28 b / px \nAudio: Dolby Digital AC3, 192 Kbps, CBR, 48 kHz and 2 ch.\n\n\n\nHas three upper body / abs programs in addition to the three lower-body workouts (so it's more than just &quot;butt toning&quot;). The three workout &quot;sets&quot; build in intensity - you'll start with the introductory series and advance to the more challenging pair. The moves are mostly straight-forward classics, from squats, leg lifts and lunges to push-ups, dumbbell rows and abdominal crunches. While many exercises are repeated throughout the levels, you also get tougher variations in the later sets (eg one-legged squats or narrow-hand-position push-ups). Pauline Nordin is not your standard instructor. Her cuing is minimal and her chatty commentary is &quot;bad ass&quot; motivational (&quot;Nobody loves this move. Why? Because it hurts!&quot;). Requires 3 to 5 lb. dumbbells; a body bar is also used in one inter / advan workout. Â© 2011.\n\n\n\n","torrent":{"xt":"urn:btih:cf2ab5184727f9951946038f246eb9893def5a25","amp;dn":"Exercise+TV+-+The+Butt+Bible+%28Pauline+Nordine%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2ab5184727f9951946038f246eb9893def5a25","infoHashBuffer":{"type":"Buffer","data":[207,42,181,24,71,39,249,149,25,70,3,143,36,110,185,137,61,239,90,37]},"announce":[],"urlList":[]}}