{"title":"Dungeon of Cum - DoCR - Aug 04, 2016 - Julie Night","uid":16008247,"size":655950680,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cf63002abeaf40c5924516907f5c8a25e85d1a38&amp;dn=Dungeon+of+Cum+-+DoCR+-+Aug+04%2C+2016+-+Julie+Night&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":14,"uploader":"merzedes","files":258,"time":1476205459,"description":"&quot;Bondage Whore Gets Fucked Rough&quot; \r\nDungeon of Cum : Redux \r\n Julie Night \r\n\r\nMp4 + Pics. \r\n\r\nJulie Night is new to the Dungeon, and as you may already know, she is one naughty girl. So much so, that when Mr. Sanders heard she was visiting, he was immediately interested in a return visit to the Dungeon. For those of you who may not already be familiar with Julie Night, she is one hot little, innocent looking brunette. You will soon find out however, that looks can be deceiving. We first tie Julie on her knees, with her hands overhead, and stuff a ballgag in her gaping mouth. Alex enters, flogger in hand, and promptly goes to work on Julie's little torso with it. Then, he breaks out some clothes pins and clamps them to Julie's rock hard nipples. Seeing Julie in obvious dicomfort, Alex kindly removes the clothes pins... with the whip... of course. He then removes the ball gag from Julie's mouth and gives her a little face fucking. Thrusting his giant cock in and out of Julie's tiny little mouth, gets the juices flowing for Mr. Sanders, so he kneels and fucks her for a while from behind and Julie takes all he can give and still begs for more. In our next scene, Julie is tied face down, doggie style on a bench, defiantly wiggling her little ass at Alex. Seizing the opportunity to mount her high and hard and put her in her place and then some, Alex shoves his cock into her cunt, and hammers away. Then, he volleys back and forth between her pussy and face, before giving Julie what she really needs... a good ass fucking. After drilling Julie's asshole hard and deep Alex pulls out and fucks her face a bit more, then goes back to hammering her ass until, Julie explodes in a shattering orgasm that will make your ears bleed. In our final scene, Julie is forced onto the bed, her hands tied to her ankles. Alex seizes the opportunity to fuck her throat while he vibes her pussy. Despite Julie repeatedly gagging on his cock, he still tools away at her face. Totally submissive and spirit broken, Julie gets the assfuck of her life, as Alex takes her in various positions. Until finally he can take it no longer, he drops a humongous load on Julie's face and mouth as she licks his cock clean of her own juices \r\n\r\nScreens \r\n \nhttp://www.dungeoncorp.com/updates16/DRE/JUL_081007/index.php \r\n\r\nUploaded by Merzedes and Shallow2 \r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect. \r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:) \r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!! \r\n\r\nAny Questions ?? Read our FAQ!! \r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg \r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg \r\n\r\nCheers :-) \r\n\r\nKAT RIP","torrent":{"xt":"urn:btih:cf63002abeaf40c5924516907f5c8a25e85d1a38","amp;dn":"Dungeon+of+Cum+-+DoCR+-+Aug+04%2C+2016+-+Julie+Night","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf63002abeaf40c5924516907f5c8a25e85d1a38","infoHashBuffer":{"type":"Buffer","data":[207,99,0,42,190,175,64,197,146,69,22,144,127,92,138,37,232,93,26,56]},"announce":[],"urlList":[]}}