{"title":"Microsoft Office 2013 Multi-Language Proofing Tools SP1 x86-x64","uid":13956277,"size":1147482112,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cf6da5026d88bc7eb4c791aa4269a9f11beb37cd&amp;dn=Microsoft+Office+2013+Multi-Language+Proofing+Tools+SP1+x86-x64+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"jovo_bih","files":1,"time":1458541968,"description":"About this release\r\n\r\nThis ISO compilation includes 52 single Proofing Tools installers for Office 2013 products (x86/x64)\r\n\r\nWorks with: Excel 2013, OneNote 2013, Outlook 2013, PowerPoint 2013, Word 2013\r\n\r\nAvailable for the following languages\r\nArabic, Bulgarian, Basque, Catalan, Chinese (Simplified), Chinese (Traditional), Croatian, Czech, Danish, Dutch, English, Estonian, Finnish, French, Galician, German, Greek, Gujarati, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Kannada, Kazakh, Korean, Latvian, Lithuanian, Malay (Latin), Marathi, Norwegian Bokmål, Norwegian Nynorsk, Polish, Portuguese (Brazil), Portuguese (Portugal), Punjabi (Gurmukhi), Romanian, Russian, Serbian (Cyrillic, Serbia), Serbian (Latin, Serbia), Slovak, Slovenian, Spanish, Swedish, Tamil, Telugu, Thai, Turkish, Ukrainian, Urdu, Vietnamese\r\n\r\nUsage\r\n- Mount / burn / extract\r\n- Install Proofing Tools then apply Service Pack 1, restart Office\r\n- Just use the proofing tools as you normally would - you should now see them for your newly installed langauge. For example, you can set your proofing language to the new language to use spell check (if available.\r\n\r\nAbout Proofing Tools\r\n\r\nDepending on which language you are using, proofing tools can check spelling or grammar, hyphenate text, and look up words in the thesaurus.\r\nYou can switch between proofing tools by selecting a different language for your document.\r\n\r\nSpelling checker\r\nFlags words in a document that may not be spelled correctly and may provide suggested replacements.\r\n\r\nGrammar/Style checker\r\nVerifies written text for grammatical correctness and detects stylistic problems.\r\n\r\nThesaurus\r\nLists synonyms and antonyms of words (if any are available).\r\n\r\nTranslation Dictionaries\r\nAllows you to translate single words or short phrases.\r\n\r\nAutoCorrect List\r\nFixes typos and misspelled words and inserts symbols and other pieces of text.\r\n\r\nHyphenator\r\nAutomatically breaks words at the end of lines and adds hyphens to help justify text within a line.\r\n\r\nContextual Speller\r\nFlags words that are spelled correctly but are not the correct words in the given context.\r\n\r\nPlease seed for a while, thanks !","torrent":{"xt":"urn:btih:cf6da5026d88bc7eb4c791aa4269a9f11beb37cd","amp;dn":"Microsoft+Office+2013+Multi-Language+Proofing+Tools+SP1+x86-x64+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf6da5026d88bc7eb4c791aa4269a9f11beb37cd","infoHashBuffer":{"type":"Buffer","data":[207,109,165,2,109,136,188,126,180,199,145,170,66,105,169,241,27,235,55,205]},"announce":[],"urlList":[]}}