{"title":"White Bird in a Blizzard - Laura Kasischke.epub","uid":10872912,"size":365733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d07bce3384b23d3952bee6c76e9639b39264d074&amp;dn=White+Bird+in+a+Blizzard+-+Laura+Kasischke.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1408980177,"description":"When Katrina Connors' mother walks out on her family, Kat is surprised but not shocked; the whole year she has been &quot;becoming sixteen&quot; - falling in love with the boy next door, shedding her babyfat, discovering sex - her mother has been slowly withdrawing. As Kat and her impassive father pick up the pieces of their daily lives, she finds herself curiously unaffected by her mother's absence. But in dreams that become too real to ignore, she's haunted by her mother's cries for help. Finally, she must act on her instinct that something violent and evil has occurred - a realization that brings Kat to a chilling discovery.\n\nLike SUSPICIOUS RIVER, which The New Yorker described as &quot;by turns terrifying and ravishingly lyrical,&quot; WHITE BIRD BLIZZARD evokes works of Kathryn Harrison and Joyce Carol Oates - and confirms Kasischke's arrival as a major literary talent.\n\nLaura Kasischke's first novel, SUSPICIOUS RIVER, was hailed as &quot;extremely powerful&quot; (The Los Angeles Times) and &quot;amazing...beautifully written&quot; (The Boston Globe). Now Kasischke follows up her auspicious debut with mesmerizing story of youthful passion and loss of innocence.","torrent":{"xt":"urn:btih:d07bce3384b23d3952bee6c76e9639b39264d074","amp;dn":"White+Bird+in+a+Blizzard+-+Laura+Kasischke.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d07bce3384b23d3952bee6c76e9639b39264d074","infoHashBuffer":{"type":"Buffer","data":[208,123,206,51,132,178,61,57,82,190,230,199,110,150,57,179,146,100,208,116]},"announce":[],"urlList":[]}}