{"title":"White Lies - Discography (2008-2013) [FLAC]","uid":8806488,"size":1689960335,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d08033fa28a821b2e4f997e4c19e418f8d0b2eb9&amp;dn=White+Lies+-+Discography+%282008-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"politux","files":-1,"time":1376345067,"description":"\n  White Lies - Discography (2008-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Post-Punk, New Wave, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  EP's\n\n  2008 Unfinished Business\n  2008 Death\n\n  Albums\n\n  2009 To Lose My Life (Japan)\n  2011 Ritual (Japan)\n  2013 Big TV (Deluxe 2CD)\n\n  A dark-edged trio hailing from London, White Lies take sonic cues from the likes of Joy Division, the Teardrop Explodes, and Echo &amp; the Bunnymen. Indeed, the three musicians are so committed to the U.K.'s post-punk scene that they signed with Fiction Records, a Polydor imprint best known for its '80s releases by the Cure and the Associates. While attending school in West London, singer/guitarist Harry McVeigh, bassist/lyricist Charles Cave, and drummer/keyboardist Jack Lawrence-Brown formed the group in 2004 under the name Fear of Flying. After releasing two neo-Brit-pop singles on the Young and Lost Club label in 2006 -- &quot;Routemaster&quot; (produced by Brit-pop mainstay Stephen Street) and &quot;Three's a Crowd&quot; -- the trio changed musical directions, adopted a new name, adapted a more somber group persona, and began creating doomy material like the funereal murder ballad &quot;Unfinished Business&quot; and the self-explanatory &quot;Death.&quot;\n\n  Following the release of the Nick Cave-like &quot;Unfinished Business&quot; in April 2008, the trio made its television debut on Later with Jools Holland and began recording a debut album with producers Ed Buller and Max Dingel. &quot;Death&quot; was released as a single in September 2008, coinciding with the trio's first headlining tour of the U.K. The band released its debut full-length, To Lose My Life..., the following year. The album debuted at number one on the U.K. charts. The band set off on a dizzying world tour, crossing the U.S., Europe, and Japan and hitting major festivals like Lollapalooza, Glastonbury, and Coachella along the way. With such a rigorous touring schedule, the bandmembers found writing difficult, but they eventually made it back into the studio after doing a stadium tour in support of Muse. Finally able to record, White Lies released their second album, Ritual, in early 2011. In 2013, after an extended hiatus from touring and recording, White Lies returned with the Ed Buller-produced Big TV.","torrent":{"xt":"urn:btih:d08033fa28a821b2e4f997e4c19e418f8d0b2eb9","amp;dn":"White+Lies+-+Discography+%282008-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d08033fa28a821b2e4f997e4c19e418f8d0b2eb9","infoHashBuffer":{"type":"Buffer","data":[208,128,51,250,40,168,33,178,228,249,151,228,193,158,65,143,141,11,46,185]},"announce":[],"urlList":[]}}