{"title":"Mutekki Media Vengeance Effects Volume 2","uid":4142226,"size":565308551,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:d25b2075384f8d5750c94cc30a6be4de8e251b42&amp;dn=Mutekki+Media+Vengeance+Effects+Volume+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"Mr-DJ","files":40,"time":1208548449,"description":"More than 750 high quality FX sounds &amp; loops for all kinds of modern dance music!\n\nVengeance Essential Club Sounds 2 from Mutekki Media feautures over 2,500 samples \nfor Trance, Techno, Hardstyle, Hands Up and Italo Dance\nVengeance Essential Club Sounds Volume 2 also includes samples suitable for Breakbeat,\nMinimal, Techhouse and Progressive Dance. Besides kicks, claps, fx, loops, synths, \nsnares, you\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;ll also find some quirky acid sounds, a fascinating human beatbox, bass\nsounds and much more. Click the Listen Now button on the left to get a preview of\nthis product\nWhat\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s included in Essential Club Sounds 2?\n\nIncludes over 650 MB of first class club and dance oriented drums and sounds as\nwell as diverse FX and loops, that can take your production to a higher level.\nThe material has been programmed according to the dance genre and is adaptable\nin the range of 120 to 150 BPM (beats per minute). If you write either house,\ntrance or techno then this product is like the name suggests, essential!\nAbout Manuel Schleis and Manuel Reuter - Producers of the Vengeance Series\n\nThe Vengeance Sample CD Series is produced by much respected and loved German\nproducers, Manuel Schleis and Manuel Reuter. Manuel Schleis is not just a Sample\nCD creator; his house, trance and techno synthesizer patches are amongst the best\nin the world. Furthermore, he has written synthesizer factory presets for companies\nsuch as Roland, Access, Waldorf &amp; reFX. His partner, Manuel Reuter, is likewise an \nactive and successful producer, and he is behind projects such as DJ Manian, Yanou, \nCascada and Plazmatek. Apart from that they have also been engaged to deliver remix \nworks for well known chart acts as the likes of Groove Coverage, 4 Strings, Pulsedriver\nand Klubbingman. You are in safe hands here!\n\n\nSize: 550 MB\nUnpacks to about 777 MB\n.bin file","torrent":{"xt":"urn:btih:d25b2075384f8d5750c94cc30a6be4de8e251b42","amp;dn":"Mutekki+Media+Vengeance+Effects+Volume+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d25b2075384f8d5750c94cc30a6be4de8e251b42","infoHashBuffer":{"type":"Buffer","data":[210,91,32,117,56,79,141,87,80,201,76,195,10,107,228,222,142,37,27,66]},"announce":[],"urlList":[]}}