{"title":"Mastering Autodesk Revit Architecture 2014 - James Vandezande, E","uid":8729555,"size":102086534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d26459fc311cadf8ba847d289af7f16fb731bf86&amp;dn=Mastering+Autodesk+Revit+Architecture+2014+-+James+Vandezande%2C+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"Ehhhhtozebec","files":-1,"time":1374567166,"description":"\nOverview\n\nLearn Revit Architecture with expert instruction from this Autodesk Official Press guide\n\nThe new edition of this bestselling Revit book is the most useful and approachable Mastering Revit Architecture yet. Thoroughly revised and updated, this comprehensive guide to Autodesk's industry-leading building information modeling (BIM) software features in-depth explanations, real-world examples, and practical tutorials help you grasp crucial tools, techniques, and concepts so you can quickly start doing real work in Revit. You will learn core BIM concepts and best practices for everything from putting together impressive building designs to producing solid documentation, creating visualizations that impress clients, and more. Hands-on exercises with downloadable before-and-after files provide plenty of opportunities to practice the real-world scenarios and hone all the crucial Revit skills.\n\n    Explains the user interface, general concepts, best practices, and new features of Revit 2014\n    Teaches modeling, massing, and visualization with Revit\n    Helps users develop extended modeling skills for walls, stairs, floors, and more\n    Features detailed documentation and presentation techniques\n    Provides detailed instruction, step-by-step tutorials, and numerous examples\n    Includes downloadable starting and ending files and additional advanced content\n    Offers information to help readers prepare for Autodesk's certification exams\n\nThis detailed reference and tutorial is the perfect resource for becoming an expert with Autodesk's powerful BIM software.\n\n\nProduct Details\n\n    ISBN-13: 9781118521304\n    Publisher: Wiley, John &amp; Sons, Incorporated\n    Publication date: 6/4/2013\n    Edition number: 1\n    Pages: 1008\n\n\nMeet the Author\n\nJames Vandezande is a registered architect and Principal at HOK, where he is one of the company's BIM leaders. James is also a cofounder of the New York City Revit Users Group and teaches Revit as an adjunct lecturing professor at NYU. Eddy Krygiel is an Autodesk Authorized Author and registered architect at HNTB Architects, where he implements BIM and has used Revit to complete projects of all sizes. Connect with James and Eddy at the popular Mastering Revit page on Facebook. Phil Read is the founder of Arch Tech, as well as one of the driving forces behind the original Revit software. He's an avid blogger and a popular speaker at Autodesk University and currently works at an AEC-related technology startup.\n","torrent":{"xt":"urn:btih:d26459fc311cadf8ba847d289af7f16fb731bf86","amp;dn":"Mastering+Autodesk+Revit+Architecture+2014+-+James+Vandezande%2C+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d26459fc311cadf8ba847d289af7f16fb731bf86","infoHashBuffer":{"type":"Buffer","data":[210,100,89,252,49,28,173,248,186,132,125,40,154,247,241,111,183,49,191,134]},"announce":[],"urlList":[]}}