{"title":"The Acts of King Arthur and His Noble Knights","uid":15789323,"size":1718248,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3345c1457296068b91131d03118ddf15e8b2aee&amp;dn=The+Acts+of+King+Arthur+and+His+Noble+Knights&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"marty14","files":1,"time":1473370851,"description":"The Acts of King Arthur and His Noble Knights - John Steinbeck [epub]\r\n\r\nMalory’s Le Morte d’Arthur was the first book that John Steinbeck truly enjoyed reading as a child. Fascinated by Arthurian tales of adventure, knighthood, honor and friendship, in addition to the challenging nuances of the original Anglo-Saxon language, Steinbeck set out to render these stories faithfully and with keen animation for a modern audience. Here then is Steinbeck’s modernization of the adventure of King Arthur and the Knights of the Round Table, featuring the icons of Arthurian legend—including King Arthur, Merlin, Morgan le Fay, the incomparable Queen Guinevere, and Arthur's purest knight, Sir Lancelot of the Lake.\r\n \r\nThese enduring tales of loyalty and betrayal in the time of Camelot flicker with the wonder and magic of an era past but not forgotten. Steinbeck's retelling will capture the attention and imagination of legions of Steinbeck fans, including those who love Arthurian romances, as well as countless readers of science fiction and fantasy literature","torrent":{"xt":"urn:btih:d3345c1457296068b91131d03118ddf15e8b2aee","amp;dn":"The+Acts+of+King+Arthur+and+His+Noble+Knights","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3345c1457296068b91131d03118ddf15e8b2aee","infoHashBuffer":{"type":"Buffer","data":[211,52,92,20,87,41,96,104,185,17,49,208,49,24,221,241,94,139,42,238]},"announce":[],"urlList":[]}}