{"title":"CCGHQ MTG HQ Pics Complete through M14 October 27, 2013","uid":9105371,"size":16657032646,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:d35cbb070893e41df88c39db99f6cc869e7eb882&amp;dn=CCGHQ+MTG+HQ+Pics+Complete+through+M14+October+27%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":4,"uploader":"Huggybaby","files":-1,"time":1382854985,"description":"From the CCGHQ Team at http://www.slightlymagic.net/forum/\n\nMagic the Gathering High Quality Pics Complete through M14 (This is the first release: it's missing some promos and other ancillaries).\n\nOh yes, there's some missing, but that will be fixed, I assure you, but there's a lot of good stuff here too, more than you will find anywhere else. \n\nThe last Complete Pics torrent, which is still available and seeded here at TPB, stopped at 10E, and was released November 12, 2007, pretty much six years ago. It was 3 GB and had 93 Fulls sets.\n\nA lot has changed since then.\n\nThis torrent stops at M14, has 113 sets in the Fulls folder (and that's with quite a few missing!), and is 15.5 GB in size, over five times bigger.\n\nIt includes the Tiny Crops for excellent performance on portable devices, XLHQs for 1080P HD monitors, and some 4KHQs (our new standard for 4K monitors) for good measure. All these are new, compared to six years ago anyway.\n\nPlease download this new torrent, take a look, go to the forum and tell me what I've left out. If YOU don't tell me, I won't be able to fix it.\n\nThe sets in this torrent have been completed, corrected, spell checked, new sizes and naming standards created...well, let's just say there's stuff here that you won't get anywhere else, guaranteed, because we  don't mirror these sets, and we don't create them to merely MIMIC our previous standards (with lesser quality); we ORIGINATE  them to the highest standard, a standard we have created and refined over the years, and with error checking no one else does or is able to.\n\nLook forward to the update, but until then, I guarantee you'll find no better collection.","torrent":{"xt":"urn:btih:d35cbb070893e41df88c39db99f6cc869e7eb882","amp;dn":"CCGHQ+MTG+HQ+Pics+Complete+through+M14+October+27%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35cbb070893e41df88c39db99f6cc869e7eb882","infoHashBuffer":{"type":"Buffer","data":[211,92,187,7,8,147,228,29,248,140,57,219,153,246,204,134,158,126,184,130]},"announce":[],"urlList":[]}}