{"title":"Fleetwood Mac - Rumours (1977) 2011 HDTracks 24-96-FLAC","uid":11014851,"size":873019037,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d3750d5c037be0b5d46af69fd40ff7baaddcf9d4&amp;dn=Fleetwood+Mac+-+Rumours+%281977%29+2011+HDTracks+24-96-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"hal4000","files":-1,"time":1410452947,"description":"While most bands undergo a number of changes over the course of their careers, few groups experienced such radical stylistic changes as Fleetwood Mac. Initially conceived as a hard-edged British blues combo in the late '60s, the band gradually evolved into a polished pop/rock act over the course of a decade. Throughout all of their incarnations, the only consistent members of Fleetwood Mac were drummer Mick Fleetwood and bassist John McVie -- the rhythm section that provided the band with its name. Ironically, they had the least influence over the musical direction of the band. Originally, guitarists Peter Green and Jeremy Spencer provided the band with its gutsy, neo-psychedelic blues-rock sound, but as both guitarists descended into mental illness, the group began moving toward pop/rock with the songwriting of pianist Christine McVie. By the mid-'70s, Fleetwood Mac had relocated to California, where they added the soft rock duo of Lindsey Buckingham and Stevie Nicks to their lineup. Obsessed with the meticulously arranged pop of the Beach Boys and the Beatles, Buckingham helped the band become one of the most popular groups of the late '70s. Combining soft rock with the confessional introspection of singer/songwriters, Fleetwood Mac created a slick but emotional sound that helped 1977's Rumours become one of the biggest-selling albums of all time. The band retained its popularity through the early '80s, when Buckingham, Nicks, and Christine McVie all began pursuing solo careers. The band reunited for one album, 1987's Tango in the Night, before splintering in the late '80s. Buckingham left the group initially, but the band decided to soldier on, releasing one other album before Nicks and McVie left the band in the early '90s, hastening the group's commercial decline. \n\nRumours is the kind of album that transcends its origins and reputation, entering the realm of legend -- it's an album that simply exists outside of criticism and outside of its time, even if it thoroughly captures its era. Prior to this LP, Fleetwood Mac were moderately successful, but here they turned into a full-fledged phenomenon, with Rumours becoming the biggest-selling pop album to date. While its chart success was historic, much of the legend surrounding the record is born from the group's internal turmoil. Unlike most bands, Fleetwood Mac in the mid-'70s were professionally and romantically intertwined, with no less than two couples in the band, but as their professional career took off, the personal side unraveled. Bassist John McVie and his keyboardist/singer wife Christine McVie filed for divorce as guitarist/vocalist Lindsey Buckingham and vocalist Stevie Nicks split, with Stevie running to drummer Mick Fleetwood, unbeknown to the rest of the band. These personal tensions fueled nearly every song on Rumours, which makes listening to the album a nearly voyeuristic experience. You're eavesdropping on the bandmates singing painful truths about each other, spreading nasty lies and rumors and wallowing in their grief, all in the presence of the person who caused the heartache. Everybody loves gawking at a good public breakup, but if that was all that it took to sell a record, Richard and Linda Thompson's Shoot Out the Lights would be multi-platinum. No, what made Rumours an unparalleled blockbuster is the quality of the music. Once again masterminded by producer/songwriter/guitarist Buckingham, Rumours is an exceptionally musical piece of work -- he toughens Christine McVie and softens Nicks, adding weird turns to accessibly melodic works, which gives the universal themes of the songs haunting resonance. It also cloaks the raw emotion of the lyrics in deceptively palatable arrangements that made a tune as wrecked and tortured as &quot;Go Your Own Way&quot; an anthemic hit. But that's what makes Rumours such an enduring achievement -- it turns private pain into something universal. Some of these songs may be too familiar, whether through their repeated exposure on FM radio or their use in presidential campaigns, but in the context of the album, each tune, each phrase regains its raw, immediate emotional power -- which is why Rumours touched a nerve upon its 1977 release, and has since transcended its era to be one of the greatest, most compelling pop albums of all time.\n\nHDTracks PCM-24Bit-96Khz.","torrent":{"xt":"urn:btih:d3750d5c037be0b5d46af69fd40ff7baaddcf9d4","amp;dn":"Fleetwood+Mac+-+Rumours+%281977%29+2011+HDTracks+24-96-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3750d5c037be0b5d46af69fd40ff7baaddcf9d4","infoHashBuffer":{"type":"Buffer","data":[211,117,13,92,3,123,224,181,212,106,246,159,212,15,247,186,173,220,249,212]},"announce":[],"urlList":[]}}