{"title":"Speaker Knockerz-2014-Married To The Money II","uid":9730272,"size":40222814,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d39a71b94e27624eb5c0f7b9a657cd2069d81e3a&amp;dn=Speaker+Knockerz-2014-Married+To+The+Money+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"yabrokehomie","files":-1,"time":1394324662,"description":"Speaker Knockerz-2014-Married To The Money II\n\nGenre: Rap \n\nOriginal Release Date: Unreleased\n\nLabel: Talibandz Entertainment\n\n\n\n\n\nTrack Listing:\n\n\n01 - Don't Know\n02 - On My Mind\n03 - Lonely\n04 - Dap You Up\n05 - Pass Em (Fet. Teddy Ted)\n06 - Erica Kane\n07 - Rico Story (Trilogy)\n\n\n\n\n \nBio:\n \n Underground South Carolina rapper/producer, Speaker Knockerz (born Derek McAllister) was pronounced dead on March 6,2014 at the young age of 19. Missing two days prior to his death, he was then found in the garage of his South Carolina home. Although an autopsy revealed no signs of trauma and his death appears to be the result of a heart attack. County officers are still investigating the cause of his death as they await toxicology reports for final disposition in the case.\n\n Soon after his death, fans took part in having the hashtag #RIPSPEAKERKNOCKERZ trend on the social media twitter. The 19-year old spitter wasn't signed to a major record label, but his YouTube page includes some 53 videos, including &quot;Lonely&quot; and &quot;Rico Story (Trilogy),&quot; which have been viewed by underground rap fans 1,977,235 and 3,152,684 times, respectively.\n\n At the time of his passing, he had 49 downloadable tracks available for sale on iTunes.\n\n On his latest single, &quot;Dap You Up,&quot; posted online just over a month ago, Knockerz shows his lyrical dexterity over a beat that he produced himself. With lines like, &quot;Got all this ice on my muf---kin watch, I think he mad cause I'm winning and he not/You rappers hot, you better thank Mr. Guwop/ Go steal his flow 'cause if you don't yo sh-- gone flop,&quot; it's evident that Knockerz was no hip-hop neophyte on the mic.\n\n\n\n A Mournful ending for a young man with a bright future. My condolences are sent to the family of the teenager. Rest In Peace Derek ( Speaker Knockerz ) McAllister. Gone but never forgotten.\n\n\n\nENJOY &amp; SEED\n\n \nIf you like Speaker Knockerz, then please buy his music. Please, support the artists you like. This is years of blood, sweat and tears. Leave a comment &amp; rate this download &amp; please seed. This takes a lot of time &amp; effort. I cant do it all myself.","torrent":{"xt":"urn:btih:d39a71b94e27624eb5c0f7b9a657cd2069d81e3a","amp;dn":"Speaker+Knockerz-2014-Married+To+The+Money+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d39a71b94e27624eb5c0f7b9a657cd2069d81e3a","infoHashBuffer":{"type":"Buffer","data":[211,154,113,185,78,39,98,78,181,192,247,185,166,87,205,32,105,216,30,58]},"announce":[],"urlList":[]}}