{"title":"Dragonball Xenoverse Multi9 GameReady 3-2-PLAY","uid":11728723,"size":4941611696,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d3cdc48def83504fc8a99217e25f1dc8c77259f4&amp;dn=Dragonball+Xenoverse+Multi9+GameReady+3-2-PLAY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":5,"uploader":"globeplus","files":17,"time":1425203218,"description":"HI MY REGARDS TO ALL THE NEW NICE PC GAMES FANS ...\n\n\n\nTHIS FILE IS GAMEREADY... AFTER DOWNLOAD NO EXTRACTION OR INSTALLATION IS NEEDED TO START PLAYING ...\n\n\nMULTI9 WITH A BUILT-IN LANGUAGE SELECTOR TO FACILITATE THE CHANGING OF THE LANGUAGE ...\n\n\nCOMPLETLY PORTABLE TO THE MACHINE, DISCS, EXTERNAL HARD DRIVES OR USB ...\n\n\nIN CASE OF NEEDED SOME MORE SPACE TO RECORD IN A 4.7 GB DISC OR TO HAVE IN A NOT TOO MUCH SIZE USB PEN DRIVE , JUST 7ZIP-IT OR ARC-IT TO GET EXTRA 600 OR 700 MEGA LESS SIZE ... IS UP TO YOU ...\nI PREFERED LEAVE IT LIKE THIS BECAUSE WASNÂ´T SO MUCH COMPRESSION AS THAT FOR A 4.6 GB FILE AND THE GAME IS READY TO GO BUT THAT OPTION STILL AVAILABLE DEPENDING ON THE USER NEEDS ...\n\n\n\nGameplay\n\n\nThe game is set in full 3D destructible environments. Fighters can traverse the levels free-roaming in very large spaces and can be fighting on a platform, go in the air, and fight underwater. They run when on the ground, and swim while underwater. XenoVerse has dialogue while fights go on, and fighters show facial expressions when they strike an opponent or take damage. The players have some freedom to explore the planet Earth as it exists in the Dragon Ball universe along with a handful of other locations, including a mysterious new city, now revealed as Toki-Toki City, which is the point of origin for the game's new character. XenoVerse is also the third Dragon Ball game to feature character creation, the first being Dragon Ball Online and the second being Dragon Ball Z: Ultimate Tenkaichi.\n\nThe game's new character is confirmed to be a player created character. With the character customization, players will now be able to customize their character's race, gender, head, build, voice, and clothing. You can also change the pitch and add voice effects to the character's voice. Voice effects include flanger, harmonizer, echo, and tremolo. These effects can be tweaked to the player's liking and more than one can be applied to the voice. Players can create characters from multiple races, with the ones available being Saiyans, Namekians, Earthlings, Majins and Frieza's currently unnamed race. Players will be able to visit the futuristic Toki-Toki City, meet up with other players and take on cooperative, time-traveling missions.\n\nThe PC, PS4, and Xbox One versions of Dragon Ball XenoVerse also include unique gameplay features proper to this generation of consoles such as improved graphics. Players can also become apprentices of the original Dragon Ball anime characters to equip over 200 special moves and 450 costume items. As reported by ShonenGameZ, an Amazon Japan posting for the guide revealed that there will be at least 47 playable characters. There will be 12 Master Quests, 50 Parallel Quests, 200 skills and 400 pieces of equipment to choose from according to the guide. Players also have the option to equip varying types of the Ki Charge Ability, but at the cost of a Super slot. Additionally, Vegeta uses an alternate version of Super Saiyan and Super Saiyan 2, called Super Vegeta and Super Vegeta 2 respectively, which will mainly affect the user's Ki Blast stat instead of Melee. Custom Saiyans will also be able to use this special.\n\n\n* enjoy","torrent":{"xt":"urn:btih:d3cdc48def83504fc8a99217e25f1dc8c77259f4","amp;dn":"Dragonball+Xenoverse+Multi9+GameReady+3-2-PLAY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3cdc48def83504fc8a99217e25f1dc8c77259f4","infoHashBuffer":{"type":"Buffer","data":[211,205,196,141,239,131,80,79,200,169,146,23,226,95,29,200,199,114,89,244]},"announce":[],"urlList":[]}}