{"title":"Oz - The Entire DVD Box Set (1997-2003) [Rinzler]","uid":6479460,"size":36681001139,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d3f770f6ad6c492520a5cea9d303294ed19e0598&amp;dn=Oz+-+The+Entire+DVD+Box+Set+%281997-2003%29+%5BRinzler%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":9,"uploader":"Rinzler","files":-1,"time":1308443887,"description":"An HBO Original Series\n\nCast: Christopher Meloni, Ernie Hudson, Adewale Akinnuoye-Agbaje, Harold Perrineau Jr., Eamonn Walker, Rita Moreno, John Lurie, Terry Kinney, Betty Buckley, Kathryn Erbe, Lee Tergesen, B. D. Wong, J. K. Simmons, Dean Winters, Scott William Winters, Kirk Acevedo, Erik King, Evan Seinfeld, David Zayas, Lauren V lez, and Edie Falco.\n\nOz chronicles life inside an experimental cell block in the Oswald Maximum Security Correctional Facility: Level Four called Emerald City. Under unit manager Tim McManus and Warden Leo Glynn, the inmates in Em City all struggle to fulfill their own needs. Some fight for power; either power over the drug trade or power over the other inmate factions. Others want money, either through slinging 'tits' (drugs), gambling or other scams. Others, Corrections officers and inmates alike, simply want to survive long enough to make parole or even to see tomorrow. The show gives a no-holds-barred account of prison life with all the plots, subplots and conflicts given context and explaination by the show's wheelchair-bound narrator, Augustus Hill.\n-\nEach episode is ripped in .AVI format from NTSC DVD's and in English only. No subtitles. Overall excellent quality. Please seed and share!\n\n-\n\nRinzler.tk","torrent":{"xt":"urn:btih:d3f770f6ad6c492520a5cea9d303294ed19e0598","amp;dn":"Oz+-+The+Entire+DVD+Box+Set+%281997-2003%29+%5BRinzler%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3f770f6ad6c492520a5cea9d303294ed19e0598","infoHashBuffer":{"type":"Buffer","data":[211,247,112,246,173,108,73,37,32,165,206,169,211,3,41,78,209,158,5,152]},"announce":[],"urlList":[]}}