{"title":"Ben's BBQ Bible The ultimate cook's companion by Ben O'Donoghue","uid":9387526,"size":9135468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4372a9a13768f6176d4ab7d84ab03812a0533dd&amp;dn=Ben%27s+BBQ+Bible+The+ultimate+cook%27s+companion+by+Ben+O%27Donoghue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"420weedman","files":6,"time":1387824029,"description":"This book is a compendium of Ben's classic barbecue recipes with an additional 40 brand-new recipes and entirely brand-new photography! Throw away the sausages and chops and be inspired by celebrity Australian chef Ben O'Donoghue's exciting world of barbecued food.\nBen's recipes cover everything from juicy meats like Mexican suckling pig, Singapore chilli crab, Moreton Bay bugs with figs and pancetta kebabs to succulent vegetarian dishes like Artichokes with lemon, honey, thyme and almond or Grilled Haloumi with lemon and mint - you'll have your friends talking about your barbecue for years. Whether your pride and joy is a simple wire rack over an open fire, an everyday kettle barbecue or a gas-fired hotplate with all the bells and whistles, the recipes can be cooked on any equipment. In this compendium you'll also find the best drinks and desserts to accompany your meal, along with recipes for all the rubs and marinades, breads, salads and vegetables you'll ever need to make your barbecues the best in the neighbourhood.\nGenre: Non Fiction , Cooking","torrent":{"xt":"urn:btih:d4372a9a13768f6176d4ab7d84ab03812a0533dd","amp;dn":"Ben%27s+BBQ+Bible+The+ultimate+cook%27s+companion+by+Ben+O%27Donoghue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4372a9a13768f6176d4ab7d84ab03812a0533dd","infoHashBuffer":{"type":"Buffer","data":[212,55,42,154,19,118,143,97,118,212,171,125,132,171,3,129,42,5,51,221]},"announce":[],"urlList":[]}}