{"title":"Radiohead Complete Studio Discography [FLAC]","uid":7873089,"size":2843182863,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d59dc193a7aff8fdd0e7496bc4549c658a105fad&amp;dn=Radiohead+Complete+Studio+Discography+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"rudown78","files":208,"time":1354268689,"description":"Radiohead Complete Studio Discography\n\n\nRadiohead are an English rock band from Abingdon, Oxfordshire, formed in 1985. The band consists of Thom Yorke (lead vocals, guitar, piano), Jonny Greenwood (lead guitar, keyboards, other instruments), Colin Greenwood (bass), Phil Selway (drums, percussion) and Ed O'Brien (guitar, backing vocals).\n\nRadiohead released their debut single &quot;Creep&quot; in 1992. The song was initially unsuccessful, but it became a worldwide hit several months after the release of their debut album, Pablo Honey (1993). Radiohead's popularity rose in the United Kingdom with the release of their second album, The Bends (1995). Radiohead's third album, OK Computer (1997), propelled them to greater international fame. Featuring an expansive sound and themes of modern alienation, OK Computer is often acclaimed as one of the landmark records of the 1990s.\n\nKid A (2000) and Amnesiac (2001) marked an evolution in Radiohead's musical style, as the group incorporated experimental electronic music, krautrock and jazz influences. Kid A, though somewhat polarising at the time of its release, is now frequently recognised as one of the most important albums of the 2000s. Hail to the Thief (2003), a mix of piano and guitar driven rock, electronics and lyrics inspired by war, was the band's final album for their major record label, EMI. Radiohead self-released their seventh album, In Rainbows (2007), as a digital download for which customers could set their own price, and later in physical form to critical and chart success. Radiohead's eighth album, The King of Limbs (2011), was an exploration of rhythm and quieter textures, which the band released independently.\n\nRadiohead have sold more than 30 million albums worldwide, with the band's work being placed highly in both listener polls and critics' lists, they have the distinction of doing so in both the 1990s and 2000s. In 2005, Radiohead were ranked number 73 in Rolling Stone's list of &quot;The Greatest Artists of All Time&quot;, while Jonny Greenwood and Ed O'Brien were both included in Rolling Stone's list of greatest guitarists, and Thom Yorke in their list of greatest singers. In 2009, Rolling Stone readers voted the group the second best artist of the 2000s.\n\n\nPablo Honey (1993)\n\nThe Bends (1995)\n\nOK Computer (1997)\n\nKid A (2000)\n\nAmnesiac (2001)\n\nHail to the Thief (2003)\n\nIn Rainbows (2007)\n\nThe King of Limbs (2011)\n\n\nAll of the album artwork is included as well. Enjoy!","torrent":{"xt":"urn:btih:d59dc193a7aff8fdd0e7496bc4549c658a105fad","amp;dn":"Radiohead+Complete+Studio+Discography+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d59dc193a7aff8fdd0e7496bc4549c658a105fad","infoHashBuffer":{"type":"Buffer","data":[213,157,193,147,167,175,248,253,208,231,73,107,196,84,156,101,138,16,95,173]},"announce":[],"urlList":[]}}