{"title":"Anime Music Collection!","uid":8520950,"size":2529486022,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d676de20d4546a23f043d51f21d8005922139759&amp;dn=Anime+Music+Collection%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":3,"uploader":"moonspeak","files":263,"time":1369873512,"description":"Hello, please read to avoid Downloading the same files twice. :)\n\n\nEvery month (so far) i've been uploading my anime/japanese music for you to listen to!\n\nWhen i upload the newest month, i include all the previous months IN the torrent file to avoid them dying out on me.\nSo you don't have to worry about missing a month cuz they're all in one place!\nSo here is how you download the new month WITHOUT downloading the previous months (assuming) you have :P\n\n\n- When you open the torrent file in bit/utorrent or W/e you use. untick the previous months that you already have and begin download!\n\n\n- if you don't get an option to choose what folders to download, here is how you turn it on!\n\n- Go to options and choose preferences and go to the tab &quot;UI Settings&quot;\n- You have to tick the option that says &quot;Show a window that displays the files inside the torrent&quot; Apply and OK\n- Now remove the torrent and re-add the torrent, now the display will show and choose your months!\n- (optional) lastly go to thepiratebay ORand thank me in the comments ^^\n\n \n\ncheck back every few months for new tracks!!\n\n\n- note!\n\nThe list is entirely subjective, i only add music I like to my collection.. so if you're into the chipmonk/high pitch japanese music this torrent ain't for you :p\n\n\n-changelog\n\n35 new tunes added june","torrent":{"xt":"urn:btih:d676de20d4546a23f043d51f21d8005922139759","amp;dn":"Anime+Music+Collection%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d676de20d4546a23f043d51f21d8005922139759","infoHashBuffer":{"type":"Buffer","data":[214,118,222,32,212,84,106,35,240,67,213,31,33,216,0,89,34,19,151,89]},"announce":[],"urlList":[]}}