{"title":"The Great Pierpont Morgan: A Biography","uid":16044779,"size":605634,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d679d586a1da23f41eb51f237b4d0b71859f6f22&amp;dn=The+Great+Pierpont+Morgan%3A+A+Biography&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"marty14","files":1,"time":1476552742,"description":"The Great Pierpont Morgan: A Biography - Frederick Lewis Allen [epub]\r\n\r\nCelebrated as a titan of industry by some and decried as a monopolizing robber baron by others, John Pierpont Morgan was without a doubt a dominant player in American finance at the turn of the twentieth century. He founded U.S. Steel, a conglomeration of leading steel and iron producers, which was the nation’s largest coast-to-coast railroad system, and the first company to be worth more than $1 billion.\r\n \r\nMorgan was also instrumental in developing the Federal Reserve after working with political leaders to prevent a potentially devastating fiscal crisis in 1907. Indeed, he was a driving force in the modernization of American business, and the effects of his acumen and foresight continue to resonate today—on Wall Street and beyond.\r\n \r\nAdditionally, known for his displays of wealth and power, Morgan was a prominent figure of the New York society scene—a member of the original one percent—as well as a notable art connoisseur with a sizable collection now housed in Manhattan’s lavish Morgan Library &amp; Museum, once his own private library.\r\n \r\nIn this meticulously researched and comprehensive biography, Frederick Lewis Allen, former editor of Harper’s magazine and author of Only Yesterday, delves into the life and character of a fascinating, multidimensional man. Allen also probes the evolution of the business landscape during Morgan’s lifetime, when giant corporations with unparalleled economies of scale began to absorb and replace smaller competitors","torrent":{"xt":"urn:btih:d679d586a1da23f41eb51f237b4d0b71859f6f22","amp;dn":"The+Great+Pierpont+Morgan%3A+A+Biography","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d679d586a1da23f41eb51f237b4d0b71859f6f22","infoHashBuffer":{"type":"Buffer","data":[214,121,213,134,161,218,35,244,30,181,31,35,123,77,11,113,133,159,111,34]},"announce":[],"urlList":[]}}