{"title":"Houndmouth - From the Hills Below the City (2013) [FLAC]","uid":8546917,"size":298716336,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d6a1823424b13054e9e4223c3ae622d545c0a958&amp;dn=Houndmouth+-+From+the+Hills+Below+the+City+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"politux","files":-1,"time":1370546882,"description":"\n  Houndmouth - From the Hills Below the City (2013) [FLAC]\n\n  Released: 2013\n  Duration: 41:41\n  Genre: Country, Folk\n  Styles: Alternative Folk, Americana, Country-Folk\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 On The Road \n  02 Come On Illinois\n  03 Penitentiary \n  04 Casino (Bad Things)\n  05 Ludlow\n  06 Hey Rose \n  07 Krampus \n  08 Long As You're At Home \n  09 Houston Train \n  10 Halfway To Hardinsburg \n  11 Comin' Round Again \n  12 Palmyra\n  \n  Hailing from New Albany, Indiana, a town neighboring Louisville, young band Houndmouth make their debut on the meticulously produced From the Hills Below the City. The album's 12 songs find Houndmouth, composed of just four musicians, putting out a passionate and explosively large sound, revisiting bygone themes through both the down-home holler of heartland Americana and some well-schooled rock musicianship. One of the first things that sticks out about the group is the urgent singing of all four members, often backing each other up as one member takes the lead. Opening track &quot;On the Road&quot; finds vocalists Katie Toupin and Matt Myers in a spirited duet not too far off from the lovers-on-the-run anthems of Edward Sharpe &amp; the Magnetic Zeros or the dustbowl nostalgia of the Lumineers, who Houndmouth have toured with at times. This song, much like the rest of the album, builds subtly and seamlessly, with supportive organ textures and tambourine showing up just in the nick of time for the brief tune's brilliant summit. The by-the-numbers production goes hand in hand with the bandmembers' tailored playing and thickly stylized vocals, hitting all the marks of emphatic country-enamored rock on tracks like the Toupin-fronted &quot;Houston Train,&quot; a tale of being strung out, riding the hard-luck rails. \n\n  There's plenty of Great Depression-era imagery throughout From the Hills Below the City, with signifiers like coal mines, riverboats, wartime rations, and random names of Southern towns making up the lyrical content for most songs. In its best moments, the album taps into an imagined nostalgia at the same time it grabs some of the weary rock &amp; roll grit that made up greasy classics like Exile on Main St. and Neil Young's Tonight's the Night. However, those records were full of murky moods, glaring mistakes, and a very real mania. Houndmouth's take on rocking Americana is scrubbed clean and flawlessly rehearsed, and comes off as more of an affectation than anything visceral. The sounds are inoffensive and reeled in completely, and as the band spins a would-be devious tale of cocaine running and swarthy bar fights on &quot;Comin' Around Again,&quot; it sounds harmless. The production, playing, and singing are the work of clearly talented folks, but 12 songs of this safe and manicured take on fiery music quickly drag. While those already predisposed to the romantic notions of early American iconography in new rock will adore Houndmouth, many listeners will be left with a few hooky -- if hollow -- songs.","torrent":{"xt":"urn:btih:d6a1823424b13054e9e4223c3ae622d545c0a958","amp;dn":"Houndmouth+-+From+the+Hills+Below+the+City+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a1823424b13054e9e4223c3ae622d545c0a958","infoHashBuffer":{"type":"Buffer","data":[214,161,130,52,36,177,48,84,233,228,34,60,58,230,34,213,69,192,169,88]},"announce":[],"urlList":[]}}