{"title":"Star Trek TOS complete Remaster (Chromecast) x264/aac MP4","uid":10083070,"size":23442469634,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d795047b22d971b629cda3d0a7db08eb704a2c08&amp;dn=Star+Trek+TOS+complete+Remaster+%28Chromecast%29+x264%2Faac+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":19,"uploader":"kromekast","files":-1,"time":1399045513,"description":"Complete Remastered (2004) collection of the 1966-1969 original Star Trek TV series converted from AVI/XVID to Chromecast-compatible H264/AAC MP4 files.\n\nTo make it easier to play some of my favorite TV series on Google Chromecast, I decided to batch convert my AVI files to more robust and efficient H264 encoded MP4 files. This is much better than jumping through hoops with problem-prone &quot;transcoding&quot;. Converted files are 30% smaller without noticeable loss in quality.\n\n--- Video code: H264 --- Audio codec: AAC (m4a) 48000\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0060028/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0060028/&lt;/a&gt;\nhttp://www.tvrage.com/Star_Trek\n\nIMDB:\n\nThe adventures of the USS Enterprise, representing the United Federation of Planets on a five-year mission in outer space to explore new worlds, seek new life and new civilizations, and to boldly go where no man has gone before.\n\nThe Enterprise is commanded by handsome and brash Captain James T. Kirk. His First Officer and best friend is Mr. Spock from the planet Vulcan, and Kirk's Medical Officer is Dr. Leonard &quot;Bones&quot; McCoy. With its crew of approximately 430, the Enterprise battles aliens, megalomanical computers, time paradoxes, psychotic murderers, and even Genghis Khan!\n\nTV Rage:\n\nThe series premiered on NBC on Thursday, September 8, 1966 in the 8:30-9:30 PM time slot with the episode &quot;The Man Trap.&quot; Both of the pilots were originally aired, although &quot;The Cage&quot; was restructured as a flashback episode of sorts in the two-parter &quot;The Menagerie.&quot;\n\nThe show never received high ratings but gathered a small but devoted fan following. NBC considered canceling the series in its second year but a letter-writing campaign purportedly saved it. However, NBC moved the series to a later Friday night time slot and Roddenberry left his position as executive producer in protest.\n\nSince then Star Trek has run almost continuously in syndication and has inspired an animated series, six feature films, and four additional spin-off television shows as of 2012. The show has spawned a huge amount of merchandise, including novels, comic books, memorabilia, and games. Fans have created vast amount of fan fiction and even low-budget web episodes, some involving original creators. Despite its short network run, Star Trek has become one of the most successful shows in television history.","torrent":{"xt":"urn:btih:d795047b22d971b629cda3d0a7db08eb704a2c08","amp;dn":"Star+Trek+TOS+complete+Remaster+%28Chromecast%29+x264%2Faac+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d795047b22d971b629cda3d0a7db08eb704a2c08","infoHashBuffer":{"type":"Buffer","data":[215,149,4,123,34,217,113,182,41,205,163,208,167,219,8,235,112,74,44,8]},"announce":[],"urlList":[]}}