{"title":"The Gun Club - Fire of Love","uid":3323747,"size":57721696,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d7aa455aa9b5fd8e994923991e44c4ab2cd9f533&amp;dn=The+Gun+Club+-+Fire+of+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"bergmanwasa","files":11,"time":1114898961,"description":"The Gun Club's debut is the watermark for all post-punk roots music. This features the late Jeffrey Lee Pierce's swamped-out brand of roiling rock, swaggerific hell-bound blues, and gothic country. With Pierce's wailing high lonesome slide guitar twinned with Ward Dotson's spine-shaking riffs and the solid yet off-the-rails rhythm section of bassist Rob Ritter and drummer Terry Graham, the Gun Club burst out of L.A. in the early '80s with a bone to pick and a mountain to move -- and they accomplished both on their debut album. With awesome, stripped to the frame production by the Flesh Eaters' Chris D., Fire of Love blew away all expectations -- and with good reason. Nobody has heard music like this before or since. Pierce's songs were rooted in his land of Texas. On &quot;Sex Beat&quot;; a razor-sharp country one-two shuffle becomes a howling wind as Pierce's wasted, half-sung half-howled vocals relate a tale of voodoo, sex, dope, and death. The song choogles like a freight train coming undone in a twister. Here Black Flag, the Sex Pistols, Son House, and the coughing, hacking rambling ghost of Hank Williams all converge in a reckless mass of seething energy and nearly evil intent. As if the opener weren't enough of a jolt, the Gun Club follow this with a careening version of House's &quot;Preachin the Blues,&quot; full of staccato phrasing and blazing slide. But it isn't until the anthemic, opiate-addled country of &quot;She's Like Heroin to Me&quot; and the truly frightening punk-blues of &quot;Ghost on the Highway&quot; that the listener comes to grip with the awesome terror that is the Gun Club. The songs become rock &amp; roll ciphers, erasing themselves as soon as they speak, heading off into the whirlwind of a storm that is so big, so black, and so awful one cannot meditate on anything but its power. Fire of Love may be just what the doctor ordered, but to cure or kill is anybody's guess.","torrent":{"xt":"urn:btih:d7aa455aa9b5fd8e994923991e44c4ab2cd9f533","amp;dn":"The+Gun+Club+-+Fire+of+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7aa455aa9b5fd8e994923991e44c4ab2cd9f533","infoHashBuffer":{"type":"Buffer","data":[215,170,69,90,169,181,253,142,153,73,35,153,30,68,196,171,44,217,245,51]},"announce":[],"urlList":[]}}