{"title":"Napoleon and the Art of Diplomacy","uid":15854558,"size":1668101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d88645693aa1629ce50f15066c7d2f4be2af99f9&amp;dn=Napoleon+and+the+Art+of+Diplomacy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"marty14","files":1,"time":1474225945,"description":"Napoleon and the Art of Diplomacy - William R. Nester [epub]\r\n\r\nMore books have been written about Napoleon Bonaparte than the number of days that have passed since his death. Warriors, however, are not generally known for their diplomatic skills and Napoleon is no exception. After all, conquerors are accustomed to imposing rather than negotiating terms. For Napoleon, however, the arts of war and diplomacy meshed. Napoleon was often as brilliant and successful at diplomacy as he was at war, although at times he could also be as disastrous at the diplomatic table as he was on his final battlefield. William R. Nester’s Napoleon and the Art of Diplomacy is the first comprehensive exploration of Napoleon the diplomat and how his abilities in that arena shaped his military campaigns and the rise and fall of the French empire. \r\n\r\nNapoleon’s official diplomatic career lasted nearly two decades and involved relations with scores of kings, queens, ministers, diplomats, and secret agents across Europe and beyond. All those involved asserted their respective state (and often their private) interests across the entire span of international relations in which conflicts over trade and marriage were often inseparable from war and peace. For Napoleon, war and diplomacy were indivisible and complementary for victory. Much of Napoleon’s military success was built upon a foundation of alliances and treaties.\r\n\r\nAlthough not always at war, Napoleon incessantly practiced diplomacy on a steady stream of international issues. Some of his noteworthy achievements in this arena included his 1797 Treaty of Campo Formio with the Austrians after he defeated them in the Italian campaign; the 1807 Treaty of Tilsit, when he incorporated Tsar Alexander of Russia as his junior partner while France was still at war with Britain; and, the 1812 conference of Dresden, where the crowned heads of Europe allied with France as Napoleon opened his massive (and disastrous) invasion of Russia","torrent":{"xt":"urn:btih:d88645693aa1629ce50f15066c7d2f4be2af99f9","amp;dn":"Napoleon+and+the+Art+of+Diplomacy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d88645693aa1629ce50f15066c7d2f4be2af99f9","infoHashBuffer":{"type":"Buffer","data":[216,134,69,105,58,161,98,156,229,15,21,6,108,125,47,75,226,175,153,249]},"announce":[],"urlList":[]}}