{"title":"Silverchair - Neon Ballroom (1999)","uid":5969475,"size":95113982,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d8dd3090463cc0401e35394fa95232aed52b5306&amp;dn=Silverchair+-+Neon+Ballroom+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"piratetorrent1989","files":12,"time":1290227595,"description":"Neon Ballroom is the third studio album by Australian post-grunge band Silverchair and was released on March 8, 1999. The album is certified gold in the United States and contained the singles &quot;Anthem for the Year 2000&quot;, &quot;Ana's Song (Open Fire)&quot;, &quot;Miss You Love&quot;, and &quot;Paint Pastel Princess&quot;.\n\nNeon Ballroom was an overhaul of the band's musical style found on its first two albums, Frogstomp and Freak Show. &quot;Anthem for the Year 2000&quot;, for example, retained much of the band's youthful rock energy but featured a new rock song structure and various electronic effects. Eight years after the album's release, Silverchair frontman Daniel Johns would say: &quot;To me, I honestly feel like our first record was Neon Ballroom. I've never felt any different. I don't feel like our first two albums were Silverchair: that's our teenage high school band. I don't like them at all. I listen to them and go, 'That's cute', especially the first one, because Frogstomp we were 14. But the second one we're like 16, I'm like 'You're getting older. You're running out of chances'&quot;.[3]\n\n&quot;Spawn&quot; was first released on the 1997 soundtrack to the film Spawn. This particular version is a remix of the original version; hip-hop group Vitro added various electronic bleeps and blips to the song. However, the origin of &quot;Spawn&quot; dates back to 1996 when it was originally recorded for inclusion on Freak Show but was later omitted. The Pre-Vitro mix of &quot;Spawn&quot; is not the Freak Show version but a later version recorded when the band demoed tracks for Neon Ballroom. The Pre-Vitro version is also notable because it lacks an entire verse pertaining to &quot;animal liberation&quot;. This version was included on the Neon Ballroom Limited Edition bonus disc, The Best of Volume 1 (2 Disc Limited Edition) in 2000, and the Rarities 1994 - 1999 compilation in 2002. The recording of &quot;Anthem for the Year 2000&quot; is slightly different on the Australian release than the one found on all other releases (including singles).\n\n&quot;Satin Sheets&quot; was originally called &quot;Punk Song #3&quot; and &quot;Paint Pastel Princess&quot; was &quot;All the Same to Me&quot;. &quot;Emotion Sickness&quot;, &quot;Ana's Song (Open Fire)&quot;, and &quot;Miss You Love&quot; are on The Best of Volume 1. An acoustic remix of &quot;Ana's Song&quot; was released on the Best of disc that also included the Rarities bonus. Eight tracks from Neon Ballroom appear on Live from Faraway Stables.\n\nThe album has been released in a double pack along with Freak Show. Johns wrote all the songs on the album except for &quot;Spawn Again&quot; (Johns-Gillies). The vinyl version of the album was limited to 5,000 copies worldwide.\n\nTrack listing\n\n   1. &quot;Emotion Sickness&quot; - 6:01\n   2. &quot;Anthem for the Year 2000&quot; - 4:08\n   3. &quot;Ana's Song (Open Fire)&quot; - 3:42\n   4. &quot;Spawn Again&quot; - 3:31\n   5. &quot;Miss You Love&quot; - 4:01\n   6. &quot;Dearest Helpless&quot; - 3:35\n   7. &quot;Do You Feel the Same&quot; - 4:18\n   8. &quot;Black Tangled Heart&quot; - 4:34\n   9. &quot;Point of View&quot; - 3:35\n  10. &quot;Satin Sheets&quot; - 2:24\n  11. &quot;Paint Pastel Princess&quot; - 4:33\n  12. &quot;Steam Will Rise&quot; - 5:18\n\nvbr mp3 (average 255kbps)","torrent":{"xt":"urn:btih:d8dd3090463cc0401e35394fa95232aed52b5306","amp;dn":"Silverchair+-+Neon+Ballroom+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8dd3090463cc0401e35394fa95232aed52b5306","infoHashBuffer":{"type":"Buffer","data":[216,221,48,144,70,60,192,64,30,53,57,79,169,82,50,174,213,43,83,6]},"announce":[],"urlList":[]}}