{"title":"Leverage Season 4 - COMPLETE + Eng Softsubs 720p x264 [MKV,AC3,5","uid":9083285,"size":7825055225,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d90a30a119470c76f6e28a0f159eda40cb2a7205&amp;dn=Leverage+Season+4+-+COMPLETE+%2B+Eng+Softsubs+720p+x264+%5BMKV%2CAC3%2C5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":22,"uploader":"Ehhhhtozebec","files":-1,"time":1382418766,"description":"\n imageimage\nimage\n\n\n\nThe rich and powerful, they take what they want. We steal it back for you. And sometimes, bad guys make the best good guys. We provide... leverage.\n\nTimothy Hutton stars as Nate Ford, an insurance investigator known for his ability to recover stolen goods for his employer. However, after the firm denies insurance claims for his dying son, Ford decides to go against the corporate world taking freelance jobs. Ford is soon hired by an aeronautics executive in order to recover stolen designs. He enlists the help of the best thieves and grifters in the business, and with their help, he steals from the rich and gives to the poor to help balance the crooks in high power positions. He and his team help provide...leverage. Helping Ford are Parker (Beth Riesgraf), a thief; Alec Hardison (Aldis Hodge), an Internet specialist; Eliot Spencer (Christian Kane), a &quot;retrieval specialist&quot; and martial artist; and Sophie Devereaux (Gina Bellman), a grifter whose acting skills play an important part in setting up difficult scams. Together, this group of con artists have the ability to target the greediest and most unjust people.\n\n\nMain cast\n\nTimothy Hutton as Nathan &quot;Nate&quot; Ford (&quot;The Mastermind&quot; or &quot;The Brains&quot; in the opening credits of later seasons): A former insurance fraud investigator for IYS Insurance operated by Ian Blackpoole and the team's mastermind. The son of South Boston numbers runner Jimmy Ford,[14] Nate originally intended to become a Catholic priest prior to becoming an insurance investigator. While Ford was working for IYS, Blackpoole decided on a policy of denying every medical treatment especially those experimental (Blackpoole claimed the policy was implemented to cut costs, but in fact to turn a bigger profit), his young son Sam became fatally ill and IYS refused to pay for an experimental procedure, resulting in his death. The aftermath led to Nate's divorce from his wife Maggie, his subsequent dismissal from the company and his descent into alcoholism. Ford swore vengeance on Blackpoole and IYS which would come to pass years later. After meeting the team for the first time and running a con against their first mark, instead of disbanding as intended, Nate is asked to continue working with them and is given the privilege of leading the team and selecting what clients the team will help. A skilled planner, Nate draws on his experience as an insurance investigator to anticipate the moves of his team's marks. Nate is at first very affable, but is unwilling to discuss his own problems with friends or others. His tendency to change objectives in the middle of a job, his alcoholism, and his often-tenuous relationship with his team has on occasion put the client and the team at risk. Since moving to Portland, he and Sophie are now an established couple, but he is working on a project with Hardison's help which is being kept secret from the other team members and only revealed to them and the audience in the series finale as &quot;the Holy Grail&quot; of all scores.\n\nGina Bellman as Sophie Devereaux (&quot;The Grifter&quot;): British actress and accomplished grifter with a taste for art theft. Multi-lingual and particularly adept at the use of accents, Sophie is seen to portray many characters in various cons, usually making direct contact with a mark to draw them into the con. Sophie has a collection of aliases, which includes &quot;Sophie Devereaux&quot;, but her real name remains unknown. Comically, her attempts to make a career as an actress lead to nothing but failure, as she proves woefully untalented and over-the-top onstage. It is only during a con when she can disappear effortlessly into a character, where ironically she can actually act well if she is pretending to be an actress. She has a long history with Nate, dating back at least ten years to when he pursued her with IYS as an art thief. At some point, they recognized an attraction to one another, leaving Sophie alternately frustrated, angry, and disappointed. They have on occasion tried to further the relationship, but for various reasons one or the other resisted. Nate asks Sophie (using her real first name) to marry him in the series finale, and she accepts.\n\nAldis Hodge as Alec Hardison (&quot;The Hacker&quot;): The team's computer specialist and hacker. He is a self-proclaimed geek and science fiction fan, with an easy going manner and dry, unusual wit. Hardison was raised by a foster parent, an older woman he refers to as &quot;Nana&quot;. Hardison can hack into most forms of electronics and is rarely caught. Hardison designed and assembled the computer and television systems in the team's headquarters, and is responsible for the two-way earpieces used by the team on each episode. He is also very attached to his electronics (and in particular his van) and shown to become very depressed when the con takes a turn for the worse and requires they destroy his electronics to make their escape. Hardison and Parker's relationship develops into a romantic one as time goes on but it is fraught with personal (and physical) complications.\n\nChristian Kane as Eliot Spencer (&quot;The Hitter&quot;): The team's highly skilled martial artist, weapons expert and self-described &quot;retrieval expert&quot;. A former black ops soldier, his role in cons is often to play small roles while protecting the team, often leading him into hand-to-hand combat that draws on his martial arts skills. Eliot once worked for crime financier Damien Moreau, and has a long history as a hired gun and bodyguard, then a retrieval specialist. Eliot is skilled with firearms, but dislikes guns. While merely presumed as the muscleman, he demonstrates a subtle intelligence in conversation, often taking advantage of the underestimations of others and later in the series performs as a grifter along with Sophie. In contrast to the other characters Eliot prefers to keep his romantic life private, as well as much of his background. Over the course of the series, he displays an extraordinary talent for cooking, and is now in charge of the kitchen of the microbrewery in Portland where the team has set up headquarters (despite clashes on the subject of food with Hardison).\n\nBeth Riesgraf as Parker (&quot;The Thief&quot;): An expert thief, cat-burglar, pickpocket and safe-cracker. The product of an abusive childhood spent in several foster homes, Parker is socially awkward and relates poorly to most people but has come to regard the other members of the team as her family. Sophie (and in Season 5 Elliot) has attempted to improve gaps in her social skills on numerous occasions with limited success. Parker also has affection for Hardison, but finds it hard to convey what she feels when confronted by others. While emotionally impulsive, she can demonstrate great physical self-control in her work using acrobatics, strength and concentration to her advantage. Her obsessive focus on theft is to the point that her safehouse is filled with gear and rappelling equipment to help her in various jobs, and during one con, she was put through a rehab to address it. Parker was trained at a young age by expert thief (and recurring character) Archie Leach, who found her proficient with the physical demands of burglary as well as safe-cracking and lock-picking, skills she uses in many of the cons. In Season 5's &quot;The Broken Wing Job&quot;, she proves that she can handle problems on her own while the other team members are away and seems to be, with Nate's guidance, developing her ability as a planner.\n\nimage","torrent":{"xt":"urn:btih:d90a30a119470c76f6e28a0f159eda40cb2a7205","amp;dn":"Leverage+Season+4+-+COMPLETE+%2B+Eng+Softsubs+720p+x264+%5BMKV%2CAC3%2C5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d90a30a119470c76f6e28a0f159eda40cb2a7205","infoHashBuffer":{"type":"Buffer","data":[217,10,48,161,25,71,12,118,246,226,138,15,21,158,218,64,203,42,114,5]},"announce":[],"urlList":[]}}