{"title":"Curb Your Enthusiasm - Season 5","uid":3417564,"size":2557198080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d93ff1e727cad28624c436113c2aaef1b450e922&amp;dn=Curb+Your+Enthusiasm+-+Season+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":3,"uploader":"xanthyos","files":11,"time":1133771248,"description":"Curb Your Enthusiasm ? Season 5\n\n41 ? The Larry David Sandwich\nLarry is changed by a near-death experience, a revelation about his father, and a sandwich that is named after him.\n42 ? The Bowtie\nLarry hires a private investigator to find out if he is adopted. After Larry adopts a dog, Wanda deems the dog to be racist after she visits.\n43 ? The Christ Nail\nLarry buys his housekeeper a bra, and is saved from the wrath of her vengeful husband by orthotics and a special nail. \n44 ? Kamikaze Bingo\nLarry dishonors an art dealer at a Japanese restaurant, and accuses a nursing-home resident of a Bingo fix.\n45 ? Lewis Needs a Kidney\nWhen Richard Lewis needs a kidney transplant, Larry and Jeff debate on how far they are willing to go to help out their friend in need.\n46 ? The Smoking Jacket\nLarry celebrates his birthday and asks for two wishes that eventually come true one involving a visit to Hugh Hefner's Playboy Mansion. While there, Larry swaps &quot;smoking jackets&quot; with a living legend.\n47 ? The Seder\nLarry and Cheryl hold a passover seder for friends and family. One of the many guests includes a sex offender which causes much awkwardnesses among the others. \n48 ? The Ski Lift\nLarry and Jeff befriend the head of a kidney transplant consortium. \n49 ? The Korean Bookie\nLarry pays off a debt, and contemplates how to invest money from a debt paid. Larry then suspects his bookie of kidnapping Jeff's dog, Oscar. \n50 ? The End\nLarry is changed by a trip to Arizona, to Richard Lewis? profound relief. Larry also finds out the truth of whether he is adopted. \n\n\n\n\n\n\nepisode files compiled and catalogued by Hank McInernie\n\n\n&lt;3 &lt;3\n\n________________\n\n\n\n&quot;prettay, prettay, prettay good..&quot;\n\n\n\n(moof narm hm ok computer brain hail whoas skeep roooh)","torrent":{"xt":"urn:btih:d93ff1e727cad28624c436113c2aaef1b450e922","amp;dn":"Curb+Your+Enthusiasm+-+Season+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d93ff1e727cad28624c436113c2aaef1b450e922","infoHashBuffer":{"type":"Buffer","data":[217,63,241,231,39,202,210,134,36,196,54,17,60,42,174,241,180,80,233,34]},"announce":[],"urlList":[]}}