{"title":"Escritores da Liberdade (2007) 1080p Dublado (Freedom Writers)","uid":14637933,"size":1846291003,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d9b391200a623beceeb87760cd8a3385b11cc42a&amp;dn=Escritores+da+Liberdade+%282007%29+1080p+Dublado+%28Freedom+Writers%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":3,"uploader":null,"files":1,"time":1463480629,"description":"Escritores da Liberdade é um filme de drama norte-americano lançado em 2007. Dirigido por Richard LaGravenese e produzido por Danny DeVito, Michael Shamberg e Stacey Sher, o filme é estrelado por Hiliary Swank, Scott Glenn, Imelda Staunton e Patrick Dempsey e é inspirados nos eventos reais relatados pelo livro The Freedom Writers Diaries, baseado nos relatos da professora Erin Gruwell e seus diversos alunos.\r\n\r\nO filme Escritores da Liberdade&quot; (Freedom Writers, EUA, 2007), baseado em uma história real, aborda de maneira comovente os desafios da educação, em especial num contexto socioeconômico problemático.\r\n\r\n\r\nSinopse:\r\n\r\nNo filme, a professora Erin Gruwell assume uma turma de alunos problemáticos de uma escola que não está nem um pouco disposta a investir ou mesmo acreditar naqueles garotos. No começo a relação da professora com os alunos não é muito boa. A professora é vista como representante do domínio dos brancos nos Estados Unidos. Suas iniciativas para conseguir quebrar as barreiras encontradas na sala de aula vão aos poucos resultando em frustações.\r\n\r\nApesar de muitas vezes apresentar desânimos nas chances de um resultado positivo no trabalho com aquele grupo, Erin não desiste, levanta a cabeça e segue em frente.\r\n\r\nMesmo não contando com o apoio da direção da escola e das demais professoras, ela acredita que há possibilidades de superar as mazelas sociais e étnicas ali existentes. Para isso cria um projeto de leitura e escrita, iniciada com o livro &quot; O diário de Anne Frank&quot; em que os alunos poderão registrar em cadernos personalizados o que quiserem sobre suas vidas.\r\n\r\nAo criar um elo de contato com o mundo Erin fornece aos alunos um elemento real de comunicação que permite ao mesmo se libertarem de seus medos, anseios, aflições e inseguranças.\r\n\r\nErin consegue mostrar aos alunos que os impedimentos e situações de exclusão e preconceito podem afetar a todos independente da cor, da pele, da origem étnica, da religião etc.larry is real so much believe","torrent":{"xt":"urn:btih:d9b391200a623beceeb87760cd8a3385b11cc42a","amp;dn":"Escritores+da+Liberdade+%282007%29+1080p+Dublado+%28Freedom+Writers%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9b391200a623beceeb87760cd8a3385b11cc42a","infoHashBuffer":{"type":"Buffer","data":[217,179,145,32,10,98,59,236,238,184,119,96,205,138,51,133,177,28,196,42]},"announce":[],"urlList":[]}}