{"title":"Prototype-the P.C. Game.iso","uid":7943944,"size":3719608320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d9d2c7480a95cd24d7cff244784140f717e274c4&amp;dn=Prototype-the+P.C.+Game.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"prodallasosoft","files":1,"time":1356081090,"description":"The game follows Alexander J. Mercer (voiced by Barry Pepper) who wakes up in a morgue in the basement of Gentek, a genetic engineering company based in Manhattan, sending a pair of scientists that were just about to perform an autopsy running. Alex escapes, and witnesses the scientists being gunned down by military operatives. Alex is discovered and attacked. He survives bullets being fired into his chest, and leaps over a wall to safety. He soon discovers he now possesses powerful shapeshifting abilities, superhuman strength, speed, agility, durability, endurance, weaponry and the ability to &quot;consume&quot; people to gain their memories, skills and appearance. With no memory of his previous life, Alex decides to find and consume those related to the conspiracy in order to uncover the truth. During his quest, Alex faces two factions: the United States Marine Corps and Blackwatch, a Fort Detrick special forces unit dedicated to combating biological warfare; and the Infected, monsters created by a virus known as BLACKLIGHT that is overrunning Manhattan. Captain Robert Cross (voiced by Jeffrey Pierce), a Blackwatch officer, is given orders to find and contain Alex.\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\nPlease Leave A Comment Confirming This Pack\n\nPLEASE SEED !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nAs Always,this is an iso, mount or burn,Install,and Play. Enjoy\t\t","torrent":{"xt":"urn:btih:d9d2c7480a95cd24d7cff244784140f717e274c4","amp;dn":"Prototype-the+P.C.+Game.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9d2c7480a95cd24d7cff244784140f717e274c4","infoHashBuffer":{"type":"Buffer","data":[217,210,199,72,10,149,205,36,215,207,242,68,120,65,64,247,23,226,116,196]},"announce":[],"urlList":[]}}