{"title":"David Snyder - CPI Covert Persuasion Intelligence [6 DVDs - Rip]","uid":11878023,"size":1366807226,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:da9d59e41c07d847e93d35e2b7c2dce1c64e365e&amp;dn=David+Snyder+-+CPI+Covert+Persuasion+Intelligence+%5B6+DVDs+-+Rip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":4,"uploader":"acer47x","files":8,"time":1430595719,"description":"This is a 6-dvd condensed footage from a 3-day seminar on covert persuasion. You do not need to know hypnosis or NLP to understand it (although it does help). The material does not include teaching hypnosis per se; it focuses on rapport techniques, useful mindsets, language patterns and a mixed bag of tips &amp; techniques. His model is based on the use of presuppositional language presented in small chunks. The presupposition groups are defined and the associated word groups are presented. The presentation is designed to provide the skills to build persuasive language patterns on the fly, eliminating the need for memorization.At the time I found this to be the best and most thorough presentation on covert hypnosis I have seen, however Igor Lï¿½s mind bending language system is more complete but there are a lot of similarities.\n\n\nDavid Snyder (aka David X, David Van Arrick) is a very competent instructor who studied under Kenrick Cleveland, Mark Cunningham ( makes a cameo), John LaTourette, Ross Jeffries, and other notables.\n\nThis course draws on NLP and the work of his teachers (especially Kenrick), but he has his own well-defined model of influence (CPI) that I found useful, the information is well presented, the drills are simple and effective, and I did find myself doing the stuff he teaches in the real world without thinking about it, which leads me to think his unconscious installation strategies are effective","torrent":{"xt":"urn:btih:da9d59e41c07d847e93d35e2b7c2dce1c64e365e","amp;dn":"David+Snyder+-+CPI+Covert+Persuasion+Intelligence+%5B6+DVDs+-+Rip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da9d59e41c07d847e93d35e2b7c2dce1c64e365e","infoHashBuffer":{"type":"Buffer","data":[218,157,89,228,28,7,216,71,233,61,53,226,183,194,220,225,198,78,54,94]},"announce":[],"urlList":[]}}