{"title":"Game of Thrones S02E02 (2012)DviX nl subs NLtoppers","uid":7912857,"size":493680073,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dac8da328283a909a4e27026f108ebba79c70011&amp;dn=Game+of+Thrones+S02E02+%282012%29DviX+nl+subs+NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"ChickieChicken","files":-1,"time":1355265464,"description":"2012 | 51 minuten | | avontuur, fantasy  \n\nRegie: Alan Taylor\t \nCast: Peter Dinklage, Lena Headey, Michelle Fairley, Emilia Clarke, Nikolaj Coster-Waldau\t \nEen eeuwenoude machtsstrijd barst los in een wereld waar de zomers decennia duren en de winters een leven lang kunnen aanslepen... Er roert iets in het land waar de zomers decennia duren en de winters een leven lang kunnen aanslepen. Twee machtige geslachten - de regerende Baratheons en de verbannen Targaryens - maken zich op om de IJzeren Troon te claimen en de Zeven Koninkrijken van Westeros onder hun controle te krijgen. Maar in een tijdperk waarin verraad, lust, intriges en bovennatuurlijke krachten hoogtij vieren, zal hun dodelijke kat-en-muisspelletje onvoorziene en verreikende gevolgen hebben. Achter een eeuwenoude, gigantische muur van ijs in het uiterste noorden van Westeros maakt een kille vijand zich immers op om het land onder de voet te lopen. Gebaseerd op de bestseller fantasyreeks &quot;A Song of Ice and Fire&quot; van George R.R. Martin.\n\n\n\nSeason 2 Episode 2: The North Remembers \n\n\n:\n&quot;Who's next?&quot;\nKing Joffrey Baratheon celebrates his nameday in King's Landing by ordering his knights to fight to the death for his entertainment. Ser Gregor &quot;The Hound&quot; Clegane makes short work of his opponent, but when the next fighter, Ser Dontos Hollard, takes to the field drunk, Joffrey demands that he be drowned in wine. Sansa manages to save the man's life by suggesting Joffrey take him on as a court fool, but then the festivities are interrupted by the arrival of Tyrion Lannister.\n\n\nBy Chickie","torrent":{"xt":"urn:btih:dac8da328283a909a4e27026f108ebba79c70011","amp;dn":"Game+of+Thrones+S02E02+%282012%29DviX+nl+subs+NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dac8da328283a909a4e27026f108ebba79c70011","infoHashBuffer":{"type":"Buffer","data":[218,200,218,50,130,131,169,9,164,226,112,38,241,8,235,186,121,199,0,17]},"announce":[],"urlList":[]}}