{"title":"The Complete Art of War - Sun Tzu","uid":16005817,"size":2999019,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db0c29fec2ed6b411793c51b9e251c82b9894471&amp;dn=The+Complete+Art+of+War+-+Sun+Tzu&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"suprbayrequest","files":1,"time":1476178656,"description":"The Complete Art of War: Sun Tzu/sun Pin - translated by Ralph Sawyer\r\n\r\n\r\nSun Tzu’s Art of War is the most famous, and the most thought-provoking, work of strategy ever written. The profound insights of this book have endured for over two thousand years, and they continue to reward careful study. The Military Methods of Sun Pin, the great-grandson of Sun Tzu, is a brilliant elaboration on his ancestor’s work, which has been lost for nearly two millennia. Presented here together for the first time are the greatest of the ancient Chinese classics of strategic thought: The Complete Art of War.The Sun family writings on strategy represent a unique contribution to our understanding of human affairs. By unveiling the complex, often unexpected, interrelationships of armies locked in battle, their wisdom reveals the enduring principles of success in the struggle of life itself.With a unique index to the essential principles of strategy, and Sawyer’s thoughtful chapter-by-chapter commentaries, The Complete Art of War is designed to guide the reader to new insights into the nature of human conflict and a greater understanding of every field of human activity, from playing the game of politics to building a successful marriage, from closing a deal to managing a large organization, and even from making war to making peace.\r\n\r\nPublished by Basic Books in 2007 (9780465003877)\r\n\r\nEnglish, 320 pages, retail EPUB\r\n\r\nFor requests, register with the forum and post here: \r\n \nhttps://pirates-forum.org/Forum-Requests","torrent":{"xt":"urn:btih:db0c29fec2ed6b411793c51b9e251c82b9894471","amp;dn":"The+Complete+Art+of+War+-+Sun+Tzu","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0c29fec2ed6b411793c51b9e251c82b9894471","infoHashBuffer":{"type":"Buffer","data":[219,12,41,254,194,237,107,65,23,147,197,27,158,37,28,130,185,137,68,113]},"announce":[],"urlList":[]}}