{"title":"Emma Healey - Elizabeth Is Missing (epub, mobi, azw3)","uid":10348347,"size":1337525,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db78a01ad42b53e6ffe692bb89fe2e45672ce017&amp;dn=Emma+Healey+-+Elizabeth+Is+Missing+%28epub%2C+mobi%2C+azw3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"pharmakate","files":-1,"time":1402639077,"description":"Emma Healey - Elizabeth Is Missing (Harper, 2014).\n\nRetail azw3; epub and mobi conversions using calibre. (Thanks to the original uploader!)\n\n\ndescription:\n\nIn this darkly riveting debut novel -- a sophisticated psychological mystery that is also an heartbreakingly honest meditation on memory, identity, and aging -- an elderly woman descending into dementia embarks on a desperate quest to find the best friend she believes has disappeared, and her search for the truth will go back decades and have shattering consequences.\n\nMaud, an aging grandmother, is slowly losing her memory -- and her grip on everyday life. Yet she refuses to forget her best friend Elizabeth, whom she is convinced is missing and in terrible danger.\n\nBut no one will listen to Maud -- not her frustrated daughter, Helen, not her caretakers, not the police, and especially not Elizabeth's mercurial son, Peter. Armed with handwritten notes she leaves for herself and an overwhelming feeling that Elizabeth needs her help, Maud resolves to discover the truth and save her beloved friend.\n\nThis singular obsession forms a cornerstone of Maud's rapidly dissolving present. But the clues she discovers seem only to lead her deeper into her past, to another unsolved disappearance: her sister, Sukey, who vanished shortly after World War II.\n\nAs vivid memories of a tragedy that occurred more fifty years ago come flooding back, Maud discovers new momentum in her search for her friend. Could the mystery of Sukey's disappearance hold the key to finding Elizabeth?\n\n\nFrom Booklist\nStarred Review \n\nYour best friend doesn't respond to calls or knocks on the door. A moving van is loaded with your friend's possessions. Your friend's son, a nasty, grasping type, seems to have taken over. You report what's going on to the police, to your daughter, to anyone who will listen. No one believes you. You hardly know whether to believe yourself since you know that your memory, lately, has gotten so bad. This is the predicament facing Maud Horsham, a woman who survived the London Blitz and is now sinking into dementia. Part of the wallop of this mystery is that a woman with declining memory and mental powers is placed in the position of detective. This adds to the urgency of her quest, since Maud is battling the condescension of her caretakers, the police, and her daughter as her faculties fade. Another part of the power of this debut novel is that Maud is the narrator; this choice of point of view gives readers a lens on the casual cruelties inflicted on the aging, especially those with dementia. Maud writes everything down, to help her remember clues about her missing friend, and she also writes down how she is treated. Maud focuses on a second mystery as well, the disappearance of her sister, Sukey, after the war. Part mystery, part meditation on memory, part Dickensian revelation of how apparent charity may hurt its recipients, this is altogether brilliant.","torrent":{"xt":"urn:btih:db78a01ad42b53e6ffe692bb89fe2e45672ce017","amp;dn":"Emma+Healey+-+Elizabeth+Is+Missing+%28epub%2C+mobi%2C+azw3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db78a01ad42b53e6ffe692bb89fe2e45672ce017","infoHashBuffer":{"type":"Buffer","data":[219,120,160,26,212,43,83,230,255,230,146,187,137,254,46,69,103,44,224,23]},"announce":[],"urlList":[]}}