{"title":"SAS Statistics by Example - Ron Cody","uid":11885296,"size":12545791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dcccadbcbd704b97eeb8cb6d07a1facc1e0ee987&amp;dn=SAS+Statistics+by+Example+-+Ron+Cody&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":4,"uploader":"Mohammad_AT","files":3,"time":1430818857,"description":"In SAS Statistics by Example, Ron Cody offers up a cookbook approach for doing statistics with SAS. Structured specifically around the most commonly used statistical tasks or techniques--for example, comparing two means, ANOVA, and regression--this book provides an easy-to-follow, how-to approach to statistical analysis not found in other books. \n \nFor each statistical task, Cody includes heavily annotated examples using ODS Statistical Graphics procedures such as SGPLOT, SGSCATTER, and SGPANEL that show how SAS can produce the required statistics. Also, you will learn how to test the assumptions for all relevant statistical tests. Major topics featured include descriptive statistics, one- and two-sample tests, ANOVA, correlation, linear and multiple regression, analysis of categorical data, logistic regression, nonparametric techniques, and power and sample size. \n \nThis is not a book that teaches statistics. Rather, SAS Statistics by Example is perfect for intermediate to advanced statistical programmers who know their statistics and want to use SAS to do their analyses","torrent":{"xt":"urn:btih:dcccadbcbd704b97eeb8cb6d07a1facc1e0ee987","amp;dn":"SAS+Statistics+by+Example+-+Ron+Cody","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcccadbcbd704b97eeb8cb6d07a1facc1e0ee987","infoHashBuffer":{"type":"Buffer","data":[220,204,173,188,189,112,75,151,238,184,203,109,7,161,250,204,30,14,233,135]},"announce":[],"urlList":[]}}