{"title":"The 50 Greatest Pieces of Classical Music","uid":8098162,"size":653280620,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dd8986c31d3ff749d39b07ec910826595cb7bd2d&amp;dn=The+50+Greatest+Pieces+of+Classical+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":3,"uploader":"aswang","files":-1,"time":1359904606,"description":"The 50 Greatest Pieces of Classical Music consists of famous selections performed by the London Philharmonic Orchestra, under the direction of David Parry, with additional appearances by violinist Pieter Schoeman, pianist Finghin Collins, and guitarist Craig Ogden. While the term &quot;greatest&quot; may be debatable in the instance of some of the pieces, &quot;popular&quot; is a description that's easier to support, for there's no denying the staying power of these pieces. Indeed, some are so well-loved, they have become obligatory on such collections and are likely found in most listeners' collections. Pachelbel's ubiquitous Canon in D major and the spurious Albinoni Adagio (actually composed by Remo Giazotto) are here, as is Stanley Myers' Cavatina from The Deer Hunter, though most of the tracks are excerpted sections from longer works, such as operas, concertos, symphonies, and choral works. In this way, the masters from Bach and Vivaldi to Rachmaninov and Mahler are generously represented, so even though the album gives merely a sample of what each composer's music is like, the quantity of tracks makes it a broad introductory survey.","torrent":{"xt":"urn:btih:dd8986c31d3ff749d39b07ec910826595cb7bd2d","amp;dn":"The+50+Greatest+Pieces+of+Classical+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd8986c31d3ff749d39b07ec910826595cb7bd2d","infoHashBuffer":{"type":"Buffer","data":[221,137,134,195,29,63,247,73,211,155,7,236,145,8,38,89,92,183,189,45]},"announce":[],"urlList":[]}}