{"title":"The Penguin History of the World, 6th Edition (2013) epub","uid":11739590,"size":19400489,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dda8c849962513b85c6fb8f205a4e1d1ef27d6e2&amp;dn=The+Penguin+History+of+the+World%2C+6th+Edition+%282013%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"bookzilla","files":1,"time":1425728078,"description":"This is a completely new and updated edition of J. M. Roberts and Odd Arne Westad's widely acclaimed, landmark bestseller &quot;The Penguin History of the World&quot;. For generations of readers &quot;The Penguin History of the World&quot; has been one of the great cultural experiences - the entire story of human endeavour laid out in all its grandeur and folly, drama and pain in a single authoritative book. Now, for the first time, it has been completely overhauled for its 6th edition - not just bringing it up to date, but revising it throughout in the light of new research and discoveries, such as the revolution in our understanding of many civilizations in the Ancient World. The closing sections of the book reflect what now seems to be the inexorable rise of Asia and the increasingly troubled situation in the West. About the authors: J.M. Roberts, CBE, published &quot;The Penguin History of the World&quot; in 1976 to immediate acclaim. His other major books include &quot;The Paris Commune from the Right&quot;, &quot;The Triumph of the West&quot; (which was also a successful television series), &quot;The Penguin History of Europe&quot; and &quot;The Penguin History of the Twentieth Century&quot;. He died in 2003. Odd Arne Westad, FBA, is Professor of International History at the London School of Economics. He has published fifteen books on modern and contemporary international history, among them &quot;The Global Cold War&quot;, which won the Bancroft Prize, and &quot;Decisive Encounters&quot;, a standard history of the Chinese civil war. He also served as general co-editor of the &quot;Cambridge History of the Cold War&quot;","torrent":{"xt":"urn:btih:dda8c849962513b85c6fb8f205a4e1d1ef27d6e2","amp;dn":"The+Penguin+History+of+the+World%2C+6th+Edition+%282013%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda8c849962513b85c6fb8f205a4e1d1ef27d6e2","infoHashBuffer":{"type":"Buffer","data":[221,168,200,73,150,37,19,184,92,111,184,242,5,164,225,209,239,39,214,226]},"announce":[],"urlList":[]}}