{"title":"J. M. Coetzee - Nobel Prize in Literature, 2003 (22 books)","uid":14479058,"size":40449473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddc317914851c43544844071f23ddd70cd193a2d&amp;dn=J.+M.+Coetzee+-+Nobel+Prize+in+Literature%2C+2003+%2822+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":1,"uploader":"workerbee","files":59,"time":1461975556,"description":"JOHN MAXWELL &quot;J. M.&quot; COETZEE (b. 1940) is a South African novelist, essayist, linguist, and translator. He was the recipient of the 2003 Nobel Prize in Literature for portraying &quot;in innumerable guises . . . the surprising involvement of the outsider.&quot;\n\nDUSKLANDS (1974), Coetzee's first book, contains two novellas united in their exploration of colonization, &quot;The Vietnam Project&quot; (set in the United States in the late 20th century) and &quot;The Narrative of Jacobus Coetzee&quot; (set in 18th-century South Africa). IN THE HEART OF THE COUNTRY (1977) is a stream-of-consciousness narrative of a Boer madwoman, and WAITING FOR THE BARBARIANS (1980), set in some undefined borderland, is an examination of the ramifications of colonization. LIFE &amp; TIMES OF MICHAEL K (1983), which won the Booker Prize, concerns the dilemma of a simple man beset by conditions he can neither comprehend nor control during a civil war in a future South Africa.\n\nCoetzee continued to explore themes of the colonizer and the colonized in FOE (1986), his reworking of Defoe's Robinson Crusoe, in which the female narrator comes to new conclusions about power and otherness and ultimately concludes that language can enslave as effectively as can chains. In AGE OF IRON (1990), Coetzee dealt directly with circumstances in contemporary South Africa, but in THE MASTER OF PETERSBURG (1994) he made reference to 19th-century Russia (particularly to Dostoyevsky's Devils); both books treat the subject of literature in society. With the novel DISGRACE (1999), Coetzee became the first writer to win the Booker Prize twice. After the novel's publication and an outcry in South Africa, he moved to Australia, where he was granted citizenship in 2006.\n\nThe structure of ELIZABETH COSTELLO (2003), a series of &quot;lessons&quot; in which the eponymous narrator reflects on a variety of topics, puzzled many readers. One reviewer proposed that it be considered &quot;non-nonfiction.&quot; Costello makes a surreal reappearance in Coetzee's SLOW MAN (2005), about a recent amputee's reluctance to accept his condition. DIARY OF A BAD YEAR (2007) employs a literally split narrative technique, with the text on the page divided into concurrent storylines, the main story being the musings of an aging South African writer modeled on Coetzee himself. In THE CHILDHOOD OF JESUS (2013), a boy and his guardian scour a dystopian world -- from which desire and pleasure have apparently been purged -- in search of the boy's mother.\n\nThe notably reticent author's nonfiction books include INNER WORKINGS (2008), a collection of literary essays, and the autobiographic trilogy SCENES FROM PROVINCIAL LIFE (1997-2009). HERE AND NOW: Letters 2008–2011 (2013) is a collection of correspondence between Coetzee and American novelist Paul Auster. THE GOOD STORY: Exchanges on Truth, Fiction, and Psychotherapy (cowritten with Arabella Kurtz) was published in 2015. \n\nThe following books are in ePUB format unless otherwise indicated:\n\n\n                                 == FICTION ==\n\n* Age of Iron, The (Secker &amp; Warburg, 1990 / Penguin, 2010) -- ePUB + PDF\n\n* Childhood of Jesus, The (Text, 2013)\n\n* Diary of a Bad Year (Harvill Secker, 2007)\n\n* Disgrace (Vintage / Penguin, 2000) -- ePUB + PDF\n\n* Dusklands (Vintage, 1998)\n\n* Elizabeth Costello (Vintage, 2003)\n\n* Foe (Penguin, 1987) -- ePUB + PDF\n\n* &quot;A House in Spain&quot; (Architectural Digest, 57.10 [2000]: 68, 72, 76). -- PDF\n\n* In the Heart of the Country (Vintage, 2004)\n\n* Life and Times of Michael K (Vintage, 1983)\n\n* Lives of Animals, The (Princeton UP, 1999) -- ePUB + PDF\n\n* Master of Petersburg, The (Viking, 1994 / Vintage, 2004) -- ePUB + PDF\n\n* Slow Man (Vintage, 2006)\n\n* Three Stories (Text, 2014)\n\n* Waiting for the Barbarians (Penguin, 1999 / Vintage, 2004) -- ePUB + PDF\n\n\n                        == FICTIONALIZED AUTOBIOGRAPHY ==\n\n* Boyhood: Scenes from Provincial Life I (Secker &amp; Warburg / Penguin, 1997) -- ePUB + PDF\n\n* Scenes from Provincial Life (Vintage, 2011).  Edited single volume of Boyhood / Youth / and Summertime.\n\n* Summertime: Scenes from Provincial Life III (Harvill Secker, 2009)\n\n* Youth: Scenes from Provincial Life II (Vintage, 2003) -- ePUB + PDF\n\n\n                            == CRITICISM &amp; LETTERS ==\n\n* Good Story, The: Exchanges on Truth, Fiction and Psychotherapy [with Arabella Kurtz] (Viking, 2015)\n\n* &quot;He and His Man&quot;: The Nobel Lecture (Nobel Foundation, 2007) -- PDF\n\n* Here and Now: Letters, 2008-2011 [with Paul Auster] (Penguin, 2013)\n\n* Inner Workings: Literary Essays, 2000-2005 (Vintage, 2008)\n\n* &quot;Meat Country&quot; (Granta 52 [1995]: 43-52) -- PDF\n\n* &quot;Truth in Autobiography&quot; - Inaugural Lecture, 3 October 1984 (University of Cape Town, 1984) -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account): \nhttps://pirates-forum.org/User-workerbee\n\nPLEASE HELP TO SEED! If you like these books and want others to have access to them, please help to seed for as long as you can. The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content. Thank you!","torrent":{"xt":"urn:btih:ddc317914851c43544844071f23ddd70cd193a2d","amp;dn":"J.+M.+Coetzee+-+Nobel+Prize+in+Literature%2C+2003+%2822+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc317914851c43544844071f23ddd70cd193a2d","infoHashBuffer":{"type":"Buffer","data":[221,195,23,145,72,81,196,53,68,132,64,113,242,61,221,112,205,25,58,45]},"announce":[],"urlList":[]}}