{"title":"Game of Thrones S02E08 (2012)DviX nl subs NLtoppers","uid":7919075,"size":457832569,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:de1f5da481434fb412b6cf3e9caa69470cbfaa2d&amp;dn=Game+of+Thrones+S02E08+%282012%29DviX+nl+subs+NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":5,"uploader":"ChickieChicken","files":-1,"time":1355433400,"description":"Game of Thrones is een HBO-serie gebaseerd op de fantasyboeken \n ''Een Lied van IJs en Vuur'' van George R. R. Martin. Het gaat \n over een machtsstrijd om de ijzeren troon tussen zeven \n verschillende adellijke families op het fictieve continent \n Westeros. \n\n Robert Baratheon is koning van Westeros, maar al snel ontdekt \n hij dat zijn troon zeer gewild is onder de adellijke families. \n\n Om het allemaal nog erger te maken staat er in het Noorden een \n oud kwaad op, klaar om het verscheurde Westeros binnen te vallen\n\nSeizoen 2 Aflevering 8: &quot;The Prince of Winterfell&quot;\n\n Alan Taylor David Benioff &amp; D. B. Weiss May 20, 2012 3.86[68] \nRobb Stark learns that his mother Catelyn has secretly freed Jaime Lannister, now escorted by Brienne of Tarth, in order to ransom her daughters Sansa and Arya; he also enters into a romantic relationship with the healer Talisa. Tywin Lannister leaves Harrenhal to attack Robb, which leads Arya Stark, Gendry and Hot Pie to attempt an escape with Jaqen H'ghar's help. In King's Landing, Cersei Lannister attempts to blackmail Tyrion by abducting the whore, Ros, whom Cersei believes to be his secret lover. The capital prepares for assault by Stannis, who, underway to King's Landing, promises to make Davos Seaworth his Hand of the King. Beyond the Wall, the Wildling leader &quot;Rattleshirt&quot; leads the captured Jon Snow and Qhorin Halfhand to his king, Mance Rayder. In Qarth, Jorah Mormont agrees to accompany Daenerys into the House of the Undying to retrieve her dragons.  \n\n\nBy Chickie","torrent":{"xt":"urn:btih:de1f5da481434fb412b6cf3e9caa69470cbfaa2d","amp;dn":"Game+of+Thrones+S02E08+%282012%29DviX+nl+subs+NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de1f5da481434fb412b6cf3e9caa69470cbfaa2d","infoHashBuffer":{"type":"Buffer","data":[222,31,93,164,129,67,79,180,18,182,207,62,156,170,105,71,12,191,170,45]},"announce":[],"urlList":[]}}