{"title":"Prince of Fools: The Red Queen's War, Book 1","uid":10485474,"size":634110970,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:de7750c5b1ab3baf16467baf2f3422f9a2df8b3a&amp;dn=Prince+of+Fools%3A+The+Red+Queen%27s+War%2C+Book+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":null,"files":4,"time":1404470979,"description":"Hailed as &quot;epic fantasy on a George R. R. Martin scale, but on speed&quot; (Fixed on Fantasy), the Broken Empire trilogy introduced a bold new world of dark fantasy with the story of Jorg Ancrath' s devastating rise to power. Now, Mark Lawrence returns to the Broken Empire with the tale of a less ambitious prince.\n\nThe Red Queen is old but the kings of the Broken Empire dread her like no other. For all her reign, she has fought the long war, contested in secret, against the powers that stand behind nations, for higher stakes than land or gold. Her greatest weapon is The Silent Sister - unseen by most and unspoken of by all.\n\nThe Red Queen's grandson, Prince Jalan Kendeth - drinker, gambler, seducer of women - is one who can see The Silent Sister. Tenth in line for the throne and content with his role as a minor royal, he pretends that the hideous crone is not there. But war is coming. Witnesses claim an undead army is on the march, and the Red Queen has called on her family to defend the realm. Jal thinks it' s all a rumor - nothing that will affect him - but he is wrong. After escaping a death trap set by the Silent Sister, Jal finds his fate magically intertwined with a fierce Norse warrior. As the two undertake a journey across the Empire to undo the spell, encountering grave dangers, willing women, and an upstart prince named Jorg Ancrath along the way, Jalan gradually catches a glimmer of the truth: He and the Norseman are but pieces in a game, part of a series of moves in the long war - and the Red Queen controls the board.","torrent":{"xt":"urn:btih:de7750c5b1ab3baf16467baf2f3422f9a2df8b3a","amp;dn":"Prince+of+Fools%3A+The+Red+Queen%27s+War%2C+Book+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7750c5b1ab3baf16467baf2f3422f9a2df8b3a","infoHashBuffer":{"type":"Buffer","data":[222,119,80,197,177,171,59,175,22,70,123,175,47,52,34,249,162,223,139,58]},"announce":[],"urlList":[]}}