{"title":"Marijuana 101 - Introduction To Growing Grade A Bud By Professor","uid":9731894,"size":29444483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfc497f3d3af0e83a43456706811afe2bc859660&amp;dn=Marijuana+101+-+Introduction+To+Growing+Grade+A+Bud+By+Professor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1394395901,"description":"Format: mobi/epub\nGenre: Horticulture\nPrint Length: 215 pages\nRelease Date: 2011\n\nDescription:\n\nWritten for first-time growers, MARIJUANA 101 will help those who don't have endless supplies of time and money, but are still looking to find success with a small personal crop. Starting from the very beginning, Professor Lee walks the reader through issues often overlooked in more exhaustive books. He discusses what to think about before even choosing to grow, how to keep it secret and, most usefully, how to keep it cheap. He then covers what to buy and where, how to make sense of the equipment available, the merits of different grow techniques and basic bud history and theory.\n\nUnlike the vast majority of other grow books, Marijuana 101 reads like an informal study guide for an &quot;Introduction to Growing&quot; course run by a professor who had a successful grow for a decade. Professor Lee involves his readers and helps them over each potential stumbling block, with constant reference to his own experience, giving the book the personal touch similar guides lack. \n\nReview:\n\n&quot;This is the book I wanted to have when I first started growing. The explanations are simple to understand, and written for the small-scale home gardener; no previous experience is needed.\n\nConversational text, photos of pretty buds and straightforward illustrations fill this refreshingly easy to comprehend marijuana grow primer. For those who enjoy good bud photography, some of the flowering cannabis photos are exceptional. For visual learners, Professor Lee includes several step-by-step photo tutorials.\n\nThe book is divided into two parts, the first portion of the book addresses the technical aspects involved in growing weed, and the second part teaches readers about the practical applications. These divisions are called &quot;lessons&quot; and each is further broken up into several topics.&quot; - cannabis.info","torrent":{"xt":"urn:btih:dfc497f3d3af0e83a43456706811afe2bc859660","amp;dn":"Marijuana+101+-+Introduction+To+Growing+Grade+A+Bud+By+Professor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc497f3d3af0e83a43456706811afe2bc859660","infoHashBuffer":{"type":"Buffer","data":[223,196,151,243,211,175,14,131,164,52,86,112,104,17,175,226,188,133,150,96]},"announce":[],"urlList":[]}}