{"title":"Germany’s War and the Holocaust: Disputed Histories","uid":15811043,"size":470898,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfc4316d9cd83d537ff672a4930ad189ab47ee62&amp;dn=Germany%26rsquo%3Bs+War+and+the+Holocaust%3A+Disputed+Histories&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"marty14","files":1,"time":1473636202,"description":"Germany’s War and the Holocaust: Disputed Histories - Omer Bartov [epub]\r\n\r\nOmer Bartov, a leading scholar of the Wehrmacht and the Holocaust, provides a critical analysis of various recent ways to understand the genocidal policies of the Nazi regime and the reconstruction of German and Jewish identities in the wake of World War II. Germany's War and the Holocaust both deepens our understanding of a crucial period in history and serves as an invaluable introduction to the vast body of literature in the field of Holocaust studies.\r\n\r\nDrawing on his background as a military historian to probe the nature of German warfare, Bartov considers the postwar myth of army resistance to Hitler and investigates the image of Blitzkrieg as a means to glorify war, debilitate the enemy, and hide the realities of mass destruction. The author also addresses several new analyses of the roots and nature of Nazi extermination policies, including revisionist views of the concentration camps. Finally, Bartov examines some paradigmatic interpretations of the Nazi period and its aftermath: the changing American, European, and Israeli discourses on the Holocaust; Victor Klemperer's view of Nazi Germany from within; and Germany's perception of its own victimhood","torrent":{"xt":"urn:btih:dfc4316d9cd83d537ff672a4930ad189ab47ee62","amp;dn":"Germany%26rsquo%3Bs+War+and+the+Holocaust%3A+Disputed+Histories","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc4316d9cd83d537ff672a4930ad189ab47ee62","infoHashBuffer":{"type":"Buffer","data":[223,196,49,109,156,216,61,83,127,246,114,164,147,10,209,137,171,71,238,98]},"announce":[],"urlList":[]}}