{"title":"CBT Nuggets - Definitive Guide to working with GNS3 by Keith Bar","uid":7996499,"size":2633626319,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e004fb5ab817595b8358d4ffa06733c9c2523071&amp;dn=CBT+Nuggets+-+Definitive+Guide+to+working+with+GNS3+by+Keith+Bar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"angelos2225","files":-1,"time":1357634504,"description":"From http://www.cbtnuggets.com/it-training-videos/series/gns3 :\n\nGNS3 is a free, open-source tool that provides emulation of network hardware (such as Cisco routers and firewalls), so that customers can practice, configure, and troubleshoot network scenarios all in a virtual environment running right on their Windows, Mac OSX or Linux computers. Multiple network topologies can be saved, paused and/or resumed on the fly so that the learner can practice at the convenience of their own schedule. GNS3 provides the emulation of the physical devices, and the user provides the OS image for the version/vendor of the software they want to practice on.\n\nGNS3 is a fantastic tool, but there are a few stumbling blocks facing the typical user. In this video series, CBT Nuggets trainer Keith Barker becomes your tour guide and introduces the typical issues facing every GNS3 user and, more importantly, how to overcome and solve each of these challenges. Topics in the video series include running GNS3 in Windows, Mac and Linux environments; how to integrate virtual workstations into the GNS3 topology; how to connect the virtual GNS3 network to a live network; and much more. \n\nAnd about Keith Barker:\n\nKeith Barker is a trainer and consultant with more than 27 years of IT experience. He has been named a Cisco Designated VIP and is the author of numerous Cisco Press books and articles. Keith also posts IT videos to his YouTube channel, Keith6783.\n\nI uploaded the files in .flv format, just like i found them\nYou can always convert them to whatever you need by using WinFF (or just FFmpeg)","torrent":{"xt":"urn:btih:e004fb5ab817595b8358d4ffa06733c9c2523071","amp;dn":"CBT+Nuggets+-+Definitive+Guide+to+working+with+GNS3+by+Keith+Bar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e004fb5ab817595b8358d4ffa06733c9c2523071","infoHashBuffer":{"type":"Buffer","data":[224,4,251,90,184,23,89,91,131,88,212,255,160,103,51,201,194,82,48,113]},"announce":[],"urlList":[]}}