{"title":"World of Warcraft-Illidan by William King-2016","uid":15525215,"size":447709831,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e1405f37abb6e14ec11d3a9720a7765e844d9629&amp;dn=World+of+Warcraft-Illidan+by+William+King-2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"sever29","files":35,"time":1470776832,"description":"Info: \r\nOriginal Title: Illidan: World of Warcraft\r\nASIN:  B015LYSIXA\r\nOriginally published: April 12, 2016\r\nAuthor: William King\r\nNarrator: Graeme Malcolm\r\nLength: 10 hours 18 minutes\r\nQuality: MP3\r\n\r\nBehind the legend stands an individual hungry for justice and vengeance - as the adventure, intrigue, and heroism of World of Warcraft rise to a new level. You are not prepared. Illidan Stormrage is one of the most powerful beings ever to walk the lands of Azeroth. He is also one of the least understood. Behind his legend, beneath his enigmatic mission, lies a brilliant mind whose machinations are comprehended by few - and trusted by even fewer. Illidan's righteous reign of justice and vengeance has begun. Long ago, the night elf sorcerer Illidan infiltrated the demonic Burning Legion to ward off its invasion of Azeroth. Instead of hailing him as a hero, his own kind branded him the Betrayer, questioning his intentions after he appeared to aid the demon lords. For 10,000 years he languished in prison - vilified, isolated, but never forgetting his purpose. Now the Legion has returned, and there is only one champion who can truly stand against it. Released from his bonds, Illidan prepares for the final confrontation in the alien realm of Outland, gathering an army of grotesque fel orcs, serpentine naga, cunning blood elves, and twisted demon hunters to his side. He alone knows what deeply hidden motives guide his hand; he alone understands the price that must be paid to defeat the enemies of creation. Yet as before, he is assailed by those who see his schemes as a cynical quest for power, including the night elf Maiev Shadowsong, his former jailor. Warden Shadowsong and her Watchers have pursued the Betrayer to Outland to exact retribution for his crimes, and she will not rest until Illidan is in her custody...or in his grave","torrent":{"xt":"urn:btih:e1405f37abb6e14ec11d3a9720a7765e844d9629","amp;dn":"World+of+Warcraft-Illidan+by+William+King-2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1405f37abb6e14ec11d3a9720a7765e844d9629","infoHashBuffer":{"type":"Buffer","data":[225,64,95,55,171,182,225,78,193,29,58,151,32,167,118,94,132,77,150,41]},"announce":[],"urlList":[]}}