{"title":"An Astronaut's Guide to Life on Earth [2013][Chris Hadfield][mob","uid":9160497,"size":12701201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e199b46a296648eef320163731fc337821084377&amp;dn=An+Astronaut%27s+Guide+to+Life+on+Earth+%5B2013%5D%5BChris+Hadfield%5D%5Bmob&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1383866616,"description":"An Astronaut's Guide to Life on Earth: What Going to Space Taught Me About Ingenuity, Determination, and Being Prepared for Anything by Chris Hadfield\n\n\nFormat: mobi/epub\nLength: 304 pages\nGenre: Non-Fiction/Science/Self-Help\nDate: 29 October 2013\n\nColonel Chris Hadfield has spent decades training as an astronaut and has logged nearly 4000 hours in space. During this time he has broken into a Space Station with a Swiss army knife, disposed of a live snake while piloting a plane, and been temporarily blinded while clinging to the exterior of an orbiting spacecraft. The secret to Col. Hadfield's success-and survival-is an unconventional philosophy he learned at NASA: prepare for the worst-and enjoy every moment of it.\n\nIn An Astronaut's Guide to Life on Earth, Col. Hadfield takes readers deep into his years of training and space exploration to show how to make the impossible possible. Through eye-opening, entertaining stories filled with the adrenaline of launch, the mesmerizing wonder of spacewalks, and the measured, calm responses mandated by crises, he explains how conventional wisdom can get in the way of achievement-and happiness. His own extraordinary education in space has taught him some counterintuitive lessons: don't visualize success, do care what others think, and always sweat the small stuff.\n\nAuthor: &lt;a href=&quot;\nhttp://image.bayimg.com/feb2ef2c3547fd2ee4b616c8eed81ca415ef4977.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/feb2ef2c3547fd2ee4b616c8eed81ca415ef4977.jpg&lt;/a&gt;\nChris Hadfield is one of the most seasoned and accomplished astronauts in the world. The top graduate of the U.S. Air Force Test Pilot School in 1988 and U.S. Navy test pilot of the year in 1991, Hadfield was selected by the Canadian Space Agency to be an astronaut in 1992. He was CAPCOM for 25 Shuttle launches and served as Director of NASA Operations in Star City, Russia from 2001-2003, Chief of Robotics at the Johnson Space Center in Houston from 2003-2006, and Chief of International Space Station Operations from 2006-2008.\n\nAll thanks goes to the original uploaders","torrent":{"xt":"urn:btih:e199b46a296648eef320163731fc337821084377","amp;dn":"An+Astronaut%27s+Guide+to+Life+on+Earth+%5B2013%5D%5BChris+Hadfield%5D%5Bmob","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e199b46a296648eef320163731fc337821084377","infoHashBuffer":{"type":"Buffer","data":[225,153,180,106,41,102,72,238,243,32,22,55,49,252,51,120,33,8,67,119]},"announce":[],"urlList":[]}}