{"title":"World Soccer Winning Eleven 8 International [SPA-ENG] [DVD]","uid":3286216,"size":2059617202,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e2b4185a62fbc7e92d1ee0555aef9b9ec94309b2&amp;dn=World+Soccer+Winning+Eleven+8+International+%5BSPA-ENG%5D+%5BDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"pctorrent","files":5,"time":1107706808,"description":"Featuring 136 club teams and 57 national teams, Winning Eleven 8 \n       offers gamers control of up to 4,500 of the world's greatest \n       soccer players. The inclusion of licensed leagues is a huge step \n       forward for the series, with player likenesses, names and official \n       kits, bolstering what is already considered the most advanced and \n       realistic soccer game to date. \n\n       The world's biggest stars are brought to life through photo \n       realistic graphics and authentically modeled features, as well as \n       individual styles of play, movement and ball control. \n       Additionally, the game introduces a wealth of new moves and tricks \n       including new free kick and penalty kick techniques, an innovative \n       indirect free kick move and a new dribbling system that offers \n       more control as gamers go one-on-one against opposing players. \n       Teaming up with these new features will be more advanced player \n       stats that govern every aspect of their play, including how well \n       players can bring a ball under control, hit it past an encroaching \n       defender or flick it to a teammate. \n\n       Further adding to the excitement of the game, Winning Eleven 8 \n       also features the first-ever on-screen referee in the history of \n       the series. Boasting an enhanced ref AI, the referee will run up \n       and down the field reacting realistically and instinctively to \n       fouls, giving advantage for minor infringements and even stepping \n       in to calm things down when the action gets heated.","torrent":{"xt":"urn:btih:e2b4185a62fbc7e92d1ee0555aef9b9ec94309b2","amp;dn":"World+Soccer+Winning+Eleven+8+International+%5BSPA-ENG%5D+%5BDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b4185a62fbc7e92d1ee0555aef9b9ec94309b2","infoHashBuffer":{"type":"Buffer","data":[226,180,24,90,98,251,199,233,45,30,224,85,90,239,155,158,201,67,9,178]},"announce":[],"urlList":[]}}