{"title":"Erich von Manstein: Hitler's Master Strategist","uid":15811006,"size":840280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2f926469dfd1e1bf6c30edcc3d81e07ac9ff129&amp;dn=Erich+von+Manstein%3A+Hitler%27s+Master+Strategist&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"marty14","files":1,"time":1473635762,"description":"Erich von Manstein: Hitler's Master Strategist - Benoît Lemay [epub]\r\n\r\nTo many close students of World War II, von Manstein is already considered to be the greatest commander of the war, if not the entire 20th century. He devised the plan that conquered France in 1940, thence led an infantry corps in that campaign; at the head of a panzer corps he reached the gates of Leningrad in 1941, then took command of 11th Army and conquered Sevastopol and the Crimea. After destroying another Soviet army in the north, he was given command of the ad hoc Army Group Don to retrieve the German calamity at Stalingrad, whereupon he launched a counteroffensive that, against all odds, restored the German front. Afterward he commanded Army Group South, nearly crushing the Soviets at Kursk, and then skillfully resisted their relentless attacks, as he traded territory for coherence in the East.\r\n\r\nThough an undoubtedly brilliant military leader―whose achievements, considering the forces at his disposal, cast those of Patton, Rommel, MacArthur, and Montgomery in the pale―surprisingly little is known about Manstein himself, save for his own memoir and the accolades of his contemporaries. In this book we finally have a full portrait of the man, including his campaigns, and an analysis of what precisely kept a genius such as Manstein harnessed to such a dark cause.\r\n\r\nA great military figure, but a man who lacked a razor-sharp political sense, Manstein was very much representative of the Germano-Prussian military caste of his time. Though Hitler was uneasy about the influence he had gained throughout the German Army, Manstein ultimately declined to join any clandestine plots against his Führer, believing they would simply cause chaos, the one thing he abhorred. Even though he constantly opposed Hitler on operational details, he considered it a point of loyalty to simply stand with the German state, in whatever form","torrent":{"xt":"urn:btih:e2f926469dfd1e1bf6c30edcc3d81e07ac9ff129","amp;dn":"Erich+von+Manstein%3A+Hitler%27s+Master+Strategist","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2f926469dfd1e1bf6c30edcc3d81e07ac9ff129","infoHashBuffer":{"type":"Buffer","data":[226,249,38,70,157,253,30,27,246,195,14,220,195,216,30,7,172,159,241,41]},"announce":[],"urlList":[]}}