{"title":"The Woodworker &amp; Woodturner - September 2016 (gnv64)","uid":15445296,"size":21021675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e311565c5c21610585dd453a1965609c8d0da9cb&amp;dn=The+Woodworker+%26amp%3B+Woodturner+-+September+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"gnv65","files":4,"time":1469873589,"description":"The Woodworker &amp; Woodturner - September 2016\r\nEnglish | 92 pages | True PDF | 20 mb\r\n\r\nWOODWORK\r\n14 Wood, boring? Never! Part 1 - Robin Gates explores the many ways of boring holes in timber and admits to a grudging admiration for woodworm\r\n26 Horsing around - Ian Wilkie makes two charming stable blocks using birch plywood, which would make ideal gifts for grandchildren with a love of all things equestrian\r\n32 The woodturning people - Taking advantage of a warm spring day, Andy King ventures over to Dover to visit the premises of ‘the woodturning people’ – longestablished family business Stiles and Bates\r\n36 Fitted furniture: some of the basics – part 2 Almost at the end of the build, the Editor fits a simple panelled door, glues everything up and takes a break before considering the final paint job\r\n42 Safety fi rst - Considering the fact that safety should always be at the forefront of every woodworker’s mind, the Editor discusses the issue of unguarded machines and how to avoid dangerous practices\r\n44 Spice up your kitchen! - Need a last-minute gift for the mother-in-law? It’s James Brolly to the rescue, with a simple spice rack\r\n46 How we chilled in the old days - This article from The Woodworker of April 1952 tackles the tricky task of building your own refrigerator – not something we would likely tackle today but certainly a source of inspiration for many a maker\r\n49 Nesting instinct - Dominic Collings employs functional design and classic joinery to make a fine set of oak tables\r\n90 The learning days - Documenting his first day as a cabinetmaker, Peter Baker discusses the intricacies of sharpening tools and how he was taught to ‘do it properly’ – lessons that have stayed with him until this day\r\nTURNING &amp; CARVING\r\n57 Out of this world - Returning from a short break, Colin Simpson takes inspiration from our great galaxy to create\r\nan eye-catching enhanced bowl with a cosmic twist\r\n70 Make it personal - Bernard Greatrix shows that with a handful of tools and a little imagination, woodcarving can enhance your projects\r\nON TEST\r\n78 Milwaukee M18 BP 18V planer\r\n80 Charnwood BS350 Premium bandsaw\r\n82 Triton 12V drill &amp; driver set\r\n84 Veritas tapered snug plug cutters\r\nREGULARS\r\n3 Welcome\r\n8 AOB &amp; diary\r\n11 Timber directory\r\n13 News from D&amp;M Tools\r\n25 Readers’ letters\r\n46 Archive\r\n64 Subscriptions\r\n89 Marketplace\r\n \nhttps://s31.postimg.org/yr9j7fnor/The_Woodworker_Woodturner_September_2016.jpg","torrent":{"xt":"urn:btih:e311565c5c21610585dd453a1965609c8d0da9cb","amp;dn":"The+Woodworker+%26amp%3B+Woodturner+-+September+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e311565c5c21610585dd453a1965609c8d0da9cb","infoHashBuffer":{"type":"Buffer","data":[227,17,86,92,92,33,97,5,133,221,69,58,25,101,96,156,141,13,169,203]},"announce":[],"urlList":[]}}