{"title":"Men’s Fitness - Your Ultimate Fat Loss 28 Day Plan","uid":15445616,"size":41307107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3140e51fcd473d4f5b4c4b29013cefc66c55b05&amp;dn=Men%26rsquo%3Bs+Fitness+-+Your+Ultimate+Fat+Loss+28+Day+Plan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":null,"files":1,"time":1469878874,"description":"It’s never too late to get in shape. All you need is four weeks and this ultimate gym-free guide to cut fat, build lean muscle and feel your best.\r\n\r\nThis 164-page fat loss bible will provide you with everything you need to burn fat fast. The four-week training and meal plan is designed by Bradley Simmonds, personal trainer to top Premier League footballers and a leading coach on Instagram where he inspires his 90,000+ followers with daily workouts. The book includes 18 easy-to-follow workouts that can all be done at home and each take less than 20 minutes, making it perfect for the busiest of schedules. They cycle between high-intensity interval training (HIIT) to burn calories, resistance training to build strength and low intensity yoga-inspired drills for recovery, designed by top London instructor Laura-Kate Brown.\r\n\r\nAlongside the workouts are detailed meal plans for the full 28 days with 16 delicious recipes to follow, from a hearty full-English breakfast to cheat-day oat pancakes that will help you lose fat without sacrificing flavour. In the book you’ll also find the most up-to-date training and nutrition knowledge from the experts at Men’s Fitness, from the supplements to support your efforts, the essential training kit to invest in and holiday drills to stay trim on the go, to help you get – and stay – fit and healthy long-term.\r\n\r\nMen’s Fitness - Your Ultimate Fat Loss 28 Day Plan\r\nEnglish | 164 pages | PDF | 19.00 MB","torrent":{"xt":"urn:btih:e3140e51fcd473d4f5b4c4b29013cefc66c55b05","amp;dn":"Men%26rsquo%3Bs+Fitness+-+Your+Ultimate+Fat+Loss+28+Day+Plan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3140e51fcd473d4f5b4c4b29013cefc66c55b05","infoHashBuffer":{"type":"Buffer","data":[227,20,14,81,252,212,115,212,245,180,196,178,144,19,206,252,102,197,91,5]},"announce":[],"urlList":[]}}