{"title":"RealtimeBondage--Earning Stripes Part 2  Dresden High","uid":15932340,"size":2483576607,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e4322cf7b07102df97510a408d63a9744486f49e&amp;dn=RealtimeBondage--Earning+Stripes+Part+2++Dresden+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":6,"uploader":"merzedes","files":1,"time":1475367928,"description":"Earning Stripes Part 2 | Dresden\r\n\r\nOctober 1, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nA Few Lashes Leave a Lasting Impression \r\n \r\nDresden is a filthy little slut and she knows it. Or if she didn't before it is going to be made painfully clear to her by the end of her time with us. As everyone knows the best way to make someone really look at themselves and who they are as a person is to break them all the way down to their core, so that is exactly what our handlers are going to do. First through complete abject humiliation, and then through pure, simple, terrible pain.\r\n\r\nDresden starts out this session in the racks with her legs and arms spread, her entire naked body completely exposed to us. The next step is to make her look as ridiculous as possible. Two of our handlers take turns covering Dresden's face in spit. Her makeup runs down her face with the streams of saliva. It is absolutely disgusting and she looks pitiful. But that isn't enough. We remove her fake eyelashes and put them on her upper lip like a false mustache. It's clear from looking at her that she knows just how silly she looks and she doesn't like it very much.\r\n\r\nThen it's time for the pain portion of Dresden's day with us. We suspend her from the ceiling by her wrists, just high enough that she is forced to stand on her tip toes and her whole body looks stretched out. Our two handlers then each take out a whip and start tearing into the soft flesh of her tits and her back. Each time one of the lashes lands on one of her nipples, Dresden recoils and shrieks. But it's not over until O.T. canes that fine ass of hers. She squirms away but there is only so far you can go when you are chained in place. Soon enough her body is covered up and down with marks from the abuse she's been receiving. And we haven't even gotten to her feet yet. \r\n \r\nScreens \nhttp://www.realtimebondage.com/live/bondage/trailer.php?y=2016&amp;p=10_01dresden2&amp;u=RealTimeBondage-Dresden-Earning-Stripes-Part-2\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:e4322cf7b07102df97510a408d63a9744486f49e","amp;dn":"RealtimeBondage--Earning+Stripes+Part+2++Dresden+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4322cf7b07102df97510a408d63a9744486f49e","infoHashBuffer":{"type":"Buffer","data":[228,50,44,247,176,113,2,223,151,81,10,64,141,99,169,116,68,134,244,158]},"announce":[],"urlList":[]}}