{"title":"Adam LeBor - Tower of Basel - The Shadowy History of the Secret","uid":15947588,"size":920672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e43cb17b9f6bf24fbc4bfec0ee85f2ba21743645&amp;dn=Adam+LeBor+-+Tower+of+Basel+-+The+Shadowy+History+of+the+Secret+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"roflcopter2110","files":2,"time":1475530885,"description":"https://cdn.pximg.xyz/538bbc3c4facf38e563895ed67bba141.png\r\n \nhttp://boltimg.com/images/fodrG.jpg\r\n\r\nAdam LeBor - Tower of Basel - The Shadowy History of the Secret Bank that Runs the World - epub [TKRG]\r\n\r\nTower of Basel is the first investigative history of the world’s most secretive global financial institution. Based on extensive archival research in Switzerland, Britain, and the United States, and in-depth interviews with key decision-makers—including Paul Volcker, the former chairman of the US Federal Reserve; Sir Mervyn King, governor of the Bank of England; and former senior Bank for International Settlements managers and officials—Tower of Basel tells the inside story of the Bank for International Settlements (BIS): the central bankers’ own bank.\r\n\r\nCreated by the governors of the Bank of England and the Reichsbank in 1930, and protected by an international treaty, the BIS and its assets are legally beyond the reach of any government or jurisdiction. The bank is untouchable. Swiss authorities have no jurisdiction over the bank or its premises. The BIS has just 140 customers but made tax-free profits of $1.17 billion in 2011–2012.\r\n\r\nSince its creation, the bank has been at the heart of global events but has often gone unnoticed. Under Thomas McKittrick, the bank’s American president from 1940–1946, the BIS was open for business throughout the Second World War. The BIS accepted looted Nazi gold, conducted foreign exchange deals for the Reichsbank, and was used by both the Allies and the Axis powers as a secret contact point to keep the channels of international finance open","torrent":{"xt":"urn:btih:e43cb17b9f6bf24fbc4bfec0ee85f2ba21743645","amp;dn":"Adam+LeBor+-+Tower+of+Basel+-+The+Shadowy+History+of+the+Secret+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e43cb17b9f6bf24fbc4bfec0ee85f2ba21743645","infoHashBuffer":{"type":"Buffer","data":[228,60,177,123,159,107,242,79,188,75,254,192,238,133,242,186,33,116,54,69]},"announce":[],"urlList":[]}}