{"title":"The Happiness Project  - Gretchen Rubin - EPUB","uid":10609023,"size":537864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4f0e556b61f72166f2be5c646dc99da2ebd0265&amp;dn=The+Happiness+Project++-+Gretchen+Rubin+-+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"nosnavis","files":1,"time":1406020578,"description":"The Happiness Project: Or, Why I Spent a Year Trying to Sing in the Morning, Clean My Closets, Fight Right, Read Aristotle, and Generally Have More Fun \nBy Gretchen Rubin\nHarperCollins Publishers (2011)\nEPUB\n\n\nGretchen Rubin had an epiphany one rainy afternoon in the unlikeliest of places: a city bus. &quot;The days are long, but the years are short,&quot; she realized. &quot;Time is passing, and I'm not focusing enough on the things that really matter.&quot; In that moment, she decided to dedicate a year to her happiness project.\n\nIn this lively and compelling account of that year, Rubin carves out her place alongside the authors of bestselling memoirs such as Julie and Julia, The Year of Living Biblically, and Eat, Pray, Love. With humor and insight, she chronicles her adventures during the twelve months she spent test-driving the wisdom of the ages, current scientific research, and lessons from popular culture about how to be happier.\n\nWritten with charm and wit, The Happiness Project is illuminating yet entertaining, thought-provoking yet compulsively readable. Gretchen Rubin's passion for her subject jumps off the page, and reading just a few chapters of this book will inspire you to start your own happiness project.","torrent":{"xt":"urn:btih:e4f0e556b61f72166f2be5c646dc99da2ebd0265","amp;dn":"The+Happiness+Project++-+Gretchen+Rubin+-+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f0e556b61f72166f2be5c646dc99da2ebd0265","infoHashBuffer":{"type":"Buffer","data":[228,240,229,86,182,31,114,22,111,43,229,198,70,220,153,218,46,189,2,101]},"announce":[],"urlList":[]}}