{"title":"The First Crusade: A New History","uid":15770713,"size":812973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4fa2f465f7a9e43b830de28566b3371a27e461a&amp;dn=The+First+Crusade%3A+A+New+History&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"marty14","files":1,"time":1473201095,"description":"The First Crusade: A New History - Thomas Asbridge [epub]\r\n\r\nIn The First Crusade, Thomas Asbridge offers a gripping account of a titanic three-year adventure filled with miraculous victories, greedy princes, and barbarity on a vast scale. Beginning with the electrifying speech delivered by Pope Urban II on the last Tuesday of November in the year 1095, readers will follow the more than 100,000 men who took up the call from their mobilization in Europe (where great waves of anti-Semitism resulted in the deaths of thousands of Jews), to their arrival in Constanstinople, an exotic, opulent city--ten times the size of any city in Europe--that bedazzled the Europeans.\r\n\r\nFeatured in vivid detail are the siege of Nicaea and the pivotal battle for Antioch, the single most important military engagement of the entire expedition, where the crusaders, in desparate straits, routed a larger and better equipped Muslim army. Through all this, the crusaders were driven on by intense religious devotion, convinced that their struggle would earn them the reward of eternal paradise in Heaven. But when a hardened core finally reached Jerusalem in 1099 they unleahsed an unholy wave of brutality, slaughtering thousands of Muslims--men, women, and children--all in the name of Christianity.\r\n\r\nThe First Crusade marked a watershed in relations between Islam and the West, a conflict that set these two world religions on a course toward deep-seated animosity and enduring enmity. The chilling reverberations of this earth-shattering clash still echo in the world today","torrent":{"xt":"urn:btih:e4fa2f465f7a9e43b830de28566b3371a27e461a","amp;dn":"The+First+Crusade%3A+A+New+History","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4fa2f465f7a9e43b830de28566b3371a27e461a","infoHashBuffer":{"type":"Buffer","data":[228,250,47,70,95,122,158,67,184,48,222,40,86,107,51,113,162,126,70,26]},"announce":[],"urlList":[]}}