{"title":"Spider-Man 2â„¢ Game","uid":3268063,"size":647729040,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e523a388eaf9e84bec0ada8449332973d1e26888&amp;dn=Spider-Man+2%E2%84%A2+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"fcjr","files":1,"time":1103768622,"description":"This Time. There Is Nowhere You Can't Go.\n\nTwo years have passed since Peter Parker first hit the streets of New York City as the conflicted crime-fighter Spider-Man. Now he finds himself battling his most diabolical villain yet, the mechanized, multi-tentacled Doc Ock. The nefarious Doc Ock was once Dr. Otto Octavius, a brilliant nuclear physicist. But a freak accident transformed him from a timid researcher to a criminally insane megalomaniac who blames Spider-Man for his horrible transformation. Now the scientist Peter once idolized for his remarkable intellect has marked our web-slinger for death.\n\nExperience total freedom as you soar through the concrete canyons of a living, breathing Manhattan, complete with familiar landmarks and bustling, traffic-clogged streets. True non-linear gameplay (GameCubeâ„¢, PlayStationÂ®2, and XboxÂ® only) means you can web-swing wherever you like, whenever you like, exploring the vast metropolis and reliving scenes from the Spider-Man 2â„¢ movie. Combat petty thugs and aid NYC citizens in challenging side-quests, or pursue the lunatic Doc Ock and other classic Spider-Man rivals. The decision is yours.\n\t \t\n\nTake Manhattan for a spin in Spider-Man 2â„¢.\n","torrent":{"xt":"urn:btih:e523a388eaf9e84bec0ada8449332973d1e26888","amp;dn":"Spider-Man+2%E2%84%A2+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e523a388eaf9e84bec0ada8449332973d1e26888","infoHashBuffer":{"type":"Buffer","data":[229,35,163,136,234,249,232,75,236,10,218,132,73,51,41,115,209,226,104,136]},"announce":[],"urlList":[]}}