{"title":"Acoustica CD DVD Label Maker 3.29-serial incl(lightscribe)","uid":4646693,"size":22095517,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e70fc07784dfa2311f1c40ea50f7846cfe51b5c2&amp;dn=Acoustica+CD+DVD+Label+Maker+3.29-serial+incl%28lightscribe%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"jmb2012","files":4,"time":1231907597,"description":"Why let the artists have all the fun? Create your own CD/DVD labels and CD jewel cases with the ultimate in ease and flexibility! If you're sick of guessing which songs are on which CD, get the CD label software that automatically puts your track list on your CD/DVD label! Chock full of custom art for holidays and special occasions like Christmas, Valentines, birthdays, vacations, weddings and more! Automatically imports your track information from Acoustica MP3 CD Burner, iTunes, WinAmp, Easy CD Creator or any other popular playlist or previously burnt CD! Print on standard paper, stock sticker labels, CD jewel case templates or print directly on a CD or DVD*! Automatically import your iTunes play lists!     Buy it now for just $21.95!\tVersion 3 now supports HP LightScribe direct labeling drives! Acoustica is a certified HP LightScribe software partner.\n\n\n\nProduct Features\nSupports HP LightScribe direct labeling drives - your search for easy LightScribe software is over!\nPrint to multiple LightScribe drives simultaneously!\nNow supports partial transparency for images, text backgrounds and PNG images with alpha layers.\nAutomatically align your printers with the Printer Alignment Wizard!\nNow reads data or backup CDs and creates an instant summary!\nVideo DVD / Chapter support!\nImport art from tons of stock graphics or your own photographs\nAutomatically import your music playlists such as iTunes or read the contents of your previously burnt CD into visually appealing arrangements. (Also reads MP3 CDs and data CDs and DVDs!)\nCreate curved and spiral text!\nEasy wizards help create your CD/DVD/mini CD labels and CD jewel cases\nSupports 99% of stock CD labels and CD jewel case templates!\nSupport for the new direct-to-CD printers!\nSupport for DVD cases\nSupports Asian fonts!!!\nSupports JPEG, PNG, GIF, TIF, and more, including various digital camera RAW image formats\n\n\n\nPentiumII-400\nWin95/98/NT/2K/ME/XP/Vista\n64 MB Ram\nPrinter","torrent":{"xt":"urn:btih:e70fc07784dfa2311f1c40ea50f7846cfe51b5c2","amp;dn":"Acoustica+CD+DVD+Label+Maker+3.29-serial+incl%28lightscribe%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e70fc07784dfa2311f1c40ea50f7846cfe51b5c2","infoHashBuffer":{"type":"Buffer","data":[231,15,192,119,132,223,162,49,31,28,64,234,80,247,132,108,254,81,181,194]},"announce":[],"urlList":[]}}