{"title":"In Such Good Company: Eleven Years of Laughter..","uid":15852328,"size":11721038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e73588d3e7ffcb2592eb1d86c9788a27a2bd60a0&amp;dn=In+Such+Good+Company%3A+Eleven+Years+of+Laughter..&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"BanchMon2","files":1,"time":1474171588,"description":"In Such Good Company: Eleven Years of Laughter, Mayhem, and Fun in the Sandbox (2016) by Carol Burnett\r\n\r\n\r\nIn Such Good Company: Eleven Years of Laughter, Mayhem, and Fun in the Sandbox By Carol Burnett\r\n2016 | 288 Pages | ISBN: 1101904658 | EPUB | 11 MB\r\n\r\n\r\n Comedy legend Carol Burnett tells the hilarious behind-the-scenes story of her iconic weekly variety series, The Carol Burnett Show. Who but Carol Burnett herself has the timing, talent, and wit to pull back the curtain on the Emmy-Award winning show that made television history for eleven glorious seasons? In Such Good Company delves into little-known stories of the guests, sketches and antics that made the show legendary, as well as some favorite tales too good not to relive again. Carol lays it all out for us, from the show s original conception to its evolution into one of the most beloved primetime programs of its generation. Written with all the charm and humor fans expect from a masterful entertainer like Carol Burnett, In Such Good Company skillfully highlights the elements that made the show so successful in a competitive period when TV variety shows ruled the air waves. Putting the spotlight on everyone from her talented costars to her amazing guest stars the most celebrated and popular entertainers of their day Carol crafts a lively portrait of the talent and creativity that went into every episode. Here are all the topics readers want to know more about, including: how the show almost didn't air due to the misgivings of certain CBS vice presidents; how she discovered and hired Harvey Korman, Vicki Lawrence, Lyle Waggoner, and Tim Conway; anecdotes about guest stars and her close freindships with many of them, including Lucille Ball, Roddy Mcdowell, Jim Nabors, Bernadette Peters, Betty Grable, Steve Lawrence, Eydie Gorme, Gloria Swanson, Rita Hayworth, and Betty White; the people behind the scenes from Bob Mackie, her costume designer and partner in crime, to the wickedly funny cameraman who became a fixture during the show s opening Q&amp;A; and Carol's takes on her favorite sketches and the unpredictable moments that took both the cast and viewers by surprise. This book is Carol's love letter to a golden era in television history through the lens of her brilliant show which won no less than 25 Emmy Awards! Get the best seat in the house as she reminisces about the outrageous tales that made working on the show as much fun as watching it","torrent":{"xt":"urn:btih:e73588d3e7ffcb2592eb1d86c9788a27a2bd60a0","amp;dn":"In+Such+Good+Company%3A+Eleven+Years+of+Laughter..","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e73588d3e7ffcb2592eb1d86c9788a27a2bd60a0","infoHashBuffer":{"type":"Buffer","data":[231,53,136,211,231,255,203,37,146,235,29,134,201,120,138,39,162,189,96,160]},"announce":[],"urlList":[]}}