{"title":"BodyCount - BodyCount [Ice-T] [Full Version] [Cov+CD] [Bubanee]","uid":4990908,"size":78473196,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e82b8db653fc82df6adf566fc044f9f7117c4554&amp;dn=BodyCount+-+BodyCount+%5BIce-T%5D+%5BFull+Version%5D+%5BCov%2BCD%5D+%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"bubanee","files":21,"time":1247034875,"description":"I've included the CD, front and back covers only since it's rare. I was going to include all covers but thought no\nleave it somewhat rare\nanyway it includes all 18 songs!\nPlease SEED for others to Enjoy!\nCheers, Bubanee\n\nFor All Your Latest Urban-Hip Hop-Rap-Old Skool and New Released Albums/Movies &lt;a href=&quot;\nhttp://www.mystudioproductions.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mystudioproductions.com/&lt;/a&gt;\n\nBody Count is the eponymous debut album of American heavy metal band Body Count. &quot;Cop Killer&quot; was originally intended to be the album's title, as evidenced by the tattoo on the original cover. Released in 1992, the album material focuses on various social and political issues ranging from police brutality to drug abuse. The album presents a turning point in the career of Ice-T, who co-wrote the album's songs with lead guitarist Ernie C and performed as the band's lead singer. Previously known only as a rapper, Ice-T's work with the band helped establish a crossover audience with rock music fans. The album produced one single, &quot;There Goes the Neighborhood.&quot;\nBody Count is best known for the inclusion of the controversial song &quot;Cop Killer,&quot; which was the subject of much criticism from various political figures, although many defended the song on the basis of the group's right to freedom of speech. Ice-T eventually chose to remove the song from the album, although it continues to be performed live. Although the album received mixed reviews, it was ranked among the Village Voice's list of the 40 Best Albums of 1992, and is believed to have helped pave the way for the mainstream success of the rapcore genre, although the album itself does not feature rapping in any of its songs.\nThe song &quot;Body Count's In The House&quot; features in the film &quot;Universal Soldier&quot; (1992).\n\n..FURTHER READING..\n\n&quot;Cop Killer&quot; is a 1992 song by American heavy metal band Body Count, from its 1992 self-titled debut album. The lyrics are sung in the first person of an individual who is outraged by police brutality and decides to take the law into his own hands by killing violent, corrupt police officers. The song, which lyricist Ice T referred to as a &quot;protest record,&quot; was written in 1990, and was partially influenced by &quot;Psycho Killer&quot; by the Talking Heads.\nThe song provoked much controversy and negative reactions from politicians such as George H.W. Bush, Dan Quayle and Tipper Gore, although some defended the song on the basis of the band's First Amendment rights. When Ice-T began to feel that the controversy over the song had eclipsed the band's musical merit, he chose to recall the album briefly before it was re-released without the inclusion of the song. The studio version of the song is currently unavailable in any official format.\nIce T referred to &quot;Cop Killer&quot; as a &quot;protest record,&quot; stating that the song is &quot;[sung] in the first person as a character who is fed up with police brutality.&quot; Ice T has also credited the Talking Heads song &quot;Psycho Killer&quot; with partially inspiring the song. &quot;Cop Killer&quot; was written in 1990, and had been performed live several times, including at the 1991 Lollapalooza tour, before it had been recorded in a studio.\nThe recorded version mentions then-Los Angeles police chief Daryl Gates, and Rodney King, a black motorist whose beating by LAPD officers had been caught on videotape. Shortly after the release of Body Count, a jury acquitted the officers and riots broke out in South Central Los Angeles. Soon after the riots, the Dallas Police Association and the Combined Law Enforcement Association of Texas (CLEAT) launched a campaign to force Warner Bros. Records to withdraw the album.\nOver the next month, controversy against the band grew. Vice President Dan Quayle branded &quot;Cop Killer&quot; as being &quot;obscene,&quot; and President George H.W. Bush publicly denounced any record company that would release such a product. Body Count was removed from the shelves of a retail store in Greensboro, North Carolina after local police had told the management that they would no longer respond to any emergency calls at the store if they continued to sell the album.","torrent":{"xt":"urn:btih:e82b8db653fc82df6adf566fc044f9f7117c4554","amp;dn":"BodyCount+-+BodyCount+%5BIce-T%5D+%5BFull+Version%5D+%5BCov%2BCD%5D+%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e82b8db653fc82df6adf566fc044f9f7117c4554","infoHashBuffer":{"type":"Buffer","data":[232,43,141,182,83,252,130,223,106,223,86,111,192,68,249,247,17,124,69,84]},"announce":[],"urlList":[]}}