{"title":"The Killers - Discography (2004-2012) [FLAC]","uid":8887074,"size":5299438698,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e888bef7b6290b6854d16cbcb943aeac08c00d9c&amp;dn=The+Killers+-+Discography+%282004-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":7,"uploader":"politux","files":-1,"time":1378487290,"description":"\n  The Killers - Discography (2004-2012) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, New Wave, Post-Punk\n  Sources: CD, vinyl\n  Codec: FLAC\n  Bit Rates: ~ 900, ~ 2,900 kbps\n  Bit Depth: 16, 24\n  Sampling Rates: 44,100 Hz, 96,000 Hz\n\n  2004 Hot Fuss\n  2004 Hot Fuss Vinyl Box (24/96)\n  2006 Sam's Town\n  2008 Day &amp; Age \n  2008 Day &amp; Age (Japan)\n  2008 Day &amp; Age vinyl (24/96)\n  2009 Live from the Royal Albert Hall\n  2012 Battle Born (Deluxe)\n  2012 Battle Born (Target Deluxe)\n\n  Few bands in the early 2000s rose so quickly to the forefront of pop music as The Killers. With a mix of '80s-styled synth pop and fashionista charm, the band's street-smart debut, Hot Fuss, became one of 2004's biggest releases, spawning four singles and catapulting the group -- particularly their dandyish, 22-year-old frontman, Brandon Flowers -- into the international spotlight. Hot Fuss reveled in the garish glitz of the band's native Las Vegas, spinning tales of androgynous girlfriends and illicit affairs to a public whose taste for revivalist dance-rock would prove to be virtually insatiable. Franz Ferdinand, Interpol, and the Bravery all benefited from such retro-minded interest, but The Killers unapologetically trumped them all -- even when their sophomore effort, Sam's Town, deemphasized the group's new wave sensibilities in favor of something more akin to the heartland rock of Bruce Springsteen and Rattle and Hum-era U2.\n\n  Brandon Flowers (vocals/keyboards), David Keuning (guitar), Mark Stoermer (bass), and Ronnie Vannucci (drums) first came together in 2002, two years before Hot Fuss introduced their band to the public. Flowers had been sacked by his former synth pop band, Blush Response, after refusing to move to Los Angeles with the rest of his bandmates. Instead, he remained in Las Vegas, where he soon met local guitarist and Oasis fanatic Keuning. The two began collaborating on material; within weeks, they'd composed their soon-to-be radio hit &quot;Mr. Brightside.&quot; Stoermer, a former medical courier, and Vannucci, a classical percussion major at UNLV, eventually joined the fray, and the band began playing small clubs in its hometown. A U.K. representative for Warner Bros. caught wind of The Killers' brewing hype, and although he neglected to bring them aboard the Warner roster, he did pass along their demo to the London-based indie imprint Lizard King. The British label quickly signed The Killers, who temporarily moved to the U.K. and issued a limited-edition single for &quot;Mr. Brightside.&quot; The Killers' buzz had effectively traveled back across the Atlantic by fall 2003, and the band was offered a prime spot at the annual CMJ Music Marathon in New York City. A worldwide deal with Island followed shortly thereafter, positioning The Killers to join the ranks of Interpol, the Rapture, and the Strokes.\n\n  Shared U.K. dates with British Sea Power and stellastarr* in 2004 gave The Killers an opportunity to showcase material from their debut album, Hot Fuss, which was released that June. &quot;Somebody Told Me,&quot; &quot;Mr. Brightside,&quot; &quot;Smile Like You Mean It,&quot; and &quot;All These Things That I've Done&quot; all became worldwide chart hits, and Hot Fuss peaked at number seven on the Billboard Top 200. Buoyed by such success, Flowers became a sought-after media presence, often lashing out at such groups as the Bravery for riding his band's coattails into the mainstream. The frontman's confidence was not unwarranted; by 2006, Hot Fuss had earned five Grammy nominations and sold over five million copies. Rather than take a break to recover from their heavy tour regime, The Killers immediately set to work on a second album. A newly built facility at the Palms Hotel and Casino in Las Vegas became the band's studio, and legendary producers Flood and Alan Moulder (who had previously worked together with U2 and the Smashing Pumpkins) were chosen to helm the controls. Instead of mining the glamour and glitz of their hometown (as they did to successful extent on Hot Fuss), the group instead focused on nostalgia and the demise of old-fashioned American values, citing veteran songsmith Bruce Springsteen as a chief influence.\n\n  The popularity generated by leadoff single &quot;When You Were Young&quot; led up to the highly anticipated release of Sam's Town in early October 2006. While the album did not match the popularity of the band's debut, it nevertheless sold 700,000 copies worldwide during its first week, eventually spawning three U.S. singles and gaining The Killers two additional Grammy nods. Sawdust, a collection of B-sides, rarities, and remixes, followed one year later, serving as a stopgap recording between the band's proper studio albums. The Killers then returned in 2008 with Day &amp; Age, which eschewed the Americana tangents of Sam's Town in favor of pop pastiches and sleek, oddball dance-rock. The band's return to the dancefloor was emboldened by Stuart Price, a veteran producer who had previously worked with Madonna and Gwen Stefani, and the Top 40 single &quot;Human&quot; helped The Killers continue their commercial streak. A lengthy tour carried the band into 2009, which also saw the release of the concert album Live from the Royal Albert Hall. Solo work comprised many of the next few years, including Brandon Flowers' Flamingo, Ronnie Vannucci's Big Talk, and Mark Stoermer's Another Life. After reconvening in early 2011, the band got to work on its fourth studio album, enlisting a small army of notable producers, including Daniel Lanois, Steve Lillywhite, Damian Taylor, Stuart Price, and Brendan O'Brien. The resulting Battle Born was released in September, 2012.","torrent":{"xt":"urn:btih:e888bef7b6290b6854d16cbcb943aeac08c00d9c","amp;dn":"The+Killers+-+Discography+%282004-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e888bef7b6290b6854d16cbcb943aeac08c00d9c","infoHashBuffer":{"type":"Buffer","data":[232,136,190,247,182,41,11,104,84,209,108,188,185,67,174,172,8,192,13,156]},"announce":[],"urlList":[]}}