{"title":"The Wealth of Nations by Adam Smith (Giants of Political thought","uid":6838411,"size":148842659,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e91205e79471bc7f7e275776a6ef817bdf1a0401&amp;dn=The+Wealth+of+Nations+by+Adam+Smith+%28Giants+of+Political+thought&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"michaelrizzo","files":-1,"time":1322084919,"description":"A nice production from the Knowledge Products Series with true Scottish\nactors used - as Adam Smith was himself a Scot as was David Hume by the way.\n\n&quot;It is not from the benevolence of the butcher, the brewer, or the baker,\nthat we expect our dinner, but from their regard to their own interest. \nWe address ourselves, not to their humanity but to their self-love, a\nand never talk to them of our own necessities but of their advantages&quot;\n\nThis is the fundamental tenet underlying the philosophies of Adam Smith\nand his view of all that is involved in the functioning of any economic model.\n\nI think this view has some real merit in what has to be considered the\ntruth. However it is far from the whole truth as we also strive for our\nfamilies and therefore our communities and in this regard we do cater to\nsome notions of self interest that go far above just the basest needs of\nmere survival as living things and instead as specifically human beings in\nthe full command of their faculties.\n\nAnd it is only such thinking that will yield the best results in making\ndecisions over an economy such as setting price floors and ceilings\nif need be and the same for wages and in allocating resources which are scarce\nto those that have real merit and the factors of production to only those we \nshould trust and be prepared to abdicate to in case of need in the case of war, \ninsurrection or what have you.\n\nSo yes he is correct it is self interest that rules, however benevolence must\nnot be missing or it is not a state that the best folks will choose to consider\ntheir own until such time as it could be better constituted to allow for such a\ndisposition without being imprudent in the least and on the contrary altogether\nwith the righter notions of merit in our midst.\n\nMichael Rizzo Chessman\n","torrent":{"xt":"urn:btih:e91205e79471bc7f7e275776a6ef817bdf1a0401","amp;dn":"The+Wealth+of+Nations+by+Adam+Smith+%28Giants+of+Political+thought","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e91205e79471bc7f7e275776a6ef817bdf1a0401","infoHashBuffer":{"type":"Buffer","data":[233,18,5,231,148,113,188,127,126,39,87,118,166,239,129,123,223,26,4,1]},"announce":[],"urlList":[]}}