{"title":"Bon Iver - Studio Discography 2008-2011 [FLAC]","uid":8992169,"size":492606911,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e979b101d61effb47ed8076f30a9f31a9e12556c&amp;dn=Bon+Iver+-+Studio+Discography+2008-2011+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"rudown78","files":66,"time":1380808645,"description":"Bon Iver - Studio Discography 2008-2011 [FLAC]\n\n\nJustin Vernon began recording under the nom de band Bon Iver following the breakup of DeYarmond Edison, an indie folk group similar in tone and manner to Iron &amp; Wine, Little Wings, and -- to a certain extent -- Bonnie &quot;Prince&quot; Billy. Vernon's solo project took DeYarmond Edison's introspective, folky sound and embellished it with squinchy, quirky orchestral touches that nodded to Sparklehorse and the drifty optimism of the Flaming Lips. Vernon moved back to Wisconsin the winter following DeYarmond's demise, setting up camp in a remote cabin in the north woods for three months. It was a hugely generative period for Vernon; writing and recording songs in 12-hour bursts, he found himself with a nine-song debut album by spring. He dubbed the project Bon Iver (an intentional misspelling of the French for &quot;good winter&quot;), and the disc, For Emma, Forever Ago, was released on Jagjaguwar in early 2008.\n\nJoined in his live shows by Sean Carey, Vernon toured throughout the eastern U.S. and Canada throughout the remainder of the year, sharing the stage with like-minded singer/songwriter Elvis Perkins. As the year progressed, the album became quite popular with both the buying public and critics, eventually landing on a number of &quot;best of 2008&quot; year-end lists. In January 2009, Bon Iver returned with an EP of old and new songs titled Blood Bank. One of Vernon's fans turned out to be Kanye West, who brought him to Hawaii later that year to add vocals to a couple tracks on West's 2010 album, My Beautiful Dark Twisted Fantasy. When it came time to return to Vernon's own music, he continued stretching his legs by composing orchestral, lushly arranged folk songs that turned their back on For Emma's intimate sound. The new tunes were released during the following summer as Bon Iver. It received generally positive reviews, topped the charts in several countries, and hit number two in America. In February 2012, Bon Iver won two Grammy awards: Best Alternative Album and Best New Artist. \n\n\n2008 - For Emma, Forever Ago\n2009 - Blood Bank [EP]\n2011 - Bon Iver, Bon Iver\n\n\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:e979b101d61effb47ed8076f30a9f31a9e12556c","amp;dn":"Bon+Iver+-+Studio+Discography+2008-2011+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e979b101d61effb47ed8076f30a9f31a9e12556c","infoHashBuffer":{"type":"Buffer","data":[233,121,177,1,214,30,255,180,126,216,7,111,48,169,243,26,158,18,85,108]},"announce":[],"urlList":[]}}