{"title":"Hitler's Secret Commandos: Operations of the K-Verband","uid":15854547,"size":11142744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eaacc443d95d8387c4dd9882bf31773db9076200&amp;dn=Hitler%27s+Secret+Commandos%3A+Operations+of+the+K-Verband&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":1,"uploader":"marty14","files":1,"time":1474225668,"description":"Hitler's Secret Commandos: Operations of the K-Verband - Helmut Blocksdorf [epub]\r\n\r\nHitler's Secret Commandos is the history of the K-Verband naval commando unit, established in 1943 to reek havoc amongst invading allied forces involved in amphibious landings or actions, against German-occupied coasts.\r\n\r\nFollowing the Italian and British example, the basic idea was for a small, exceptionally well-trained and absolutely reliable commando force using the maximum element of surprise. Midget U-boats, and small torpedo-carrying craft along the lines of the &quot;explosive boats&quot; used by the Italian Navy, were designed for individual operations while a naval assault troop was formed for missions against important enemy operational targets near the sea after being landed from naval vessels offshore.\r\n\r\nUsing German archive material, first-hand accounts and other published material this is the first comprehensive history of the K-Verband. It charts the development, structure, selection, training and equipment the Commando unit used together with a detailed narrative of the operations undertaken.\r\n\r\nThe material has been translated from a German text, previously published in Germany with wide acclaim","torrent":{"xt":"urn:btih:eaacc443d95d8387c4dd9882bf31773db9076200","amp;dn":"Hitler%27s+Secret+Commandos%3A+Operations+of+the+K-Verband","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaacc443d95d8387c4dd9882bf31773db9076200","infoHashBuffer":{"type":"Buffer","data":[234,172,196,67,217,93,131,135,196,221,152,130,191,49,119,61,185,7,98,0]},"announce":[],"urlList":[]}}