{"title":"Ta loi ji kong wu/The Justice of Life(1989)Cantonese,Cht subbed","uid":8804089,"size":6453332199,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:eadd803e0b5a0c994e5ddc4fb1c19d11e7e3cc8d&amp;dn=Ta+loi+ji+kong+wu%2FThe+Justice+of+Life%281989%29Cantonese%2CCht+subbed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":21,"uploader":"app1985","files":-1,"time":1376282586,"description":" &lt;a href=&quot;http://zh.wikipedia.org/wiki/%E4%BB%96%E4%BE%86%E8%87%AA%E6%B1%9F%E6%B9%96&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://zh.wikipedia.org/wiki/%E4%BB%96%E4%BE%86%E8%87%AA%E6%B1%9F%E6%B9%96&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0298701/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0298701/&lt;/a&gt;\n\n\n\nCantonese/Mandarin title: Ta Loi Chi Gong Wu / Ta Lai Zi Jiang Hu\nEnglish title: The Justice of Life\nAlso known as: He Came From Jiang Hu\nGenre: Drama\nEpisodes: 30\nBroadcast network: TVB\nBroadcast year: 1989\n\nSynopsis\n\nThe unstoppable trio of Stephen Chow, Ng Man Tat, and writer-director Lee Lik Chi ruled Hong Kong cinema in the 1990s with blockbuster comedies like Flirting Scholar, God of Cookery, and The King of Comedy, but their golden collaboration actually began in television. In 1989, they collaborated in two extremely popular TVB dramas, the nonsensical martial arts comedy The Final Combat and urban drama The Justice of Life, launching Stephen Chow into great fame. Fondly remembered as one of the best TVB dramas of all time, The Justice of Life features Stephen Chow and Ng Man Tat as a memorable father-son duo, with Chow displaying his unique brand of motormouth &quot;mo lei tau&quot; everyman humor that would later drive his films. Leading the cast is film and television star Alex Man, along with his future wife Tanny Tien and many actors who now form the backbone of Hong Kong cinema, including Anthony Wong, Teresa Mo, Hui Siu Hung, and Wong Yat Fei. Truly one of the classics of Hong Kong television, The Justice of Life draws both laughter and tears with its down-to-earth humor and moving depiction of family, love, and brotherhood. After the death of his fiancee (Pauline Yeung), triad legend Ming Tin (Alex Man) washes his hands of the underworld, retreating to a quiet life running a small mahjong parlor. He originally disavowed himself of romance as well, but two very different women (Tanny Tien and Teresa Mo) wander into his life. Ming Tin lives with his mother (Lee Heung Kam), uncle (Ng Man Tat), and cousin Gam Sui (Stephen Chow). Ming Tin and Gam Sui are as close as brothers, but Gam Sui's father has a grudge against Ming Tin, leading to many barbs and bickers in this odd family. When Gam Sui and his father unwittingly stumble onto the wrong sides of the track, it's up to Ming Tin to pull them back with his old connections.","torrent":{"xt":"urn:btih:eadd803e0b5a0c994e5ddc4fb1c19d11e7e3cc8d","amp;dn":"Ta+loi+ji+kong+wu%2FThe+Justice+of+Life%281989%29Cantonese%2CCht+subbed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eadd803e0b5a0c994e5ddc4fb1c19d11e7e3cc8d","infoHashBuffer":{"type":"Buffer","data":[234,221,128,62,11,90,12,153,78,93,220,79,177,193,157,17,231,227,204,141]},"announce":[],"urlList":[]}}