{"title":"Good Math A Geek's Guide to the Beauty of Numbers, Logic, and Co","uid":8850761,"size":10206264,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb3abe13d8f54e545976b6c9c0f94aa5cdb31297&amp;dn=Good+Math+A+Geek%27s+Guide+to+the+Beauty+of+Numbers%2C+Logic%2C+and+Co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1377516394,"description":"Good Math: A Geeks Guide to the Beauty of Numbers, Logic, and Computation\n\nBook Details:\n\nPages: 250\nPublisher: Pragmatic Bookshelf (July 2013)\nLanguage: English\nISBN-10: 1937785335\nISBN-13: 978-1937785338\nFormat: PDF, EPUB\n\n\nBook Description:\n\nMathematics is beautiful and it can be fun and exciting as well as practical. Good Math is your guide to some of the most intriguing topics from two thousand years of mathematics: from Egyptian fractions to Turing machines; from the real meaning of numbers to proof trees, group symmetry, and mechanical computation. If you have ever wondered what lay beyond the proofs you struggled to complete in high school geometry, or what limits the capabilities of the computer on your desk, this is the book for you.\n\nWhy do Roman numerals persist? How do we know that some infinities are larger than others? And how can we know for certain a program will ever finish? In this fast-paced tour of modern and not-so-modern math, computer scientist Mark Chu-Carroll explores some of the greatest breakthroughs and disappointments of more than two thousand years of mathematical thought. There is joy and beauty in mathematics, and in more than two dozen essays drawn from his popular Good Math blog, you will find concepts, proofs, and examples that are often surprising, counterintuitive, or just plain weird.\n\nMark begins his journey with the basics of numbers, with an entertaining trip through the integers and the natural, rational, irrational, and transcendental numbers. The voyage continues with a look at some of the oddest numbers in mathematics, including zero, the golden ratio, imaginary numbers, Roman numerals, and Egyptian and continuing fractions. After a deep dive into modern logic, including an introduction to linear logic and the logic-savvy Prolog language, the trip concludes with a tour of modern set theory and the advances and paradoxes of modern mechanical computing.\n\nIf your high school or college math courses left you grasping for the inner meaning behind the numbers, Marks book will both entertain and enlighten you.\n\nWhat You Need:\n\nNo special equipment or software is required. Although the book contains brief code examples, they can all be run with open source software on any up-to-date Apple, Windows, or Linux computer.\n\nTable of Contents:\n\nPart I: Numbers\nChapter 1. Natural Numbers\nChapter 2. Integers\nChapter 3. Real Numbers\nChapter 4. Irrational and Transcendental Numbers\n\nPart II: Funny Numbers\nChapter 5. Zero\nChapter 6. e: The Unnatural Natural Number\nChapter 7. ?: The Golden Ratio\nChapter 8. i: The Imaginary Number\nChapter 9. Roman Numerals\nChapter 10. Egyptian Fractions\nChapter 11. Continued Fractions\n\nPart IV: Logic\nChapter 12. Mr. Spock Is Not Logical\nChapter 13. Proofs, Truth, and Trees: Oh My!\nChapter 14. Programming with Logic\nChapter 15. Temporal Reasoning\n\nPart V: Sets\nChapter 16. Cantors Diagonalization: Infinity Is not Just Infinity\nChapter 17. Axiomatic Set Theory: Keep the Good, Dump the Bad\nChapter 18. Models: Using Sets as the LEGOs of the Math World\nChapter 19. Transfinite Numbers: Counting and Ordering Infinite Sets\nChapter 20. Group Theory: Finding Symmetries with Sets\n\nPart VI: Mechanical Math\nChapter 21. Finite State Machines: Simplicity Goes Far\nChapter 22. The Turing Machine\nChapter 23. Pathology and the Heart of Computing\nChapter 24. Calculus: No, Not That Calculus? Calculus\nChapter 25. Numbers, Booleans, and Recursion\nChapter 26. Types, Types, Types: Modeling ? Calculus\nChapter 27. The Halting Problem\n","torrent":{"xt":"urn:btih:eb3abe13d8f54e545976b6c9c0f94aa5cdb31297","amp;dn":"Good+Math+A+Geek%27s+Guide+to+the+Beauty+of+Numbers%2C+Logic%2C+and+Co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb3abe13d8f54e545976b6c9c0f94aa5cdb31297","infoHashBuffer":{"type":"Buffer","data":[235,58,190,19,216,245,78,84,89,118,182,201,192,249,74,165,205,179,18,151]},"announce":[],"urlList":[]}}