{"title":"Occupy the Economy - Richard D. Wolff - EPUB PDF","uid":15756074,"size":1243449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebc4087a4beac833d18a3eb15d981b188e4a5897&amp;dn=Occupy+the+Economy+-+Richard+D.+Wolff+-+EPUB+PDF&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"nosnavis","files":2,"time":1473052444,"description":"Occupy the Economy: Challenging Capitalism \r\nRichard D. Wolff\r\nCity Lights Books (2012) \r\n \r\nToday's economic crisis is capitalism's worst since the Great Depression. Millions have lost their jobs, homes and healthcare while those who work watch their pensions, benefits and job security decline. As more and more are impacted by the crisis, the system continues to make the very wealthy even richer. In eye-opening interviews with prominent economist Richard Wolff, David Barsamian probes the root causes of the current economic crisis, its unjust social consequences and what can and should be done to turn things around.\r\n  \r\nWhile others blame corrupt bankers and unregulated speculators or the government or even the poor who borrowed, the authors show that the causes of the crisis run much deeper. They reach back to the 1970s when the capitalist system itself shifted, ending the century-old pattern of rising wages for U.S. workers and thereby enabling the top 1% to become ultra-rich at the expense of the 99%. Since then, economic injustice has become chronic and further corrupted politics. The Occupy movement, by articulating deep indignation with the whole system, mobilizes huge numbers who seek basic change. Occupying the Economy not only clarifies and analyzes the crisis in U.S. capitalism today, it also points toward solutions that can shape a far better future for all.\r\n\r\nIf you want to support the author: \nhttp://www.rdwolff.com/books#occupytheeconomy","torrent":{"xt":"urn:btih:ebc4087a4beac833d18a3eb15d981b188e4a5897","amp;dn":"Occupy+the+Economy+-+Richard+D.+Wolff+-+EPUB+PDF","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebc4087a4beac833d18a3eb15d981b188e4a5897","infoHashBuffer":{"type":"Buffer","data":[235,196,8,122,75,234,200,51,209,138,62,177,93,152,27,24,142,74,88,151]},"announce":[],"urlList":[]}}