{"title":"Game Of Thrones (A Song of Ice and Fire)","uid":8989834,"size":138477628,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec0f7464ef1a1e3b678b8b6c71da294015a72cf0&amp;dn=Game+Of+Thrones+%28A+Song+of+Ice+and+Fire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"spiderot","files":194,"time":1380759699,"description":"Description\nGame Of Thrones (A Song of Ice and Fire) 1-5 books(pdf)+extras\n\n\nThe torrent contains all the 5 books in pdf format + extras from the tv series\nEXTRAS\n1)History and Lore- some basic info about the plot\n2)Houses- history and info about the houses\n3)Land- the maps to the world of game of throne\n\n\n\nI will be uploading some more extras in next torrents to come\n\nplease comment and seed let me know if anything is wrong i will try to fix it\n\nimage\n\n\n\nA Song of Ice and Fire is a series of epic fantasy novels written by American novelist and screenwriter George R. R. Martin. Martin began the series in 1991 and published the first volume, A Game of Thrones, in 1996. Martin gradually extended the originally planned trilogy into seven volumes. The fifth installment, A Dance with Dragons, took Martin five years to write before it was published in 2011. The sixth book, The Winds of Winter, is currently being written.\n\nThe story of A Song of Ice and Fire takes place on the fictional continents Westeros and Essos, with a history of thousands of years. The series is told in the third person by point of view (POV) characters, whose number reaches 31 by the fifth novel. Three stories become interwoven: the chronicling of a dynastic war for control of Westeros by several families; the rising threat of the dormant cold supernatural Others dwelling beyond an immense wall of ice on Westeros' northern border; and the ambition of Daenerys Targaryen, the exiled daughter of a king murdered in a civil war shortly before her birth, to return to Westeros with her fire-breathing dragons and claim her rightful throne.\n\nDrawing inspiration from historical events such as the English period of the Wars of the Roses, Martin defied the conventions of the high fantasy genre. The series received praise for its realism; it subdues magic in favor of battles and political intrigue. The first novel contains practically no magic at all, yet the presence of magic keeps growing for each book. Violence, sexuality and moral ambiguity are frequently displayed among a set of over a thousand named characters. Major characters are often killed off so that readers cannot rely on the supposed heroes to remain safe and sound. The multiple viewpoint structure allows characters to be explored from many sides so that the supposed villains can provide their viewpoint. In contrast to an omniscient storyteller, this structure can present the reader with misleading information as it is slanted by each character's own interpretation of events, rather than being a strictly factual presentation. A Song of Ice and Fire also received critical commentary for its diverse portrayal of women and religion","torrent":{"xt":"urn:btih:ec0f7464ef1a1e3b678b8b6c71da294015a72cf0","amp;dn":"Game+Of+Thrones+%28A+Song+of+Ice+and+Fire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec0f7464ef1a1e3b678b8b6c71da294015a72cf0","infoHashBuffer":{"type":"Buffer","data":[236,15,116,100,239,26,30,59,103,139,139,108,113,218,41,64,21,167,44,240]},"announce":[],"urlList":[]}}