{"title":"Infinite Skills Learning AutoCAD Electrical 2014","uid":8396368,"size":1638435909,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ec202149965118d81353cb348d9aed41506bb696&amp;dn=Infinite+Skills+Learning+AutoCAD+Electrical+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"angelos2225","files":-1,"time":1366580899,"description":"Infinite Skills Learning AutoCAD Electrical 2014 Training Video\nA Practical AutoCAD Training Course That Teaches Real World Skills\n\nIn this project-based Learning AutoCAD Electrical 2014 video tutorial series, you'll quickly have relevant skills for real-world applications.\n\nFollow along with our expert instructor in this training course to get:\n\nConcise, informative and broadcast-quality Learning AutoCAD Electrical 2014 training videos delivered to your desktop\nA quick grasp of even the most complex Learning AutoCAD Electrical 2014 subjects because they're broken into simple, easy to follow tutorial videos\n\nPractical working files further enhance the learning process and provide a degree of retention that is unmatched by any other form of Learning AutoCAD Electrical 2014 tutorial, online or offline... so you'll know the exact steps for your own projects.\n\nSKU: 01767 | Duration: 9 hours - 132 tutorial videos\nDate Released: 2013-03-27\nWorks on: Windows PC or Mac \nInstructor: Shaun Bryant\n\n\nCourse Description\n\nIn this training course for AutoCAD Electrical 2014, expert trainer Shaun Bryant guides you through the tools and techniques you can use to create your electrical CAD designs. With AutoCAD Electrical you get a huge selection of symbol libraries and features specific to electrical engineering. Shaun takes you through these features and how to use them step by step in short, easy to understand lessons.\n\nYou will begin this tutorial with a walk through the AutoCAD interface, as Shaun shows how to access the electrical design toolset. Each lesson is designed to build on the last, ensuring that you are not inundated with too much information at once, which will increases your retention of the material. Some of the topics that are covered include; workflow basics, schematic wiring, accessing and using electrical symbols, editing your schematics, creating panel layouts, using custom components, PLC Modules, and automation tools. Those features are just a small example of the over 9 hours of top quality video training you get in this professional tutorial.\n\nOnce you have completed this computer based training course for AutoCAD Electrical 2014, you will have a comprehensive understanding of the tools and techniques Autodesk has to offer in this popular software program. Not only will you understand them, but you will have functional experience in applying this learning through the working files that the author has included in this training course.\n","torrent":{"xt":"urn:btih:ec202149965118d81353cb348d9aed41506bb696","amp;dn":"Infinite+Skills+Learning+AutoCAD+Electrical+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec202149965118d81353cb348d9aed41506bb696","infoHashBuffer":{"type":"Buffer","data":[236,32,33,73,150,81,24,216,19,83,203,52,141,154,237,65,80,107,182,150]},"announce":[],"urlList":[]}}