{"title":"The Life of Mammals   (BBC 2002 - Complete Series)","uid":5119742,"size":7344556540,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ec3522384d6a8c33b4b6ea29ad2621e72e914f4b&amp;dn=The+Life+of+Mammals+++%28BBC+2002+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":4,"uploader":"dougietrotter","files":-1,"time":1255267953,"description":"David Attenborough and the BBC have a well-earned reputation for producing some of the greatest nature programmes, but The Life of Mammals could well be Attenborough's magnum opus. Much of the footage shot for this series had never been seen before, and is presented with the respect and reverence for the natural world that Attenborough has made his trademark. It never ceases to surprise: the sight of a lion taking down a wildebeest on the African savannah has almost become a clichÃƒÂ© of nature programmes, yet in The Life of Mammals the cameras keep rolling and the viewer witnesses the fallen animal's herd coming to its rescue and driving off the lion. It's a moving sight and just one of many remarkable scenes.\n\n\nA thorough and entertaining overview of one of evolution's greatest success stories, the series is loosely structured to follow the development of mammals, beginning with the basics in &quot;A Winning Design&quot;, which clarifies what makes a mammal different from reptiles and birds - no, it isn't egg-laying: both the platypus and the echidna are egg-laying mammals; it's their ability to adapt. And it's this adaptability that becomes the crux of the remainder of the series. &quot;Insect Hunters&quot; focuses on mammals who have specifically adapted to eating insects, from the giant anteater and the armoured armadillo to bats, which have evolved into complex and effective hunters. &quot;Plant Predators&quot; demonstrates the particular (and often peculiar) adaptations of herbivores, while &quot;Chisellers&quot; is about those mammals who feed primarily on roots and seeds, ranging from tree-dwelling squirrels to opportunistic mice and rats. &quot;Meat Eaters&quot; talks about the evolutionary arms race that exists between predators and prey, and the unique adaptations of both individual and pack hunters. Omnivores are explored in &quot;Opportunists&quot; - mammals like bears and raccoons, whose varied diet allows them to occupy nearly any environment. &quot;Return to the Water&quot; discusses those mammals such as whales, seals and dolphins that have left behind life on dry land and adapted completely to life in the sea, existing at the top of the food chain. The last three episodes - &quot;Life in the Trees&quot;, &quot;Social Climbers&quot; and &quot;Food for Thought&quot; - take the viewer through the development of primates, eventually culminating in that most successful mammal: man.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ec3522384d6a8c33b4b6ea29ad2621e72e914f4b","amp;dn":"The+Life+of+Mammals+++%28BBC+2002+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec3522384d6a8c33b4b6ea29ad2621e72e914f4b","infoHashBuffer":{"type":"Buffer","data":[236,53,34,56,77,106,140,51,180,182,234,41,173,38,33,231,46,145,79,75]},"announce":[],"urlList":[]}}