{"title":"Instant PHP Web Scraping (Packt) [PDF] [StormRG]","uid":11194557,"size":1618257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edb5608dcaf67c7ab9018fbd7041945126af02fa&amp;dn=Instant+PHP+Web+Scraping+%28Packt%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"steelballz","files":-1,"time":1413062784,"description":"Description\nInstant PHP Web Scraping\nAuthor: Ward, Jacob\nPublished:July 26 2013\nPublisher: Packt Publishing\nASIN: B00E7NC9CS\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nimage\n\n\nDESCRIPTION\nProduct Description\nIn Detail\n\nWith the proliferation of the web, there has never been a larger body of data freely available for common use. Harvesting and processing this data can be a time consuming task if done manually. However, web scraping can provide the tools and framework to accomplish this with the click of a button. It's no wonder, then, that web scraping is a desirable weapon in any programmer's arsenal.\n\nInstant Web Scraping With PHP How-to uses practical examples and step-by-step instructions to guide you through the basic techniques required for web scraping with PHP. This will provide the knowledge and foundation upon which to build web scraping applications for a wide variety of situations such as data monitoring, research, data integration relevant to today's online data-driven economy.\n\nOn setting up a suitable PHP development environment, you will quickly move to building web scraping applications. Beginning with a simple task of retrieving a single web page, you will then gradually build on this by learning various techniques for identifying specific data, crawling through numerous web pages to retrieve large volumes of data, and processing then saving it for future use. You will learn how to submit login forms for accessing password protected areas, along with downloading images, documents, and emails. Learning to schedule the execution of scrapers achieves the goal of complete automation, and the final introduction of basic object-oriented programming (OOP) in the development of a scraping class provides the template for future projects.\n\nArmed with the skills learned in the book, you will be set to embark on a wide variety of web scraping projects.\nApproach\n\nFilled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. Short, concise recipes to learn a variety of useful web scraping techniques using PHP.\nWho this book is for\n\nThis book is aimed at those new to web scraping, with little or no previous programming experience. Basic knowledge of HTML and the Web is useful, but not necessary","torrent":{"xt":"urn:btih:edb5608dcaf67c7ab9018fbd7041945126af02fa","amp;dn":"Instant+PHP+Web+Scraping+%28Packt%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edb5608dcaf67c7ab9018fbd7041945126af02fa","infoHashBuffer":{"type":"Buffer","data":[237,181,96,141,202,246,124,122,185,1,143,189,112,65,148,81,38,175,2,250]},"announce":[],"urlList":[]}}