{"title":"Kali Linux Social Engineering [PDF]~StormRG~","uid":9638709,"size":4225771,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eedee1e1978d2292e3f7c43264ad04e47fa95a64&amp;dn=Kali+Linux+Social+Engineering+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":1,"uploader":"steelballz","files":-1,"time":1392876695,"description":"Description\nKali Linux Social Engineering\nAuthor: Rahul Singh Patel\nPublished: Dec 24 2013\nPublisher: Packt Publishing\nISBN-10:1783283270\nISBN-13:978-1783283279\nASIN:B00HK3VPEA\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nProduct Description\n\n\n\nIn Detail\n\nKali Linux has a specific toolkit that incorporates numerous social-engineering attacks all into one simplified interface. The main purpose of SET (social engineering toolkit) is to automate and improve on many of the social engineering attacks currently out there.\n\nThis book is based on current advanced social engineering attacks using SET that help you learn how security can be breached and thus avoid it. You will attain a very unique ability to perform a security audit based on social engineering attacks.\n\nStarting with ways of performing the social engineering attacks using Kali, this book covers a detailed description on various website attack vectors and client side attacks that can be performed through SET. This book contains some of the most advanced techniques that are currently being utilized by hackers to get inside secured networks. This book covers phishing (credential harvester attack), web jacking attack method, spear phishing attack vector, Metasploit browser exploit method, Mass mailer attack and more.\n\nBy the end of this book you will be able to test the security of any organization based on social engineering attacks.\nApproach\n\nThis book is a practical, hands-on guide to learning and performing SET attacks with multiple examples.\nWho this book is for\n\nKali Linux Social Engineering is for penetration testers who want to use BackTrack in order to test for social engineering vulnerabilities or for those who wish to master the art of social engineering attacks.\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:eedee1e1978d2292e3f7c43264ad04e47fa95a64","amp;dn":"Kali+Linux+Social+Engineering+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eedee1e1978d2292e3f7c43264ad04e47fa95a64","infoHashBuffer":{"type":"Buffer","data":[238,222,225,225,151,141,34,146,227,247,196,50,100,173,4,228,127,169,90,100]},"announce":[],"urlList":[]}}