{"title":"American Prometheus: The Triumph and Tragedy of J.R. Oppenheimer","uid":15796222,"size":6518956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef7ce211b79187e4d8ddeb906095027534607ea6&amp;dn=American+Prometheus%3A+The+Triumph+and+Tragedy+of+J.R.+Oppenheimer&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"marty14","files":1,"time":1473460315,"description":"American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer - Bird &amp; Sherwin [epub]\r\n\r\nAmerican Prometheus is the first full-scale biography of J. Robert Oppenheimer, &quot;father of the atomic bomb,&quot; the brilliant, charismatic physicist who led the effort to capture the awesome fire of the sun for his country in time of war. Immediately after Hiroshima, he became the most famous scientist of his generation - one of the iconic figures of the twentieth century, the embodiment of modern man confronting the consequences of scientific progress.\r\n\r\nHe was the author of a radical proposal to place international controls over atomic materials - an idea that is still relevant today. He opposed the development of the hydrogen bomb and criticized the Air Force's plans to fight an infinitely dangerous nuclear war. In the now almost-forgotten hysteria of the early 1950s, his ideas were anathema to powerful advocates of a massive nuclear buildup, and, in response, Atomic Energy Commission chairman Lewis Strauss, Superbomb advocate Edward Teller and FBI director J. Edgar Hoover worked behind the scenes to have a hearing board find that Oppenheimer could not be trusted with America's nuclear secrets.\r\n\r\nAmerican Prometheus is an evocation of America at mid-century, a new and compelling portrait of a brilliant, ambitious, complex and flawed man profoundly connected to its major events - the Depression, World War II and the Cold War. It is at once biography and history, and essential to our understanding of our recent past - and of our choices for the future","torrent":{"xt":"urn:btih:ef7ce211b79187e4d8ddeb906095027534607ea6","amp;dn":"American+Prometheus%3A+The+Triumph+and+Tragedy+of+J.R.+Oppenheimer","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef7ce211b79187e4d8ddeb906095027534607ea6","infoHashBuffer":{"type":"Buffer","data":[239,124,226,17,183,145,135,228,216,221,235,144,96,149,2,117,52,96,126,166]},"announce":[],"urlList":[]}}