{"title":"Le Diner de CONS (dinner game) + english SRT","uid":4482513,"size":715241429,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef9aa943938ebfb8fd03a76629dc83935e1349cf&amp;dn=Le+Diner+de+CONS+%28dinner+game%29+%2B+english+SRT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"Tanauser","files":3,"time":1225632066,"description":"Le Diner de Cons (1998) + English Sub (Srt) thanks to www.AllSubs.org\n\nThe Dinner Game\n\nRÃƒÂ©alisÃƒÂ© par Francis Veber\nAvec Thierry Lhermitte, Jacques Villeret, Francis Huster   Plus...\nFilm franÃƒÂ§ais. \nGenre : ComÃƒÂ©die\nDurÃƒÂ©e : 1h 20min. \nAnnÃƒÂ©e de production : 1997\nRemake : Dinner for Schmucks (2008)\n\nPierre brochant est un ÃƒÂ©diteur parisien ÃƒÂ  succÃƒÂ¨s qui se divertit avec ses amis en organisant des &quot;dÃƒÂ®ners de cons&quot; ou chaque participants amÃƒÂ¨ne une personne qui doit ÃƒÂªtre la plus barbante et ridicule possible. Quand commence cette piÃƒÂ¨ce , Pierre attend FranÃƒÂ§ois Pignon, le &quot;con&quot; de sa soirÃƒÂ©e qui promet d&amp;#039;ÃƒÂªtre exceptionnel. Mais trÃƒÂ¨s vite tout va tourner au cauchemar pour cet ÃƒÂ©diteur sans scrupules. Et FranÃƒÂ§ois va amener catastrophe sur catastrophe qui vont ÃƒÂ  jamais changer la vie de Pierre, pour le pire... et le meilleur...\n\nThe premise here is that a group of wealthy friends periodically throw an &quot;idiot dinner,&quot; a party to which each must bring the most boring or stupid guest he can find, competing to see who can find the most foolish idiot. The concept is discomforting, rooted as it is in an attitude of arrogant superiority, but this is farce, and supposedly the perpetrators are to be hoisted on the petard of their insensitivity. (Sadly, we are told that the idea was inspired by a real-life game played in Paris.)\n    As it turns out, the premise is merely a plot device to bring together Brochant (Thierry Lhermitte), a publisher, and the &quot;idiot&quot; he has found to bring to the nights&amp;#039; revelry, Pignon (Jacques Villeret), a government  accountant whose hobby is building matchstick models: the Eiffel Tower, the Concorde, the Golden Gate Bridge. Brochant throws his back out and they never do go to the party, which may or may not have made a better movie.\n    Pignon, at Brochant&amp;#039;s elegant apartment, proceeds to involve Brochant in a mildly outrageous series of complications with his wife (who has just left him), his mistress, his best friend, and a tax inspector (Daniel Prevost). The incidents are silly, errors compounding errors, appropriate to the farce form. Brochant is mean and dismissive towards Pignon, which is built into the premise as well . He&amp;#039;s an utterly unlikeable fellow. And Pignon turns out to be the only character in the film of any complexity and interest, the only one who is likeable - he&amp;#039;s sensitive and smarter than he appears, though, in the end, he is still an idiot. It all fits according to the farce schema.\n    Trouble is, it just isn&amp;#039;t funny enough. There are some laughs, but not enough to sustain interest - even for the movie&amp;#039;s relatively short 82 minutes. The targets are the obvious ones, the turnabouts are fairly predictable, the wit is thin. As a result, there are too many stretches that induce more yawns than giggles.\n    The film is based on a play; the screenplay and director make little effort to &quot;open it up.&quot; Almost the whole time you are in that lovely, but confining apartment, just as it must have looked on the stage of a theater.  All too often that brings in the telephone as the means of communication, as the tool to keep the plot moving forward.\n   If the film has one genuinely redeeming quality, it is in the performance of  Jacques Villeret. Villeret creates a warm, sympathetic, and very human fool and he has the timing down to a tee. With a bald pate and frizzy side hair, his face has the plasticity of silly putty, changing expression and mood instantly to reflect the quickly unfolding chain of events. Just when he has demonstrated some cleverness, when a certain glow of  having done something right lights up his face, he inevitably messes it up and torpedoes his own accomplishment and the face falls, like a collapsed souffle. An idiot, indeed, but a lovable one - and a splendid performance. ","torrent":{"xt":"urn:btih:ef9aa943938ebfb8fd03a76629dc83935e1349cf","amp;dn":"Le+Diner+de+CONS+%28dinner+game%29+%2B+english+SRT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef9aa943938ebfb8fd03a76629dc83935e1349cf","infoHashBuffer":{"type":"Buffer","data":[239,154,169,67,147,142,191,184,253,3,167,102,41,220,131,147,94,19,73,207]},"announce":[],"urlList":[]}}