{"title":"Otis Redding - The Dock of the Bay [HD Tracks] 24.192","uid":10462239,"size":1303258397,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:efe493d56b228e3bacd26adb7f371de5502d83b5&amp;dn=Otis+Redding+-+The+Dock+of+the+Bay+%5BHD+Tracks%5D+24.192&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":2,"uploader":"politux","files":-1,"time":1404146039,"description":"\n  Otis Redding - The Dock of the Bay [HD Tracks] 24.192\n\n  Genre: Rhythm and Blues\n  Style: Soul\n  Source: 2012 ATCO Records HD Tracks\n  Codec: FLAC\n  Bitrate: ~ 5,400 kbps\n  Bit Depth: 24\n  Sample Rate: 192 kHz\n\n  01 (Sittin' On) The Dock of the Bay \n  02 Love You More Than Words Can Say\n  03 Let Me Come On Home\n  04 Open the Door \n  05 Don't Mess with Cupid\n  06 The Glory of Love\n  07 I'm Coming Home to See About You \n  08 Tramp\n  09 The Huckle-Buck\n  10 Nobody Knows You (When You're Down and Out) \n  11 Ole Man Trouble \n  \n  It was never supposed to be like this: &quot;(Sittin' on) The Dock of the Bay&quot; was supposed to mark a beginning of a new phase in Otis Redding's career, not an ending. Producer/guitarist Steve Cropper had a difficult task to perform in pulling together this album, the first of several posthumous releases issued by Stax/Volt in the wake of Otis Redding's death. What could have been a cash-in effort or a grim memorial album instead became a vivid, exciting presentation of some key aspects of the talent that was lost when Redding died. Dock of the Bay is, indeed, a mixed bag of singles and B-sides going back to July of 1965, one hit duet with Carla Thomas, and a pair of previously unissued tracks from 1966 and 1967, respectively. There's little cohesion, stylistic or otherwise, in the songs, especially when the title track is taken into consideration -- nothing else here resembles it, for the obvious reason that Redding never had a chance to follow it up. Despite the mix-and-match nature of the album, however, this is an impossible record not to love. Cropper chose his tracks well, selecting some of the strongest and most unusual among the late singer's orphaned songs: &quot;I Love You More Than Words Can Say&quot; is one of Redding's most passionate performances; &quot;Let Me Come on Home&quot; presents an ebullient Otis Redding accompanied by some sharp playing; and &quot;Don't Mess With Cupid&quot; begins with a gorgeous guitar flourish and blooms into an intense, pounding, soaring showcase for singer and band alike. No one could complain about the album then, and it still holds more than four decades later.\n","torrent":{"xt":"urn:btih:efe493d56b228e3bacd26adb7f371de5502d83b5","amp;dn":"Otis+Redding+-+The+Dock+of+the+Bay+%5BHD+Tracks%5D+24.192","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efe493d56b228e3bacd26adb7f371de5502d83b5","infoHashBuffer":{"type":"Buffer","data":[239,228,147,213,107,34,142,59,172,210,106,219,127,55,29,229,80,45,131,181]},"announce":[],"urlList":[]}}