{"title":"Ancestral Journeys: The Peopling of Europe","uid":15791720,"size":36611350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0790cf0d38012dbe65aaa7472643bcb988f5a32&amp;dn=Ancestral+Journeys%3A+The+Peopling+of+Europe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"marty14","files":1,"time":1473386596,"description":"Ancestral Journeys: The Peopling of Europe from the First Venturers to the Vikings - Jean Manco [epub]\r\n\r\nWho are the Europeans and where did they come from? In recent years scientific advances have released a mass of data, turning cherished ideas upside down. The idea of migration in prehistory, so long out of favor, is back on the agenda. New advances allow us to track human movement and the spread of crops, animals, and disease, and we can see the evidence of population crashes and rises, both continent-wide and locally. Visions of continuity have been replaced with a more dynamic view of Europe’s past, with one wave of migration followed by another, from the first human arrivals in Europe to the Vikings.\r\n\r\nAncient DNA links Europe to its nearest neighbors. It is not a new idea that farming was brought from the Near East, but genetics now reveal an unexpectedly complex process in which farmers arrived not in one wave, but several. Even more unexpected is the evidence that the European gene pool was stirred vigorously many times after farming had reached most of Europe. Climate change played a part in this upheaval, but so did new inventions such as the c and wheeled vehicles. Genetic and linguistic clues also enhance our understanding of the upheavals of the Migration Period, the wanderings of steppe nomads, and the adventures of the Vikings. 124 illustrations, including 59 maps","torrent":{"xt":"urn:btih:f0790cf0d38012dbe65aaa7472643bcb988f5a32","amp;dn":"Ancestral+Journeys%3A+The+Peopling+of+Europe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0790cf0d38012dbe65aaa7472643bcb988f5a32","infoHashBuffer":{"type":"Buffer","data":[240,121,12,240,211,128,18,219,230,90,170,116,114,100,59,203,152,143,90,50]},"announce":[],"urlList":[]}}