{"title":"The Fat-Burning Bible: 28 Days of Foods, Supplements, and Workou","uid":7072554,"size":24481199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f099518743cdb2339cc6296592f9407ebb18de12&amp;dn=The+Fat-Burning+Bible%3A+28+Days+of+Foods%2C+Supplements%2C+and+Workou&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"MANTESH","files":3,"time":1330728030,"description":"\n\n[b][quote][color=Green]\n\nThe Fat-Burning Bible: 28 Days of Foods, Supplements, and Workouts that Help You Lose Weight\n\n\nWiley\nMackie Shilstone\nEnglish\nISBN: 0471794015\n2006 \nPDF | \n289 Pages \n23.3 MB\n\n\nThe first section of the book helps you establish your honest starting point--it's easy to be at an acceptable weight but have unacceptably high fat percentages, cholesterol or blood sugar. Establishing this point involves a fair amount of measuring and math, and includes checklists that will help you identity potential concerns like Syndrome X or thyroid problems.\n\nDiet and nutrition follow; the section encompasses fairly complex suggestions on intake percentages as well as simple meal plans and recipes. Portion control figures highly--it's back to the old 'four ounces of skinless chicken breast' as a basic building block. A short section on supplements refers in a general way to recent research, but is more of an introduction than complete system. More time is devoted to the exercise program, but this could be more complex than a typical dieter feels ready for. Clear photos show off specific exercises, but they require regular trips to the gym or a set of dumbbells at home. The last section, which Shilstone suggests photocopying, is a day-to-day journal that allows you to check off goals and note areas for further work. It's a helpful tool, but also requires a fair amount of dedication.\n\n[/color][/quote][/b]\n\n\n\n\n[img]http://torrent-stats.info/2965/47f36f3d.png[/img]","torrent":{"xt":"urn:btih:f099518743cdb2339cc6296592f9407ebb18de12","amp;dn":"The+Fat-Burning+Bible%3A+28+Days+of+Foods%2C+Supplements%2C+and+Workou","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f099518743cdb2339cc6296592f9407ebb18de12","infoHashBuffer":{"type":"Buffer","data":[240,153,81,135,67,205,178,51,156,198,41,101,146,249,64,126,187,24,222,18]},"announce":[],"urlList":[]}}