{"title":"Eddie Murphy:Raw(1987)DVDRip.AC3(ENG)-DROCK","uid":6258401,"size":732641672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0c9bbb0fe35f0a8569ec470e0ab41e90f961495&amp;dn=Eddie+Murphy%3ARaw%281987%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":18,"leechers":0,"uploader":"drock232","files":-1,"time":1300667802,"description":"Filmed in front of a packed New York City crowd, the concert film Eddie Murphy: Raw presents the comedian (near the height of his popularity) performing his standup material. The energetic and often extremely raunchy set begins with a series of impressions, most involving some celebrity becoming upset at Murphy for unflattering jokes: a squeaky-voiced Michael Jackson threatens to pummel Murphy into the ground; an enraged Mr. T is confused by Murphy's verbal sleight of hand; and even paragon of calm Bill Cosby loses his cool while chastising the comic for his dirty mouth. After some digressions finding humor in racial differences and other matters, Murphy proceeds into the centerpiece of his act, a series of routines about contemporary relationships between men and women, including an extended bit about what life would be like were he to become married -- jokes that some have criticized as heavily misogynist. Finally, Murphy concludes his set with an extended, comedic but sympathetic, reminiscence about his childhood and family life, a tone that matches that of the film's prologue -- a fictional re-creation of Murphy, in his childhood, entertaining a family gathering with what turns out to be an inappropriately off-color joke.\n\nRipped with Handbrake.\n\nLength: 1 Hour 30 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:f0c9bbb0fe35f0a8569ec470e0ab41e90f961495","amp;dn":"Eddie+Murphy%3ARaw%281987%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0c9bbb0fe35f0a8569ec470e0ab41e90f961495","infoHashBuffer":{"type":"Buffer","data":[240,201,187,176,254,53,240,168,86,158,196,112,224,171,65,233,15,150,20,149]},"announce":[],"urlList":[]}}