{"title":"NubileFilms - Joleyn Burst (Strip Poker)","uid":12428981,"size":213037694,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f1a335271373757de9894b49be1fcd95df1fa78b&amp;dn=NubileFilms+-+Joleyn+Burst+%28Strip+Poker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":26,"uploader":"EndYou","files":1,"time":1442427817,"description":"                                    -------------\n                                    :Description:\n                                    -------------\nJoleyn Burst has agreed to play poker with Matt Ice. The stakes for each hand are an article of clothes, but once Joleyn's clothes are gone she realizes that losing isn't all bad. Crawling forward on her hands and knees, she helps Matt out of his jeans so that she can lean down and wrap her warm mouth around his cock in a celebratory blowjob that leaves him breathless.\n\nEventually the tanned blonde gets her consolation prize when Matt helps her up onto the couch so that he can dive in for a bald pussy feast. He uses his tongue and lips expertly, and when he slides two fingers deep into Joleyn's tight twat he finds her wet and ready for him to stand up and push his member deep inside.\n\nJoleyn can't contain her moan of appreciation when Matt initially enters her needy twat, and her gasps only get louder and more expressive as he starts thrusting with hard fast strokes. Her first orgasm of the day slams through her as Matt grabs her small tit and squeezes to amp up her total pleasure.\n\nGetting on her hands and knees, Joleyn presents herself to Matt so that he can take her doggy style. He slows down his pussy pounding, setting a steady rhythm that drives his blonde lover crazy with excitement until she once again explodes in his arms.\n\nChanging things up, Joleyn helps Matt sit down on the couch so that she can climb onto his lap and impale herself on his stiffie for a ride where she's in control. Matt can't keep his hands off of Joleyn's bouncing boobs and sensitive clit as Joleyn rides him like a stud. His added touches bring Joleyn in another burst of ecstasy that leaves her boneless and smiling.\n\nWith her fuck hole finally satisfied, Joleyn sets out on a mission to bring Matt off, too. She starts off on her knees with her small hand and soft mouth wrapped around his cock, but soon she rises up so that her hand is doing all the work. When Matt finally explodes, he hits Joleyn's waiting mouth and covers his own dick and stomach in jizz that the blonde samples with a sated smile.\n\n                                    -------------\n                                    :Screenshots:\n                                    -------------\n                           &lt;a href=&quot; http://imgpremium.com/image/vG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/vG&lt;/a&gt;\n                           &lt;a href=&quot; http://imgpremium.com/image/vz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/vz&lt;/a&gt;","torrent":{"xt":"urn:btih:f1a335271373757de9894b49be1fcd95df1fa78b","amp;dn":"NubileFilms+-+Joleyn+Burst+%28Strip+Poker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a335271373757de9894b49be1fcd95df1fa78b","infoHashBuffer":{"type":"Buffer","data":[241,163,53,39,19,115,117,125,233,137,75,73,190,31,205,149,223,31,167,139]},"announce":[],"urlList":[]}}