{"title":"Yes  Very best of - 1993","uid":3714428,"size":89950996,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f1bc9a408db5c7b010b87093c485e50f91405220&amp;dn=Yes++Very+best+of+-+1993&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"Ekolb","files":14,"time":1181885706,"description":"Yes are an English progressive rock band that formed in London in 1968. Their music is marked by complex classically-influenced arrangements, unusual time signatures, virtuoso musicianship, dramatic dynamic and metrical changes, a blend of musical styles, and oblique lyrics. Despite the many changes to its lineup, the band has continued for nearly 40 years and retains a strong international following.\n\nEngineers include: Gerald Chevin, Eddie Offord, John Timperley. Recorded between 1969 to 1987. All tracks have been digitally remastered. With songs that often rival classical music for length and sheer ambition, Yes is not a group whose work can easily be distilled to a single-length compact disc. However, for those looking to skim off the cream off a long and distinguished career, THE VERY BEST OF YES will do the trick, although it may well serve to whet the appetite for more. This collection is arranged chronologically, beginning with &quot;Survival&quot; off the group&amp;#039;s self-titled debut record and finishing with its last certifiable hit, &quot;Rhythm of Love.&quot; Although it does not present a complete picture of the group&amp;#039;s progress, the collection does chronicle Yes&amp;#039;s major phases. Like many bands of the late &amp;#039;60s, Yes began writing songs that echoed the love ethos of the era (&quot;Time and a Word&quot;) before graduating to full-fledged space rock on songs like &quot;Starship Trooper.&quot; During its golden age, Yes had FM radio hits (&quot;Roundabout,&quot; &quot;I&amp;#039;ve Seen All Good People&quot;), and during the mid- to late &amp;#039;70s, the group continued to refine its approach with fine compositions like the melodious &quot;Wondrous Stories&quot; and the raucous &quot;Going for the One.&quot; The surprising #1 hit, &quot;Owner of a Lonely Heart&quot; captures the group in its more stripped-down &amp;#039;80s incarnation.\n\nLabel Atlantic (USA) \nOrig Year 1993 \nAll Time Sales Rank   4361   \nDiscs 1 \nProducer Yves Beauvais (Compilation)\n\nTracks\n1. Survival      \n2. Time And A Word      \n3. Starship Trooper: Life Seeker/Disillusion/Wurm      \n4. I&amp;#039;ve Seen All Good People: Your Move/All Good People      \n5. Roundabout      \n6. Long Distance Runaround      \n7. Soon (Single Edit)      \n8. Wonderous Stories      \n9. Going For The One      \n10. Owner Of A Lonely Heart      \n11. Leave It      \n12. Rhythm Of Love\n\nEnjoy! and please seed..\nEkolb","torrent":{"xt":"urn:btih:f1bc9a408db5c7b010b87093c485e50f91405220","amp;dn":"Yes++Very+best+of+-+1993","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1bc9a408db5c7b010b87093c485e50f91405220","infoHashBuffer":{"type":"Buffer","data":[241,188,154,64,141,181,199,176,16,184,112,147,196,133,229,15,145,64,82,32]},"announce":[],"urlList":[]}}