{"title":"Romance of the Three Kingdoms XII 12 (2012) English Patched","uid":9105387,"size":2746315592,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f313b6c2991cee962fac30c83e97ad22346c4dc9&amp;dn=Romance+of+the+Three+Kingdoms+XII+12+%282012%29+English+Patched&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":2,"uploader":"lemon07r","files":1,"time":1382855590,"description":"CRC32 Checksum (this is to check if your download is corrupt after its finished):\nb45082b4\nHow to check your crc32 checksum: &lt;a href=&quot;\nhttp://www.febooti.com/products/filetweak/members/hash-and-crc/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.febooti.com/products/filetweak/members/hash-and-crc/&lt;/a&gt;\nInstall\nRight click file and go to properties\nClick on the &quot;Hash / CRC&quot; tab\nPut a check in the box next to crc32 only (it will save time)\nClick compute\nSee if you have the right crc32 checksum. (it's b45082b4 for the setup file)\nPassword is lime1911\n\n\nRomance of the Three Kingdoms XII (12) is finally here!! But it's not it in English or available outside of Asia (Japan area I believe)! And is just about impossible to find on the internet!\nLucky for you after working hard, I found a Japanese torrent and was able to download it with only 4 peers; yes it was not an easy task. \nWhen I finally finished downloading it, I installed it only to find my antivirus popping up every few seconds telling me it had malware (it was not false positive)! So I spent all weekend cleaning out the game making sure there were 0 viruses and malware. \nThe game itself was only version 1.0.0.0, so then I had to go through the trouble of manually patching it to 1.0.0.7, not a easy task since I don't know a ounce of Japanese, or really any other language other than English (and a couple programming languages) and then to make the game playable I had to finda bunc English patches and hotfixes, which I eventually got done.\nThere was a separate English patch for the scenarios, items, menus, etc. Which was truly annoying.\nFinished with that, I finally had everything I needed to bring together a good release, the game is approximately a hulking 6 GB so making the installer was a bit arduous, but I got it down with correct install paths, good compression, correct install scripts, and script to run a batch file which patches  the res file (this was one patch that has to be done seperately on every pc), etc. \nMaking the installer took me a few tries, and so did uploading because of a few network errors along the way but here it is!\nOne more thing I forgot to mention, you guys will have downloaded the game but you will have never played it right? No problem, the installer comes with a ENGLISH pdf guide on how to play, like a game manual, make sure the box next to &quot;view readme&quot; is checked off right after game is finished installing, or you can find &quot;ROTK 12 Play Guide&quot; in your start menu after installing.\n\nEnjoy! -lime1911/lemon07r, Lamim\n\nCredits and thanks to:\n-3dmgame for giving me somewhere to download the game from (even if it was loaded with viruses and took forever to download)\n-Samkok911 for the main portion of the english patches\n-xDiva who had a lot to do with english patches and game patches and for the basic guide she made for new players (also included with setup)\n-And the other people I downloaded the other patches and hotfixes from (I couldn't find names for them)","torrent":{"xt":"urn:btih:f313b6c2991cee962fac30c83e97ad22346c4dc9","amp;dn":"Romance+of+the+Three+Kingdoms+XII+12+%282012%29+English+Patched","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f313b6c2991cee962fac30c83e97ad22346c4dc9","infoHashBuffer":{"type":"Buffer","data":[243,19,182,194,153,28,238,150,47,172,48,200,62,151,173,34,52,108,77,201]},"announce":[],"urlList":[]}}