{"title":"Handbook of Depression, 2E Friedman [PDF][StormRG]{HTD15}","uid":11784623,"size":5026623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f388f3cba3a82b57320e6032aaa0452549208409&amp;dn=Handbook+of+Depression%2C+2E+Friedman+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":3,"uploader":"0xmovva","files":3,"time":1427696983,"description":"TITLE/EDITION Handbook of Depression: Second Edition\nBy: Edward S Friedman (Author), Ian Anderson (Author)\nPaperback: 105 pages\nPublisher: Springer Healthcare; 2014 edition (July 15, 2014)\nLanguage: English\nISBN-10: 1907673784\nISBN-13: 978-1907673788\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nDepression is a common mood disorder that affects approximately 10% of the global population at some point in their lives and can cause serious psychological, physical, and cognitive distress. Additionally, patients with depression are at a greater risk for cardiovascular disease, stroke, functional impairment, disability and all-cause mortality. Aside from the impact on the individual, this condition presents a very real economic burden, as depression is the most predominant mental health problem among working-age patients and the leading cause of lost work productivity. Despite advances in screening and treating depression in recent decades, a vast majority of patients with depression do not actively seek treatment and, of those that do, only a quarter have been found to receive adequate and effective interventions. Handbook of Depression, Second Edition is a concise review of assessment tools, available and emerging pharmacological and non-pharmacological treatment options, and consensus management guidelines that center on enhancing the clinician-patient relationship and improving patient quality of life. Cowritten by expert US- and UK-based authors, this handbook has an innovative global focus that consolidates current knowledge in a convenient, pocket-sized guide that is ideal for every day reference in a clinical setting","torrent":{"xt":"urn:btih:f388f3cba3a82b57320e6032aaa0452549208409","amp;dn":"Handbook+of+Depression%2C+2E+Friedman+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f388f3cba3a82b57320e6032aaa0452549208409","infoHashBuffer":{"type":"Buffer","data":[243,136,243,203,163,168,43,87,50,14,96,50,170,160,69,37,73,32,132,9]},"announce":[],"urlList":[]}}