{"title":"Terrence Malick -  Days Of Heaven (1978)","uid":3573281,"size":733855744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f3a53b2bcfc0418f6fd1abe8b8072f591c9a7ed2&amp;dn=Terrence+Malick+-++Days+Of+Heaven+%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"kegir","files":1,"time":1165621083,"description":"USA Title: Days of Heaven\nDirector: Terrence Malick \nYear: 1978 \nLanguage: English\n\nPlot Synopsis from AMG\n\nTerrence Malick&amp;#039;s Days of Heaven, the long-awaited follow-up to his 1973 debut Badlands, confirmed his reputation as a visual poet and narrative iconoclast with a story of love and murder told through the jaded voice of a child and expressive images of nature. In 1916, Chicago steelworker Bill (Richard Gere, stepping in for John Travolta) flees to Texas with his little sister Linda (Linda Manz) and girlfriend Abby (Brooke Adams) after fatally erupting at his boss. Along with other itinerant laborers, they work the harvest at a wealthy, ailing farmer&amp;#039;s ranch, but the farmer (playwright Sam Shepard) falls in love with Abby, and, believing her to be Bill&amp;#039;s sister, asks the three to stay on at his elysian spread. Seeing it as his one real chance to escape perpetual poverty, Bill urges Abby to marry the sick man. Marriage, however, has more restorative powers, and the farmer has more magnetism, than Bill had planned. &quot;Nobody&amp;#039;s perfect,&quot; Linda impassively observes in one of her many voiceovers, after their brief paradise is erased by plagues of locusts, fire, and lethal jealousy.\nLucia Bozzola\n\nReview from AMG \n\nTerrence Malick&amp;#039;s follow-up to his acclaimed 1973 debut Badlands confirmed his reputation as a visual poet and narrative iconoclast. Inspired by silent master F.W. Murnau&amp;#039;s City Girl (1930), and shot by Nestor Almendros and Haskell Wexler in natural light primarily during the &quot;magic hour&quot; before sunset, Malick&amp;#039;s spectacular imagery took the place of conventional exposition and excessive dialogue. The tragic love triangle between a migrant worker couple and a wealthy landowner must be pieced together through brief, cryptic incidents and child observer Linda&amp;#039;s jaded, distant voice-over; the expressive sequences of nature&amp;#039;s radiance and brutality allude to the emotions brewing beneath the adults&amp;#039; cool surfaces. Ennio Morricone&amp;#039;s delicate, dreamy score further complemented the narrative restraint and sensory beauty. Hailed as a lushly visual masterpiece, even by viewers less taken with Malick&amp;#039;s elliptical story-telling, Days of Heaven won a Cannes Film Festival prize and an Oscar for its cinematography, and received Oscar nominations for Score, Costumes, and Sound. Malick himself won Best Director awards from Cannes and the New York Film Critics&amp;#039; Circle. Despite its critical success, Days of Heaven failed to find an audience in 1978; Malick took a 20-year sabbatical from directing before making The Thin Red Line (1998).\nLucia Bozzola\n\nFile Name .............: Terrence Malick -  Days Of Heaven (1978).avi\nFile Size (in bytes) ..: 733,855,744 bytes\nRuntime (# of frames) .: 1:29:55 (10944416 frames)\n\nVideo Codec ...........: DivX 3 Low-Motion\nFrame Size ............: 576x320 [=1.800]\nFPS ...................: 25.000\nVideo Bitrate .........: 967 kb/s\nBits per Pixel ........: 0.210 bpp\nB-VOP, N-VOP, QPel, GMC ......: []...[]...[]...[]\n\nAudio Codec ...........: 0x0055 MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 113 kb/s [2 channel(s)] VBR audio\nInterleave ............: 80 ms\nNo. of audio streams ..: 1\n\nNOT MY RIP \n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\t\t\t\t","torrent":{"xt":"urn:btih:f3a53b2bcfc0418f6fd1abe8b8072f591c9a7ed2","amp;dn":"Terrence+Malick+-++Days+Of+Heaven+%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3a53b2bcfc0418f6fd1abe8b8072f591c9a7ed2","infoHashBuffer":{"type":"Buffer","data":[243,165,59,43,207,192,65,143,111,209,171,232,184,7,47,89,28,154,126,210]},"announce":[],"urlList":[]}}