{"title":"Megadeath - Greatest Hits - Back to the Start","uid":4657016,"size":77857103,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f507c130e95466ea38fdc12250e5fc36706bd178&amp;dn=Megadeath+-+Greatest+Hits+-+Back+to+the+Start&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":3,"uploader":"Hanorotu","files":43,"time":1232236143,"description":"How does one go about reviewing a &quot;best of&quot; or &quot;greatest hits&quot; album? Doesn't everyone already know what the songs sound like? Sure, you could go on about which songs the band chose. You could even give your opinion on which songs &quot;should have&quot; been on the album. That is not the case with this album. Dave Mustaine did something I don't think I've ever seen before. He let the fans decide what songs were on the album.\n\nSince the fans know best what they want on an album criticizing the song selections would be like explaining how we all voted for the wrong singer in American Idol. It would be like biting the media hand that feeds you. What I can do is give you a run down on the album art, copy quality and pretty much anything else that pops into my head.\n\nBefore we get to that we should provide the song list. This list is all-important since the Megadeth fans did it:\n\n1. Holy Wars...The Punishment Due\n2. In My Darkest Hour\n3. Peace Sells\n4. Sweating bullets\n5. Angry Again\n6. A Tout Le Monde\n7. Trust\n8. Kill The King\n9. Symphony Of Destruction\n10. Mechanix\n11. Train Of Consequences\n12. Wake Up Dead\n13. Hangar 18\n14. Dread And The Fugitive Mind\n15. Skin O' My Teeth\n16. She-Wolf\n17. Prince Of Darkness\n\nDid everybody get that? They packed seventeen of the best fan-picked songs into one single disk. I was expecting more like 12-15 but 17 of Megadeth's greatest are well worth it. I was impressed with how strong they have stayed throughout the near twenty years in the industry. I can think of another band that started in the same timeframe that wasn't able to keep their sound nearly as well as Megadeth has. They've stood strong through it all.\n\nTo get into the history of the band one needs only to look at the band member list for these tracks. Most of the band members in Megadeth tend to be expendable. Only two band members have stayed to full course, Dave Mustaine and David Ellefson. For an example of how rocky the band employment is I provide this list from the CD's liner notes:\n\nDave Mustaine: vocals, lead &amp; rhythm guitars [all tracks]\nChris Poland: lead &amp; rhythm guitars [tracks3, 10 &amp; 12]\nJeff Young: lead &amp; rhythm guitars [track 2]\nMarty Friedman: lead &amp; rhythm guitars [tracks 1, 4-9, 11, 13 &amp; 15-17]\nAl Pitrelli: guitars [track 14]\nDavid Ellefson: bass &amp; bkg vocals [all tracks]\nGar Samuelson: drums [tracks 3, 10 &amp; 12]\nChuck Behler: drums [track 2]\nNick Menza: drums [tracks 1, 4-7, 9, 11, 13, 15 &amp; 16]\nJimmy Degrasso: drums [tracks 8, 14 &amp; 17]\n\nA different band member for each one of their albums. I guess this guarantees the lineup will always stay fresh? I'm sure there's probably a long, rock &amp; roll soap opera explanation for each of the rotating band members but I'm not going to speculate as to exactly what transpired. I will speculate that this will probably be the last album you see from Megadeth. From what I hear this album completes the contract with the Capitol Records and, since injuring his arm in 2002, believes it better to pursue other options in the music industry. Of course, I could be mistaken on all of this. It's just rumor-mill stuff.\nAnyway, back to the review.\n\nListening to the album one thing stuck out about it. There was little to no digital remastering done on any of the tracks. Every extra high or low pitch on the original song was in this album. Although I believe they could have stood a bit of volume and warble fixing on a few of the tracks it was entirely for the fans. I would guess that they had this in mind when they decided not to monkey with the original recordings. The people voted on the original songs and that's what they got.\n\nNow, most reviews would end here but I believe there is another factor to reviews that people tend to miss. Album art can be as important as the album itself. I can say without a moment of hesitation that this had great and fitting album art. From the Photoshopped &quot;Megadeth Skull&quot; in the nuke blast on the cover to the beautiful rendition of &quot;the bomb&quot; on the back the album art is not only excellent but sticks to a motif. There is excellent album art throughout.\n\nReviewing this album was more of a pleasure than a task. It is definitely going to be one of my favorites for a while. It might be an even bigger favorite if the Gigantour Megadeath is headlining were to come to my neck of the woods, but some things just don't come to pass. Maybe they could just swing by Hampton Roads and make it 34 dates instead of 33?\n\nNow I must provide a numerical verdict for this album. You know, that trusty old &quot;out of ten&quot; scale everyone looks for. Well, it's not really a requirement or anything, it's just good to have. Anyway, I give this album and 9.5. The only detractors I found was the album sound had some problems with the first note of some songs and a few others sounded as if they had a slight warble to the volume.\n\n\nA review from http://blogcritics.org/archives/2005/06/29/0419162.php\nRemember to seed","torrent":{"xt":"urn:btih:f507c130e95466ea38fdc12250e5fc36706bd178","amp;dn":"Megadeath+-+Greatest+Hits+-+Back+to+the+Start","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f507c130e95466ea38fdc12250e5fc36706bd178","infoHashBuffer":{"type":"Buffer","data":[245,7,193,48,233,84,102,234,56,253,193,34,80,229,252,54,112,107,209,120]},"announce":[],"urlList":[]}}