{"title":"X-Men - The Complete Schism &amp; Regenesis (2011-2012)","uid":9474293,"size":1616249958,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f51feb5b8b253ef3b1a224d08958c35db18987a6&amp;dn=X-Men+-+The+Complete+Schism+%26amp%3B+Regenesis+%282011-2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":4,"uploader":"VikTSlick","files":-1,"time":1389653903,"description":"This is a continuation of my Messiah Trilogy torrent; the link will be in the comments section below.\n\nAfter the events of Second Coming, the X-Men are coming apart at the seams; Cyclops and Wolverine are both natural leaders but they are increasingly divided on many issues, and it is complicating the lives of all the mutants in the X-family. Thus begins the Schism of the X-Men, and the separation of their teams into two distinct factions. The following story arc, Regenesis, explores the ramifications of Schism and highlights the differences in the new status quo. This torrent collects all the relevent pieces of both events plus a little extra prelude and epilogue material. Although the Regenesis stories are not really meant to be in a specific order - more likely, to be read concurrently - I have tried to organize that section in the most coherent order possible so it makes more sense and follows logically. I apologize if I failed miserably, lol! There are five sections in this torrent, organized as follows:\n\n00 The Heroic Age - A self-contained story featuring Cyclops dealing with the fallout of Second Coming. Not strictly necessary but it fits the timeline so I added it here. Contains Uncanny X-Men - The Heroic Age 01 (One-Shot).\n\n01 Generation Hope 01-05, Prelude to Schism - Deals with the teaser of the 5 new mutants at the end of Second Coming, and Hope's quest to locate them in the Five Lights storyline. Also has the first part of the Schism arc. Contains Generation Hope 01-05, Prelude to Schism 01-04.\n\n02 Schism - The rift between Wolverine and Cyclops boils over, and Hope as well as others get caught up in the mix. Contains Schism 01-05, Generation Hope 06-11.\n\n03 Regenesis - The X-Men emerge from Schism with two divergent paths, and many have to decide who they will choose to follow. Wolverine relocates from San Francisco to Westchester and hopes to rebuild the mansion and school; Cyclops and others stay on Utopia and move forward with their own plans. Contains X-Men: Regenesis (One-Shot), Generation Hope 12-17, X-Men Legacy v1 259-260.1, Uncanny X-Men v2 01-03, Wolverine v4 17-19, Wolverine and the X-Men 01-03, Astonishing X-Men 44-47, x-23 17-19, Uncanny X-Force v1 19, X-Factor v3 230, New Mutants v2 33-36, Magneto: Not A Hero 01-04 (Limited Series) and X-Club 01-05 (Limited Series). Again, there is not set order to read these in per se, so feel free to look around and experiment if you feel my numbering is off.\n\n04 X-Sanction - The last part of the arc, featuring the return of Cable and the havoc the follows. Contains Avengers: X-Sanction 01-04.\n\nAll credit to the original uploaders and scanners (especially Minutemen and Zone-Empire). Please seed and I hope you like it! :-)  ","torrent":{"xt":"urn:btih:f51feb5b8b253ef3b1a224d08958c35db18987a6","amp;dn":"X-Men+-+The+Complete+Schism+%26amp%3B+Regenesis+%282011-2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f51feb5b8b253ef3b1a224d08958c35db18987a6","infoHashBuffer":{"type":"Buffer","data":[245,31,235,91,139,37,62,243,177,162,36,208,137,88,195,93,177,137,135,166]},"announce":[],"urlList":[]}}