{"title":"The Establishment: And How They Get Away With It (2014)epub","uid":11010596,"size":376056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f522c47799e6c0ef48c657c9ba05dacb1666809a&amp;dn=The+Establishment%3A+And+How+They+Get+Away+With+It+%282014%29epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"bookzilla","files":1,"time":1410309451,"description":"In The Establishment Owen Jones, author of the international bestseller Chavs, offers a biting critique of the British Establishment and a passionate plea for democracy. Behind our democracy lurks a powerful but unaccountable network of people who wield massive power and reap huge profits in the process. \n\nIn exposing this shadowy and complex system that dominates our lives, Owen Jones sets out on a journey into the heart of our Establishment, from the lobbies of Westminster to the newsrooms, boardrooms and trading rooms of Fleet Street and the City. Exposing the revolving doors that link these worlds, and the vested interests that bind them together, Jones shows how, in claiming to work on our behalf, the people at the top are doing precisely the opposite. In fact, they represent the biggest threat to our democracy today - and it is time they were challenged. \n\nPraise for Owen Jones' Chavs: &quot;A passionate and well-documented denunciation of the upper-class contempt for the probes that has recently become so visible in the British class system&quot;. (Eric Hobsbawm, Guardian Books of 2011). &quot;As with all the best polemics, a luminous anger backlights his prose&quot;. (Economist). &quot;A bold attempt to rewind political orthodoxies; to reintroduce class as a political variable ...It moves in and out of postwar British history with great agility, weaving together complex questions of class, culture and identity with a lightness of touch. Jones torches the political class to great effect&quot;. (Jon Cruddas, Independent). Owen Jones was born in Sheffield, grew up in Stockport, and studied history at Oxford. His first book, the international bestseller Chavs: The Demonization of the Working Class, was long-listed for the Guardian First Book Award and chosen as one of The New York Times top 10 non-fiction books of 2011. In 2013 he received the Young Writer of the Year prize at the Political Book Award. He is a columnist for the Guardian and a frequent broadcaster.\n","torrent":{"xt":"urn:btih:f522c47799e6c0ef48c657c9ba05dacb1666809a","amp;dn":"The+Establishment%3A+And+How+They+Get+Away+With+It+%282014%29epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f522c47799e6c0ef48c657c9ba05dacb1666809a","infoHashBuffer":{"type":"Buffer","data":[245,34,196,119,153,230,192,239,72,198,87,201,186,5,218,203,22,102,128,154]},"announce":[],"urlList":[]}}