{"title":"Heavier Than Heaven: A Biography of Kurt Cobain","uid":9652667,"size":12640470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5701165609b94608c8c1f4c47872605c43e5042&amp;dn=Heavier+Than+Heaven%3A+A+Biography+of+Kurt+Cobain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"PirateBook","files":1,"time":1393122266,"description":"\nBy: Charles R. Cross\n\nThe art of Nirvana's Kurt Cobain was all about his private life, but written in a code as obscure as T.S. Eliot's. Now Charles Cross has cracked the code in the definitive biography Heavier Than Heaven, an all-access pass to Cobain's heart and mind. It reveals many secrets, thanks to 400-plus interviews, and even quotes Cobain's diaries and suicide notes and reveals an unreleased Nirvana masterpiece. \n\nAt last we know how he created, how lies helped him die, how his family and love life entwined his art--plus, what the heck &quot;Smells Like Teen Spirit&quot; really means. (It was graffiti by Bikini Kill's Kathleen Hanna after a double date with Dave Grohl, Cobain, and the &quot;over-bored and self-assured&quot; Tobi Vail, who wore Teen Spirit perfume; Hanna wrote it to taunt the emotionally clingy Cobain for wearing Vail's scent after sex--a violation of the no-strings-attached dating ethos of the Olympia, Washington, &quot;outcast teen&quot; underground. \n\nCobain's stomach-churning passion for Vail erupted in six or so hit tunes like &quot;Aneurysm&quot; and &quot;Drain You.&quot;) Cross uncovers plenty of news, mostly grim and gripping. As a teen, Cobain said he had &quot;suicide genes,&quot; and his clan was peculiarly defiant: one of his suicidal relatives stabbed his own belly in front of his family, then ripped apart the wound in the hospital. \n\nCobain was contradictory: a sweet, popular teen athlete and sinister berserker, a kid who rescued injured pigeons and laughingly killed a cat, a talented yet astoundingly morbid visual artist. He grew up to be a millionaire who slept in cars (and stole one), a fiercely loyal man who ruthlessly screwed his oldest, best friends. In fact, his essence was contradictions barely contained. \n\nCross, the coauthor of Nevermind: Nirvana, the definitive book about the making of the classic album, puts numerous Cobain-generated myths to rest. (Cobain never lived under a bridge--that Aberdeen bridge immortalized in the 12th song on Nevermind was a tidal slough, so nobody could sleep under it.) He gives the fullest account yet of what it was like to be, or love, Kurt Cobain. Heavier Than Heaven outshines the also indispensable Come As You Are. It's the deepest book about pop's darkest falling star.\n\nGenre: Biographies/Memoirs","torrent":{"xt":"urn:btih:f5701165609b94608c8c1f4c47872605c43e5042","amp;dn":"Heavier+Than+Heaven%3A+A+Biography+of+Kurt+Cobain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5701165609b94608c8c1f4c47872605c43e5042","infoHashBuffer":{"type":"Buffer","data":[245,112,17,101,96,155,148,96,140,140,31,76,71,135,38,5,196,62,80,66]},"announce":[],"urlList":[]}}