{"title":"The New Crusades: Constructing the Muslim Enemy","uid":15760417,"size":16325673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f592b6fc0885f529c87678eff3749f1c36da9892&amp;dn=The+New+Crusades%3A+Constructing+the+Muslim+Enemy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"marty14","files":1,"time":1473107431,"description":"The New Crusades: Constructing the Muslim Enemy - Emran Qureshi [epub]\r\n\r\nNot since the Crusades of the Middle Ages has Islam evoked the degree of fear, hostility, and ethnic and religious stereotyping that is evident throughout Western culture today. As conflicts continue to proliferate around the globe, the perception of a colossal, unyielding, and unavoidable struggle between Islam and the West has intensified. These numerous conflicts, both actual and ideological, have revived fears of an ongoing &quot;clash of civilizations&quot; ― an intractable and irreconcilable conflict of values between Western cultures and an Islam that is portrayed as hostile and alien.\r\n\r\nThe New Crusades takes head-on the idea of an emergent &quot;Cold War&quot; between Islam and the West. It explores the historical, political, and institutional forces that have raised the specter of a threatening and monolithic Muslim enemy and provides a nuanced critique of much received wisdom on the topic, particularly the &quot;clash of civilizations&quot; theory. Bringing together twelve of the most influential thinkers in Middle Eastern and religious studies ― including Edward Said, Roy Mottahedeh, and Fatema Mernissi ― this timely collection confronts such depictions of the Arab-Islamic world, showing their inner workings and how they both empower and shield from scrutiny Islamic radicals who operate from similar paradigms of inevitable and absolute conflict","torrent":{"xt":"urn:btih:f592b6fc0885f529c87678eff3749f1c36da9892","amp;dn":"The+New+Crusades%3A+Constructing+the+Muslim+Enemy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f592b6fc0885f529c87678eff3749f1c36da9892","infoHashBuffer":{"type":"Buffer","data":[245,146,182,252,8,133,245,41,200,118,120,239,243,116,159,28,54,218,152,146]},"announce":[],"urlList":[]}}