{"title":"Thom Yorke - Tomorrows Modern Boxes mp3  (2014)","uid":11157356,"size":92997591,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f5aad76414cc5444710d54b72412ec533da8124f&amp;dn=Thom+Yorke+-+Tomorrows+Modern+Boxes+mp3++%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"analogkid6103","files":9,"time":1412455125,"description":"\nThomas Edward &quot;Thom&quot; Yorke (born 7 October 1968) is an English musician, singer, and songwriter. He is the lead singer and principal songwriter of the bands Radiohead and Atoms for Peace, known for his use of falsetto. As a multi-instrumentalist, he mainly plays guitar and piano, but also plays synthesizer, bass guitar, and drums among other instruments, and makes use of electronic equipment such as samplers and drum machines; later Radiohead albums credit him with playing &quot;laptop&quot;. In the 1990s, Yorke was known as a rock musician, but the 2000 Radiohead album Kid A saw his work expand into electronic music. He has released two solo albums: The Eraser (2006) and Tomorrow's Modern Boxes (2014). Outside music, Yorke is a political activist on behalf of human rights, environmentalist and anti-war causes.\n\nIn 2002, Q magazine named Yorke the sixth most powerful figure in music, and Radiohead were ranked number 73 in Rolling Stone's &quot;100 Greatest Artists of All Time&quot; in 2005. A 2005 poll by Blender and MTV2 saw Yorke voted the 18th greatest singer of all time, and in 2008, he was ranked 66th in Rolling Stone's &quot;100 Greatest Singers of All Time&quot; list.\n\nYorke was born on 7 October 1968, in Wellingborough, Northamptonshire. He was born with a paralysed left eye, and underwent five eye operations by the age of six. During this time Yorke had to wear a patch over his eye. Yorke stated that the last surgery was &quot;botched&quot;, giving him a drooping eyelid.\n\nYorke's family moved frequently. Yorke's father, a nuclear physicist and later a chemical equipment salesman, was hired by a firm in Scotland shortly after his son's birth, and the family lived there until Yorke was seven. Yorke moved from school to school, where classmates teased him for his eye. The family finally settled in Oxfordshire in 1978. Yorke received his first guitar when he was seven; his earliest musical inspiration was guitarist Brian May of Queen. By 11, he had joined his first band and written his first song. He attended the all-boys public school Abingdon in Oxford, where he met future band members Ed O'Brien, Phil Selway, and brothers Colin and Jonny Greenwood. They formed a band named On a Friday, named for the only day they were allowed to rehearse. In this early line-up, Yorke played guitar and sang. Speaking about music's influence on him as a schoolboy, Yorke said: &quot;School was bearable for me because the music department was separate from the rest of the school. It had pianos in tiny booths, and I used to spend a lot of time hanging around there after school.&quot;\n\nAfter leaving school, Yorke took a gap year, during which he worked in a few jobs and was involved in a car accident that made him wary of any kind of mechanised transport; this informed the lyrics of several Radiohead songs, including the Bends B-side &quot;Killer Cars&quot; and &quot;Airbag&quot; from OK Computer. In late 1988, Yorke left Oxford to study at the University of Exeter, which put On a Friday on hiatus aside from holiday break rehearsals. At Exeter, Yorke worked as a DJ at Guild nights in the Lemon Grove and played with the band Headless Chickens. He also met his partner Rachel Owen, and artist Stanley Donwood, with whom Yorke later collaborated to produce artwork for Radiohead albums and promotional material.\n\nOn A Friday resumed activity in 1991 as the members were finishing their degree courses. They signed to Parlophone and changed their name to Radiohead. Around this time, Yorke said he &quot;hit the self-destruct button pretty quickly&quot;; he drank heavily, which resulted in him cutting his hair off and being too drunk to perform onstage. Radiohead gained notice with the worldwide hit single &quot;Creep&quot;, which later appeared on the band's 1993 debut album Pablo Honey. Yorke admitted later that the success had inflated his ego; he tried to project himself as a rock star, which included bleaching his hair and wearing extensions. He said, &quot;When I got back to Oxford I was unbearable ... as soon as you get any success you disappear up your own arse and lost it forever.&quot;\n\nBy the time of their second album, The Bends (1995), Radiohead had attracted a large fanbase and had begun to receive wider critical acclaim. After the album's release, the American rock band R.E.M. picked Radiohead as its opening act for the European leg of their tour. During the tour, Yorke and R.E.M. singer Michael Stipe became close friends; Stipe gave him advice on how to deal with the demands of being in a famous rock band. During the production of the band's third album, OK Computer (1997), all five members of Radiohead had differing opinions and equal production roles, with Yorke having &quot;the loudest voice&quot;, according to guitarist Ed O'Brien. OK Computer was heralded as a landmark album by nearly every publication that reviewed it, establishing Radiohead as one of the leading alternative rock acts of the 1990s. But Yorke was ambivalent about this success. Some of these concerns were voiced in the 1998 documentary film Meeting People Is Easy, which followed the band on their OK Computer tour. Yorke has explained that he dislikes the &quot;mythology&quot; of rock music and the media's obsession with celebrity.\n\nYorke and the band adopted a more radical approach on 2000's Kid A and 2001's Amnesiac, processing vocals, obscuring lyrics, and departing from rock for a more varied musical landscape including electronic, jazz and avant-garde classical influences. The albums divided fans and critics, but were commercially successful, and later established wide critical acclaim; at the turn of the decade, Kid A was named the best album of the 2000s by Rolling Stone and Pitchfork. In 2003, Radiohead released their sixth album, Hail to the Thief, a blend of rock and electronica that Yorke described as a reaction to the events of the early 2000s and newfound fears for his children's future, though he denied political intent. The band has continued to tour, and in 2005 they undertook recording sessions for a seventh album, In Rainbows, released as a digital DRM-free download in October 2007. In 2011, Radiohead released their eighth album, The King of Limbs, which Yorke described as &quot;an expression of physical movements and wildness&quot;.\n\nYorke released his debut solo album The Eraser in 2006. Produced by Radiohead producer Nigel Godrich and featuring cover art by Stanley Donwood, it was released on the independent label XL Recordings. Yorke described the album as &quot;more beats and electronics&quot; and denied that it meant he was leaving Radiohead, saying: &quot;I want no crap about me being a traitor or whatever splitting up blah blah... this was all done with their blessing.&quot; The Eraser received positive reviews, and reached number 3 in the UK in its first week, number 2 in the United States, Canada and Australia, and number 9 in Ireland. It was nominated for a Mercury Prize a Grammy Award for Best Alternative Music Album. On 21 September 2009, Yorke released a new double-A side single, &quot;Feeling Pulled Apart by Horses / The Hollow Earth&quot;. In 2012, Yorke contributed music to a Rag &amp; Bone fashion show. In September 2014, Yorke released his second solo album, Tomorrow's Modern Boxes, via BitTorrent.\n\nYorke rarely plays as a solo act, and has never embarked on a solo tour. He has sometimes played short acoustic sets of Radiohead songs in the band's webcasts and television appearances, and occasionally on his own at rallies. In 2006, he performed stripped-down versions of several songs from The Eraser (&quot;Analyse&quot;, &quot;The Clock&quot;, &quot;Skip Divided&quot; and &quot;Cymbal Rush&quot; ) on radio and TV programmes, has performed &quot;Cymbal Rush&quot; as an encore at some Radiohead concerts. In July 2009, Yorke played a solo performance at the Latitude Festival in England.\n\nIn 2009, Yorke formed Atoms for Peace to perform songs from his solo album The Eraser. Alongside Yorke on vocals, guitar and keyboards, the band comprises bassist Flea of the Red Hot Chili Peppers, drummer Joey Waronker of Beck and R.E.M., percussionist Mauro Refosco of Forro in the Dark and Radiohead producer Nigel Godrich on keyboards and guitar. In February 2013, Atoms for Peace released their debut album, Amok, to positive reviews. Answering a fan question on Reddit, Yorke wrote that determining whether new songs were for Radiohead or Atoms for Peace was &quot;a grey area. getting greyer. obviously depends on who is being sampled.&quot;\n\n\n\nDiscography\n\nThe Eraser (2006)\nTomorrow's Modern Boxes (2014)\n\n\n\nTomorrow's Modern Boxes (2014)\n\n\n\n01 A Brain In A Bottle\n02 Guess Again!\n03 Interference\n04 The Mother Lode\n05 Truth Ray\n06 There Is No Ice (For My Drink)\n07 Pink Section\n08 Nose Grows Some\nGenre:\tAlternative\nSubgenre:\tProgressive / Electronic\nBitrate:\t320 k\nSize:\t88.69 MB\nShow/Hide Files: \t\n9 files","torrent":{"xt":"urn:btih:f5aad76414cc5444710d54b72412ec533da8124f","amp;dn":"Thom+Yorke+-+Tomorrows+Modern+Boxes+mp3++%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5aad76414cc5444710d54b72412ec533da8124f","infoHashBuffer":{"type":"Buffer","data":[245,170,215,100,20,204,84,68,113,13,84,183,36,18,236,83,61,168,18,79]},"announce":[],"urlList":[]}}