{"title":"Rhiannon Giddens - Tomorrow Is My Turn [2015][FLAC]","uid":11693589,"size":279245655,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f656499242cbf1bfc3bfef35e6fd75e51e4eb743&amp;dn=Rhiannon+Giddens+-+Tomorrow+Is+My+Turn+%5B2015%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"SmashAndGrab","files":14,"time":1423623986,"description":"Rhiannon Giddens - Tomorrow Is My Turn [2015][FLAC]\n\nReleased ................ 2015\nSource .................. CD\nGenre ................... Folk\nCodec ................... FLAC\nBit Depth ............... 16 bits\nSampling Rate ........... 44.1 KHz\nLog ..................... Yes\nCue ..................... Yes\n\n01 - Last Kind Words\n02 - Don't Let It Trouble Your Mind\n03 - Waterboy\n04 - She's Got You\n05 - Up Above My Head\n06 - Tomorrow Is My Turn\n07 - Black Is The Color\n08 - Round About The Mountain\n09 - Shake Sugaree\n10 - O Love Is Teasin'\n11 - Angel City\n\nStepping away from the Carolina Chocolate Drops, Rhiannon Giddens teams up with producer T-Bone Burnett for her 2015 solo debut, Tomorrow Is My Turn. Giddens previously worked with Burnett on Lost on the River, an album where musicians added new music to lyrics Bob Dylan left behind during The Basement Tapes, and she also appeared in a concert he shepherded for the Coen brothers' folk revival opus Inside Llewyn Davis -- two projects steeped in history, as is Tomorrow Is My Turn. Here, Giddens expands upon the neo-string band of the Carolina Chocolate Drops by crafting an abbreviated and fluid history of 20th century roots music -- along with the older forms that informed it -- concentrating on songs either written or popularized by female musicians. As a torchbearer, not a revivalist, Giddins isn't concerned with replicating either the sound or feel of the past, so she comfortably slips a subdued hip-hop drum loop into &quot;Black Is the Color,&quot; a standard here credited to Nina Simone, and blurs country and soul boundaries on Patsy Cline's &quot;She's Got You.&quot; These two are the most overt tamperings with tradition but Giddens is sly throughout Tomorrow Is My Turn, giving Elizabeth Cotten's &quot;Shake Sugaree&quot; a deceptively lively little lilt and casting Dolly Parton's &quot;Don't Let It Trouble Your Mind&quot; as a rolling progressive folk tune that creates an invisible bridge between past and present. Much of Giddens' work on Tomorrow Is My Turn demonstrates the benefits of such careful, deliberate sculpting, making it a nice fit for Burnett's handsome acoustica. Thankfully, the austereness that sometimes creeps into T-Bone's new millennial work is nowhere to be found; there's a warmth that radiates from Giddens, which is crucial to the success of the record. Her easy, welcoming touch is a balm every time Tomorrow Is My Turn is played, but it's upon successive spins that the intricacies of Giddens' construction -- not to mention her subtle political messages -- begin to take hold","torrent":{"xt":"urn:btih:f656499242cbf1bfc3bfef35e6fd75e51e4eb743","amp;dn":"Rhiannon+Giddens+-+Tomorrow+Is+My+Turn+%5B2015%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f656499242cbf1bfc3bfef35e6fd75e51e4eb743","infoHashBuffer":{"type":"Buffer","data":[246,86,73,146,66,203,241,191,195,191,239,53,230,253,117,229,30,78,183,67]},"announce":[],"urlList":[]}}