{"title":"My Real Swinger's Orgy (NEW 2016 Marc Dorcel) [Split Scenes] WEB","uid":14568784,"size":1259953835,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f6946c182c220434475cb1fb3e013dd24240695c&amp;dn=My+Real+Swinger%27s+Orgy+%28NEW+2016+Marc+Dorcel%29+%5BSplit+Scenes%5D+WEB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":4,"uploader":"UniX","files":3,"time":1462781263,"description":"My Real Swinger's Orgy (NEW 2016 Marc Dorcel) [Split Scenes] WEB-DL FRENCH\r\n\r\nscreens;\r\n \nhttp://imgurx.net/share-53E9_5730281C.html\r\n \nhttp://imgurx.net/share-C4C3_57302838.html\r\n \nhttp://imgurx.net/share-6217_57302838.html\r\n \nhttp://imgurx.net/share-F445_57302838.html\r\n\r\nAn exceptional orgy with 15 real amateur couples\r\n&quot;I never would've thought it possible, it was crazy!&quot; Anna Polina\r\n\r\n&quot;We thought we had tried every sexually debauched thing imaginable&quot; Chloé and Eric (libertines).\r\n\r\n&quot;It's more than just sex, it's desire&quot; Hervé Bodilis\r\n\r\nIt's more than just a film, it's was an unforgettable experience for everyone involved. For the first time, the world of pornography and the world of libertines have been brought together. \r\n\r\nIn a loft already made famous by a French reality show, our cameras made an appointment with 20 libertine couples and a group of pornstars (Ricky Mancini, Joss Lescaf...).\r\n\r\nAnna Polina, the mistress of ceremonies, sets the tone, arriving arm in arm with Marie Marlo, a newcomer to the world of Marc Dorcel.\r\n\r\nAfter a cocktail beside the pool, the libertines, set free by the masks they are wearing, quickly get into the swing of things enjoying everything (and everyone) around them. A gorgeous blonde with red soled shoes squeezes herself between two pornstars under the excited and watchful gaze of her husband, as he runs his hands over his neighbour. Tonight is a first for everyone. Everyone is free to give in to their desires: on the sofas, on the tables or in the middle of the floor as everyone watches on, Marie Marlo is offered to anyone who wants her, and she loves it.\r\n\r\nOnce the intimate introductions have been made, Anna calls everyone to follow her into the backroom, which has been specially set up for the final orgy. The cameras get right into the middle of the action, so much so it's difficult to tell who is who. With the actual party lasting for five hours, we have saved 80 minutes of pure pleasure just for you, with absolutely no staging or acting direction, just pure pleasure","torrent":{"xt":"urn:btih:f6946c182c220434475cb1fb3e013dd24240695c","amp;dn":"My+Real+Swinger%27s+Orgy+%28NEW+2016+Marc+Dorcel%29+%5BSplit+Scenes%5D+WEB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6946c182c220434475cb1fb3e013dd24240695c","infoHashBuffer":{"type":"Buffer","data":[246,148,108,24,44,34,4,52,71,92,177,251,62,1,61,210,66,64,105,92]},"announce":[],"urlList":[]}}