{"title":"Fulcanelli and the Alchemical Revival","uid":15848030,"size":1575025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6cca6e7f0f0ded195189c496a83f513cb83f844&amp;dn=Fulcanelli+and+the+Alchemical+Revival&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"marty14","files":1,"time":1474129060,"description":"Fulcanelli and the Alchemical Revival: The Man Behind the Mystery of the Cathedrals - Geneviève Dubois [epub]\r\n\r\nFulcanelli, operative alchemist and author of The Mystery of the Cathedrals and The Dwellings of the Philosophers - two of the most important esoteric works of the twentieth century - remains himself a mystery. The true identity of the man who allegedly succeeded in creating the philosopher’s stone has never been discovered, despite ardent searches by many - even the OSS (the wartime U.S. intelligence agency, later to become the CIA) claimed to have looked for him following the end of World War II. Geneviève Dubois looks at the esoteric milieu of Paris at the turn of the century, a time that witnessed a great revival of the alchemical tradition, and investigates some of its salient personalities. Could one of these have been this enigmatic man, reported to have last appeared in Seville, Spain, in 1952 when he would have been 113 years of age?\r\n\r\nThe trail followed by the author encounters such figures as Papus, René Guénon, Schwaller de Lubicz, Pierre Dujols, Eugene Canseliet, and Jean-Julien Champagne. Working from rare documents, letters, and photos, Dubois suggests that one of these men could have been hiding his activity behind the pseudonym of Fulcanelli or that Fulcanelli may even have been a composite fabricated by several of these individuals working together. Beyond its attempt to reveal the actual identity of Fulcanelli, Fulcanelli and the Alchemical Revival also presents an explanation of the alchemical doctrine and reveals the unsuspected relationships among the important twentieth-century truth seekers it highlights","torrent":{"xt":"urn:btih:f6cca6e7f0f0ded195189c496a83f513cb83f844","amp;dn":"Fulcanelli+and+the+Alchemical+Revival","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6cca6e7f0f0ded195189c496a83f513cb83f844","infoHashBuffer":{"type":"Buffer","data":[246,204,166,231,240,240,222,209,149,24,156,73,106,131,245,19,203,131,248,68]},"announce":[],"urlList":[]}}