{"title":"The_Settlers_7-Razor1911","uid":5517867,"size":5899025474,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f6f3fb81742b370d4061c3ca9c13ba1e49fd05a0&amp;dn=The_Settlers_7-Razor1911&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":2,"uploader":"JuggernautOfWar","files":-1,"time":1272335884,"description":"Razor 1911 proudly presents:\nThe Settlers 7: Paths to a Kingdom\n(C) Ubisoft\n\nDate: 2010-04-27       Game Type : Strategy\nSize: 1 DVD            Protection: Ubisoft DRM + Custom Server-Side Stuff\n\nGame Notes\n\nThe  Settlers  7: Paths to a Kingdom ties in with the tradition of the series\nsuccess while bringing a fresh, modern and innovative strategy game, based on\nstrong  game  mechanics  and  deep  gameplay that are hallmarks of the highly\nacclaimed  Settlers  franchise.  Players  will  easily  become  engaged in an\nexciting  campaign,  skirmish  maps  or multi-player challenges in a world of\nlush  forests,  open  meadows,  fast  flowing  rivers,  and  high  mountains.\n\nInstall Notes\n\n1. Extract RARs\n2. Mount or Burn image\n3. Install the game\n4. Install the update located in \\Razor1911\\Update\\\n5. Copy the whole content of \\Razor1911\\Crack to your game folder overwriting\nany existing files.\nExample: X:\\Program Files (x86)\\Ubisoft\\The Settlers 7 - Paths to a Kingdom\\\n6. Make sure to back up and then delete any previous copies of\n&quot;My Documents\\Settlers7\\Profiles.xml&quot;\n7. Start the game (admin rights may be required the first time you run it)!\n8. Have Fun!\n\nMinor recurring freezes after every 10 min. of playing the game are due to a\nfaulty implementation of the autosave mechanism and are NOT crack-related.\n\nScene-related rants &amp; stuff:\n\nAs  far  as  previous  'cracks'  of  Ubisoft's  new DRM system are concerned:\n\nBoth   of   Skidr0w's   releases   show  us they haven't had a look (probably\neven  didn't  find)  the  actual  protection  code and everything hints on em\nusing  parts   of  publicly  collected  'challenge/response'  pairs.  Luckily\nAssassin's   Creed  II is probably the only  target  ever where this approach\nof  'emulating'  the  server by a  static lookup will  yield  any  measurable\nsuccess   (due   to   a   basic   design  flaw in  an otherwise  pretty  neat\nidea  of  software  protection).  In  fact, we  considered this  approach  as\ngenerally  too  unreliable  and  'unworthy' of a scene crack,  so  we  didn't\ncare   about   doing   it.   Instead   we  opted  for going for the arguably\nmost     challenging    implementation    of    Ubisoft's   new   DRM   first\n(emulating   actual   server-side   game  code).  So  here  it  is: The first\nUbisoft DRM crack!\n\n@RELOADED:\nCongrats  on  your  recent advances in automating your Solidshield VM cracks.\nWe  actually  respect  that. However, we wonder why you didn't go all the way\nand  recompiled  the  fixed decompiler output to optimized native x86 code as\nwe   did   as   early   as   with  Perry  Rhodan  (followed  by  Anno  1404).\n\nAlthough  we  think there's not much merit to discussing technical details in\n.nfos  (mostly  because  it's  impossible  for  anyone lacking the skills and\nsources  to  fact-check  these  statements)  we feel the need to preempt all\nthat  made-up &quot;they-ripped-it-from-some-unprotected-tuvaluan-multi12-binary&quot;\nbullshit that's sure to follow:\n\nWe  invite  anyone  who is able to and interested enough in this to check the\nhistory  of  scene-released  Solidshield VM cracks taking into account things\nlike  availability  of  possible  alternate  sources  for  the protected code\nfragments  at  the time of release, similarity to compiled code (i.e. 'copy &amp;\npaste  cracks'  from  differently  protected  or  unprotected  binaries), the\nrebuilt   code's  resemblence  of  the  original  VM  instructions  regarding\nsequence  of  mnemonics  etc.pp. We're pretty confident (read '100% certain')\nyou'll  come  to the conclusion that we were first with respect to rebuilding\nactual Solidshield VM code.\n\nNvm, 'mild respect'!\n\nP.S.\nFinally,   there's  a  chance  of  the  good  ol'  times  coming  back  (when\nprotections   had  to  be  dealt  with  on  a  per  title  basis  by  skilled\nindividuals)  and  an  opportunity  of  telling  the sharpies from the fakers\nagain.   Thanks   Ubi!   (Yup,   we're   actually   serious  about  this  )\n\nRazor 1911 Greetings\n\nTo our demo division heroes: Your cracktro rocks (we expected no less :wink!\n\n              /\\\nRazor 1911   /__\\   Since 1985\n            /\\  /\\\n           /__\\/__\\\n\nSUPPORT THE COMPANIES THAT PRODUCE QUALITY SOFTWARE!\nIF YOU ENJOYED THIS PRODUCT, BUY IT!  SOFTWARE AUTHORS DESERVE SUPPORT!!\n\n\n--------------------\n\nVirus scanner reports -- why hasn't anyone else posted any yet?  &lt;a href=&quot;\nhttp://www.threatexpert.com/report.aspx?md5=e5524c87626eb3817ac2aefab77f8eb2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.threatexpert.com/report.aspx?md5=e5524c87626eb3817ac2aefab77f8eb2&lt;/a&gt;  &lt;a href=&quot;\nhttp://virustotal.com/analisis/4ff30d53f7cdc793d556465e574d6445c3a3d1c62d4d0352679346add8abbf1c-1272392245&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virustotal.com/analisis/4ff30d53f7cdc793d556465e574d6445c3a3d1c62d4d0352679346add8abbf1c-1272392245&lt;/a&gt; \n\n\nNotwithstanding: this is the unaltered release. Take it or leave it.\n\n-------------------------------\n\nSome informative comments:\n\n Ubung  at 2010-04-28 21:37 CET:\nI can confirm the game does work. However the guy talking about the acheivments is correct. Everytime you exit the game your gold and acheivments are lost. This means you cant get any of the extra stuff from the shop.\n\n\n unrealdj at 2010-04-29 20:33 CET:\nFound a pretty big bug with this crack.\nIt seems once you get a pretty huge area for yourself (like 12+ sectors), the storehouse's and additional contructors cease to work, for medium small games this is flawless. But I waited 20 minutes for ONE stone to get to a store house, nothing else being built, no other upgrades, no interference etc and 20 minutes that 1 stone i needed never came.\nsometimes saving/reloading works, but now that I'm up to 16 sectors for myself that doesn't work anymore either.\n","torrent":{"xt":"urn:btih:f6f3fb81742b370d4061c3ca9c13ba1e49fd05a0","amp;dn":"The_Settlers_7-Razor1911","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6f3fb81742b370d4061c3ca9c13ba1e49fd05a0","infoHashBuffer":{"type":"Buffer","data":[246,243,251,129,116,43,55,13,64,97,195,202,156,19,186,30,73,253,5,160]},"announce":[],"urlList":[]}}