{"title":"TapouT XT 1 &amp; 2 - x264 - MP4 - DVDrip","uid":8797240,"size":9969098070,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f7deb40f436fd31c9413724304d14bd45d652359&amp;dn=TapouT+XT+1+%26amp%3B+2+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":4,"uploader":"MrTVGuy","files":-1,"time":1376102445,"description":"TAPOUT XT 1 &amp; 2 EXTREME MMA HOME FITNESS WORKOUT\n\nNow get BOTH TapouT XT and TapouT XT2 in one amazing workout torrent. All workouts are encoded in x264 codex in an MP4 container for maximum compatibility, small file size and excellent quality. These videos should be compatible with Softmodded Wiis and other devices.\n\nPro trainer and MMA conditioning coach, Mike Karpenko will lead you to the lean, rock hard body you want. TapouT XT's extreme home training program will leave you ripped and ready for more. You just need to Come And Get It!\n\nLose weight, build lean muscle, and get ripped in 90 days with TapouT XT then get ripped even more with TapouT XT2. \nYou should complete TapouT XT1 before attempting TapouT XT2.\nNo weights, no pull-ups and no gym memberships.\nMMA style workout videos\n\nIt comes with the following workouts:\n\n8 PACK ABS (XT2)\nWhen a 6-pack just isn't enough! Want 8 pack-abs that will make you look like you just walked out of a magazine ad? Then pop in this DVD and get ready for all new XT extreme core moves that will rip your abs to shreds.\n\nBUNS AND GUNS (XT)\nJust what it says. Get that firm, toned and lifted butt along with beach-ready toned biceps, triceps and more. (31:20)\n\nBUNS AND GUNS 2 (XT2)\nThey are the Hollywood muscles- the booty and the guns. They need to look good. They need to look GREAT! And this is how you do it. Will you?\n\nCARDIO XT (XT)\nWhen we say this workout is extreme, we mean it. High pac, intense and fun cardio workout that will make you earn it with sweat! (46:20)\n\nCOMPETITION CORE (XT)\nWant TapouT Abs? Do this work out! Carve your upper, middle, lower abs, and love handles at the same time. (47:14)\n\nCROSS CORE COMBAT (XT)\nMelt away fat MMA style as you punch and kick your way to a shredded core in this hard twisting crack of the skull core workout. (45:49)\n\nCROSS CORE COMBAT 2 (XT2)\nForget sit-ups and crunches. That's for your old high school gym class. This sequel to the original hit Cross Core Combat for the XT1 series will literally reinvent the way you go about training your entire core. You will be stronger, faster, more athletic, and oh yeah, you'll look freakin' amazing naked.\n\nDRENCH XT (XT2)\nIt's like showering with your workout clothes on. Think about 'off-the-hook', 'turbo-charged', and 'high octane'...and then, think again. Drench XT takes any other cardio workout, jumps on it, stomps on it, tears it to pieces, and then does it all over again. Wanna push play? Go ahead. We dare you!\n\nFIGHT NIGHT XT\nIf you liked Muay Thai in the original XT series, then get ready for Fight Night! You will throw down and &quot;get it on&quot; with some of the top pro MMA fighters in the world. This one is as authentic as it gets! Real MMA punches, kicks, flying knees, elbows and more. Fight Night will hone your fighting skills, boost your cardio and shred your body head to toe.\n\nHURL XT (XT2)\nThe mother of all XT2 workouts...This one will have you cryin' for mommy. Like Mike says at the top of this workout, &quot;grab your jump rope, grab your XT Ball...and grab a bucket&quot;. Hurl XT is as extreme as it gets. Hurl XT is truly Extreme Reinvented.\n\nLEGS &amp; BACK (XT)\nYou will be turning heads after a few sessions of this leg burning, booty lifting, back sculpting workout. (40:19)\n\nLEG EXTREME (XT2)\nHave you ever heard your legs scream before? That's the feeling of results! Leg Extreme is designed to give you the performance of an elite athlete, and the look of someone with lean, chiseled legs! So get ready for the burn!\n\nMUAY THAI (XT)\nBased on the MMA combat technique developed in Thailand, this workout uses stand-up striking along with knock-out kicks that will reshape your entire body and burn fat XT style! (40:02)\n\nPLYO XT (XT)\nBurn fat and improve athletic performance with this sweat drenching explosive plyometric lower body workout. (51:11)\n\nRECOVERY AND MOBILITY (XT2)\nWhen you train hard, you need to recover, stretch and work on your mobility. The pros do it and so should you. If you have never done a professional stretch and mobility workout before, this one is going to be eye opening and hip opening. Plus- it is critical to your success and completion of XT2... so don't skip it!\n\nRIPPED CONDITIONING (XT)\nNo weights. No pull ups. Pure muscle. This extreme conditioning workout will get you that ripped up TapouT XT body you want. (41:14)\n\nSPRAWL AND BRAWL (XT)\nMelt away fat and carve a lean, chiseled body as you train like a MMA fighter with this signature TapouT XT workout. (46:07)\n\nSPRAWL AND BRAWL 2 (XT2)\nBack by popular demand! Sprawl and Brawl 2 is a non-stop barrage of cardio and resistance combined with total body movements that keeps your muscles guessing and your blood pumping. Plus enough sprawls, punches, kicks and flying knees to satisfy and exhaust any MMA fan.\n\nSTRENGTH AND FORCE UPPER (XT)\nGet ready to bring the power as you sculpt lean muscle and upper body definition with extra focus on your chest, shoulders and triceps. (53:41)\n\nTOTAL BODY XT (XT2)\nThe name says it all and this one gets it all. Chest, shoulders, legs, back, bi's, tri's and of course, the core. Total Body XT is a rigorous pace of fat blasting, body chiseling XT2 signature moves that will leave you covered in sweat and absolutely shredded!\n\nULTIMATE ABS XT (XT)\nGood bye spare tire. Hello six-pack! This 15 minute ab blitzing workout is the key to getting rock hard TapouT Abs. (15:45)\n\nYOGA XT (XT)\nYou will look forward to this stretch-based, yoga workout each week. But remember, this is TapouT XT, so don't expect any free passes here! You're gonna feel it! (51:04)\n\nPLUS BONUS VIDEOS:\n\nFLEX XT (XT2)\nROUND 5 (XT2)\nSTRIKE TRAINING (XT)\n\nDocuments included:\nTapouT XT Workout Schedule\nTapout XT2 Workout Schedule\nTapout XT &amp; XT2 Hybrid Workout Schedule\nTapouT XT 10 Day Slim Down\nTapout XT Fitness Guide\nTapouT XT Food Plan\nTapouT XT2 Nutrition Guide\n\nEQUIPMENT NEEDED:\nLower Body Band (XT)\nResistance Band (XT &amp; XT2)\nJump Rope (XT2)\nXT Training Ball (Medicine Ball with Handles) (XT2)","torrent":{"xt":"urn:btih:f7deb40f436fd31c9413724304d14bd45d652359","amp;dn":"TapouT+XT+1+%26amp%3B+2+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7deb40f436fd31c9413724304d14bd45d652359","infoHashBuffer":{"type":"Buffer","data":[247,222,180,15,67,111,211,28,148,19,114,67,4,209,75,212,93,101,35,89]},"announce":[],"urlList":[]}}