{"title":"John Petrucci - Rock Discipline [DVDrip Eng] Guitar Lesson [TNT ","uid":6186456,"size":587071913,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f8d3ccb98a1b5bd3183806d6578655bb0db90de0&amp;dn=John+Petrucci+-+Rock+Discipline+%5BDVDrip+Eng%5D+Guitar+Lesson+%5BTNT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"l.diliberto","files":2,"time":1298126358,"description":"John Petrucci - Rock Discipline [DVDrip Eng] Guitar Lesson [TNT Village]\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=52688&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=52688&lt;/a&gt;\n\nDream Theater guitarist John Petrucci has long been admired by the guitar-playing community for his almost unearthly technique. Petrucci is not only respected for his technical prowess however; he has been voted &quot;Best Guitarist&quot; in Guitar Magazine, and &quot;Break Through Guitarist of the Year&quot; in Guitar for the Practicing Musician. Such remarkable accomplishments made Petrucci a logical choice to host the Warner Brothers instructional video release &quot;Rock Discipline&quot;.\nThe two hour video opens with Petrucci outlining numerous warm-up exercises he uses prior to gigs or practice sessions. These exercises are designed to strengthen your fretting hand, your picking hand, or both. These warm-ups alone are worth the price of the video; all of them start at a reasonably simple level, yet develop into virtually impossible exercises as variations are applied. That Petrucci plays each at quick tempos without flinching is testamount to his incredible technique.\nexerpt of a warm up exercise from John Petrucci of Dream Theater\nThese warm up exercises could provide hundreds of hours of practice for the motivated guitarist, but these exercises truly are the tip of the iceberg in the video. Next comes some of Petrucci's favorite speed building exercises. Many of these are simply scale fragments that the guitarist plays repeatedly, or builds into an exercise. These speed builders are good, but not as focused as the warm up exercises. Some of the patterns are extremely long, and often don't follow any sort of coherent musical structure, so they may be difficult to memorize. Petrucci's extensive use of effects while playing some of these exercises is also somewhat puzzling and distracting.\nWhile there is some documentation on chord construction and soloing ideas on &quot;Rock Discipline&quot;, it is technique that is clearly the focus here. Petrucci, throughout the course of the video, outlines exercises to help guitarists work on &quot;inside the string&quot; picking, legato playing, sweep picking, arpeggiating chords, string skipping, fretting hand stretching, and much more. The guitarist also takes time to reflect on how he was introduced to the guitar, his thoughts on soloing and songwriting, and his musical influences. Dream Theater fans will also be very happy to find generous clips of Petrucci playing with the band. Also included in the video is a segment that explains Petrucci's guitars and gear in detail, including set-up information.\n&quot;Rock Discipline&quot; clearly isn't intended for beginner guitarists; even the warm-up exercises at the beginning of the video require stretches that novices will find overwhelming. That said, &quot;Rock Discipline&quot; is a superior resource for accomplished guitarists looking to increase their technical facility on the instrument.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://images.amazon.com/images/P/B00006L57W.01.LZZZZZZZ.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://images.amazon.com/images/P/B00006L57W.01.LZZZZZZZ.jpg&lt;/a&gt;\n\n0=============================0\n\n.: Dati tecnici del ripping :.\n\nName.........: John Petrucci - Rock Discipline.avi\nFilesize.....: 558 MB (or 571,594 KB or 585,312,320 bytes)\nRuntime......: 01:57:43 (169,347 fr)\nVideo Codec..: DivX 5.0\nVideo Bitrate: 559 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 96 kb/s (48/ch, stereo) CBR\nFrame Size...: 640x480 (1.33:1) [=4:3]","torrent":{"xt":"urn:btih:f8d3ccb98a1b5bd3183806d6578655bb0db90de0","amp;dn":"John+Petrucci+-+Rock+Discipline+%5BDVDrip+Eng%5D+Guitar+Lesson+%5BTNT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8d3ccb98a1b5bd3183806d6578655bb0db90de0","infoHashBuffer":{"type":"Buffer","data":[248,211,204,185,138,27,91,211,24,56,6,214,87,134,85,187,13,185,13,224]},"announce":[],"urlList":[]}}