{"title":"[MomsLickTeens / RealityKings] Jamie Valentine, Crystal Rae (Mel","uid":13402486,"size":369963216,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f95a9c28d0353a0ae6ac20cc571514453e45422a&amp;dn=%5BMomsLickTeens+%2F+RealityKings%5D+Jamie+Valentine%2C+Crystal+Rae+%28Mel&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":0,"uploader":"UniX","files":1,"time":1454395182,"description":"[MomsLickTeens / RealityKings] Jamie Valentine, Crystal Rae (Melt In My Mouth) SD **NEW FEB 2,2016**\r\n\r\nSCREENS\r\n \nhttp://imgurx.net/share-5CC7_56B03ED4.html\r\n\r\n\r\nCrystal Rae was cramming for a science test coming up when her stepmom Jamie Valentine walked into the room wheeling a suitcase. Crystal asked if she was going somewhere and Jamie decided to just finally level with her loving stepdaughter. She tried to keep the truth from her for as long as possible because she knew it would just distract her from her school work but enough was enough and it was time to come clean. Jamie had been having trouble with Crystal's father whom she'd been married to for quite some time. She caught him red-handed cheating on her and was fed up with the constant disrespect and unfaithfulness. She was leaving Crystal's father and it became painfully obvious they wouldn't be seeing much of anymore. Jamie figured the time was right to also reveal she was strictly going to date women from now on and Crystal, in turn, also admitted she had fooled around with one of her girlfriends. Jamie jumped at the chance to exact revenge on her cheating hubby by seducing his daughter and simultaneously finally have a chance to get a taste of such a young, sweet ass. They both realized they were stealing looks and lusting after each other. Sometimes the best way to say farewell is to fulfill one longing fantasy they both shared","torrent":{"xt":"urn:btih:f95a9c28d0353a0ae6ac20cc571514453e45422a","amp;dn":"%5BMomsLickTeens+%2F+RealityKings%5D+Jamie+Valentine%2C+Crystal+Rae+%28Mel","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f95a9c28d0353a0ae6ac20cc571514453e45422a","infoHashBuffer":{"type":"Buffer","data":[249,90,156,40,208,53,58,10,230,172,32,204,87,21,20,69,62,69,66,42]},"announce":[],"urlList":[]}}