{"title":"Lone Survivor: The Eyewitness Account of Operation Redwing and t","uid":9221219,"size":4231002,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9c042361d366510600cb13edd5c8bda640a5073&amp;dn=Lone+Survivor%3A+The+Eyewitness+Account+of+Operation+Redwing+and+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1384940369,"description":"Lone Survivor: The Eyewitness Account of Operation Redwing and the Lost Heroes of SEAL Team 10\nby Marcus Luttrell, Patrick Robinson\n\nDESCRIPTION:\n\nFour US Navy SEALS departed one clear night in early July 2005 for the mountainous Afghanistan-Pakistan border for a reconnaissance mission. Their task was to document the activity of an al Qaeda leader rumored to be very close to Bin Laden with a small army in a Taliban stronghold. Five days later, only one of those Navy SEALS made it out alive.\n\nThis is the story of the only survivor of Operation Redwing, SEAL fire team leader Marcus Luttrell, and the extraordinary firefight that led to the largest loss of life in American Navy SEAL history. His squadmates fought valiantly beside him until he was the only one left alive, blasted by an RPG into a place where his pursuers could not find him. Over the next four days, terribly injured and presumed dead, Luttrell crawled for miles through the mountains and was taken in by sympathetic villagers who risked their lives to keep him safe from surrounding Taliban warriors.\n\nA born and raised Texan, Marcus Luttrell takes us from the rigors of SEAL training, where he and his fellow SEALs discovered what it took to join the most elite of the American special forces, to a fight in the desolate hills of Afghanistan for which they never could have been prepared. His account of his squadmates' heroism and mutual support renders an experience that is both heartrending and life-affirming. In this rich chronicle of courage and sacrifice, honor and patriotism, Marcus Luttrell delivers a powerful narrative of modern war.\n\nAmazon.com title link: &lt;a href=&quot;\nhttp://www.amazon.com/Lone-Survivor-Eyewitness-Account-Operation/dp/0316044695&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Lone-Survivor-Eyewitness-Account-Operation/dp/0316044695&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f9c042361d366510600cb13edd5c8bda640a5073","amp;dn":"Lone+Survivor%3A+The+Eyewitness+Account+of+Operation+Redwing+and+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9c042361d366510600cb13edd5c8bda640a5073","infoHashBuffer":{"type":"Buffer","data":[249,192,66,54,29,54,101,16,96,12,177,62,221,92,139,218,100,10,80,115]},"announce":[],"urlList":[]}}