{"title":"Saul Bellow - Nobel Prize in Literature, 1976 (24 books)","uid":14038319,"size":39554645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:faa39324e2d1cc5b7a024abd090d0b6a7db5bdd2&amp;dn=Saul+Bellow+-+Nobel+Prize+in+Literature%2C+1976+%2824+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":7,"uploader":"workerbee","files":53,"time":1458995063,"description":"SAUL BELLOW (1915-2005) was a Canadian-born American writer whose characterizations of modern urban man, disaffected by society but not destroyed in spirit, earned him the 1976 Nobel Prize in Literature.  In the words of the Swedish Nobel Committee, his writing exhibited &quot;the mixture of rich picaresque novel and subtle analysis of our culture, of entertaining adventure, drastic and tragic episodes in quick succession interspersed with philosophic conversation, all developed by a commentator with a witty tongue and penetrating insight into the outer and inner complications that drive us to act, or prevent us from acting, and that can be called the dilemma of our age.&quot;\n\nBellow won a reputation among a small group of readers with his first two novels, DANGLING MAN (1944), a story in diary form of a man waiting to be inducted into the army, and THE VICTIM (1947), a subtle study of the relationship between a Jew and a Gentile, each of whom becomes the other's victim.  THE ADVENTURES OF AUGIE MARCH (1953), a picaresque story of a poor Jewish youth from Chicago and his sometimes comic progress through the 20th century, brought wider acclaim and won a National Book Award.  In this novel Bellow employed for the first time a loose, breezy style in conscious revolt against the preoccupation of writers of that time with perfection of form.\n\nHENDERSON THE RAIN KING (1959) continued the picaresque approach in its tale of an eccentric American millionaire on a quest in Africa.  SEIZE THE DAY (1956), a novella, is a unique treatment of a failure in a society where the only success is success.  He also wrote a volume of short stories, MOSBY'S MEMOIRS (1968), and TO JERUSALEM AND BACK (1976) about a trip to Israel.\n\nIn his later novels and novellas -- notably HERZOG (1964), MR. SAMMLER'S PLANET (1970), HUMBOLDT'S GIFT (1975), THE DEAN'S DECEMBER (1982), MORE DIE OF HEARTBREAK (1987), A THEFT (1989), THE BELLAROSA CONNECTION (1989), and THE ACTUAL (1997) -- Bellow arrived at his most characteristic vein.  The heroes of these works are often Jewish intellectuals whose interior monologues range from the sublime to the absurd.  At the same time, their surrounding world, peopled by energetic and incorrigible realists, acts as a corrective to their intellectual speculations.  It is this combination of cultural sophistication and the wisdom of the streets that constitutes Bellow's greatest originality.\n\nAmong his non-fiction works, TO JERUSALEM AND BACK (1976) is a rigorous attempt to come to grips with Israel's history and future.  Bellow records the opinions, passions, and dreams of Israelis of varying viewpoints and adds his own thoughts on being Jewish in the twentieth century.  Two collections -- IT ALL ADDS UP (1994) and THERE IS SIMPLY TOO MUCH TO THINK ABOUT (2015) -- bring together an abundance of articles, lectures, essays, criticism, interviews, speeches, and other reflections, tracing his career from his initial success as a novelist until the end of his life.  Finally, more than 700 of his marvellous letters, edited by Benjamin Taylor, are published in LETTERS (2010).\n\nIn addition to the Nobel Prize, Bellow also won the Pulitzer Prize (1976), the National Medal of Arts (1988), the National Book Award for Fiction (3 times in 1954, 1965, and 1971), and the National Book Foundation's lifetime Medal for Distinguished Contribution to American Letters (1990). \n\n\nThe following books are in PDF and/or ePUB format as indicated:\n\n\n                                  == FICTION  ==\n\n* The Actual (Viking, 1997). -- PDF\n\n* The Adventures of Augie March (Penguin Classics, 2001). -- ePUB\n\n* The Bellarosa Connection (Penguin, 1989) -- PDF\n\n* Collected Stories (Viking / Penguin, 2001) -- PDF + ePUB\n\n* Dangling Man (Penguin Classics, 2007) -- ePUB\n\n* The Dean's December (Pocket Books, 1983) -- PDF\n\n* Henderson the Rain King (Penguin Classics, 2007) -- ePUB\n\n* Herzog (Penguin Classics, 2001) -- ePUB\n\n* Him With the Foot in His Mouth (Penguin Classics, 2011) -- ePUB\n\n* Humboldt's Gift (Penguin Classics, 2007) -- ePUB\n\n* More Die of Heartbreak (Penguin Classics, 2007) -- ePUB\n\n* Mosby's Memoirs &amp; Other Stories (Penguin, 1984) -- PDF\n\n* Mr. Sammler's Planet (Penguin Classics, 2007) -- ePUB\n\n* Ravelstein (Penguin Classics, 2008) -- ePUB\n\n* Seize the Day (Fawcett, 1968 / Odyssey, 2013) -- PDF (courtesy of @pharmakate) + ePUB\n\n* Something To Remember Me By: Three Tales [A Theft / The Bellarosa Connection / Something to Remember Me By] (Signet, 1991) -- PDF\n\n* The Victim (Odyssey, 2013) -- ePUB\n\n\n                                     == PLAYS ==\n\n* The Last Analysis (Viking, 1965) -- PDF\n\n\n                              == NON-FICTION &amp; LETTERS ==\n\n* The Art of Fiction, No. 37 (Paris Review, Winter 1966).  Interviewed by Gordon Lloyd Harper. -- PDF\n\n* It All Adds Up: From the Dim Past to the Uncertain Future (Viking, 1994 / Penguin Classics, 2011) -- PDF + ePUB\n\n* Letters (Viking, 2010).  Edited by Benjamin Taylor. -- ePUB\n\n* Nobel Prize Lecture (Nobel Foundation, 1976) -- PDF\n\n* There Is Simply Too Much To Think About: Collected Nonfiction (Viking, 2015).  Edited by Benjamin Taylor. -- ePUB\n\n* To Jerusalem and Back (Viking, 1976) -- PDF\n\n____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account): \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:faa39324e2d1cc5b7a024abd090d0b6a7db5bdd2","amp;dn":"Saul+Bellow+-+Nobel+Prize+in+Literature%2C+1976+%2824+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faa39324e2d1cc5b7a024abd090d0b6a7db5bdd2","infoHashBuffer":{"type":"Buffer","data":[250,163,147,36,226,209,204,91,122,2,74,189,9,13,11,106,125,181,189,210]},"announce":[],"urlList":[]}}