{"title":"You Are a Badass: How to Stop Doubting Your Greatness","uid":8610997,"size":1222501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb005f747b43d8f393daed835c99c08bf1103dd2&amp;dn=You+Are+a+Badass%3A+How+to+Stop+Doubting+Your+Greatness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1372134133,"description":"\nYou Are a Badass: How to Stop Doubting Your Greatness and Start Living an Awesome Life by Jen Sincero\nEnglish | 2013 | ISBN: 0762447699 | ISBN-13: 9780762447695 , 9780762448319 | 256 pages | EPUB | 1,2 MB\n\nBestselling author, speaker and world-traveling success coach, Jen Sincero, cuts through the din of the self-help genre with her own verbal meat cleaver in You Are a Badass: How to Stop Doubting Your Greatness and Start Living an Awesome Life.\n\nIn this refreshingly blunt how-to guide, Sincero, serves up 27 bite-sized chapters full of hilariously inspiring stories, life-changing insights, easy exercises and the occasional swear word.\n\nVia chapters such as &quot;Your Brain is Your Bitch,&quot; &quot;Fear is for Suckers&quot; and &quot;My Subconscious Made Me Do It,&quot; Sincero takes you on a wild joy ride to your own transformation, helping you create the money, relationships, career and general all around awesomeness you so desire. And should you be one of those people who dreads getting busted with a self-help book in your hands, fear not. Sincero, a former skeptic herself, delivers the goods minus the New-Age cheese, giving even the snarkiest of poo-pooers exactly what they need to get out of their ruts and start kicking some ass.\n","torrent":{"xt":"urn:btih:fb005f747b43d8f393daed835c99c08bf1103dd2","amp;dn":"You+Are+a+Badass%3A+How+to+Stop+Doubting+Your+Greatness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb005f747b43d8f393daed835c99c08bf1103dd2","infoHashBuffer":{"type":"Buffer","data":[251,0,95,116,123,67,216,243,147,218,237,131,92,153,192,139,241,16,61,210]},"announce":[],"urlList":[]}}