{"title":"Svetlana Alexievich - Nobel Prize in Literature, 2015 (6 books)","uid":14767390,"size":23240811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb8ddc1a9bfe2e178f3c7d38d452e72457d89ff8&amp;dn=Svetlana+Alexievich+-+Nobel+Prize+in+Literature%2C+2015+%286+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"workerbee","files":18,"time":1464894962,"description":"SVETLANA ALEXANDROVNA ALEXIEVICH (b. 1948) is a Belarusian investigative journalist and non-fiction prose writer who writes in Russian.  She was awarded the 2015 Nobel Prize in Literature &quot;for her polyphonic writings, a monument to suffering and courage in our time.&quot;\n\nHer books are a literary chronicle of the emotional history of the Soviet and post-Soviet individual, as told by means of a carefully constructed collage of interviews and witness testimonies. Alexievich describes the theme of her works this way: &quot;If you look back at the whole of our history, both Soviet and post-Soviet, it is a huge common grave and a blood bath. An eternal dialog of the executioners and the victims. The accursed Russian questions: what is to be done and who is to blame. The revolution, the gulags, the Second World War, the Soviet-Afghan war hidden from the people, the downfall of the great empire, the downfall of the giant socialist land, the land-utopia, and now a challenge of cosmic dimensions -- Chernobyl. This is a challenge for all the living things on earth. Such is our history. And this is the theme of my books, this is my path, my circles of hell, from man to man.&quot;\n\nZINKY BOYS (1991) is a collection of first-hand accounts from the Soviet war in Afghanistan that claimed 50,000 casualties -- and the youth and humanity of many tens of thousands more. Creating controversy and outrage when it was first published in the USSR -- where it was denounced by reviewers as &quot;slanderous piece of fantasy&quot; and part of a &quot;hysterical chorus of malign attacks&quot; -- the book presents the candid and affecting testimony of the officers and grunts, nurses and prostitutes, mothers, sons, and daughters who describe the devastating war and its lasting effects. What emerges is a story that is shocking in its brutality and revelatory in its similarities to the American experience in Vietnam.\n\nIn the highly-praised VOICES FROM CHERNOBYL (1997), Alexievich relates the psychological and personal tragedy of the 1986 Chernobyl nuclear accident, and explores the experiences of individuals and how the disaster affected their lives. She collected testimonies from more than 500 eyewitnesses, including firefighters, liquidators (members of the cleanup team), politicians, physicians, physicists and ordinary citizens over a period of 10 years, crafting their voices into a haunting oral history of fear, anger and uncertainty, but also dark humour and love. CHERNOBYL PRAYER, a new translation by Anna Gunin and Arch Tait, appeared in May 2016.\n\nIn SECONDHAND TIME (2013), Alexievich chronicles the demise of communism, showing us what life was like during the fall of the Soviet Union and what it's like to live in the new Russia left in its wake. Through interviews spanning 1991 to 2012, Alexievich takes us behind the propaganda and contrived media accounts, giving us a panoramic portrait of contemporary Russia and Russians who still carry memories of oppression, terror, famine, massacres -- but also of pride in their country, hope for the future, and a belief that everyone was working and fighting together to bring about a utopia. Here is an account of life in the aftermath of an idea so powerful it once dominated a third of the world. \n\n\n\nThe following books are in PDF and/or ePUB/Mobi format as indicated:\n\n* Chernobyl Prayer: A Chronicle of the Future (Penguin Classics, 2016).  Translated by Anna Gunin and Arch Tait. -- ePUB/Mobi\n\n* The Man Who Flew (New York Review of Books, 19 Nov. 2015).  Translated by Jamey Gambrell. -- PDF\n\n* Nobel Prize Lecture: On the Battle Lost (Nobel Foundation, 2015).  Translated by Jamey Gambrell. -- PDF\n\n* Secondhand Time: The Last of the Soviets (Random House, 2016).  Translated by Bela Shayevich. -- ePUB/Mobi\n\n* Voices from Chernobyl: The Oral History of a Nuclear Disaster (Picador / Dalkey Press Archive, 2006).  Translated by Keith Gessen. -- PDF (scan courtesy of @pharmakate) + ePUB/Mobi\n\n* Zinky Boys: Soviet Voices from the Afghanistan War (Norton, 1992).  Translated by Julia and Robin Whitby. -- PDF (scan courtesy of @pharmakate) + ePUB/Mobi\n\n\nAlso included: Masha Gessen, &quot;The Memory Keeper: The Oral Histories of Russia's New Nobel Laureate&quot; (New Yorker, 26 Oct. 2015) -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n                         \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:fb8ddc1a9bfe2e178f3c7d38d452e72457d89ff8","amp;dn":"Svetlana+Alexievich+-+Nobel+Prize+in+Literature%2C+2015+%286+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb8ddc1a9bfe2e178f3c7d38d452e72457d89ff8","infoHashBuffer":{"type":"Buffer","data":[251,141,220,26,155,254,46,23,143,60,125,56,212,82,231,36,87,216,159,248]},"announce":[],"urlList":[]}}