{"title":"Machine Head - Bloodstone Diamonds mp3 320k (2014)","uid":11389885,"size":172234007,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fc3c8dd3b31862001b48f2a62c8ecef09f9dbdec&amp;dn=Machine+Head+-+Bloodstone+Diamonds+mp3+320k+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"analogkid6103","files":12,"time":1415312062,"description":"Biography: Uploader Speaks My comments dont work no more so the only way I can speak is through the torrent page some weird glitch so believe it I like to interact on there at least I can still upload and write my words here. Alrght enjoy the music and you guys can still post comments \n\nMachine Head is an American heavy metal band from Oakland, California. Formed in 1992, the group was founded by Robb Flynn and Adam Duce. There have been 4 member changes since their inception. The current lineup of the band comprises Flynn (vocals, guitar), Duce (bass), ex-Vio-Lence guitarist Phil Demmel (guitar), and Dave McClain (drums). Machine Head is one of the pioneering bands in the New Wave of American Heavy Metal.\n\nMachine Head was formed by member Robb Flynn, previously part of the bands Forbidden and Vio-lence. Flynn felt musically unfulfilled with Vio-lence and requested to start a side project. When his request was denied, he left the band and formed Machine Head in 1992 with Adam Duce, Logan Mader and Tony Constanza. Though the band's first album, Burn My Eyes, was a big success in Europe where it garnered attention on MTV's Headbangers Ball, in America (with HBB taken off the air during the grunge movement) Machine Head would not have success until later albums.\n\nThe band nearly disbanded in 2002 after negotiating off its label, Roadrunner Records, when controversy surrounding Machine Head's 4th release Supercharger (released 2 weeks after September 11, 2001) resulted in their songs and their then-current video for the song &quot;Crashing Around You&quot; (which featured burning buildings) being pulled from all media outlets. The band re-signed with Roadrunner soon after and has released two albums since, 2003's Through the Ashes of Empires, and 2007's The Blackening, which earned Machine Head its first Grammy Award nomination. Machine Head are currently writing a new album, which is due for release in late 2011.\n\n\n\nLine-up:\n\nRobb Flynn - Lead Vocals, Guitar\nDave McClain - Drums\nPhil Demmel - Lead Guitar\nJared MacEachern - Bass, Vocals\n\n\nMachine Head - Bloodstone &amp; Diamonds (2014)\n\n\n\n\nCBR @ 320kbps\n\n\n\nTracklist:\n\n01. Now We Die\n02. Killers &amp; Kings\n03. Ghosts Will Haunt My Bones\n04. Night Of Long Knives\n05. Sail Into The Black\n06. Eyes Of The Dead\n07. Beneath The Silt\n08. In Comes The Flood\n09. Damage Inside\n10. Game Over\n11. Imaginal Cells (Instrumental)\n12. Take Me Through The Fire\n\n\nGenre:\tThrash\nSubgenre:\tPost-Thrash / Groove Metal\nBitrate:\t320 k\nSize:\t164.26 MB\nShow/Hide Files: \t\n12 files\nAdded:\t06/11/2014","torrent":{"xt":"urn:btih:fc3c8dd3b31862001b48f2a62c8ecef09f9dbdec","amp;dn":"Machine+Head+-+Bloodstone+Diamonds+mp3+320k+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3c8dd3b31862001b48f2a62c8ecef09f9dbdec","infoHashBuffer":{"type":"Buffer","data":[252,60,141,211,179,24,98,0,27,72,242,166,44,142,206,240,159,157,189,236]},"announce":[],"urlList":[]}}