{"title":"Vikings S03 - COMPLETE Season 3 720p HDTV x264 [MKV, AC3,5.1] Eh","uid":13608736,"size":4506482031,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fc6317a9d953eb78e13d22cfbf2d6626b4702bd8&amp;dn=Vikings+S03+-+COMPLETE+Season+3+720p+HDTV+x264+%5BMKV%2C+AC3%2C5.1%5D+Eh&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":9,"uploader":"roflcopter2110","files":14,"time":1455908791,"description":"The HISTORY® original series Vikings transports us to the brutal and mysterious world of Ragnar Lothbrok (Travis Fimmel), a Viking warrior and farmer who yearns to explore—and raid—the distant shores across the ocean. His ambition puts him at odds with local chieftain Earl Haraldson (Gabriel Byrne), who insists on sending his raiders to the impoverished east rather than the uncharted west. When Ragnar teams up with his boat builder friend Floki (Gustaf Skarsgard) to craft a new generation of intrepid ships capable of conquering the rough northern seas, the stage is set for conflict.\r\n\r\nBut for all its warfare and bloodshed, Vikings is also a story of family and brotherhood, capturing the love and affection between Ragnar and his wife, Lagertha (Katheryn Winnick), a respected warrior in her own right. It is the tale of Ragnar’s brother Rollo (Clive Standen), a fierce fighter who simmers with jealously; of Earl Haraldson’s wife Siggy (Jessalyn Gilsig), a dutiful beauty who may be less than loyal; and of the monk Athelstan (George Blagden), whose Christian morals clash with the Vikings’ pagan society. As ambition and innovation rattle a civilization, these characters will be put to the test—and their way of life will never be the same again.\r\n\r\nVikings was created and written by Michael Hirst (Elizabeth, The Tudors).\r\n\r\n-Travis Fimmel as legendary Viking Ragnar Lothbrok. Originally a farmer, Ragnar claims to be a descendant of the god Odin, and he manages to rise to become a respected Earl of his home settlement Kattegat, as well as a feared warrior, a famed raider of undiscovered lands, and, finally, King of Denmark.\r\n-Katheryn Winnick as Lagertha, Ragnar's first wife; a shieldmaiden. Following the separation of her and Ragnar, Lagertha rises to become Earl of Hedeby in her own right, going by the name Earl Ingstad.\r\n-Clive Standen as Rollo, Ragnar's brother. Although a ruthless and skilled warrior, having spent his life in the shadow of his brother makes Rollo's feelings towards Ragnar constantly changing from loyal love and admiration, to hateful jealousy. The character is based on the great-great-great-grandfather of William the Conqueror.\r\n-Jessalyn Gilsig as Siggy, Earl Haraldson's wife, and later love-interest of Rollo. She possesses a strategic mind and a tireless urge to retain (or regain) her power and influence.\r\n-Gustaf Skarsgård as Floki, a gifted, albeit eccentric, shipbuilder and friend of Ragnar. Acknowledging his peculiar character traits, Floki considers himself a descendant of the trickster god Loki.\r\n\r\n-George Blagden as Athelstan, an Anglo-Saxon monk originally serving at the monastery of Lindisfarne in Northumbria. Captured by Ragnar on his first raid in England, Athelstan is torn between the customs of the Christian England and the pagan ways of Scandinavia.\r\n-Alexander Ludwig as Bjorn Ironside, Ragnar and Lagertha's son, given his epithet by his father, following his first battle with the Saxons (Seasons 2 and 3).\r\n-Nathan O'Toole as young Bjorn. (Seasons 1 and 2, recurring)\r\n-Alyssa Sutherland as Aslaug, Ragnar's second wife, claiming to be the daughter of the valkyrie Brynhildr and the dragonslayer Sigurd.\r\n-Gabriel Byrne as Earl Haraldson, Ragnar's predecessor as Earl of Kattegat (Season 1).\r\n\r\n-Donal Logue as King Horik of Denmark (Seasons 1 and 2).\r\n-Linus Roache as King Ecbert of Wessex (Seasons 2 and 3).\r\n-Ben Robson as Kalf, a prominent and clever Hedeby villager (Season 3).\r\n-Kevin Durand as Harbard, a charismatic wanderer and storyteller arriving in Kattegat (Season 3)\r\n-Lothaire Bluteau as King Charles of West Francia (Season 3).\r\n\r\nGeneral\r\nFormat : Matroska\r\nFormat version : Version 4 / Version 2\r\nOverall bit rate : 1 397 Kbps\r\nEncoded date : UTC 2015-05-07 03:42:24\r\nWriting application : mkvmerge v7.8.0 ('River Man') 32bit built on Mar 27 2015 16:18:02\r\nWriting library : libebml v1.3.1 + libmatroska v1.4.2\r\n\r\nVideo\r\nID : 1\r\nFormat : AVC\r\nFormat/Info : Advanced Video Codec\r\nFormat profile :   \r\nFormat settings, CABAC : Yes\r\nFormat settings, ReFrames : 9 frames\r\nCodec ID : V_MPEG4/ISO/AVC\r\nBit rate : 1 010 Kbps\r\nWidth : 1 280 pixels\r\nHeight : 716 pixels\r\nDisplay aspect ratio : 16:9\r\nFrame rate mode : Constant\r\nFrame rate : 23.976 fps\r\nColor space : YUV\r\nChroma subsampling : 4:2:0\r\nBit depth : 8 bits\r\nScan type : Progressive\r\nBits/(Pixel*Frame) : 0.046\r\nWriting library : x264 core 146 r2538kMod 121396c\r\nDefault : Yes\r\nForced : No\r\n\r\nAudio\r\nID : 2\r\nFormat : AC-3\r\nFormat/Info : Audio Coding 3\r\nMode extension : CM (complete main)\r\nFormat settings, Endianness : Big\r\nCodec ID : A_AC3\r\nBit rate mode : Constant\r\nBit rate : 384 Kbps\r\nChannel(s) : 6 channels\r\nChannel positions : Front: L C R, Side: L R, LFE\r\nSampling rate : 48.0 KHz\r\nBit depth : 16 bits\r\nCompression mode : Lossy\r\nDefault : Yes\r\nForced : No","torrent":{"xt":"urn:btih:fc6317a9d953eb78e13d22cfbf2d6626b4702bd8","amp;dn":"Vikings+S03+-+COMPLETE+Season+3+720p+HDTV+x264+%5BMKV%2C+AC3%2C5.1%5D+Eh","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc6317a9d953eb78e13d22cfbf2d6626b4702bd8","infoHashBuffer":{"type":"Buffer","data":[252,99,23,169,217,83,235,120,225,61,34,207,191,45,102,38,180,112,43,216]},"announce":[],"urlList":[]}}