{"title":"Eruption: The Untold Story of Mount St. Helens","uid":15861634,"size":5445708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fca5d781577cb55c45dd6f720f4409b910fabd9f&amp;dn=Eruption%3A+The+Untold+Story+of+Mount+St.+Helens&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":0,"uploader":"marty14","files":1,"time":1474305450,"description":"Eruption: The Untold Story of Mount St. Helens - Steve Olson [epub]\r\n\r\nFor months in early 1980, scientists, journalists, sightseers, and nearby residents listened anxiously to rumblings in Mount St. Helens, part of the chain of western volcanoes fueled by the 700-mile-long Cascadia fault. Still, no one was prepared when an immense eruption took the top off of the mountain and laid waste to hundreds of square miles of verdant forests in southwestern Washington State. The eruption was one of the largest in human history, deposited ash in eleven U.S. states and five Canadian provinces, and caused more than one billion dollars in damage. It killed fifty-seven people, some as far as thirteen miles away from the volcano’s summit.\r\n\r\nShedding new light on the cataclysm, author Steve Olson interweaves the history and science behind this event with page-turning accounts of what happened to those who lived and those who died.\r\n\r\nPowerful economic and historical forces influenced the fates of those around the volcano that sunny Sunday morning, including the construction of the nation’s railroads, the harvest of a continent’s vast forests, and the protection of America’s treasured public lands. The eruption of Mount St. Helens revealed how the past is constantly present in the lives of us all. At the same time, it transformed volcanic science, the study of environmental resilience, and, ultimately, our perceptions of what it will take to survive on an increasingly dangerous planet.\r\n\r\nRich with vivid personal stories of lumber tycoons, loggers, volcanologists, and conservationists, Eruption delivers a spellbinding narrative built from the testimonies of those closest to the disaster, and an epic tale of our fraught relationship with the natural world","torrent":{"xt":"urn:btih:fca5d781577cb55c45dd6f720f4409b910fabd9f","amp;dn":"Eruption%3A+The+Untold+Story+of+Mount+St.+Helens","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fca5d781577cb55c45dd6f720f4409b910fabd9f","infoHashBuffer":{"type":"Buffer","data":[252,165,215,129,87,124,181,92,69,221,111,114,15,68,9,185,16,250,189,159]},"announce":[],"urlList":[]}}