{"title":"iZombie (Complete Series) [DCP-D]","uid":7510967,"size":1197084636,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fde1272ee6993931505ac9aa8767184e267d8307&amp;dn=iZombie+%28Complete+Series%29+%5BDCP-D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":4,"uploader":"RubrumPopulus","files":-1,"time":1344317980,"description":"This torrent includes the complete 28 issue Vertigo series: iZombie.  Written by Chris Roberson and with wonderful art by Mike Allred, this series is a delight to read, and was a wonderful addition to the Vertigo line-up.  Both c2c and noAds versions are provided where available.\n========================================================\n\n\n\nDead to the World (01-05):\nGwendolyn &quot;Gwen&quot; Dylan is a 20-something gravedigger in an eco-friendly cemetery. Once a month she must eat a human brain to keep from losing her own memories, but in the process she becomes consumed with the thoughts and personality of the dead person - until she eats her next brain. Gwen sets out to fulfill the dead person's last request, solve a crime or right a wrong. Our zombie girl detective is joined by her best friend, Eleanor, who happens to be a swinging '60s ghost, a posse of paintball-blasting vampires, a smitten were-dog and a hot but demented mummy.\n\n========================================================\n\n\n\nuVampire (06-12):\nIn uVAMPIRE, Gwen Dylan dines on the grey matter of a person who knew her as a child - and things quickly get complicated. Meanwhile, ghost-girl Ellie learns a few tricks from Amon the mummy; Spot the were-terrier meets someone from Gwen's past, Galatea engages in some grave-robbing; and monster-hunters tackle the town's vampire problem.\n\n========================================================\n\n\n\nSix Feet Under and Rising (13-17):\nSpot tumbles into a cemetery sinkhole full of hungry creatures, Gwen's monster hunter boyfriend might uncover her big secret, and The Dead Presidents arrive, intent on taking names in a city infested with skeeball fanatics, mad scientists and shambling zombies!\n\n========================================================\n\n\n\nRepossessed &amp; The End (18-28):\n\nOnce upon a time, Gwen's biggest concerns were finding a brain to snack on and worrying whether her boyfriend would find out she was a zombie. Now, with undead secret agents and monster hunters teaming up to stop a mad scientist from bringing about the end of the world, and her friends stuck right in the middle of it, Gwen has bigger problems on her hands. But can a girl help save the world without losing everything in the world she loves?\n\n\nThanks goes to Hatful Of Hollow, Archangel, and theProletariat for these fine releases.\n","torrent":{"xt":"urn:btih:fde1272ee6993931505ac9aa8767184e267d8307","amp;dn":"iZombie+%28Complete+Series%29+%5BDCP-D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde1272ee6993931505ac9aa8767184e267d8307","infoHashBuffer":{"type":"Buffer","data":[253,225,39,46,230,153,57,49,80,90,201,170,135,103,24,78,38,125,131,7]},"announce":[],"urlList":[]}}