{"title":"The Brothers: John Dulles, Allen Dulles and Their Secret ...","uid":16044764,"size":983640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fde6b220ce7f434694c0343f8bea695213299342&amp;dn=The+Brothers%3A+John+Dulles%2C+Allen+Dulles+and+Their+Secret+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":17,"leechers":3,"uploader":"marty14","files":1,"time":1476552466,"description":"The Brothers: John Foster Dulles, Allen Dulles and Their Secret World War - Stephen Kinzer [epub]\r\n\r\nDuring the 1950s, when the Cold War was at its peak, two immensely powerful brothers led the United States into a series of foreign adventures whose effects are still shaking the world.\r\n\r\nJohn Foster Dulles was secretary of state while his brother, Allen Dulles, was director of the Central Intelligence Agency. In this book, Stephen Kinzer places their extraordinary lives against the background of American culture and history. He uses the framework of biography to ask: Why does the United States behave as it does in the world?\r\n\r\nThe Brothers explores hidden forces that shape the national psyche, from religious piety to Western movies―many of which are about a noble gunman who cleans up a lawless town by killing bad guys. This is how the Dulles brothers saw themselves, and how many Americans still see their country's role in the world.\r\n\r\nPropelled by a quintessentially American set of fears and delusions, the Dulles brothers launched violent campaigns against foreign leaders they saw as threats to the United States. These campaigns helped push countries from Guatemala to the Congo into long spirals of violence, led the United States into the Vietnam War, and laid the foundation for decades of hostility between the United States and countries from Cuba to Iran.\r\n\r\nThe story of the Dulles brothers is the story of America. It illuminates and helps explain the modern history of the United States and the world","torrent":{"xt":"urn:btih:fde6b220ce7f434694c0343f8bea695213299342","amp;dn":"The+Brothers%3A+John+Dulles%2C+Allen+Dulles+and+Their+Secret+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde6b220ce7f434694c0343f8bea695213299342","infoHashBuffer":{"type":"Buffer","data":[253,230,178,32,206,127,67,70,148,192,52,63,139,234,105,82,19,41,147,66]},"announce":[],"urlList":[]}}