{"title":"Globe: Life in Shakespeare's London","uid":15848039,"size":3184886,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe3fd8b0152ff72738526747d53d7c14109a6dc5&amp;dn=Globe%3A+Life+in+Shakespeare%27s+London&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":0,"uploader":"marty14","files":1,"time":1474129299,"description":"Globe: Life in Shakespeare's London - Catharine Arnold [epub]\r\n\r\nThe life of William Shakespeare, Britain's greatest dramatist, was inextricably linked with the history of London. Together, the great writer and the great city came of age and confronted triumph and tragedy. Triumph came when Shakespeare's company, the Chamberlain's Men, opened the Globe playhouse on Bankside in 1599, under the patronage of Queen Elizabeth I. Tragedy touched the lives of many of his contemporaries, from fellow playwright Christopher Marlowe to the disgraced Earl of Essex, while London struggled against the ever-present threat of riots, rebellions and outbreaks of plague. \r\n\r\nGlobe takes its readers on a tour of London through Shakespeare's life and work, as, in fascinating detail, Catharine Arnold tells how acting came of age. We learn about James Burbage, founder of the original Theatre in Shoreditch, who carried timbers across the Thames to build the Globe among the bear-gardens and brothels of Bankside, and of the terrible night in 1613 when the theatre caught fire during a performance of King Henry VIII.\r\n\r\nRebuilt, the Globe continued to stand as a monument to Shakespeare's genius until 1642 when it was destroyed on the orders of Oliver Cromwell. And finally we learn how 300 years later, Shakespeare's Globe opened once more upon the Bankside, to great acclaim, rising like a phoenix from the flames Arnold creates a vivid portrait of Shakespeare and his London from the bard's own plays and contemporary sources, combining a novelist's eye for detail with a historian's grasp of his unique contribution to the development of the English theatre. This is a portrait of Shakespeare, London, the man and the myth","torrent":{"xt":"urn:btih:fe3fd8b0152ff72738526747d53d7c14109a6dc5","amp;dn":"Globe%3A+Life+in+Shakespeare%27s+London","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe3fd8b0152ff72738526747d53d7c14109a6dc5","infoHashBuffer":{"type":"Buffer","data":[254,63,216,176,21,47,247,39,56,82,103,71,213,61,124,20,16,154,109,197]},"announce":[],"urlList":[]}}