{"title":"THIEME Atlas of Anatomy - General Anatomy and Musculoskeletal - ","uid":11530202,"size":198649679,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fea798a2d5e8c7f2d94baa6fcb46ab4dace76a80&amp;dn=THIEME+Atlas+of+Anatomy+-+General+Anatomy+and+Musculoskeletal+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":15,"leechers":1,"uploader":"MANTESH","files":-1,"time":1416564002,"description":"\nTHIEME Atlas of Anatomy - General Anatomy and Musculoskeletal - Mantesh\n\nMichael Schuenke (Author), Erik Schulte (Author), Udo Schumacher (Author), Lawrence M Ross (Author), Edward D Lamperti (Author), Markus Voll \n2010\nISBN-10: 1588903877  \nISBN-13: 978-1588903877\nPages: 555\nPDF\n189.45 MB\n\nThe images are beautifully drawn and labeled, and it is clear that significant time and effort have gone into the organization of the material. In addition to clear and unique illustrations, this atlas departs from the typical anatomy atlas by combining explanatory text with the images, providing summarizing tables, and giving clinical applications for the material. This atlas would be a good choice for the reader interested in neuromusculoskeletal system reference. ..The narrative works to enhance understanding of a given topic by referring the reader to other sections of this atlas that continue to elaborate on specific points. For the physical therapy, athletic training, or medical student trying to master the specifics associated with muscle function, the 2-adjoining-page organization of tables with illustrations of the muscles is a feature that would assist studying this material. Other features of this atlas that are particular strengths include an excellent index, concepts needed to understand anatomy, clear illustration and annotation, overview of basic embryology, overviews of the autonomic nervous system, illustrations identifying landmarks that can be easily palpated, bones and joints, neurovascular and lymphatic systems, the addition of schematic illustrations to clarify hard to visualize structures, many common and some rare clinical conditions, some select MRIs, and a number of other special topics. Overall, a beautiful and well-organized atlas of musculoskeletal anatomy.. The narrative provided, along with functional grouping of muscles and clinical application, have resulted in a relatively novel presentation of the musculoskeletal system that most students will appreciate.--Journal of Orthopedic Sports and Physical Therapy\nA useful addition to the library of any clinician interested in the musculoskeletal system. It contains beautiful illustrations of musculoskeletal anatomy and clear, descriptive legends, many of which are detailed. This volume offers more value than a typical atlas because of the substantial amount of functional and clinical information that is included. ...It warrants consideration as the required atlas for any gross anatomy course for physical therapist students... It also would make a fine supplemental resource for preclinical laboratory courses that emphasize skeletal and muscular anatomy and for any physical therapy clinic's reference library.--Physical Therapy, June 2006\n\nThis atlas contains superior illustrations of the musculoskeletal system of the trunk, upper, and lower extremities, as well as a concise but very informative overview of general anatomical concepts. Notably, the musculature - functional groups provides a fact box on each muscle, as well as a unique schematic that clearly demonstrates each muscle's action. The neurovascular system - forms and relations subsection of each of the chapters provides a compelling demonstration of anatomical relations and concepts of innervation. The intention in creating this text was to provide an atlas that would guide students in their study of anatomy, stimulate enthusiasm, and provide a reliable reference for experienced students and professionals. This Thieme atlas fulfills these intentions. For the novice, the general anatomy chapter provides a very descriptive overview of anatomical concepts with brief text and good diagrams. In the following three chapters, the image quality is quite impressive, illustrating excellent anatomical relations. The fact box included on each muscle provides easy reference to origin, insertion, innervation, and action. The illustrations are clearly labeled...The index is appropriate and easy to follow. For experienced students and professionals, clinical application, cross sections, x-rays, and CT and MRI scans are provided to further emphasize the clinical relevance of anatomy","torrent":{"xt":"urn:btih:fea798a2d5e8c7f2d94baa6fcb46ab4dace76a80","amp;dn":"THIEME+Atlas+of+Anatomy+-+General+Anatomy+and+Musculoskeletal+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fea798a2d5e8c7f2d94baa6fcb46ab4dace76a80","infoHashBuffer":{"type":"Buffer","data":[254,167,152,162,213,232,199,242,217,75,170,111,203,70,171,77,172,231,106,128]},"announce":[],"urlList":[]}}