{"title":"UDEMY INTRODUCTION TO RASPBERRY PI TUTORIAL","uid":12060071,"size":395394978,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ff20d0b48212bcb9dc8b6f2541cd29465d98d37e&amp;dn=UDEMY+INTRODUCTION+TO+RASPBERRY+PI+TUTORIAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":14,"leechers":1,"uploader":"RandalPaul","files":22,"time":1435231328,"description":"UDEMY INTRODUCTION TO RASPBERRY PI TUTORIAL\n\nThis is an introductory course about the credit card\nsized computer Raspberry Pi. This course is ideal\nfor those who are interested in exploring the\npossibilities of Raspberry Pi as a computer. The\ncourse does not assume any prior knowledge on\ncomputers or programming. However, a knowledge of\nLinux operating system and Python programming\nlanguage would greatly help you in getting up to speed\n\nIf you do not know Linux or Python, no need to worry. The\ncourse has sections that cover the basics of Linux and Python to\nget you started\n\nSmall as it is, The Raspberry Pi packs quite a punch. The\ncourse will teach you to hook up the Pi with a key board and\nmonitor so that you can use it as a low cost\ncomputer. You will also learn how to interact with\nthe hardware of the Pi, something that you\nnormally do not do with your home computer or\nlaptop\n\nYou will learn from 2 complete projects. The first\none teaches you how to write a software program to\nmake the most of your Raspberry Pi, using the Python language\n\nThe second project involves learning how to control the\nRaspberry Pi hardware using a computer program written in Python\nYou will hook the Pi up with a Christmas tree light and will\nuse your program to create various lighting patterns. Sounds\nexciting?\n\nJump in straight ahead!\n\nThe course provides complete code for both the\nabove mentioned projects\n\nThe entire course can be completed over a period of 2\nhours, including the hardware assembly for the\nChristmas tree light project\n\nBy the end of this course, you will learn how to boot and wire up\na Raspberry Pi. You will also have learnt how to write your\nown python code to make the Raspberry Pi do some really cool\nthings","torrent":{"xt":"urn:btih:ff20d0b48212bcb9dc8b6f2541cd29465d98d37e","amp;dn":"UDEMY+INTRODUCTION+TO+RASPBERRY+PI+TUTORIAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff20d0b48212bcb9dc8b6f2541cd29465d98d37e","infoHashBuffer":{"type":"Buffer","data":[255,32,208,180,130,18,188,185,220,139,111,37,65,205,41,70,93,152,211,126]},"announce":[],"urlList":[]}}