{"title":"Hitler's Soldiers: The German Army in the Third Reich","uid":15932332,"size":7806535,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff619678be47d0e8877419ec76869717abad1d77&amp;dn=Hitler%27s+Soldiers%3A+The+German+Army+in+the+Third+Reich&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":16,"leechers":2,"uploader":"marty14","files":1,"time":1475367900,"description":"Hitler's Soldiers: The German Army in the Third Reich - Ben H. Shepherd [epub]\r\n\r\nA penetrating study of the German army’s military campaigns, relations with the Nazi regime, and complicity in Nazi crimes across occupied Europe\r\n\r\nFor decades after 1945, it was generally believed that the German army, professional and morally decent, had largely stood apart from the SS, Gestapo, and other corps of the Nazi machine. Ben Shepherd draws on a wealth of primary sources and recent scholarship to convey a much darker, more complex picture. For the first time, the German army is examined throughout the Second World War, across all combat theaters and occupied regions, and from multiple perspectives: its battle performance, social composition, relationship with the Nazi state, and involvement in war crimes and military occupation.\r\n \r\nThis was a true people’s army, drawn from across German society and reflecting that society as it existed under the Nazis. Without the army and its conquests abroad, Shepherd explains, the Nazi regime could not have perpetrated its crimes against Jews, prisoners of war, and civilians in occupied countries. The author examines how the army was complicit in these crimes and why some soldiers, units, and higher commands were more complicit than others. Shepherd also reveals the reasons for the army’s early battlefield successes and its mounting defeats up to 1945, the latter due not only to Allied superiority and Hitler’s mismanagement as commander-in-chief, but also to the failings—moral, political, economic, strategic, and operational—of the army’s own leadership","torrent":{"xt":"urn:btih:ff619678be47d0e8877419ec76869717abad1d77","amp;dn":"Hitler%27s+Soldiers%3A+The+German+Army+in+the+Third+Reich","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff619678be47d0e8877419ec76869717abad1d77","infoHashBuffer":{"type":"Buffer","data":[255,97,150,120,190,71,208,232,135,116,25,236,118,134,151,23,171,173,29,119]},"announce":[],"urlList":[]}}