{"title":"Pink Floyd The Wall Movie","uid":5335234,"size":1577015707,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ff7b4706dc5d5fcbb3447c4b26c8726754571cb0&amp;dn=Pink+Floyd+The+Wall+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"eyesofflys","files":2,"time":1265296808,"description":"Pink Floyd The Wall Movie\n\nPink Floyd The Wall is a 1982  musical film by British director  Alan Parker based on the 1979 Pink Floyd album The Wall. The screenplay  was written by Pink Floyd vocalist and bassist Roger Waters. The film is highly metaphorical and is rich in symbolic imagery and sound. It features very little dialogue and is mainly driven by Pink Floyd's music.\n\nIn an interview with Rolling Stone magazine[when?], Roger Waters discusses how both the album and the film are partially derived from the story &quot;The Wall&quot; by Jean-Paul Sartre. The movie represents the emotional connection Waters developed with Pablo Ibbieta, the protagonist, while he was reading the story. Waters claims the incident between Pablo and RamÃƒÂ³n deeply moved him and changed the way he viewed life and eventually helped inspire the movie.\n\nThe film contains fifteen minutes of elaborate animation sequences by the political cartoonist and illustrator Gerald Scarfe, part of which depict a nightmarish vision of the German bombing campaign over the United Kingdom during World War II set to the song &quot;Goodbye Blue Sky&quot;.\nThe film depicts the construction and ultimate demolition of a metaphorical  wall. Though the film is open to interpretation, the wall itself clearly reflects a sense of isolation and alienation.\n\nPink, the protagonist (and unreliable narrator) of the film, is a rock star, one of several reasons behind his apparent depressive emotional state. He is first seen in a quiet hotel room, having trashed it. The opening music is not by Pink Floyd, but is the Vera Lynn recording of &quot;The Little Boy that Santa Claus Forgot&quot;.[1] During the following scenes, it is revealed that Pink's father was killed during World War II while he was just a baby.\n\nThe movie then flashes back to Pink as a young English boy growing up in the early 1950s. Throughout his childhood, Pink longs for a father figure. At school, he is humiliated for writing poems in class. The poems that the teacher reads aloud are lyrics from &quot;Money&quot; from the Pink Floyd album The Dark Side of the Moon. Pink is also affected by his overprotective mother. He eventually gets married, but he and his wife grow apart and she has an affair while Pink is on tour. When Pink learns of the affair, he compensates with expensive materialistic possessions and turns to a willing groupie (Jenny Wright), only to trash the hotel room and drive her away.\n\nPink slowly begins to lose his mind to metaphorical worms. He shaves off all of his body hair (an incident inspired by former bandmate Syd Barrett, who appeared at a 1975 recording session of Wish You Were Here, having shaved his eyebrows and body hair[2][3]) and, while watching The Dam Busters on television, morphs into his neo-Nazi alter-ego. Pink's manager (Bob Hoskins), along with the hotel manager (Michael Ensign) and some paramedics, discover Pink, and inject him with drugs to enable him to perform. On stage, Pink hallucinates that he is a neo-Nazi dictator, his concert a rally. His followers proceed to attack ethnic minorities and rape the white girlfriend of a black man. Later, Pink holds a rally in a suburban neighbourhood singing &quot;Waiting for the Worms&quot;. The scene is inter-cut by images of the animated marching hammers that goosestep across ruins.\nPink (Bob Geldof) at the neo-Nazi rally.\n\nPink screams &quot;Stop!&quot;, and takes refuge in a bathroom stall at the concert venue, reciting a poem which would later be used as lyrics on Waters' The Pros and Cons of Hitch Hiking album. Pink puts himself on trial, shown entirely in animation. He is depicted as a small blank-faced doll that rarely moves. The judge is a giant pair of buttocks, speaking out of its anus. After hearing from the various protagonists, the judge orders the wall to be torn down. The wall explodes. The film ends with three children cleaning up a pile of debris after the earlier riot.\n__________________________________________________________________________________________\nAudio 1: Audio Stream 0 AC3\nBit rate 448kbps\nChannels 6\nAudio sample rate 48 kHz \nSubtitles: none\n___________________________________________________________\nFormat: AVI NTSC\nOutput codec: XviD\nCustom resolution settings: fixed width of 720 pixels\nCustom resolution settings: fixed Height of 320 pixels\nFrame rate 23 Frames/second\nData rate 1761 kbps\nTotal bitrate 2209 kbps\nLenght 01:35:09\nSource aspect ratio: 16:9\nSize 1.46 GB\n===========================================================\nEnjoy!!!","torrent":{"xt":"urn:btih:ff7b4706dc5d5fcbb3447c4b26c8726754571cb0","amp;dn":"Pink+Floyd+The+Wall+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff7b4706dc5d5fcbb3447c4b26c8726754571cb0","infoHashBuffer":{"type":"Buffer","data":[255,123,71,6,220,93,95,203,179,68,124,75,38,200,114,103,84,87,28,176]},"announce":[],"urlList":[]}}